&НаСервере 
Функция ПолучитьСписокДоступныхСТатусов() 
    СЗДоступныхСтатусов = Новый СписокЗначений;
	Если Объект.Проведен = Ложь ТОгда
		СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ);	
		Возврат СЗДоступныхСтатусов;
	КонецЕсли;
	
	Если Объект.Статус =Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ   ТОгда
		СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ);	
		Возврат СЗДоступныхСтатусов;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Объект.Статус) ТОгда
		СЗДоступныхСтатусов.Добавить(Объект.Статус);	
	КонецЕсли;
	
	Если Объект.СТатус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ ТОгда
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ);	
		КонецЕсли;
	ИначеЕсли    Объект.СТатус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ ТОгда
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано);	
		КонецЕсли;
		
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ);	
		КонецЕсли;
	ИначеЕсли    Объект.СТатус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано ТОгда
		
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано);	
		КонецЕсли;

	
	Иначе
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ);	
		КонецЕсли;
 		
	КонецЕсли;
	
	Возврат  СЗДоступныхСтатусов;
КонецФункции

&НаСервере 
Процедура УстановитьДоступностьЭлементов()
	Если Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ или 
		  Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ  ТОгда
		Для Каждого ТекРекв из Объект.Ссылка.Метаданные().Реквизиты Цикл
			Попытка
				Элементы[ТекРекв.Имя].ТолькоПросмотр = Истина;
				
			Исключение
				Попытка
					Элементы[ТекРекв.Имя].Доступность =Ложь ;
				Исключение
				КонецПопытки;
				
			КОнецПопытки;
			
		КонецЦикла;
	КонецЕсли;	
	Если Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ и Объект.Проведен ТОгда
		Элементы.Контрагент.ТолькоПросмотр = Истина;
	КонецЕсли;	

КонецПРоцедуры


&НаСервере 
Процедура ПриОткрытииНаСервере()
	
	Если Объект.ДокументВнешнейСистемы ТОгда
		ТекРеквизиты = Объект.Метаданные.Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.Реквизиты;	
		Для Каждого ТекРеквизит из  ТекРеквизиты Цикл
			Если 	Найти(ТекРеквизит.Имя,"Новое")>0 ТОгда
				Попытка
					Элементы[ТекРеквизит.Имя].ТОлькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;	
		Элементы.ПокупательНовое.Доступность = ЛОжь;
		Элементы.ПоставщикНовое.Доступность = ЛОжь;
		Элементы.НеЯвляетсяРезидентомНовое.Доступность = ЛОжь;
	КонецЕсли;
	СЗ = ПолучитьСписокДоступныхСТатусов();
	Если Объект.Ссылка.Пустая() ТОгда
		Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ;	
		Объект.абс_Инициатор = ПараметрыСеанса.ТекущийПользователь;
	ИначеЕсли   Объект.Статус  =  Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ ТОгда
		УстановитьДоступностьЭлементов();
	ИначеЕсли Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано  ТОгда          
		ЭтаФорма.ТолькоПросмотр = 1;
	КонецЕсли;
	
	Элементы.ФормаСтатус.СписокВыбора.ЗагрузитьЗначения(СЗ.ВыгрузитьЗначения());
	
	ФормаСтатус = Объект.Статус;

	ЗаполнитьПриИзмененииТипаКонтрагента();	
	
КонецПРОцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Если Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.ЗаполнитьПрежниеЗначенияКонтрагента(Объект.Контрагент,Объект) = Ложь ТОгда
		Объект.Контрагент  = "";	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	УстановитьДоступностьЭлементов();
	
	СЗ = ПолучитьСписокДоступныхСТатусов();
	Элементы.ФормаСтатус.СписокВыбора.ЗагрузитьЗначения(СЗ.ВыгрузитьЗначения());
	
	Если Объект.Проведен и Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ Тогда
	//
	//	Если Объект.Контрагент.абс_СтатусКонтрагента  = Перечисления.абсСтатусыКонтрагентов.Активный ТОгда
	//		ТекОбъект = Объект.Контрагент.ПолучитьОбъект();				
	//		ТекОбъект.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов;
	//		ТекОбъект.Записать();
	//	КонецЕсли;
		
	КонецЕсли;
	
	//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
	Объект.абс_ЗавершитьЗамерПроизводительности(2);	
	//\\АБС ВСТАВКА №38173 КОНЕЦ
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры
&НаСервере
Процедура ФормаСтатусПриИзмененииНАСервере()
	Если  ОБъект.Статус <> ФормаСтатус ТОгда
		ОБъект.Статус = ФормаСтатус;
	КонецЕсли;

КонецПРоцедуры



&НаКлиенте
Процедура ФормаСтатусПриИзменении(Элемент)
	ФормаСтатусПриИзмененииНАСервере();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура абс_ТипыКонтрагентовНовоеПриИзменении(Элемент)
	
	ЗаполнитьПриИзмененииТипаКонтрагента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриИзмененииТипаКонтрагента()
	
	Объект.ЮрФизЛицоНовое 			= Объект.абс_ТипыКонтрагентовНовое.ЮрФизЛицо;
	Объект.НеЯвляетсяРезидентомНовое= Объект.абс_ТипыКонтрагентовНовое.НеЯвляетсяРезидентом;
	
	// АБС ВСТАВКА Фролов 13096
	Если Объект.НеЯвляетсяРезидентомНовое И Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия Тогда
			
		Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.ПустаяСсылка();
				
	ИначеЕсли НЕ Объект.НеЯвляетсяРезидентомНовое И НЕ Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия Тогда
		
		Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия;
		
	КонецЕсли;
	// АБС ВСТАВКА Фролов 13096 КОНЕЦ	
	
КонецПроцедуры


