
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "Данные будут удалены и заполнены по умолчанию! Продолжить выполнение операции?";
	Ответ = Вопрос(Текст, Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПоУмолчаниюНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	Макет = РегистрыСведений.kwr_СоответствиеОрганизацийМакрорегионов.ПолучитьМакет("ЗаполнениеПоУмолчанию");
	Набор = РегистрыСведений.kwr_СоответствиеОрганизацийМакрорегионов.СоздатьНаборЗаписей();
	МассивСообщений = Новый Массив;
	ВысотаТаблицы 	= Макет.ВысотаТаблицы;
	
	Для Сч = 2 По ВысотаТаблицы Цикл
		
		КодМакрорегиона	= Макет.ПолучитьОбласть("R" + Сч + "C1").ТекущаяОбласть.Текст; 
		КодОрганизации 	= Макет.ПолучитьОбласть("R" + Сч + "C2").ТекущаяОбласть.Текст;		
		Организация     = Справочники.Организации.НайтиПоКоду(КодОрганизации);
		
		Если ЗначениеЗаполнено(Организация) 
			И ЗначениеЗаполнено(КодМакрорегиона) Тогда
			
			СтрокаНабора = Набор.Добавить();
			СтрокаНабора.Организация 		= Организация;
			СтрокаНабора.КодМакрорегиона 	= КодМакрорегиона;
			
		Иначе
			МассивСообщений.Добавить("Не найдена Организация по коду - " + КодОрганизации);			
		КонецЕсли;
		
	КонецЦикла;
	
	Набор.Записать();
	ВывестиСообщениеПользователю(МассивСообщений);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиСообщениеПользователю(МассивСообщений)
	
	Для Каждого ТекстСообщения Из МассивСообщений Цикл
		
		Сообщение 		= Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры