////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ ОБЪЕКТА

Функция Автозаполнение(Организация, ПериодДействия, ТаблицаЗапроса = Неопределено, Сотрудники = Неопределено, Показатели = Неопределено, ОдинВидРасчета = Ложь, ИзДокумента = Ложь) Экспорт
	
	СписокНедоступныхВозможностейИзменения = Новый Массив;
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ПустаяСсылка());
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется);
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПарамВозможностьИзменения", СписокНедоступныхВозможностейИзменения);
	Запрос.УстановитьПараметр("ПарамДата", ПериодДействия);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТаблицаЗапроса",ТаблицаЗапроса);
	
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		СписокНедоступныхВозможностейИзменения = Новый Массив;
		СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ПустаяСсылка());
		СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПарамВозможностьИзменения", СписокНедоступныхВозможностейИзменения);
		Запрос.УстановитьПараметр("ПарамДата", ПериодДействия);
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		
		Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодДействия));
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
		Запрос.УстановитьПараметр("Показатели",Показатели);
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&ПарамДата,
		|			Организация = &ГоловнаяОрганизация";
		Если ЗначениеЗаполнено(Сотрудники) Тогда
			Запрос.Текст = Запрос.Текст + "
		|				И Сотрудник В (&Сотрудники)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|) КАК РаботникиОрганизаций
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &ПарамДата
		|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
		|		КОНЕЦ = &ОбособленноеПодразделение
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &ПарамДата
		|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период > &ПарамДата
		|	И РаботникиОрганизаций.Период <= &КонецМесяца
		|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
		|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение";
		Если ЗначениеЗаполнено(Сотрудники) Тогда
			Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизаций.Сотрудник В(&Сотрудники)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.Сотрудник,
		|	ПериодыПерекрытия.ПодразделениеОрганизации
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
		|		ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
		|			И (ПериодыПерекрытия.Период > Работники.Период)
		|			И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
		|			И (ПериодыПерекрытия.Организация = &ГоловнаяОрганизация)
		|ГДЕ
		|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И Работники.ПериодЗавершения > &ПарамДата
		|	И Работники.ПериодЗавершения <= &КонецМесяца
		|	И Работники.Организация = &ГоловнаяОрганизация
		|	И Работники.ОбособленноеПодразделениеЗавершения = &ОбособленноеПодразделение
		|	И ПериодыПерекрытия.Период ЕСТЬ NULL";
		Если ЗначениеЗаполнено(Сотрудники) Тогда
			Запрос.Текст = Запрос.Текст + "
		|	И Работники.Сотрудник В(&Сотрудники)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "	
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|ВЫБРАТЬ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 1 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель1,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 2 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель2,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 3 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель3,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 4 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель4,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 5 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель5,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 6 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель6,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 1 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный1,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 2 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный2,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 3 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный3,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 4 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный4,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 5 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный5,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 6 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный6,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1) КАК Значение1,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2) КАК Значение2,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3) КАК Значение3,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель4) КАК Значение4,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель5) КАК Значение5,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель6) КАК Значение6,
		|	МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1) КАК Валюта1,
		|	МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2) КАК Валюта2,
		|	МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3) КАК Валюта3,
		|	МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4) КАК Валюта4,
		|	МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5) КАК Валюта5,
		|	МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6) КАК Валюта6
		|ПОМЕСТИТЬ ВТПлановые
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&ПарамДата,
		|			Организация = &ОбособленноеПодразделение
		|				И Сотрудник В
		|					(ВЫБРАТЬ
		|						ВТСотрудники.Сотрудник
		|					ИЗ
		|						ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|		ПО 	(Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|	Показатели.НомерСтроки,
		|	Показатели.Показатель;
		|ВЫБРАТЬ
		|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК Сотрудник,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 1 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель1,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 2 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель2,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 3 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель3,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 4 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель4,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 5 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель5,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 6 Тогда Показатели.Показатель ИНАЧЕ NULL КОНЕЦ КАК Показатель6,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 1 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный1,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 2 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный2,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 3 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный3,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 4 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный4,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 5 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный5,
		|	ВЫБОР КОГДА Показатели.НомерСтроки = 6 Тогда Показатели.Показатель.Предопределенный ИНАЧЕ NULL КОНЕЦ КАК Предопределенный6,
		|	СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель1) КАК Значение1,
		|	СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель2) КАК Значение2,
		|	СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель3) КАК Значение3,
		|	СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель4) КАК Значение4,
		|	СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель5) КАК Значение5,
		|	СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель6) КАК Значение6,
		|	МАКСИМУМ(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта1) КАК Валюта1,
		|	МАКСИМУМ(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта2) КАК Валюта2,
		|	МАКСИМУМ(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта3) КАК Валюта3,
		|	МАКСИМУМ(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта4) КАК Валюта4,
		|	МАКСИМУМ(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта5) КАК Валюта5,
		|	МАКСИМУМ(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта6) КАК Валюта6
		|ПОМЕСТИТЬ ВТПлановыеУд
		|ИЗ
		|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
		|			&ПарамДата,
		|			Организация = &ОбособленноеПодразделение
		|				И ФизЛицо В
		|					(ВЫБРАТЬ
		|						ВТСотрудники.Сотрудник.Физлицо
		|					ИЗ
		|						ВТСотрудники)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
		|		ПО (Показатели.Ссылка = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|	Показатели.НомерСтроки,
		|	Показатели.Показатель;

		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ОбособленноеПодразделение КАК Организация,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	&ПарамДата КАК ПериодДействия,
		|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|	ВложенныйЗапрос.Показатель КАК Показатель,
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|	ВложенныйЗапрос.Валюта КАК Валюта
		|ПОМЕСТИТЬ ВТПлановыеПоказатели
		|ИЗ
		|	(";
		Для СчПоказателей = 1 По 6 Цикл
			Запрос.Текст = Запрос.Текст + "	
			|	ВЫБРАТЬ
			|		ПлановыеНачисления.Сотрудник КАК Сотрудник,
			|		ПлановыеНачисления.Показатель" + СчПоказателей + " КАК Показатель,
			|		ПлановыеНачисления.Значение" + СчПоказателей + " КАК Значение,
			|		ПлановыеНачисления.Валюта" + СчПоказателей + " КАК Валюта
			|	ИЗ
			|		ВТПлановые КАК ПлановыеНачисления
			|	ГДЕ
			|		ПлановыеНачисления.Показатель" + СчПоказателей + " ЕСТЬ НЕ NULL 
			|		И (НЕ ПлановыеНачисления.Предопределенный" + СчПоказателей + ")";
			Если ЗначениеЗаполнено(Сотрудники) Тогда
				Запрос.Текст = Запрос.Текст + "
				|	И (ПлановыеНачисления.Показатель" + СчПоказателей + " В (&Показатели))";
			КонецЕсли;
			Если СчПоказателей < 6 Тогда
				Запрос.Текст = Запрос.Текст + "	
				|	
				|	ОБЪЕДИНИТЬ ВСЕ";
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = Запрос.Текст + "
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Сотрудники.Сотрудник,
		|		Показатели.Показатель,
		|		СУММА(Показатели.Значение),
		|		Показатели.Валюта
		|	ИЗ
		|		(";
		Для СчПоказателей = 1 По 6 Цикл
			Запрос.Текст = Запрос.Текст + "
			|		ВЫБРАТЬ
			|			ПлановыеУдержания.Сотрудник КАК Сотрудник,
			|			ПлановыеУдержания.Показатель" + СчПоказателей + " КАК Показатель,
			|			ПлановыеУдержания.Значение" + СчПоказателей + " КАК Значение,
			|			ПлановыеУдержания.Валюта" + СчПоказателей + " КАК Валюта
			|		ИЗ
			|			ВТПлановыеУд КАК ПлановыеУдержания 
			|		
			|		ГДЕ
			|			ПлановыеУдержания.Показатель" + СчПоказателей + " ЕСТЬ НЕ NULL 
			|			И (НЕ ПлановыеУдержания.Предопределенный" + СчПоказателей + ")";
			Если ЗначениеЗаполнено(Сотрудники) Тогда
				Запрос.Текст = Запрос.Текст + "
				|		И (ПлановыеУдержания.Показатель" + СчПоказателей + " В (&Показатели))";
			КонецЕсли;
			Если СчПоказателей < 6 Тогда
				Запрос.Текст = Запрос.Текст + "	
			|		
			|		ОБЪЕДИНИТЬ ВСЕ";
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = Запрос.Текст + ") КАК Показатели
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				СписокСотрудников.Сотрудник КАК Сотрудник,
		|				СписокСотрудников.Физлицо КАК Физлицо
		|			ИЗ
		|				(ВЫБРАТЬ
		|					МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
		|					РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|					1 КАК Приоритет
		|				ИЗ
		|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация И	Сотрудник В
		|										(ВЫБРАТЬ
		|											ВТСотрудники.Сотрудник
		|												ИЗ
		|											ВТСотрудники) И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
		|									И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
		|							ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
		|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					РаботникиОсновноеМесто.Сотрудник.Физлицо
		|				
		|				ОБЪЕДИНИТЬ
		|				
		|				ВЫБРАТЬ
		|					МАКСИМУМ(РаботникиСовместительство.Сотрудник),
		|					РаботникиСовместительство.Сотрудник.Физлицо,
		|					2
		|				ИЗ
		|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата,  Организация = &ГоловнаяОрганизация И	Сотрудник В
		|										(ВЫБРАТЬ
		|											ВТСотрудники.Сотрудник
		|												ИЗ
		|											ВТСотрудники) И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
		|									И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
		|							ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
		|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					РаботникиСовместительство.Сотрудник.Физлицо
		|				
		|				ОБЪЕДИНИТЬ
		|				
		|				ВЫБРАТЬ
		|					МАКСИМУМ(СотрудникиДУ.Ссылка),
		|					СотрудникиДУ.Физлицо,
		|					ВЫБОР
		|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|							ТОГДА 4
		|						ИНАЧЕ 5
		|					КОНЕЦ
		|				ИЗ
		|					Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
		|				ГДЕ
		|					Организация = &ГоловнаяОрганизация И
		|						СотрудникиДУ.Ссылка В
		|								(ВЫБРАТЬ
		|									ВТСотрудники.Сотрудник
		|								ИЗ
		|									ВТСотрудники)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					СотрудникиДУ.Физлицо,
		|					ВЫБОР
		|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|							ТОГДА 4
		|						ИНАЧЕ 5
		|					КОНЕЦ) КАК СписокСотрудников
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|						СписокФизическихЛиц.Физлицо КАК Физлицо,
		|						МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
		|					ИЗ
		|						(ВЫБРАТЬ
		|							РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|							1 КАК Приоритет
		|						ИЗ
		|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|									&ПарамДата,
		|									Организация = &ГоловнаяОрганизация
		|									И	Сотрудник В
		|										(ВЫБРАТЬ
		|											ВТСотрудники.Сотрудник
		|												ИЗ
		|											ВТСотрудники)
		|									И	Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|						ГДЕ
		|							ВЫБОР
		|									КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
		|											И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|										ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
		|									ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
		|								КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							РаботникиСовместительство.Сотрудник.Физлицо,
		|							2
		|						ИЗ
		|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|									&ПарамДата,
		|									Организация = &ГоловнаяОрганизация
		|									И	Сотрудник В
		|										(ВЫБРАТЬ
		|											ВТСотрудники.Сотрудник
		|												ИЗ
		|											ВТСотрудники)
		|									И	Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|						ГДЕ
		|							ВЫБОР
		|									КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
		|											И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|										ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
		|									ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
		|								КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|						
		|						ОБЪЕДИНИТЬ
		|						
		|						ВЫБРАТЬ
		|							СотрудникиДУ.Физлицо,
		|							ВЫБОР
		|								КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|									ТОГДА 4
		|								ИНАЧЕ 5
		|							КОНЕЦ
		|						ИЗ
		|							Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
		|						ГДЕ
		|								Организация = &ГоловнаяОрганизация И
		|								СотрудникиДУ.Ссылка В
		|									(ВЫБРАТЬ
		|										ВТСотрудники.Сотрудник
		|									ИЗ
		|										ВТСотрудники)) КАК СписокФизическихЛиц
		|					
		|					СГРУППИРОВАТЬ ПО
		|						СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
		|					ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
		|						И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
		|			ПО Показатели.Сотрудник = Сотрудники.Физлицо
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Показатели.Показатель,
		|		Сотрудники.Сотрудник,
		|		Показатели.Валюта) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО (Сотрудники.Сотрудник = ВложенныйЗапрос.Сотрудник)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Подразделение,
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.Показатель,
		|	ВложенныйЗапрос.Валюта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	Сотрудник,
		|	Подразделение";
		
		Запрос.Выполнить();
		
		Если ЗначениеЗаполнено(ТаблицаЗапроса) Тогда
			
			Запрос.УстановитьПараметр("ТаблицаЗапроса",ТаблицаЗапроса);
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ВидПоказателя,
			|	Таблица.Показатель,
			|	Таблица.Сотрудник КАК Сотрудник
			|ПОМЕСТИТЬ ВТПоказателиИСотрудники
			|ИЗ
			|	&ТаблицаЗапроса КАК Таблица
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	&ОбособленноеПодразделение КАК Организация,
			|	ИтоговаяТаблица.Подразделение КАК Подразделение,
			|	ИтоговаяТаблица.Сотрудник КАК Сотрудник,
			|	ИтоговаяТаблица.Показатель КАК Показатель,
			|	ИтоговаяТаблица.ПериодДействия КАК ПериодДействия,
			|	ИтоговаяТаблица.Валюта КАК Валюта,
			|	СУММА(ЕСТЬNULL(ИтоговаяТаблица.ФактическоеЗначение, ИтоговаяТаблица.ПлановоеЗначение)) КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВложеннаяТаблица.Показатель КАК Показатель,
			|		ВложеннаяТаблица.Подразделение КАК Подразделение,
			|		ВложеннаяТаблица.Сотрудник КАК Сотрудник,
			|		ВложеннаяТаблица.ПериодДействия КАК ПериодДействия,
			|		МАКСИМУМ(ВложеннаяТаблица.Валюта) КАК Валюта,
			|		МАКСИМУМ(ВложеннаяТаблица.ФактическоеЗначение) КАК ФактическоеЗначение,
			|		МАКСИМУМ(ВложеннаяТаблица.ПлановоеЗначение) КАК ПлановоеЗначение
			|	ИЗ
			|		(ВЫБРАТЬ
			|			Факт.Показатель КАК Показатель,
			|			Факт.Подразделение КАК Подразделение,
			|			Факт.Сотрудник КАК Сотрудник,
			|			Факт.ПериодДействия КАК ПериодДействия,
			|			МАКСИМУМ(Факт.Валюта) КАК Валюта,
			|			СУММА(ЕСТЬNULL(Факт.Значение, 0)) КАК ФактическоеЗначение,
			|			NULL КАК ПлановоеЗначение
			|		ИЗ
			|			(ВЫБРАТЬ
			|				ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
			|				ВЫБОР
			|					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			|						ТОГДА ВЫРАЗИТЬ(ЗначенияПоказателейСхемМотивации.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|				КОНЕЦ КАК Подразделение,
			|				ВЫБОР
			|					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			|						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			|				КОНЕЦ КАК Сотрудник,
			|				ЗначенияПоказателейСхемМотивации.ПериодДействия КАК ПериодДействия,
			|				МАКСИМУМ(ЗначенияПоказателейСхемМотивации.Валюта) КАК Валюта,
			|				СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
			|			ИЗ
			|				РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			|			ГДЕ
			|				ЗначенияПоказателейСхемМотивации.Организация = &ОбособленноеПодразделение
			|				И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			|				И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата
			|				И ЗначенияПоказателейСхемМотивации.Сотрудник В
			|									(ВЫБРАТЬ
			|										ВТСотрудники.Сотрудник
			|									ИЗ
			|										ВТСотрудники)
			|";
			Если ЗначениеЗаполнено(Показатели) Тогда
				Запрос.Текст = Запрос.Текст + "
			|				И (ЗначенияПоказателейСхемМотивации.Показатель В (&Показатели))";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ЗначенияПоказателейСхемМотивации.Показатель,
			|				ВЫБОР
			|					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			|						ТОГДА ВЫРАЗИТЬ(ЗначенияПоказателейСхемМотивации.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|				КОНЕЦ,
			|				ВЫБОР
			|					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			|						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			|				КОНЕЦ,
			|				ЗначенияПоказателейСхемМотивации.Сотрудник,
			|				ЗначенияПоказателейСхемМотивации.ПериодДействия
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				ТаблицаЗапроса.Показатель,
			|				ВЫБОР
			|					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			|						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|				КОНЕЦ,
			|				ВЫБОР
			|					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			|						ТОГДА ТаблицаЗапроса.Сотрудник
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			|				КОНЕЦ,
			|				&ПарамДата,
			|				NULL,
			|				СУММА(0)
			|			ИЗ
			|				ВТПоказателиИСотрудники КАК ТаблицаЗапроса
			|					ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
			|					ПО (Сотрудники.Сотрудник = ТаблицаЗапроса.Сотрудник)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ВЫБОР
			|					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			|						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|				КОНЕЦ,
			|				ВЫБОР
			|					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			|						ТОГДА ТаблицаЗапроса.Сотрудник
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			|				КОНЕЦ,
			|				ТаблицаЗапроса.Показатель) КАК Факт
			|		
			|		СГРУППИРОВАТЬ ПО
			|			Факт.Показатель,
			|			Факт.Подразделение,
			|			Факт.Сотрудник,
			|			Факт.ПериодДействия
			|		
			|		ОБЪЕДИНИТЬ
			|		
			|		ВЫБРАТЬ
			|			ПЛАН.Показатель,
			|			ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
			|			ВЫБОР
			|				КОГДА ПЛАН.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			|					ТОГДА ПЛАН.Сотрудник
			|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			|			КОНЕЦ,
			|			ПЛАН.ПериодДействия,
			|			ВЫБОР
			|				КОГДА ПЛАН.Валюта = НЕОПРЕДЕЛЕНО
			|					ТОГДА NULL
			|				ИНАЧЕ ПЛАН.Валюта
			|			КОНЕЦ,
			|			NULL,
			|			ЕСТЬNULL(ПЛАН.Значение, 0)
			|		ИЗ
			|			ВТПлановыеПоказатели КАК ПЛАН) КАК ВложеннаяТаблица
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВложеннаяТаблица.Показатель,
			|		ВложеннаяТаблица.Подразделение,
			|		ВложеннаяТаблица.Сотрудник,
			|		ВложеннаяТаблица.ПериодДействия) КАК ИтоговаяТаблица
			|ГДЕ
			|	ИтоговаяТаблица.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИтоговаяТаблица.Подразделение,
			|	ИтоговаяТаблица.Сотрудник,
			|	ИтоговаяТаблица.Показатель,
			|	ИтоговаяТаблица.ПериодДействия,
			|	ИтоговаяТаблица.Валюта
			|
			|УПОРЯДОЧИТЬ ПО
			|	Подразделение,
			|	ИтоговаяТаблица.Сотрудник.Наименование,
			|	Показатель";

		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Показатели.Организация КАК Организация,
			|	Показатели.Подразделение КАК Подразделение,
			|	Показатели.ПериодДействия КАК ПериодДействия,
			|	Показатели.Сотрудник КАК Сотрудник,
			|	Показатели.Показатель КАК Показатель,
			|	Показатели.Валюта,
			|	СУММА(Показатели.Значение) КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ПлановыеПоказатели.Организация КАК Организация,
			|		ПлановыеПоказатели.Подразделение КАК Подразделение,
			|		ПлановыеПоказатели.ПериодДействия КАК ПериодДействия,
			|		ПлановыеПоказатели.Сотрудник КАК Сотрудник,
			|		ПлановыеПоказатели.Показатель КАК Показатель,
			|		ПлановыеПоказатели.Значение КАК Значение,
			|		ПлановыеПоказатели.Валюта КАК Валюта
			|	ИЗ
			|		ВТПлановыеПоказатели КАК ПлановыеПоказатели
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		&ОбособленноеПодразделение,
			|		ЗначенияПоказателейСхемМотивации.Подразделение,
			|		&ПарамДата,
			|		ЗначенияПоказателейСхемМотивации.Сотрудник,
			|		ЗначенияПоказателейСхемМотивации.Показатель,
			|		ЕСТЬNULL(ЗначенияПоказателейСхемМотивации.Значение, 0),
			|		ЗначенияПоказателейСхемМотивации.Валюта
			|	ИЗ
			|		РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			|	ГДЕ
			|		ЗначенияПоказателейСхемМотивации.Организация = &ОбособленноеПодразделение
			|		И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)";
			Если ЗначениеЗаполнено(Показатели) Тогда
				Запрос.Текст = Запрос.Текст + "
			|		И ЗначенияПоказателейСхемМотивации.Показатель В(&Показатели)";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			|		И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата) КАК Показатели
			|
			|ГДЕ Показатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			|
			|СГРУППИРОВАТЬ ПО
			|	Показатели.Сотрудник,
			|	Показатели.Показатель,
			|	Показатели.Подразделение,
			|	Показатели.Валюта,
			|	Показатели.Организация,
			|	Показатели.ПериодДействия
			|
			|УПОРЯДОЧИТЬ ПО
			|	Организация,
			|	Подразделение,
			|	Сотрудник,
			|	Показатель";
		КонецЕсли;
		
	Иначе
		
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодДействия));
		
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
		Запрос.УстановитьПараметр("Показатели",Показатели);
		
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Работники.ФизЛицо КАК ФизЛицо,
		|	Работники.Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(&ПарамДата, ) КАК Работники
		|ГДЕ
		|	Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|ГДЕ
		|	Работники.Период > &ПарамДата
		|	И Работники.Период <= &КонецМесяца
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК ПериодыПерекрытия
		|		ПО (ПериодыПерекрытия.Период > Работники.Период)
		|ГДЕ
		|	ПериодыПерекрытия.Период ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		
		Запрос.Текст = СотрудникиТекст;
		Запрос.Выполнить();
		СотрудникиТекст = "ВТСотрудники";
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Сотрудники.Подразделение КАК Подразделение,
		|	&ПарамДата КАК ПериодДействия,
		|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
		|	ВложенныйЗапрос.Показатель КАК Показатель,
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|	ВложенныйЗапрос.Валюта КАК Валюта
		|	ПОМЕСТИТЬ ВТПлановыеПоказатели
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|			Показатели.Показатель КАК Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель1) КАК Значение,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1 КАК Валюта
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 1)
		|				И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|				И ((НЕ Показатели.Показатель.Предопределенный))
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)";
		Если ЗначениеЗаполнено(Показатели) Тогда
			Запрос.Текст = Запрос.Текст + "
		|			И Показатели.Показатель В(&Показатели)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель2),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата,ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 2)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)";
		Если ЗначениеЗаполнено(Показатели) Тогда
			Запрос.Текст = Запрос.Текст + "
		|			И Показатели.Показатель В(&Показатели)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель3),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 3)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)";
		Если ЗначениеЗаполнено(Показатели) Тогда
				Запрос.Текст = Запрос.Текст + "
		|			И Показатели.Показатель В(&Показатели)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель4),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)";
		Если ЗначениеЗаполнено(Показатели) Тогда
				Запрос.Текст = Запрос.Текст + "
		|			И Показатели.Показатель В(&Показатели)";
		КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель5),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 5)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)";
		Если ЗначениеЗаполнено(Показатели) Тогда
				Запрос.Текст = Запрос.Текст + "
		|			И Показатели.Показатель В(&Показатели)";
			КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель6),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)";
		Если ЗначениеЗаполнено(Показатели) Тогда
				Запрос.Текст = Запрос.Текст + "
		|			И Показатели.Показатель В(&Показатели)";
			КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			Показатели.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(Показатели.Значение),
		|			Показатели.Валюта
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель1) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта1 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 1)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта1
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель2) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта2 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 2)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта2
		
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель3) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта3 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 3)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта3
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель4) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта4 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 4)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта4
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель5) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта5 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 3)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта5
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель6) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта6 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 6)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта6) КАК Показатели
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель В (&Показатели)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Показатели.Показатель,
		|			Показатели.ФизЛицо,
		|			Показатели.Валюта) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО Сотрудники.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Сотрудники.Подразделение,
		|		ВложенныйЗапрос.ФизЛицо,
		|		ВложенныйЗапрос.Показатель,
		|		ВложенныйЗапрос.Валюта
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	ФизЛицо,
		|	Подразделение";
		
		Запрос.Выполнить();
		
		ВТПлановыеПоказатели = "ВТПлановыеПоказатели";
		
		
		
		Если ИзДокумента Тогда
			
			Запрос.УстановитьПараметр("ТаблицаЗапроса",ТаблицаЗапроса);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ВидПоказателя,
			|	Таблица.Показатель,
			|	Таблица.Сотрудник
			|	ПОМЕСТИТЬ ВТПоказателиИСотрудники
			|ИЗ &ТаблицаЗапроса КАК Таблица
			|ИНДЕКСИРОВАТЬ ПО
			|	Таблица.Сотрудник";
			
			Запрос.Выполнить();
			
			ВТПоказателиИСотрудники = "ВТПоказателиИСотрудники";
			
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ИтоговаяТаблица.Подразделение КАК Подразделение,
			               |	Сотрудники.Сотрудник КАК Сотрудник,
			               |	ИтоговаяТаблица.Показатель КАК Показатель,
			               |	ИтоговаяТаблица.ПериодДействия КАК ПериодДействия,
			               |	ИтоговаяТаблица.Валюта КАК Валюта,
			               |	СУММА(ЕСТЬNULL(ИтоговаяТаблица.ФактическоеЗначение, ИтоговаяТаблица.ПлановоеЗначение)) КАК Значение
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		ВложеннаяТаблица.Показатель КАК Показатель,
			               |		ВложеннаяТаблица.Подразделение КАК Подразделение,
			               |		ВложеннаяТаблица.Сотрудник КАК Сотрудник,
			               |		ВложеннаяТаблица.ПериодДействия КАК ПериодДействия,
			               |		МАКСИМУМ(ВложеннаяТаблица.Валюта) КАК Валюта,
			               |		МАКСИМУМ(ВложеннаяТаблица.ФактическоеЗначение) КАК ФактическоеЗначение,
			               |		МАКСИМУМ(ВложеннаяТаблица.ПлановоеЗначение) КАК ПлановоеЗначение
			               |	ИЗ
			               |		(ВЫБРАТЬ
			               |			Факт.Показатель КАК Показатель,
			               |			Факт.Подразделение КАК Подразделение,
			               |			Факт.Сотрудник.Физлицо КАК Сотрудник,
			               |			Факт.ПериодДействия КАК ПериодДействия,
			               |			МАКСИМУМ(Факт.Валюта) КАК Валюта,
			               |			СУММА(ЕСТЬNULL(Факт.Значение, 0)) КАК ФактическоеЗначение,
			               |			NULL КАК ПлановоеЗначение
			               |		ИЗ
			               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |				ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Подразделение = НЕОПРЕДЕЛЕНО
			               |						ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Подразделение
			               |				КОНЕЦ КАК Подразделение,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ КАК Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия КАК ПериодДействия,
			               |				ЗначенияПоказателейСхемМотивации.Валюта КАК Валюта,
			               |				ЗначенияПоказателейСхемМотивации.Значение КАК Значение
			               |			ИЗ
			               |				РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			               |			ГДЕ
			               |				ЗначенияПоказателейСхемМотивации.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			               |				И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
						   |				И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата";
						   Если ЗначениеЗаполнено(Показатели) Тогда
							Запрос.Текст = Запрос.Текст + "
						   |				И (ЗначенияПоказателейСхемМотивации.Показатель В (&Показатели))";
						   КонецЕсли;
						   Запрос.Текст = Запрос.Текст + "
			               |			
			               |			
						   |			ОБЪЕДИНИТЬ ВСЕ
						   |			
						   |			ВЫБРАТЬ
						   |				ТаблицаЗапроса.Показатель,
						   |				ВЫБОР
						   |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
						   |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.Подразделения)
						   |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
						   |				КОНЕЦ,
						   |				ВЫБОР
						   |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
						   |						ТОГДА ТаблицаЗапроса.Сотрудник
						   |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
						   |				КОНЕЦ,
						   |				&ПарамДата,
						   |				NULL,
						   |				СУММА(0)
						   |			ИЗ
						   |				ВТПоказателиИСотрудники КАК ТаблицаЗапроса
						   |					ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
						   |					ПО (Сотрудники.ФизЛицо = ТаблицаЗапроса.Сотрудник.ФизЛицо)
						   |			
						   |			СГРУППИРОВАТЬ ПО
						   |				ВЫБОР
						   |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
						   |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.Подразделения)
						   |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
						   |				КОНЕЦ,
						   |				ВЫБОР
						   |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
						   |						ТОГДА ТаблицаЗапроса.Сотрудник
						   |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
						   |				КОНЕЦ,
						   |				ТаблицаЗапроса.Показатель
						   |) КАК Факт
			               |		
			               |		СГРУППИРОВАТЬ ПО
			               |			Факт.Показатель,
			               |			Факт.Подразделение,
			               |			Факт.Сотрудник,
			               |			Факт.ПериодДействия,
			               |			Факт.Сотрудник.Физлицо
			               |		
			               |		ОБЪЕДИНИТЬ
			               |		
			               |		ВЫБРАТЬ
			               |			ПЛАН.Показатель,
			               |			ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка),
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |					ТОГДА ПЛАН.ФизЛицо
			               |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |			КОНЕЦ,
			               |			ПЛАН.ПериодДействия,
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Валюта = НЕОПРЕДЕЛЕНО
			               |					ТОГДА NULL
			               |				ИНАЧЕ ПЛАН.Валюта
			               |			КОНЕЦ,
			               |			NULL,
			               |			ЕСТЬNULL(ПЛАН.Значение, 0)
			               |		ИЗ
			               |			ВТПлановыеПоказатели КАК ПЛАН) КАК ВложеннаяТаблица
			               |	
			               |	СГРУППИРОВАТЬ ПО
			               |		ВложеннаяТаблица.Подразделение,
			               |		ВложеннаяТаблица.Сотрудник,
			               |		ВложеннаяТаблица.Показатель,
			               |		ВложеннаяТаблица.ПериодДействия) КАК ИтоговаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			СписокСотрудников.Сотрудник КАК Сотрудник,
			               |			СписокСотрудников.Физлицо КАК Физлицо
			               |		ИЗ
			               |			(ВЫБРАТЬ
			               |				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			               |				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			               |				1 КАК Приоритет
			               |			ИЗ
			               |				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			               |			ГДЕ
			               |				ВЫБОР
			               |						КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			               |								И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |							ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			               |						ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			               |					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				РаботникиОсновноеМесто.Сотрудник.Физлицо
			               |			
			               |			ОБЪЕДИНИТЬ
			               |			
			               |			ВЫБРАТЬ
			               |				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			               |				РаботникиСовместительство.Сотрудник.Физлицо,
			               |				2
			               |			ИЗ
			               |				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			               |			ГДЕ
			               |				ВЫБОР
			               |						КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			               |								И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |							ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			               |						ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			               |					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				РаботникиСовместительство.Сотрудник.Физлицо
			               |			
			               |			ОБЪЕДИНИТЬ
			               |			
			               |			ВЫБРАТЬ
			               |				МАКСИМУМ(СотрудникиДУ.Ссылка),
			               |				СотрудникиДУ.Физлицо,
			               |				ВЫБОР
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |						ТОГДА 3
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |						ТОГДА 4
			               |					ИНАЧЕ 5
			               |				КОНЕЦ
			               |			ИЗ
			               |				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				СотрудникиДУ.Физлицо,
			               |				ВЫБОР
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |						ТОГДА 3
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |						ТОГДА 4
			               |					ИНАЧЕ 5
			               |				КОНЕЦ) КАК СписокСотрудников
			               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |					СписокФизическихЛиц.Физлицо КАК Физлицо,
			               |					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			               |				ИЗ
			               |					(ВЫБРАТЬ
			               |						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			               |						1 КАК Приоритет
			               |					ИЗ
			               |						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			               |								&ПарамДата,
			               |								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			               |					ГДЕ
			               |						ВЫБОР
			               |								КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			               |										И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |									ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			               |								ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			               |							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |					
			               |					ОБЪЕДИНИТЬ
			               |					
			               |					ВЫБРАТЬ
			               |						РаботникиСовместительство.Сотрудник.Физлицо,
			               |						2
			               |					ИЗ
			               |						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			               |								&ПарамДата,
			               |								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			               |					ГДЕ
			               |						ВЫБОР
			               |								КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			               |										И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |									ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			               |								ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			               |							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |					
			               |					ОБЪЕДИНИТЬ
			               |					
			               |					ВЫБРАТЬ
			               |						СотрудникиДУ.Физлицо,
			               |						ВЫБОР
			               |							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |								ТОГДА 3
			               |							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |								ТОГДА 4
			               |							ИНАЧЕ 5
			               |						КОНЕЦ
			               |					ИЗ
			               |						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
			               |				
			               |				СГРУППИРОВАТЬ ПО
			               |					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			               |				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			               |					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
			               |		ПО ИтоговаяТаблица.Сотрудник = Сотрудники.Физлицо
						   |
						   |ГДЕ ИтоговаяТаблица.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ИтоговаяТаблица.Подразделение,
			               |	Сотрудники.Сотрудник,
			               |	ИтоговаяТаблица.Показатель,
			               |	ИтоговаяТаблица.ПериодДействия,
			               |	ИтоговаяТаблица.Валюта
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Подразделение,
			               |	Сотрудники.Сотрудник.Наименование,
			               |	Показатель";
			
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Показатели.Подразделение КАК Подразделение,
			|	Показатели.ПериодДействия КАК ПериодДействия,
			|	Показатели.Сотрудник КАК Сотрудник,
			|	Показатели.Показатель КАК Показатель,
			|	Показатели.Валюта,
			|	СУММА(Показатели.Значение) КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ПлановыеПоказатели.Подразделение КАК Подразделение,
			|		ПлановыеПоказатели.ПериодДействия КАК ПериодДействия,
			|		Сотрудники.Сотрудник КАК Сотрудник,
			|		ПлановыеПоказатели.Показатель КАК Показатель,
			|		ПлановыеПоказатели.Значение КАК Значение,
			|		ПлановыеПоказатели.Валюта КАК Валюта
			|	ИЗ
			|		ВТПлановыеПоказатели КАК ПлановыеПоказатели
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				СписокСотрудников.Сотрудник КАК Сотрудник,
			|				СписокСотрудников.Физлицо КАК Физлицо
			|			ИЗ
			|				(ВЫБРАТЬ
			|					МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			|					РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|					1 КАК Приоритет
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			|									И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|							ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				
			|				СГРУППИРОВАТЬ ПО
			|					РаботникиОсновноеМесто.Сотрудник.Физлицо
			|				
			|				ОБЪЕДИНИТЬ
			|				
			|				ВЫБРАТЬ
			|					МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			|					РаботникиСовместительство.Сотрудник.Физлицо,
			|					2
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			|									И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			|							ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				
			|				СГРУППИРОВАТЬ ПО
			|					РаботникиСовместительство.Сотрудник.Физлицо
			|				
			|				ОБЪЕДИНИТЬ
			|				
			|				ВЫБРАТЬ
			|					МАКСИМУМ(СотрудникиДУ.Ссылка),
			|					СотрудникиДУ.Физлицо,
			|					ВЫБОР
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|							ТОГДА 3
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|							ТОГДА 4
			|						ИНАЧЕ 5
			|					КОНЕЦ
			|				ИЗ
			|					Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
			|				
			|				СГРУППИРОВАТЬ ПО
			|					СотрудникиДУ.Физлицо,
			|					ВЫБОР
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|							ТОГДА 3
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|							ТОГДА 4
			|						ИНАЧЕ 5
			|					КОНЕЦ) КАК СписокСотрудников
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|						СписокФизическихЛиц.Физлицо КАК Физлицо,
			|						МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			|					ИЗ
			|						(ВЫБРАТЬ
			|							РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|							1 КАК Приоритет
			|						ИЗ
			|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|									&ПарамДата,
			|									Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|						ГДЕ
			|							ВЫБОР
			|									КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			|											И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|										ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|									ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			|								КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|						
			|						ОБЪЕДИНИТЬ
			|						
			|						ВЫБРАТЬ
			|							РаботникиСовместительство.Сотрудник.Физлицо,
			|							2
			|						ИЗ
			|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|									&ПарамДата,
			|									Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|						ГДЕ
			|							ВЫБОР
			|									КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			|											И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|										ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			|									ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			|								КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|						
			|						ОБЪЕДИНИТЬ
			|						
			|						ВЫБРАТЬ
			|							СотрудникиДУ.Физлицо,
			|							ВЫБОР
			|								КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|									ТОГДА 3
			|								КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|									ТОГДА 4
			|								ИНАЧЕ 5
			|							КОНЕЦ
			|						ИЗ
			|							Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
			|					
			|					СГРУППИРОВАТЬ ПО
			|						СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			|					ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			|						И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
			|			ПО ПлановыеПоказатели.Физлицо = Сотрудники.Физлицо
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЗначенияПоказателейСхемМотивации.Подразделение,
			|		&ПарамДата,
			|		ЗначенияПоказателейСхемМотивации.Сотрудник,
			|		ЗначенияПоказателейСхемМотивации.Показатель,
			|		ЕСТЬNULL(ЗначенияПоказателейСхемМотивации.Значение, 0),
			|		ЗначенияПоказателейСхемМотивации.Валюта
			|	ИЗ
			|		РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			|	ГДЕ
			|		ЗначенияПоказателейСхемМотивации.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)";
			Если ЗначениеЗаполнено(Показатели) Тогда
					Запрос.Текст = Запрос.Текст + "
			|				И (ЗначенияПоказателейСхемМотивации.Показатель В (&Показатели))";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			|		И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата) КАК Показатели
			|
			|ГДЕ Показатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			|
			|СГРУППИРОВАТЬ ПО
			|	Показатели.Подразделение,
			|	Показатели.Сотрудник,
			|	Показатели.Показатель,
			|	Показатели.Валюта,
			|	Показатели.ПериодДействия
			|
			|УПОРЯДОЧИТЬ ПО
			|	Подразделение,
			|	Сотрудник,
			|	Показатель";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ЗаписатьИтоговыеЗаписи(Показатель, Организация, ПериодДействия)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодДействия);
	Запрос.УстановитьПараметр("парамПоказатель", Показатель);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказателиСхемМотивации.СуммируемыйПоказатель КАК СуммируемыйПоказатель,
	|	ПоказателиСхемМотивации.СпособРасчетаСуммы,
	|	ПоказателиСхемМотивации.Ссылка КАК Показатель
	|ПОМЕСТИТЬ ВТПоказатели
	|ИЗ
	|	Справочник.ПоказателиСхемМотивации КАК ПоказателиСхемМотивации
	|ГДЕ
	|	ПоказателиСхемМотивации.СуммируемыйПоказатель В(&парамПоказатель)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммируемыйПоказатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Показатели.Показатель КАК Показатель,
	|	ЕСТЬNULL(ИтогПоСотрудникам.Значение, 0) КАК ЗначениеИтогаПоСотрудникам,
	|	ИтогПоОрганизациям.Организация,
	|	ЕСТЬNULL(ИтогПоОрганизациям.Значение, 0) КАК ЗначениеИтогаПоОрганизациям,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение
	|ИЗ
	|	ВТПоказатели КАК Показатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
	|			ЗначенияПоказателейСхемМотивации.Организация КАК Организация,
	|			СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
	|		ГДЕ
	|			ЗначенияПоказателейСхемМотивации.Показатель В
	|					(ВЫБРАТЬ
	|						ВТПоказатели.СуммируемыйПоказатель
	|					ИЗ
	|						ВТПоказатели КАК ВТПоказатели
	|					ГДЕ
	|						ВТПоказатели.СпособРасчетаСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСуммыПоказателей.ПоОрганизации))
	|			И ЗначенияПоказателейСхемМотивации.ПериодДействия >= НАЧАЛОПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
	|			И ЗначенияПоказателейСхемМотивации.ПериодДействия <= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
	|			И ЗначенияПоказателейСхемМотивации.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗначенияПоказателейСхемМотивации.Организация,
	|			ЗначенияПоказателейСхемМотивации.Показатель) КАК ИтогПоОрганизациям
	|		ПО Показатели.СуммируемыйПоказатель = ИтогПоОрганизациям.Показатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
	|			СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
	|		ГДЕ
	|			ЗначенияПоказателейСхемМотивации.Показатель В
	|					(ВЫБРАТЬ
	|						ВТПоказатели.СуммируемыйПоказатель
	|					ИЗ
	|						ВТПоказатели КАК ВТПоказатели
	|					ГДЕ
	|						ВТПоказатели.СпособРасчетаСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСуммыПоказателей.ПоВсемСотрудникам))
	|			И ЗначенияПоказателейСхемМотивации.ПериодДействия >= НАЧАЛОПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
	|			И ЗначенияПоказателейСхемМотивации.ПериодДействия <= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗначенияПоказателейСхемМотивации.Показатель) КАК ИтогПоСотрудникам
	|		ПО Показатели.СуммируемыйПоказатель = ИтогПоСотрудникам.Показатель";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИтоговаяЗапись = РегистрыСведений.ЗначенияПоказателейСхемМотивации.СоздатьМенеджерЗаписи();
		ИтоговаяЗапись.Показатель = Выборка.Показатель;
		ИтоговаяЗапись.ПериодДействия = ПериодДействия;
		Если ЗначениеЗаполнено(Выборка.ЗначениеИтогаПоСотрудникам) Тогда
			
			ИтоговаяЗапись.Значение = Выборка.ЗначениеИтогаПоСотрудникам;
			ИтоговаяЗапись.Подразделение = Выборка.Подразделение;
			
		Иначе
			
			ИтоговаяЗапись.Подразделение = Выборка.Подразделение;
			ИтоговаяЗапись.Организация = Организация;
			ИтоговаяЗапись.Значение = Выборка.ЗначениеИтогаПоОрганизациям;
			
		КонецЕсли;
		ИтоговаяЗапись.Записать();
	КонецЦикла;
	
КонецПроцедуры //ЗаписатьИтоговыеЗаписи

Процедура ЗаписатьИтоговыеЗаписиПериодическихПоказателей(Показатель, Организация, Период)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамПериод", Период);
	Запрос.УстановитьПараметр("парамПоказатель", Показатель);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказателиСхемМотивации.СуммируемыйПоказатель КАК СуммируемыйПоказатель,
	|	ПоказателиСхемМотивации.СпособРасчетаСуммы,
	|	ПоказателиСхемМотивации.Ссылка КАК Показатель
	|ПОМЕСТИТЬ ВТПоказатели
	|ИЗ
	|	Справочник.ПоказателиСхемМотивации КАК ПоказателиСхемМотивации
	|ГДЕ
	|	ПоказателиСхемМотивации.СуммируемыйПоказатель В(&парамПоказатель)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммируемыйПоказатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Показатели.Показатель КАК Показатель,
	|	ЕСТЬNULL(ИтогПоСотрудникам.Значение, 0) КАК ЗначениеИтогаПоСотрудникам,
	|	ИтогПоОрганизациям.Организация,
	|	ЕСТЬNULL(ИтогПоОрганизациям.Значение, 0) КАК ЗначениеИтогаПоОрганизациям,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение
	|ИЗ
	|	ВТПоказатели КАК Показатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель КАК Показатель,
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Организация КАК Организация,
	|			СУММА(ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Значение) КАК Значение
	|		ИЗ
	|			РегистрСведений.ПериодическиеЗначенияПоказателейСхемМотивации.СрезПоследних(
	|					&парамПериод,
	|					Организация = &Организация
	|						И Показатель В
	|							(ВЫБРАТЬ
	|								ВТПоказатели.СуммируемыйПоказатель
	|							ИЗ
	|								ВТПоказатели КАК ВТПоказатели
	|							ГДЕ
	|								ВТПоказатели.СпособРасчетаСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСуммыПоказателей.ПоОрганизации))) КАК ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних
	|		ГДЕ
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель В
	|					(ВЫБРАТЬ
	|						ВТПоказатели.СуммируемыйПоказатель
	|					ИЗ
	|						ВТПоказатели КАК ВТПоказатели
	|					ГДЕ
	|						ВТПоказатели.СпособРасчетаСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСуммыПоказателей.ПоОрганизации))
	|			И ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Организация,
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель) КАК ИтогПоОрганизациям
	|		ПО Показатели.СуммируемыйПоказатель = ИтогПоОрганизациям.Показатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель КАК Показатель,
	|			СУММА(ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Значение) КАК Значение
	|		ИЗ
	|			РегистрСведений.ПериодическиеЗначенияПоказателейСхемМотивации.СрезПоследних(
	|					&парамПериод,
	|					Показатель В
	|						(ВЫБРАТЬ
	|							ВТПоказатели.СуммируемыйПоказатель
	|						ИЗ
	|							ВТПоказатели КАК ВТПоказатели
	|						ГДЕ
	|							ВТПоказатели.СпособРасчетаСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСуммыПоказателей.ПоВсемСотрудникам))) КАК ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель) КАК ИтогПоСотрудникам
	|		ПО Показатели.СуммируемыйПоказатель = ИтогПоСотрудникам.Показатель";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИтоговаяЗапись = РегистрыСведений.ПериодическиеЗначенияПоказателейСхемМотивации.СоздатьМенеджерЗаписи();
		ИтоговаяЗапись.Период = Период;
		ИтоговаяЗапись.Показатель = Выборка.Показатель;
		Если ЗначениеЗаполнено(Выборка.ЗначениеИтогаПоСотрудникам) Тогда
			
			ИтоговаяЗапись.Значение = Выборка.ЗначениеИтогаПоСотрудникам;
			
		Иначе
			
			ИтоговаяЗапись.Подразделение	= Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			ИтоговаяЗапись.Организация		= Организация;
			ИтоговаяЗапись.Значение			= Выборка.ЗначениеИтогаПоОрганизациям;
			
		КонецЕсли;
		ИтоговаяЗапись.Записать();
	КонецЦикла;
	
КонецПроцедуры //ЗаписатьИтоговыеЗаписи

Процедура ПриЗаписиПериодическихПоказателей(Отбор, Отказ, Замещение) Экспорт
	
	Показатель		= Отбор.Показатель.Значение;
	Если ЗначениеЗаполнено(Показатель) Тогда
		Если Показатель.ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.СуммаПоказателя Тогда
			Организация = Отбор.Организация.Значение;
			Период	= Отбор.Период.Значение;
			
			ЗаписатьИтоговыеЗаписиПериодическихПоказателей(Показатель, Организация, Период);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отбор, Отказ, Замещение) Экспорт
	
	Показатель		= Отбор.Показатель.Значение;
	Если ЗначениеЗаполнено(Показатель) Тогда
		Если Показатель.ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.СуммаПоказателя Тогда
			Организация = Отбор.Организация.Значение;
			ПериодДействия	= Отбор.ПериодДействия.Значение;
			
			ЗаписатьИтоговыеЗаписи(Показатель, Организация, ПериодДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ СПИСКА

// Процедура - обработчик события "ПередОткрытиемФормыСписка" формы.
//
Процедура ПередОткрытиемФормыСписка(Отказ, СтандартнаяОбработка, мРежимВводаПоказателей) Экспорт
	
	мРежимВводаПоказателей = ВосстановитьЗначение("РежимВводаПоказателей");

КонецПроцедуры // ПередОткрытиемФормыСписка

// Процедура - обработчик события "ПриОткрытииФормыСписка" формы.
//
Процедура ПриОткрытииФормыСписка(мРежимВводаПоказателей, ЭлементыФормы, ДополнительныеДействия) Экспорт
	
	//добавим подменю управления режимом ввода показателей
	ИспользоватьУправленческийУчетЗарплаты = глЗначениеПеременной("глИспользоватьУправленческийУчетЗарплаты");
	Если ИспользоватьУправленческийУчетЗарплаты Тогда
		
		КнопкиКоманднойПанели = ЭлементыФормы.ДействияФормы.Кнопки;
		МестоВставки = КнопкиКоманднойПанели.Индекс(КнопкиКоманднойПанели.Найти("ДействиеСправка"));
		
		ПодменюПорядокФормированияСМ = КнопкиКоманднойПанели.Вставить(МестоВставки, "ПорядокФормированияСМ", ТипКнопкиКоманднойПанели.Подменю, "Режим формирования схем мотивации");
		ПодменюПорядокФормированияСМ.Кнопки.Добавить("ПоОрганизациям", 	ТипКнопкиКоманднойПанели.Действие, "По структуре юридических лиц", 	ДополнительныеДействия);
		ПодменюПорядокФормированияСМ.Кнопки.Добавить("ПоЦФО", 			ТипКнопкиКоманднойПанели.Действие, "По центрам ответственности", 	ДополнительныеДействия);
		
		КнопкиКоманднойПанели.Вставить(МестоВставки + 1, "Разделитель15", ТипКнопкиКоманднойПанели.Разделитель); 
		
		Если НЕ ЗначениеЗаполнено(мРежимВводаПоказателей) Тогда
			мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
		КонецЕсли;
		
		ПодменюПорядокФормированияСМ.Кнопки.ПоЦФО.Пометка = НЕ мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
		ПодменюПорядокФормированияСМ.Кнопки.ПоОрганизациям.Пометка = мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;		
		
	Иначе
		мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
	КонецЕсли;
	
	ЗначенияПоказателейСхемМотивацииДополнительный.ВидОрганизационнойСтруктурыПредприятияПриИзменении(мРежимВводаПоказателей, ЭлементыФормы);
	
КонецПроцедуры // ПриОткрытииФормыСписка

// Процедура - обработчик события "ПриЗакрытии" формы.
//
Процедура ПриЗакрытииФормыСписка(мРежимВводаПоказателей) Экспорт
	
	СохранитьЗначение("РежимВводаПоказателей",мРежимВводаПоказателей);
	
КонецПроцедуры // ПриЗакрытии

Процедура ВыполнитьДополнительныеДействия(Кнопка,мРежимВводаПоказателей, мОрганизация, ЭтаФорма, Отбор) Экспорт
	
	Если Кнопка.Имя = "ПоОрганизациям" Тогда
		ЗначенияПоказателейСхемМотивацииДополнительный.ДействияФормыПоОрганизациям(мРежимВводаПоказателей, мОрганизация, ЭтаФорма, Отбор);
	ИначеЕсли Кнопка.Имя = "ПоЦФО" Тогда
		ЗначенияПоказателейСхемМотивацииДополнительный.ДействияФормыПоЦФО(мРежимВводаПоказателей, мОрганизация, ЭтаФорма, Отбор);
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполняетсяДополнительноеУсловие() Экспорт
	
	Возврат Истина
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ ЗАПИСИ

Процедура ПриОткрытииФормыЗаписи(мРежимВводаПоказателей, Организация) Экспорт

	Если мРежимВводаПоказателей = Неопределено Тогда
		Если ЗначениеЗаполнено(Организация) Тогда
			мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
		Иначе
			мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоЦентрамОтветственности;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьТипыРеквизитов(Организация, Подразделение) Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		ОписаниеТипа = Новый ОписаниеТипов(?(ЗначениеЗаполнено(Организация),"СправочникСсылка.ПодразделенияОрганизаций","СправочникСсылка.Подразделения"));
		Подразделение = ОписаниеТипа.ПривестиЗначение(Подразделение);
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеЭлементамиФормыДополнительно(ЭтаФорма) Экспорт
	
	РежимВводаПоЦФО = ЗначенияПоказателейСхемМотивацииДополнительный.РежимВводаПоЦФО(ЭтаФорма.мРежимВводаПоказателей);
	
	Если РежимВводаПоЦФО Тогда
		ЭтаФорма.ЭлементыФормы.ПанельОрганизация.Свертка	= РежимСверткиЭлементаУправления.Верх;
	Иначе
		ЭтаФорма.ЭлементыФормы.ПанельОрганизация.Свертка	= РежимСверткиЭлементаУправления.Нет;
	КонецЕсли;
	
КонецПроцедуры

Функция РежимВводаПоОрганизациям(мРежимВводаПоказателей) Экспорт
	
	Возврат НЕ ЗначенияПоказателейСхемМотивацииДополнительный.РежимВводаПоЦФО(мРежимВводаПоказателей);
	
КонецФункции

 #КонецЕсли
