
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = "Доверенность" + ?(ЗначениеЗаполнено(НомерДовер), " №" + НомерДовер, "") + " от " + Формат(ДатаВыдачи, "ДФ='dd.MM.yyyy ""г.""'");
	
	Заголовок = "Запись доверенности налогоплательщика (" + Владелец + ") " + Наименование + ", код " + Код;
	
	// Проверка заполнения обязательных реквизитов
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не выбрана организация налогоплательщика", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаВыдачи) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не указана дата выдачи доверенности", Отказ, Заголовок);
	КонецЕсли;
	
	Если ПолномочияПредставителя.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнены сведения о полномочиях представителя", Отказ, Заголовок);
	КонецЕсли;
	
	//АБС+ Тупиков 01.06.2012 10987
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));
	
	Если мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительБухгалтерскойГруппы) = Неопределено Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Запрещено добавлять доверенности налогоплательщика", Отказ);
	КонецЕсли;
	
	//\\АБС- Тупиков
	
КонецПроцедуры