
Процедура ЭкспрессТЭОПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.ВидТЭО = Перечисления.абс_ВидТЭО.ЭкспрессТЭО или ТЭО.Актуализация  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ДействияПослеПодготовкиОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусТЭО = ТЭО.Статус;
	
	Если ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРТЭО Тогда
		Результат = ТочкаВыбораВарианта.Варианты.РазработкаИТРТЭО;
	ИначеЕсли  ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.ЗапросИнформации;
	ИначеЕсли ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;
	КонецЕсли;
КонецПроцедуры

Процедура СогласованоИТРПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ЭтоЭкспрессТЭО2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.ВидТЭО = Перечисления.абс_ВидТЭО.ЭкспрессТЭО или ТЭО.Актуализация Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ДействияПослеПодготовкиЭкспрессОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ТекСтатусТЭО = ТЭО.Статус;
	
	Если ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДЭФ;
	ИначеЕсли  ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.ЗапросИнформации;
	ИначеЕсли ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;
	КонецЕсли;
	
КонецПроцедуры

Процедура СогласованРазработкаИТРДППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ПодготовкаЗаявкиПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ДействиеПриОтказеПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)

КонецПроцедуры

Процедура РазработкаИТРТЭОПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.РазработкаИТРТЭО,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура СогласованиеИКПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СогласованиеИК,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ЗапросИнформацииПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ЗапросОработанПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура РазработкаИТРДППередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.РазработкаИТРДП,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура СогласованИКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		Результат	= Истина;
	Иначе
		Результат	= Ложь;
	КонецЕсли;	
КонецПроцедуры

Процедура СогласованоДЭФПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура СогласованиеДЭФПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СогласованиеДЭИ,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура СформироватьЗадачуНаСогласование(Роль,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи)
	
	ФормируемыеЗадачи.Очистить();
	
	Если ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ПодготовкаТЭО или ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросИнформации или ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросОработан Тогда
		НоваяЗадача 					= Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
		НоваяЗадача.Дата 				= ТекущаяДата();
		НоваяЗадача.Наименование 		= Строка(ЭтотОбъект.Ссылка.ТЭО) + " " + ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
		
		Если ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросИнформации Тогда
			
			МассивПользователей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(ТЭО.СотрудникДопСогласование);
			Если МассивПользователей.Количество() > 0 Тогда
				НоваяЗадача.Исполнитель = МассивПользователей[0];
			КонецЕсли;

		Иначе	
			НоваяЗадача.Исполнитель 		= ПользовательИнициаторБП;
		КонецЕсли;
		
		НоваяЗадача.Роль 			    = Роль;
		НоваяЗадача.Организация 		= абс_БизнесПроцессыУведомления.ПолучитьОрганизациюСотрудника(ПользовательИнициаторБП);
		НоваяЗадача.ОбъектЗадачи 		= ТЭО;
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИИсполнители.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Роль = &Роль
		|	И РолиИИсполнители.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Роль", Роль);
		Запрос.УстановитьПараметр("Организация", абс_БизнесПроцессыУведомления.ПолучитьОрганизациюСотрудника(ПользовательИнициаторБП));

		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
			НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
			НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
			НоваяЗадача.Дата 				= ТекущаяДата();
			НоваяЗадача.Наименование 		= Строка(ЭтотОбъект.Ссылка.ТЭО) + " " + ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
			НоваяЗадача.Роль 			    = Роль;
			НоваяЗадача.Организация 		= абс_БизнесПроцессыУведомления.ПолучитьОрганизациюСотрудника(ПользовательИнициаторБП);
			НоваяЗадача.ОбъектЗадачи 		= ТЭО.Ссылка;
			
			НоваяЗадача.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
			ФормируемыеЗадачи.Добавить(НоваяЗадача);
		КонецЦикла;
	КонецЕсли;
	
	// Добавим задачи для суперпользователей
	//абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ЗаявкаНаДобавлениеПрав.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	//абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ЗаявкаНаДобавлениеПрав.Статус);	
 КонецПроцедуры
 
 Процедура Условие4ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС <> Перечисления.абс_СтатусыОС.Отмена  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
 КонецПроцедуры

 Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Результат = абс_БизнесПроцессыУведомления.ПолучитьСтатусОрганизацииСотрудника(ОсновноеСредство);
 КонецПроцедуры
 
Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	ПрочиеОС = Ложь;
	МассивГруппОСНеПрочие =  Новый Массив;
	МассивГруппОСНеПрочие.Добавить(Перечисления.ГруппыОС.ТранспортныеСредства);
	МассивГруппОСНеПрочие.Добавить(Перечисления.ГруппыОС.Здания);
	МассивГруппОСНеПрочие.Добавить(Перечисления.ГруппыОС.ЗемельныеУчастки);
	
	Если МассивГруппОСНеПрочие.Найти(ОсновноеСредство.ГруппаОС) = Неопределено Тогда
		ПрочиеОС = Истина;
	КонецЕсли;

	Результат = ПрочиеОС;
	
КонецПроцедуры

Процедура Условие3ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура Условие5ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отмена  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура Условие7ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура Условие6ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура ВыборВарианта1ОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ Тогда
		Результат	  = ТочкаВыбораВарианта.Варианты.Отказ;
	ИначеЕсли ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Корректировка Тогда
		Результат	  = ТочкаВыбораВарианта.Варианты.Корректировка;
	ИначеЕсли ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Закрыт Тогда	
		Результат     = ТочкаВыбораВарианта.Варианты.Закрыт;
	КонецЕсли;
	
КонецПроцедуры

Процедура Условие8ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СогласованиеНаУровнеДЗОПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.ОтветственныйОСДЗО,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура Действие1ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.ОтветственныйОСКТТК,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ПолготовкаПрошлаУспешноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура ДействияПослеСогласованияПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.Бухгалтерия,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура КорректировкаОСПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.ИнициаторОС,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры


