
Процедура ПередЗаписью(Отказ, Замещение)
	
	//Сторчевой А.Н. НФС 2018 {
	//Свернуть по измерениям
	Если ЭтотОбъект.Количество() Тогда 
		ТЗДвижения = ЭтотОбъект.Выгрузить();
		ИменаИзмерений = "Период,Регистратор,Активность,";
		ИменаРесурсов = "";
		Измерения = Метаданные().Измерения;
		Ресурсы = Метаданные().Ресурсы;
		Для каждого Измерение ИЗ Измерения Цикл 
			ИменаИзмерений = ИменаИзмерений + Измерение.Имя + ",";
		КонецЦикла;
		Для каждого Ресурс ИЗ Ресурсы Цикл 
			ИменаРесурсов = ИменаРесурсов + Ресурс.Имя + ",";
		КонецЦикла;
		ТЗДвижения.Свернуть(ИменаИзмерений, ИменаРесурсов);
		ЭтотОбъект.Загрузить(ТЗДвижения);
	КонецЕсли;
	//} Сторчевой А.Н. НФС 2018

КонецПроцедуры
