
&НаСервереБезКонтекста
Процедура ПрочитатьДанныеФайлаНаСервере(АдресХранилища, ИмяФайла, РасширениеФайла)
	
	Справочники.ttk_КонтрагентыВГО.ПрочитатьДанныеФайла(АдресХранилища, ИмяФайла, РасширениеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));		
	Если мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеБухгалтером) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено Тогда
		Элементы.ФормаИмпортИзФайла.Доступность = Истина;
	Иначе 
		Элементы.ФормаИмпортИзФайла.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортИзФайла(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Обзор...";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	//ДиалогВыбора.Фильтр = "Файлы Microsoft Excel (*.xls*)|*.xls*";
	ДиалогВыбора.Фильтр = "Файлы с данными (*.dat)|*.dat";
	Если ДиалогВыбора.Выбрать() Тогда
		МассивФайлов = ДиалогВыбора.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			Состояние("Обработка данных из файла: " + ИмяФайла);
			ТекущийФайл = Новый Файл(ИмяФайла);
			ИмяФайлаБезРасширения = ТекущийФайл.ИмяБезРасширения;
			РасширениеФайла = ТекущийФайл.Расширение;
			АдресХранилища = ПоместитьВоВременноеХранилище(ИмяФайла);
	        ПоместитьФайл(АдресХранилища, ИмяФайла, ИмяФайла, Ложь);
			ПрочитатьДанныеФайлаНаСервере(АдресХранилища, ИмяФайлаБезРасширения, РасширениеФайла);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
