
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СчетНаОплату") Тогда
		
		ОтборСтатус = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСтатус.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборСтатус.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СчетНаОплату");
		ОтборСтатус.ПравоеЗначение 	= Параметры.СчетНаОплату;
		ОтборСтатус.Использование	= Истина;
		
		ОтборСтатус.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры
