
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установим отображение только не выполненых задач
	ОтборВыполнен = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	ОтборВыполнен.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Выполнена");
	ОтборВыполнен.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ОтборВыполнен.ПравоеЗначение 	= ЛОЖЬ; 
	ОтборВыполнен.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ОтборВыполнен.Использование 	= Истина;
	//ОтборВыполнен.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	// Установим отбор задач по исполнителю
	ОтборИсполнитель = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборИсполнитель.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Исполнитель");
	ОтборИсполнитель.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборИсполнитель.ПравоеЗначение = глЗначениеПеременной("глТекущийПользователь");
	ОтборИсполнитель.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ОтборИсполнитель.Использование  = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТолькоПросмотр = Истина;
КонецПроцедуры
