
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Куратор = глЗначениеПеременной("глТекущийПользователь").абс_Сотрудник;		
		
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыСписка()
	
	ПараметрКуратор 				= Список.Параметры.Элементы[0];
	
	ПараметрКуратор.Значение 		= Куратор;
	ПараметрКуратор.Использование 	= Истина;		
	
КонецПроцедуры

&НаКлиенте
Процедура КураторПриИзменении(Элемент)
	
	ОбновитьПараметрыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПараметрыСписка();
	
КонецПроцедуры

	

