
Процедура ПередЗаписью(Отказ)
	
	//АБС ВСТАВКА Филиализация 15.10.2014 Акчурин
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//\\АБС ВСТАВКА Филиализация КОНЕЦ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОбъектыСтроительства.Ссылка
	               |ИЗ
	               |	Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	               |ГДЕ
	               |	ОбъектыСтроительства.абс_КодТитула = &абс_КодТитула
	               |	И ОбъектыСтроительства.абс_КодТитула <> """"
	               |	И ОбъектыСтроительства.Ссылка <> &Ссылка";
				   
	Запрос.УстановитьПараметр("абс_КодТитула", абс_КодТитула);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	                                                              
	Если Не Запрос.Выполнить().Пустой() Тогда
		 ttk_ОбщегоНазначения.СообщитьОбОшибке("Значение поля ""Код титула"" неуникально!", Отказ);
	КонецЕсли;
	
КонецПроцедуры
