
&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов(Список, Ссылка) Экспорт	
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));
	
	Список.Очистить();
	Список.Добавить(Перечисления.абсСтатусыКонтрагентов.Подготовка);
	Если мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеБухгалтером) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено Тогда
		Список.Добавить(Перечисления.абсСтатусыКонтрагентов.Активный);
		Список.Добавить(Перечисления.абсСтатусыКонтрагентов.Архив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТолькоПросмотрВсемЭлементам(мТолькоПросмотр = Истина)

	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Элемент.ТолькоПросмотр = мТолькоПросмотр;
		Исключение
			Элемент.Доступность = Не мТолькоПросмотр;						
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовПоРолямПользователя()
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
	
	Если мСтатус = ПредопределенноеЗначение("Перечисление.абсСтатусыКонтрагентов.Подготовка") Тогда
		УстановитьТолькоПросмотрВсемЭлементам(Ложь);
	Иначе
		Если мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеБухгалтером) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено Тогда
			УстановитьТолькоПросмотрВсемЭлементам(Ложь);
		Иначе 
			УстановитьТолькоПросмотрВсемЭлементам(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтатусыДокументаНаСервере()

	ЗаполнитьСписокДоступныхСтатусов(Элементы.Статус.СписокВыбора, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыНаСервере()
	
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("Контрагент", Объект.Ссылка);
	
КонецПроцедуры

//-----

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = (Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая());
	ТолькоПросмотрЭлемента = Ложь;
	УстановитьПараметрыНаСервере();	
	Объект.Ответственный = ?(Не ЗначениеЗаполнено(Объект.Ответственный), глЗначениеПеременной("глТекущийПользователь"), Объект.Ответственный);
	Объект.Статус = ?(Не ЗначениеЗаполнено(Объект.Статус), Перечисления.абсСтатусыКонтрагентов.Подготовка, Объект.Статус);
	
	Если Не (РольДоступна("АБС_Бухгалтер") Или РольДоступна("ПолныеПрава")) Тогда
		ТолькоПросмотрЭлемента = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтатусыДокументаНаСервере();
	мСтатус = Объект.Статус;
	УстановитьТолькоПросмотрВсемЭлементам(ТолькоПросмотрЭлемента);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если мСтатус <> Объект.Статус Тогда
		ПричинаИзмененияСтатуса = "";
		Если ВвестиСтроку(ПричинаИзмененияСтатуса, "Причина изменения статуса.", , Истина) Тогда
			Объект.ПричинаИзмененияСтатуса = ПричинаИзмененияСтатуса;
			Объект.Статус = мСтатус;
		Иначе 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мСтатус = Объект.Статус;
	ОбновитьВидимостьЭлементовПоРолямПользователя();
	УстановитьПараметрыНаСервере();
	Элементы.ИсторияСогласования.Обновить();
	ЗаполнитьСтатусыДокументаНаСервере();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
