//СТАНДАРТНЫЕ ПРОЦЕДУРЫ ЗАКРЫТИЯ
Процедура ЗакрытиеСчета26(СтруктураДвижений,Счет,Организация,Период,ТаблицаРезультатаЗапроса,ТаблицаРезультатаЗапросаБаза)
Для каждого СтрокаРезЗапроса из ТаблицаРезультатаЗапроса.Строки Цикл
	Сумма = СтрокаРезЗапроса.Сумма;
	МассивСумм = ttk_ОбщегоНазначения.РаспределитьПропорционально(Сумма,ТаблицаРезультатаЗапросаБаза.Строки.ВыгрузитьКолонку("СуммаОборотКт"));
	сч = 0;
	Если МассивСумм = Неопределено Тогда
		
	иначе
	
	Для каждого РаспределеннаяСумма из МассивСумм Цикл
		Движение = СтруктураДвижений.Хозрасчетный.Добавить();
		Движение.Период = СтруктураДвижений.Период;
		Движение.Организация = СтруктураДвижений.Организация;
		Движение.СчетКт = Счет;
		Движение.Счетдт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.08");
		Движение.ВидСубконтоДт1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
		Движение.СубконтоДт1 = ТаблицаРезультатаЗапросаБаза.Строки[Сч].Субконто1;
		Движение.Сумма = РаспределеннаяСумма;		
		Сч = Сч+1;
	КонецЦикла;
	конецЕсли;
КонецЦикла;

	
КонецПроцедуры


//\\СТАНДАРНЫЕ


Функция ПостроитьТаблицуРезультатаЗапроса(ТекстЗ,ПараметрыЗ,Счет,СтруктураДвижений) Экспорт
	Запрос = Новый Запрос (ТекстЗ);
	Для каждого строкаПараметры из ПараметрыЗ Цикл
		Запрос.УстановитьПараметр(СтрокаПараметры.НазваниеПараметра,СтрокаПараметры.Параметр);
	КонецЦикла;
	Запрос.УстановитьПараметр("Счет",Счет);
	Запрос.УстановитьПараметр("Организация",СтруктураДвижений.Организация);
	Запрос.УстановитьПараметр("Период",СтруктураДвижений.Период);
	
	//++ Добавлена возможность передавать переменные параметры из документа
	Если СтруктураДвижений.Свойство("ПараметрыДокументаДляЗапроса") Тогда
		Для каждого строкаПараметры из СтруктураДвижений.ПараметрыДокументаДляЗапроса Цикл
			Запрос.УстановитьПараметр(СтрокаПараметры.НазваниеПараметра, СтрокаПараметры.Параметр);
		КонецЦикла;	
	КонецЕсли;
	//--
	
	возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецФункции


Процедура СформироватьПроводки(Правило, СтруктураДвижений) Экспорт
	ТаблицаРезультатаЗапроса = ПостроитьТаблицуРезультатаЗапроса(Правило.ТекстЗапроса,Правило.ПараметрыЗапроса,Правило.Счет,СтруктураДвижений);
	ТаблицаРезультатаЗапросаБаза = ПостроитьТаблицуРезультатаЗапроса(Правило.ТекстЗапросаБаза,Правило.ПараметрыЗапросаБаза,Правило.Счет,СтруктураДвижений);
	Счет = Правило.Счет;
	Организация = СтруктураДвижений.Организация;
	Период =  СтруктураДвижений.Период;
	Выполнить(Правило.МодульПолученияТаблицыДвижений);
	
КонецПроцедуры
