
Процедура ЗаполнитьСписокДоступныхСтатусов(Список, Ссылка) Экспорт	
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));
	
	Список.Очистить();
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка.Статус) Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);
		Возврат;
    Иначе
		Список.Добавить(Ссылка.Статус);
	КонецЕсли;
	
	Если Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК);
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отмена);
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда
		Если Не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭФ) = Неопределено Или
			 Не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Согласован);
			Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отказ);
		КонецЕсли;
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отмена);
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);		
	КонецЕсли;	
	
	Возврат;
	
КонецПроцедуры

Функция ПолучитьТекущиеНастройкиПланаПлатежей(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних.Раздел,
	               |	ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних.СтатьяБюджета,
	               |	ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних.ЦФО,
	               |	ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних.ЦФУ,
	               |	ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних.Контрагент,
	               |	ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних.Активный,
	               |	ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних.Исключение
	               |ИЗ
	               |	РегистрСведений.ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежей.СрезПоследних(&Дата, ) КАК ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежейСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции