
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	               	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
   
Процедура ОбработкаПроведения(Отказ, Режим)	
	
	Если Не ЗначениеЗаполнено(РеквизитОтбора) Тогда
		Сообщить("Не заполнен реквизит: ""РеквизитОтбора""!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НовоеЗначение) Тогда
		Сообщить("Не заполнен реквизит: ""НовоеЗначение""!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ Отказ Тогда
		ДвижениеПоРегистрам();
	КонецЕсли;	

КонецПроцедуры

Процедура ДвижениеПоРегистрам()
	
	Для каждого ИмяДвижения из Движения Цикл
		
		Имя = ИмяДвижения.Метаданные().Имя;
		//АБС ВСТАВКА №48332 НАЧАЛО «6 октября 2014 г.», Пополитов   
		Если Имя = "абс_НезавершенноеПроизводствоБУ" или Имя = "абс_НезавершенноеПроизводствоНУ" Тогда
			Продолжить;
		КонецЕсли;	
		//\\АБС ВСТАВКА №48332 КОНЕЦ
		
		Движения[Имя].Записывать = Истина;                         			 
		 
		Для каждого Строка Из ЭтотОбъект[Имя] Цикл
			
			Если Имя = "Хозрасчетный" или Имя = "Налоговый" Тогда
				
				Движение = Движения[Имя].Добавить();
				Движение.Период      = Дата;
				Движение.Организация = Организация;    			
				ЗаполнитьЗначенияСвойств(Движение,Строка);
				Для Н = 1 по Строка.СчетДт.ВидыСубконто.Количество() Цикл
					БухгалтерскийУчет.УстановитьСубконто(Строка.СчетДт,Движение.СубконтоДт,Н, Строка["СубконтоДт"+Н]);
				КонецЦикла;					
				Для Н = 1 по Строка.СчетКт.ВидыСубконто.Количество() Цикл
					БухгалтерскийУчет.УстановитьСубконто(Строка.СчетКт,Движение.СубконтоКт,Н, Строка["СубконтоКт"+Н]);
				КонецЦикла;	
				
				Продолжить;
				
			КонецЕсли;			
			
			//Приход	
			Движение = Движения[Имя].ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Организация = Организация;    			
			ЗаполнитьЗначенияСвойств(Движение,Строка);
			Движение[РеквизитОтбора] = НовоеЗначение;			
			Попытка
				Движение.СписаниеПартий = Истина;	
				Движение.КодОперации = Перечисления.КодыОперацийПартииТоваров.ПередачаВПереработку;
			Исключение   			
			КонецПопытки;	
			
			//Расход
			Движение = Движения[Имя].ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			ЗаполнитьЗначенияСвойств(Движение,Строка);
			Попытка
				Движение.СписаниеПартий = Истина;	
				Движение.КодОперации = Перечисления.КодыОперацийПартииТоваров.СписаниеПартийПереданныхВПроизводство;
			Исключение   			
			КонецПопытки;	
			
		КонецЦикла; 
		
	КонецЦикла; 
	       	
КонецПроцедуры	


		
