
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	
	ОтчетПоДокументуРПР = Отчеты.абс_ОтчетПоДокументуРПР.Создать();
	
	ОтчетПоДокументуРПР.ДокументРПР = ПараметрКоманды;
	
	ОтчетПоДокументуРПР.УстановитьНачальныеНастройки(Ложь);
	
	ФормаОтчета = ОтчетПоДокументуРПР.ПолучитьФорму();
	
	ФормаОтчета.ОбновитьОтчет();
	
	ФормаОтчета.Открыть();
		
	// ПараметрыФормы = Новый Структура("", );
	// ОткрытьФорму("Документ.абс_РезервыПроизведенныхРасходов.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
