Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

//АБС Коломиец+
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если мТаблицаДвижений <> Неопределено  
	   И мТаблицаДвижений.Количество() > 0 Тогда
	   
		ДатаКонтроляПриход = Константы.абс_ДатаКонтроляСчетовНоменклатурыПриход.Получить();
		ДатаКонтроляРасход = Константы.абс_ДатаКонтроляСчетовНоменклатурыРасход.Получить();
		
		Если (ДатаКонтроляПриход <> '00010101' И мПериод >= ДатаКонтроляПриход) 
			Или (ДатаКонтроляРасход <> '00010101' И мПериод >= ДатаКонтроляРасход) Тогда
			
			РезПроверки = ПроверитьЗаполнениеСчетУчетаНоменклатуры(ДатаКонтроляПриход, ДатаКонтроляРасход);		
			
			Если РезПроверки Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//АБС ВСТАВКА 47248  28.10.2014 12:06:22  Манжела
	ДатаОчисткиДокументаОснованияПоПартиямБУНУ = Константы.абс_ДатаОчисткиДокументаОснованияПоПартиямБУНУ.Получить();
	МассивСчетаПоСредней      = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыПоСредней();
	
	Если ЭтотОбъект.Количество()>0 И ДатаОчисткиДокументаОснованияПоПартиямБУНУ <> '00010101' Тогда
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			Если ЗаписьНабора.Период>ДатаОчисткиДокументаОснованияПоПартиямБУНУ И МассивСчетаПоСредней.Найти(ЗаписьНабора.СчетУчета.Код)<>Неопределено И ЗаписьНабора.Организация=ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК Тогда 
				ЗаписьНабора.ДокументОприходования = Неопределено;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли; 
	//АБС ВСТАВКА 47248 КОНЕЦ

	
КонецПроцедуры

Функция ПроверитьЗаполнениеСчетУчетаНоменклатуры(ДатаКонтроляПриход, ДатаКонтроляРасход)
	
	Отказ = Ложь;
	
	Если ПараметрыСеанса.абс_ПользовательДЗО Тогда //абсо
		Возврат Отказ;
	КонецЕсли;
	
	МассивСчетаПартионныйУчет = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыПоПартиям();
	МассивСчетаПоСредней      = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыПоСредней();
	
	Если (ДатаКонтроляПриход <> '00010101' И мПериод >= ДатаКонтроляПриход) Тогда 
		
		Для Каждого Движение Из мТаблицаДвижений Цикл
			Если  Движение.ВидДвижения = ВидДвиженияНакопления.Приход 
				И ЗначениеЗаполнено(Движение.Номенклатура) Тогда
				СтруктураСчетовУчета = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыИзРегистраСведений(Движение.Организация,Движение.Номенклатура,Движение.Склад);
				Если МассивСчетаПартионныйУчет.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоПартиям Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (партионный учет). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по партиям", СтатусСообщения.Внимание);
					Отказ = Истина;
				ИначеЕсли МассивСчетаПоСредней.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоСредней Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (учет по средней себестоимости). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по средней", СтатусСообщения.Внимание);
					Отказ = Истина;			
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если (ДатаКонтроляРасход <> '00010101' И мПериод >= ДатаКонтроляРасход) Тогда 
		
		Для Каждого Движение Из мТаблицаДвижений Цикл
			Если  Движение.ВидДвижения = ВидДвиженияНакопления.Расход 
				И ЗначениеЗаполнено(Движение.Номенклатура) Тогда
				СтруктураСчетовУчета = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыИзРегистраСведений(Движение.Организация,Движение.Номенклатура,Движение.Склад);
				Если МассивСчетаПартионныйУчет.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоПартиям Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (партионный учет). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по партиям", СтатусСообщения.Внимание);
					Отказ = Истина;
				ИначеЕсли МассивСчетаПоСредней.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоСредней Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (учет по средней себестоимости). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по средней", СтатусСообщения.Внимание);
					Отказ = Истина;			
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции
//АБС Коломиец-