
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("абс_ОбщийОтдел") Тогда
		
		ОтборОтветственный = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборОтветственный.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборОтветственный.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ответственный");
		ОтборОтветственный.ПравоеЗначение 	= глЗначениеПеременной("глТекущийПользователь");
		ОтборОтветственный.Использование	= Истина;
		
		ОтборОтветственный.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
		
КонецПроцедуры
	