
&НаКлиенте
Процедура КомандаЗагрузитьФайл(Команда)
			
	Состояние("Отправка файла на сервер...");
	
	АдресХранилища = "";
		
	ПутьКФайлу = "";
	
	Если НЕ ПоместитьФайл(АдресХранилища, "", ПутьКФайлу, Истина, УникальныйИдентификатор) Тогда 
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер.");
		Возврат;
	КонецЕсли;
	
	ИмяФайла = "";
	ИмяКаталога = "";
	
	РаботаСФайлами.ПолучитьКаталогИИмяФайла(ПутьКФайлу, ИмяКаталога, ИмяФайла);
	
	Объект.Наименование = ИмяФайла;		
	
	Если ПередатьФайлНаСервер(АдресХранилища) Тогда
		 
		Закрыть();
	КонецЕсли;                            	
	
	ИмяФайла = "";
	
КонецПроцедуры

&НаСервере
Функция ПередатьФайлНаСервер(ВремФайл)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ВремФайл);
	
	Записать();
	
	СтруктураВозврата = абс_РаботаСФайлами.ЗаписатьФайлВоВнешнееХранилище(Объект.Объект, ДвоичныеДанные, Объект.Наименование, Объект.Ссылка);
	
	Возврат СтруктураВозврата.Успешно;
			
КонецФункции

&НаСервере
Функция ПолучитьФайлССервера()
	
	ДвоичныеДанные = абс_РаботаСФайлами.ПолучитьФайлИзВнешнегоХранилища(Объект.Ссылка);
	
	Если ДвоичныеДанные = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка 
		АдресХранилища = "";	
		АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);

	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при получении файла из хранилища.");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат АдресХранилища;
			
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Недоступна работа с файлами.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ttk_ОбщегоНазначения.СообщитьОбОшибке("Для загрузки/сохранения файлов воспользуйтесь соответствующими кнопками в списке файлов.", Отказ);
	
	ТолькоПросмотр = ЗначениеЗаполнено(Объект.Ссылка);
	
	Элементы.ФормаКнопкаЗагрузитьФайл.Доступность = НЕ ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьРасширение(Команда)
	
	УстановитьРасширениеРаботыСФайлами();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьФайл(Команда)
	
	Состояние("Загрузка файла...");
	
	АдресХран = ПолучитьФайлССервера();
	
	Если АдресХран = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(АдресХран, Объект.Наименование, Истина);
		
КонецПроцедуры
