
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 51
		|	ПодразделенияОрганизаций.Наименование,
		|	ПодразделенияОрганизаций.Ссылка,
		|	ПодразделенияОрганизаций.абс_КодИСУЗК КАК Код
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Наименование ПОДОБНО &Наименование
		|	И ПодразделенияОрганизаций.абс_Используется";
		
		Запрос.УстановитьПараметр("Наименование", Параметры.СтрокаПоиска+ "%");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Количество = Выборка.Количество();
		
		Если Количество < 51 Тогда
			
			Значение = Новый СписокЗначений;
			Пока Выборка.Следующий() Цикл
				Значение.Добавить(Выборка.Ссылка, Выборка.Наименование + " (" + СокрЛП(Выборка.Код) + ")");
			КонецЦикла;
			
			СтандартнаяОбработка = Ложь;
			ДанныеВыбора = Значение;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
