
Функция ПолучитьПредыдущееНаправление(Направление) Экспорт
	
	Если Не ЗначениеЗаполнено(Направление) Или Направление=ПередачаИзДЗОВКТТК Тогда
		Возврат ПустаяСсылка();
	ИначеЕсли Направление=ПриемИзДЗОВКТТК Тогда
		Возврат ПередачаИзДЗОВКТТК;
	ИначеЕсли Направление=ПередачаИзКТТКВФилиал Тогда
		Возврат ПриемИзДЗОВКТТК;
	ИначеЕсли Направление=ПриемИзКТТКВФилиал Тогда
		Возврат ПередачаИзКТТКВФилиал;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСледующиеНаправления(Направление) Экспорт
	
	Направления = Новый Массив;
	
	Если ЗначениеЗаполнено(Направление) Тогда
		Если Направление=ПередачаИзДЗОВКТТК Тогда
			Направления.Добавить(ПриемИзДЗОВКТТК);
			Направления.Добавить(ПередачаИзКТТКВФилиал);
			Направления.Добавить(ПриемИзКТТКВФилиал);
		ИначеЕсли Направление=ПриемИзДЗОВКТТК Тогда
			Направления.Добавить(ПередачаИзКТТКВФилиал);
			Направления.Добавить(ПриемИзКТТКВФилиал);
		ИначеЕсли Направление=ПередачаИзКТТКВФилиал Тогда
			Направления.Добавить(ПриемИзКТТКВФилиал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Направления;
	
КонецФункции
