
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		Если ЗначениеЗаполнено(Объект.Родитель) Тогда
			Объект.ГоловнаяОрганизация = Объект.Родитель.ГоловнаяОрганизация;
		Иначе
			Объект.ГоловнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КонецЕсли;		
		//+++ Григорьев Д.В. - #7758734 (28.04.2017)
		мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
		Если Не (мРолиПользователя.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для добавления обособленных подразделений!", Отказ);
		КонецЕсли;
		//--- Григорьев Д.В. - #7758734 (28.04.2017)	
	КонецЕсли;	
	
	//+++ Григорьев Д.В. - #7758734 (28.04.2017)
	ОбновитьВидимость();
	//--- Григорьев Д.В. - #7758734 (28.04.2017)
	
КонецПроцедуры

//+++ Григорьев Д.В. - #7758734 (28.04.2017)
&НаКлиенте
Процедура УстановитьТолькоПросмотрВсемЭлементам(мТолькоПросмотр = Истина)

	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Элемент.ТолькоПросмотр = мТолькоПросмотр;
		Исключение
			Элемент.Доступность = Не мТолькоПросмотр;						
		КонецПопытки;
	КонецЦикла;
	
	ЭтаФорма.ТолькоПросмотр = мТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
	Если Не (мРолиПользователя.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено) Тогда
		УстановитьТолькоПросмотрВсемЭлементам();
	КонецЕсли;	
	
КонецПроцедуры	
//--- Григорьев Д.В. - #7758734 (28.04.2017)