
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	     	
	// АБС ВСТАВКА Фролов 20120829
	// Запрещаем пользователям корректировать остатки лимитов по бюджету
	Если ЭтотОбъект.Количество() > 0 И НЕ РольДоступна("ПолныеПрава") Тогда
		Если ТипЗнч(ЭтотОбъект[0].Регистратор) = Тип("ДокументСсылка.КорректировкаЗаписейРегистров") Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Запрещено корректировать регистр """ + ЭтотОбъект.Метаданные().Синоним + """", Отказ);
		КонецЕсли;
	КонецЕсли;
	// АБС ВСТАВКА Фролов 20120829 КОНЕЦ
	
	ТекРегистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ПлюсОдинГод = Ложь;
	Если ЭтотОбъект.Количество() > 0 и ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.абс_ЗакупочныйЗаказ") Тогда
		врДок = ЭтотОбъект.Отбор.Регистратор.Значение;
		ПлюсОдинГод = врДок.СледГодОплат или врДок.СледГодПоставок;
	КонецЕсли;

	// АБС ВСТАВКА Фролов 20121026
	//АБС ИЗМЕНЕНИЕ 36495  13.12.2013 18:29:55  Поставка
	Если глЗначениеПеременной("абс_КонтрольГодаВБюджетныхАналитиках") Тогда
	//АБС ИЗМЕНЕНИЕ 36495 КОНЕЦ 
		
		Если ЭтотОбъект.Количество() > 0 Тогда
						
			ТекПериод = НачалоГода(ЭтотОбъект[0].Период);			
			//***** Убрана проверка статьи оборотов. Гетц. 13.05.13
			СпЦФО = ЭтотОбъект.Выгрузить(, "ЦФО");
			СпЦФО.Свернуть("ЦФО", "");
			
			абс_Бюджетирование.ПроверитьЦФОПоГодуИспользования(СпЦФО.ВыгрузитьКолонку("ЦФО"), ТекПериод, ТекРегистратор, Отказ, ПлюсОдинГод);
			
		КонецЕсли;
		
	КонецЕсли;	
	// АБС ВСТАВКА Фролов 20121026 КОНЕЦ
	
КонецПроцедуры
