
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Если Параметры.Свойство("Нужники") Тогда  
		Список.Параметры.УстановитьЗначениеПараметра("Нужники", Параметры.Нужники);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Нужники", Новый Массив);
	КонецЕсли;
	Если Параметры.Свойство("ДатаУвольнения") Тогда  
		Список.Параметры.УстановитьЗначениеПараметра("Уволен", Параметры.ДатаУвольнения);
	Иначе 
		Список.Параметры.УстановитьЗначениеПараметра("Уволен", '00010101');
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтображение(Команда)
	Флаг = Не Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.УправлениеВидимостью.ПодчиненныеЭлементы.ОтборОтображение.Пометка;
	УстановитьВидимостьПоляОтбора(Флаг);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоляОтбора(Флаг)
	Элементы.ГруппаОтборы.Видимость = Флаг;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.УправлениеВидимостью.ПодчиненныеЭлементы.ОтборОтображение.Пометка = Флаг;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьПоляОтбора(Ложь);
КонецПроцедуры
