Перем РассогласованиеДанных;

// Процедура обновляет даные пользователя ИБ, если изменился профиль
//
Процедура ОбновитьДанныеПользователейИБ()
	
	Если ЭтоНовый() 
		ИЛИ ЭтоГруппа 
		ИЛИ ПрофильПолномочийПользователя.Пустая() 
		ИЛИ ПрофильПолномочийПользователя = Ссылка.ПрофильПолномочийПользователя Тогда
		
		Возврат;
	КонецЕсли; 
	
	// Обновим данные пользователя ИБ
	СтруктураДанных = Новый Структура;
	
	МассивРолей = ПрофильПолномочийПользователя.СоставРолей.ВыгрузитьКолонку("ИмяРоли");
	СтруктураДанных.Вставить("СоставРолей", МассивРолей);
	СтруктураДанных.Вставить("ОсновнойИнтерфейс", ПрофильПолномочийПользователя.ОсновнойИнтерфейс);
	
	УправлениеПользователями.ИзменитьДанныеПользователяИБ(Код, СтруктураДанных);
	
КонецПроцедуры // ОбновитьДанныеПользователейИБ

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	Наименование = "";
	//абс выгрузка остатков ДЗО Начало
	Попытка
		Если ЭтоГруппа = Ложь ТОгда
			абс_РасширенноеПравоПроведенияДокументов = Ложь;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	//абс выгрузка остатков ДЗО Конец
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ОбновитьДанныеПользователейИБ();
	
	
	// АБС ВСТАВКА Сохраним в справочнике доменное имя
	ПроверитьСинхронизациюДанныхПользователя();

	ПользовательИБ = ПолучитьПользователяИБ();
	
	Если НЕ ПользовательИБ = Неопределено Тогда

		АутентификацияОС            = ПользовательИБ.АутентификацияОС;
		ПользовательОС              = ПользовательИБ.ПользовательОС;
		
		ЭтотОбъект.абс_ИмяВДомене	= ПолучитьДоменноеИмя(ПользовательИБ.ПользовательОС);
	КонецЕсли;
	// АБС ВСТАВКА Сохраним в справочнике доменное имя КОНЕЦ
	
КонецПроцедуры

Процедура ПроверитьСинхронизациюДанныхПользователя()
	
	РассогласованиеДанных = 0;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторПользователяИБ) Тогда
		РассогласованиеДанных = 1;
	ИначеЕсли НЕ ПользователиПолныеПрава.ПользовательСуществует(ЭтотОбъект.ИдентификаторПользователяИБ) Тогда
		РассогласованиеДанных = 2;
	ИначеЕсли ПользователиПолныеПрава.РассинхронизацияИмениПользователя(ЭтотОбъект.Ссылка) Тогда
		РассогласованиеДанных = 3;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПользователяИБ(ЗначениеКопирования = Неопределено)
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЗначениеКопирования.ИдентификаторПользователяИБ);
	Иначе
		Если РассогласованиеДанных = 3 Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЭтотОбъект.ИдентификаторПользователяИБ);
		Иначе
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(ЭтотОбъект.Код));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПользовательИБ;
	
КонецФункции 

Функция ПолучитьДоменноеИмя(Знач ИмяПользователяОС)
	
	ИмяПользователяОС = СокрЛП(ИмяПользователяОС);
	
	ДлинаИмени = СтрДлина(ИмяПользователяОС);
	
	Для н = 0 по ДлинаИмени - 1 Цикл
		
		Если Сред(ИмяПользователяОС, ДлинаИмени - н, 1) = "\" Тогда
			Возврат Прав(ИмяПользователяОС, н);
		КонецЕсли;
	
	КонецЦикла;
	
КонецФункции


