
&НаСервере
Процедура ЗаполнитьГруппыПользователей()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Активна");
	ТЗ.Колонки.Добавить("ГруппаПользователя");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыПользователей.Ссылка КАК ГруппаПользователя
	|ИЗ
	|	Справочник.ГруппыПользователей КАК ГруппыПользователей
	|ГДЕ
	|	НЕ ГруппыПользователей.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строки = Параметры.СписокГруппДоступа.НайтиПоЗначению(ВыборкаДетальныеЗаписи.ГруппаПользователя);
		НоваяСтрока = ТЗ.Добавить();
		Если Строки <> Неопределено Тогда
			НоваяСтрока.Активна             = Истина;
		Иначе
			НоваяСтрока.Активна             = Ложь;
		КонецЕсли;
		НоваяСтрока.ГруппаПользователя  = ВыборкаДетальныеЗаписи.ГруппаПользователя;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТЗ,"ГруппыДоступаПользователя");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьГруппыПользователей();
	мТолькоПросмотр = Параметры.ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	Оповестить("ПодборГруппДоступа",ГруппыДоступаПользователя);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТолькоПросмотр = мТолькоПросмотр;
	Элементы.ГруппыДоступаПользователя.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.Кнопка1.Видимость = Не ТолькоПросмотр;
КонецПроцедуры
          