Перем мУдалятьДвижения;

Перем мИспользоватьТару Экспорт;
Перем мВалютаРегламентированногоУчета Экспорт;
Перем КодОперацииПартииТоваров;
Перем УчетнаяПолитикаРегл;
Перем мПараметрыСвязиСтрокТЧ Экспорт;
Перем мУказаниеПроектовВТабличнойЧастиДокументов Экспорт;
//ххх Брель Виктор Андреевич 27.04.2018 18:56:52, заявка <<<
Перем СтатусПоРегистру Экспорт;
// Брель Виктор Андреевич 27.04.2018 18:56:52 >>>

Перем мСтруктураПараметровВзаиморасчетов Экспорт;

Перем мУказаниеСкладовВТЧ Экспорт;

// Хранит структуру, содержащую параметры для определения договора, доступного в данном документе:
//    список допустимых видов договоров;
//    список допустимых способов ведения взаиморасчетов.
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

// АБС ВСТАВКА Начало
Перем мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа Экспорт;
// АБС ВСТАВКА Конец

//абс_Стрельцов+ добавлено: 24.09.2012
//при переносе ПУ
Перем мПроведениеПоМеханизмуПроектногоУчета Экспорт;
//
//абс_Стрельцов-
// АБС Новоселов+
Перем ОтменитьПроведение;
Перем ЭтоВэбСервис Экспорт;
// АБС Новоселов-

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
	// Функция осуществляет печать этикеток для позиций ТЧ
	//
	// Параметры
	//  Нет
	//
	Процедура ПечататьЭтикетки()
		
		УправлениеРозничнойТорговлей.НапечататьЭтикеткиИзДокумента(Ссылка);
		
	КонецПроцедуры // ПечататьЭтикетки()
	
	// Функция печатает ценники.
	//
	Функция ПечатьЦенников()
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК Печать,
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	0 КАК Цена,
		|	1 КАК Количество
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &Док
		|");
		
		Запрос.УстановитьПараметр("Док", Ссылка);
		
		ОбработкаПечатьЦенников = Обработки.ПечатьЦенников.Создать();
		ОбработкаПечатьЦенников.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаполнитьЦены", Истина);
		
		ФормаПечатьЦенников = ОбработкаПечатьЦенников.ПолучитьФорму("Форма");
		ФормаПечатьЦенников.Параметр = СтруктураПараметров;
		ФормаПечатьЦенников.Открыть();
		
	КонецФункции // ПечатьЦенников()
	
	// Функция формирует табличный документ унифицированной формы ОС-14
	//
	// Параметры: 
	//  Нет.
	//
	// Возвращаемое значение:
	//  Табличный документ по форме ОС-14 (приходный ордер).
	//
	Функция ПечатьОС14(ПечатьПоДаннымУпрУчета = Истина)
		
		Макет       = ПолучитьМакет("ОС14");
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_ОС14";
		
		Если ПечатьПоДаннымУпрУчета тогда
			ВалютаПечати = глЗначениеПеременной("ВалютаУправленческогоУчета");
		Иначе
			ВалютаПечати = глЗначениеПеременной("ВалютаРегламентированногоУчета");
		КонецЕсли;	
		
		СтруктураВалютыПечати = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаПечати, Дата);
		КурсВалютыПечати	  = СтруктураВалютыПечати.Курс;
		КратностьВалютыПечати = СтруктураВалютыПечати.Кратность;
		
		СтруктураВалютыДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсВалютыДокумента		 = СтруктураВалютыДокумента.Курс;
		КратностьВалютыДокумента = СтруктураВалютыДокумента.Кратность;
		
		Коэф1 = КурсВалютыПечати * КратностьВалютыДокумента;
		
		Если Коэф1<>0 тогда
			КоэффициентПересчетаВалюты = (КурсВалютыДокумента * КратностьВалютыПечати) / (Коэф1);
		Иначе
			КоэффициентПересчетаВалюты = 0;
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка"                    , Ссылка);
		Запрос.УстановитьПараметр("КоэффициентПересчетаВалюты", КоэффициентПересчетаВалюты);
		Запрос.УстановитьПараметр("Телефон"                 , Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("ТелефонОрганизации"   	, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		Запрос.УстановитьПараметр("ТелефонКонтрагента"   	, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		Запрос.УстановитьПараметр("ПустойБанковскийСчет" 	, Справочники.БанковскиеСчета.ПустаяСсылка());
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Дата                     КАК ДатаДокумента,
		|	Номер                    КАК НомерДокумента,
		|	Организация              КАК ОрганизацияПолучатель,
		|	СкладОрдер               КАК МестоПриема,
		|	СкладОрдер.Представление КАК МестоПриемаНаименование,
		|	ВЫБОР КОГДА ТелефонОрганизации.Представление ЕСТЬ NULL ТОГДА """" ИНАЧЕ ТелефонОрганизации.Представление КОНЕЦ ОрганизацияПолучательТелефоны,
		|	ВЫБОР КОГДА ТелефонКонтрагента.Представление ЕСТЬ NULL ТОГДА """" ИНАЧЕ ТелефонКонтрагента.Представление КОНЕЦ ОрганизацияПоставщикТелефоны,
		|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
		|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
		|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
		|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
		|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияПолучательБанковскиеРеквизиты,
		|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
		|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
		|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
		|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
		|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияПоставщикБанковскиеРеквизиты,
		|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
		|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
		|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
		|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
		|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияГрузоотправительБанковскиеРеквизиты,
		|	УчитыватьНДС,
		|	СуммаВключаетНДС,
		|	СуммаДокумента,
		|	Контрагент               КАК ОрганизацияПоставщик,
		|	Контрагент               КАК ОрганизацияГрузоотправитель,
		|	ДоговорКонтрагента,
		|	НомерВходящегоДокумента  КАК ОснованиеНомер,
		|	ДатаВходящегоДокумента   КАК ОснованиеДата,
		|	" + ?(ПечатьПоДаннымУпрУчета, "Подразделение КАК Подразделение,", "ПодразделениеОрганизации КАК Подразделение,") + "
		|	" + ?(ПечатьПоДаннымУпрУчета, "Подразделение КАК ПодразделениеНаименование,", "ПодразделениеОрганизации КАК ПодразделениеНаименование,") + "
		|	Оборудование.(
		|		Ссылка,
		|		НомерСтроки                     КАК НомерСтроки,
		|		Номенклатура                    КАК Оборудование,
		|		Номенклатура.НаименованиеПолное КАК ОборудованиеНаименование,
		|		ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмеренияНаименование,
		|		Коэффициент,
		|		СтавкаНДС,
		|		Количество,
		|		Количество                      КАК ФактическиКоличество,
		|		Цена     * &КоэффициентПересчетаВалюты КАК СтоимостьЗаЕдиницу,
		|		Сумма    * &КоэффициентПересчетаВалюты КАК Сумма,
		|		СуммаНДС * &КоэффициентПересчетаВалюты КАК СуммаНДС
		|	)
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КонтактнаяИнформация КАК ТелефонОрганизации
		|ПО
		|	ТелефонОрганизации.Объект = ПоступлениеТоваровУслуг.Организация
		|	И
		|	ТелефонОрганизации.Тип = &Телефон
		|	И
		|	ТелефонОрганизации.Вид = &ТелефонОрганизации
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
		|ПО
		|	ТелефонКонтрагента.Объект = ПоступлениеТоваровУслуг.Контрагент
		|	И
		|	ТелефонКонтрагента.Тип = &Телефон
		|	И
		|	ТелефонКонтрагента.Вид = &ТелефонКонтрагента
		|
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
		ВыборкаПоШапке.Следующий();
		
		Шапка         = Макет.ПолучитьОбласть("Шапка");
		ШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Подвал        = Макет.ПолучитьОбласть("Подвал");
		
		ОрганизацияПолучательНаименование       = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияПолучатель, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
		ОрганизацияПоставщикНаименование        = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияПоставщик, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
		ОрганизацияГрузоотправительНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияГрузоотправитель, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
		
		Шапка.Параметры.Заполнить(ВыборкаПоШапке);
		Шапка.Параметры.ОрганизацияПолучательНаименование       = ОрганизацияПолучательНаименование;
		Шапка.Параметры.ОрганизацияПоставщикНаименование        = ОрганизацияПоставщикНаименование;
		Шапка.Параметры.ОрганизацияГрузоотправительНаименование = ОрганизацияГрузоотправительНаименование;
		
		ТабДокумент.Вывести(Шапка);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ШапкаТаблицы.Параметры.Валюта = ВалютаПечати.Наименование;
		ТабДокумент.Вывести(ШапкаТаблицы);
		
		ВыборкаПоОборудованию = ВыборкаПоШапке.Оборудование.Выбрать();
		Пока ВыборкаПоОборудованию.Следующий() Цикл
			
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаПоОборудованию);
			
			Если ВыборкаПоШапке.УчитыватьНДС Тогда
				Если ВыборкаПоШапке.СуммаВключаетНДС Тогда
					СтрокаТаблицы.Параметры.СтоимостьВсего     = ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС;
					СтрокаТаблицы.Параметры.СтоимостьЗаЕдиницу = ?(ВыборкаПоОборудованию.Количество > 0,
					(ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС) / ВыборкаПоОборудованию.Количество,
					ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС);
				Иначе
					СтрокаТаблицы.Параметры.СтоимостьВсего     = ВыборкаПоОборудованию.Сумма;
					СтрокаТаблицы.Параметры.СтоимостьЗаЕдиницу = ВыборкаПоОборудованию.СтоимостьЗаЕдиницу;
				КонецЕсли;
			Иначе
				СтрокаТаблицы.Параметры.СтоимостьВсего = ВыборкаПоОборудованию.Сумма;
			КонецЕсли;
			
			ТабДокумент.Вывести(СтрокаТаблицы);
			
		КонецЦикла;
		
		ТабДокумент.Вывести(Подвал);
		
		ТабДокумент.АвтоМасштаб = Истина;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСнизу = 0;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьОС14()
	
	//АБС ВСТАВКА 54544 НАЧАЛО
	// Функция формирует табличный документ унифицированной формы ОС-14  с комиссией
	//
	// Параметры: 
	//  Нет.
	//
	// Возвращаемое значение:
	//  Табличный документ по форме ОС-14 (приходный ордер).
	//
	Функция ПечатьОС14_СКомиссией(ПечатьПоДаннымУпрУчета = Истина)
		
		Макет       = ПолучитьМакет("ОС14");
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_ОС14";
		
		Если ПечатьПоДаннымУпрУчета тогда
			ВалютаПечати = глЗначениеПеременной("ВалютаУправленческогоУчета");
		Иначе
			ВалютаПечати = глЗначениеПеременной("ВалютаРегламентированногоУчета");
		КонецЕсли;	
		
		СтруктураВалютыПечати = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаПечати, Дата);
		КурсВалютыПечати	  = СтруктураВалютыПечати.Курс;
		КратностьВалютыПечати = СтруктураВалютыПечати.Кратность;
		
		СтруктураВалютыДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсВалютыДокумента		 = СтруктураВалютыДокумента.Курс;
		КратностьВалютыДокумента = СтруктураВалютыДокумента.Кратность;
		
		Коэф1 = КурсВалютыПечати * КратностьВалютыДокумента;
		
		Если Коэф1<>0 тогда
			КоэффициентПересчетаВалюты = (КурсВалютыДокумента * КратностьВалютыПечати) / (Коэф1);
		Иначе
			КоэффициентПересчетаВалюты = 0;
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка"                    , Ссылка);
		Запрос.УстановитьПараметр("КоэффициентПересчетаВалюты", КоэффициентПересчетаВалюты);
		Запрос.УстановитьПараметр("Телефон"                 , Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("ТелефонОрганизации"   	, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		Запрос.УстановитьПараметр("ТелефонКонтрагента"   	, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		Запрос.УстановитьПараметр("ПустойБанковскийСчет" 	, Справочники.БанковскиеСчета.ПустаяСсылка());
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Дата                     КАК ДатаДокумента,
		|	Номер                    КАК НомерДокумента,
		|	Организация              КАК ОрганизацияПолучатель,
		|	СкладОрдер               КАК МестоПриема,
		|	СкладОрдер.Представление КАК МестоПриемаНаименование,
		|	ВЫБОР КОГДА ТелефонОрганизации.Представление ЕСТЬ NULL ТОГДА """" ИНАЧЕ ТелефонОрганизации.Представление КОНЕЦ ОрганизацияПолучательТелефоны,
		|	ВЫБОР КОГДА ТелефонКонтрагента.Представление ЕСТЬ NULL ТОГДА """" ИНАЧЕ ТелефонКонтрагента.Представление КОНЕЦ ОрганизацияПоставщикТелефоны,
		|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
		|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
		|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
		|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
		|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияПолучательБанковскиеРеквизиты,
		|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
		|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
		|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
		|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
		|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияПоставщикБанковскиеРеквизиты,
		|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
		|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
		|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
		|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
		|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияГрузоотправительБанковскиеРеквизиты,
		|	УчитыватьНДС,
		|	СуммаВключаетНДС,
		|	СуммаДокумента,
		|	Контрагент               КАК ОрганизацияПоставщик,
		|	Контрагент               КАК ОрганизацияГрузоотправитель,
		|	ДоговорКонтрагента,
		|	НомерВходящегоДокумента  КАК ОснованиеНомер,
		|	ДатаВходящегоДокумента   КАК ОснованиеДата,
		|	" + ?(ПечатьПоДаннымУпрУчета, "Подразделение КАК Подразделение,", "ПодразделениеОрганизации КАК Подразделение,") + "
		|	" + ?(ПечатьПоДаннымУпрУчета, "Подразделение КАК ПодразделениеНаименование,", "ПодразделениеОрганизации КАК ПодразделениеНаименование,") + "
		|	Оборудование.(
		|		Ссылка,
		|		НомерСтроки                     КАК НомерСтроки,
		|		Номенклатура                    КАК Оборудование,
		|		Номенклатура.НаименованиеПолное КАК ОборудованиеНаименование,
		|		ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмеренияНаименование,
		|		Коэффициент,
		|		СтавкаНДС,
		|		Количество,
		|		Количество                      КАК ФактическиКоличество,
		|		Цена     * &КоэффициентПересчетаВалюты КАК СтоимостьЗаЕдиницу,
		|		Сумма    * &КоэффициентПересчетаВалюты КАК Сумма,
		|		СуммаНДС * &КоэффициентПересчетаВалюты КАК СуммаНДС
		|	)
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КонтактнаяИнформация КАК ТелефонОрганизации
		|ПО
		|	ТелефонОрганизации.Объект = ПоступлениеТоваровУслуг.Организация
		|	И
		|	ТелефонОрганизации.Тип = &Телефон
		|	И
		|	ТелефонОрганизации.Вид = &ТелефонОрганизации
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
		|ПО
		|	ТелефонКонтрагента.Объект = ПоступлениеТоваровУслуг.Контрагент
		|	И
		|	ТелефонКонтрагента.Тип = &Телефон
		|	И
		|	ТелефонКонтрагента.Вид = &ТелефонКонтрагента
		|
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
		ВыборкаПоШапке.Следующий();
		
		Шапка         = Макет.ПолучитьОбласть("Шапка");
		ШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Подвал        = Макет.ПолучитьОбласть("Подвал");
		
		ОрганизацияПолучательНаименование       = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияПолучатель, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
		ОрганизацияПоставщикНаименование        = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияПоставщик, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
		ОрганизацияГрузоотправительНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияГрузоотправитель, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
		
		Шапка.Параметры.Заполнить(ВыборкаПоШапке);
		Шапка.Параметры.ОрганизацияПолучательНаименование       = ОрганизацияПолучательНаименование;
		Шапка.Параметры.ОрганизацияПоставщикНаименование        = ОрганизацияПоставщикНаименование;
		Шапка.Параметры.ОрганизацияГрузоотправительНаименование = ОрганизацияГрузоотправительНаименование;
		
		ТабДокумент.Вывести(Шапка);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ШапкаТаблицы.Параметры.Валюта = ВалютаПечати.Наименование;
		ТабДокумент.Вывести(ШапкаТаблицы);
		
		ВыборкаПоОборудованию = ВыборкаПоШапке.Оборудование.Выбрать();
		Пока ВыборкаПоОборудованию.Следующий() Цикл
			
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаПоОборудованию);
			
			Если ВыборкаПоШапке.УчитыватьНДС Тогда
				Если ВыборкаПоШапке.СуммаВключаетНДС Тогда
					СтрокаТаблицы.Параметры.СтоимостьВсего     = ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС;
					СтрокаТаблицы.Параметры.СтоимостьЗаЕдиницу = ?(ВыборкаПоОборудованию.Количество > 0,
					(ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС) / ВыборкаПоОборудованию.Количество,
					ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС);
				Иначе
					СтрокаТаблицы.Параметры.СтоимостьВсего     = ВыборкаПоОборудованию.Сумма;
					СтрокаТаблицы.Параметры.СтоимостьЗаЕдиницу = ВыборкаПоОборудованию.СтоимостьЗаЕдиницу;
				КонецЕсли;
			Иначе
				СтрокаТаблицы.Параметры.СтоимостьВсего = ВыборкаПоОборудованию.Сумма;
			КонецЕсли;
			
			ТабДокумент.Вывести(СтрокаТаблицы);
			
		КонецЦикла;
		/// заполнение ЧленовКомиссии 
		Сч = 1;	
		
		ЧленыКомиссии = абс_КомиссияТМЦ.ЧленыКомиссии;
		//абс 16_07_08 см
		Если ЧленыКомиссии.Количество()=0  или ЧленыКомиссии=Справочники.абс_КомиссияТМЦ.ПустаяСсылка() Тогда
			Сообщить("Не заполнена Таб. Часть " +абс_КомиссияТМЦ+ " или поле не заполнено",СтатусСообщения.Важное);
			Подвал.Параметры.ЧленКомиссии1Наименование = "";
			Подвал.Параметры.ЧленКомиссии1Должность = "";
			
			Для Сч=2 по 3 Цикл
				Подвал.Параметры["ЧленКомиссии" + Сч + "Должность"] = "";	
				Подвал.Параметры["ЧленКомиссии" + Сч + "Наименование"] ="";
			КонецЦикла;
		КонецЕсли;
		//\\
		
		Для Каждого СтрокаТабличнойЧасти Из ЧленыКомиссии Цикл
			
			Председатель = СтрокаТабличнойчасти.ПРЕДСЕДАТЕЛЬ;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	РаботникиОрганизаций.Должность
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|ГДЕ
			|	РаботникиОрганизаций.Сотрудник = &Физлицо";
			Запрос.УстановитьПараметр("Физлицо",СтрокаТабличнойЧасти.ЧленКомиссии);
			Должности = Запрос.Выполнить().Выгрузить();
			
			Если Председатель Тогда
				Подвал.Параметры.ЧленКомиссии1Наименование = СтрокаТабличнойЧасти.ЧленКомиссии;
				Если Должности.Количество() <> 0 Тогда 
					Подвал.Параметры["ЧленКомиссии" + Сч + "Должность"] = Должности[0].Должность;
				Иначе 
					Сообщить("У члена комиссии " + СтрокаТабличнойЧасти.ЧленКомиссии + " нет должности");
				КонецЕсли;
			Иначе 
				//абс см 16_07_08
				
				Сч = Сч + 1;
				Если Сч<=3 Тогда //абс см 16_07_08
					
					Подвал.Параметры["ЧленКомиссии" + Сч + "Наименование"] = СтрокаТабличнойЧасти.ЧленКомиссии;
					Если Должности.Количество() <> 0 Тогда 
						Подвал.Параметры["ЧленКомиссии" + Сч + "Должность"] = Должности[0].Должность;
					Иначе 
						Сообщить("У члена комиссии " + СтрокаТабличнойЧасти.ЧленКомиссии + " нет должности");
					КонецЕсли
				КонецЕсли;
			Конецесли;
			
		КонецЦикла;	
		
		
		///	
		ТабДокумент.Вывести(Подвал);
		
		ТабДокумент.АвтоМасштаб = Истина;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСнизу = 0;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьОС14()
	//\\АБС ВСТАВКА 54544 КОНЕЦ
	
	// Функция осуществляет запуск обработки формирующей печатную форму "Бланк товарного наполнения".
	//
	// Параметры:
	//  НаПринтер - Булево. Если Истина, тогда печать выполняется непосредственно на принтер.
	//
	// Возвращаемое значение:
	//  Неопределено.
	//
	Функция ПечатьБланк(НаПринтер)
		
		Обработки.ПечатьРаскладкиНоменклатурыПоМестамХранения.Создать().НапечататьИзДокумента(Ссылка, , , НаПринтер);
		
		Возврат Неопределено;
		
	КонецФункции // ПечатьБланк()
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходимое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		Если ЭтоНовый() Тогда
			Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
			Возврат;
		ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
			Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
			Возврат;
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат;
		КонецЕсли;
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "ОС14упр" тогда
			
			// Унифицированная форма М-4 (Акт о приеме оборудования) по данным упручета
			Если  абс_КомиссияТМЦ.Пустая() Тогда
				ТабДокумент = ПечатьОС14();
			Иначе
				ТабДокумент = ПечатьОС14_СКомиссией();
			КонецЕсли;
			
		ИначеЕсли ИмяМакета = "ОС14бух" тогда
			
			// Унифицированная форма М-4 (Акт о приеме оборудования) по данным бухучета
			Если  абс_КомиссияТМЦ.Пустая() Тогда
				ТабДокумент = ПечатьОС14(Ложь);
			Иначе
				ТабДокумент = ПечатьОС14_СКомиссией(Ложь);
			КонецЕсли;
			
		ИначеЕсли ИмяМакета = "СправкаРасчетВал" тогда
			
			// Справка-расчет формирования рублевой суммы документа в валюте
			БухгалтерскийУчетРасчетовСКонтрагентами.НапечататьСправкуРасчетРублеваяСуммаДокументаВВалюте(Ссылка);
			Возврат;
		ИначеЕсли ИмяМакета = "Бланк" Тогда
			
			ТабДокумент = ПечатьБланк(НаПринтер);
		ИначеЕсли ИмяМакета = "Ценники" Тогда
			ТабДокумент = ПечатьЦенников();
		ИначеЕсли ИмяМакета = "Этикетки" Тогда
			ПечататьЭтикетки();
			Возврат;
		ИначеЕсли ИмяМакета = "СерийныеНомера" Тогда
			
			ТабДокумент = УчетСерийныхНомеров.ПечатьСерийныхНомеров(Ссылка, "Товары");
			
		ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
			
			ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
			
			Если ТабДокумент = Неопределено Тогда
				Возврат;
			КонецЕсли;
		Иначе
			//Формы Накладная, ТОРГ4, М4, ТОРГ12 печатаются из модуля менеджера
			ПараметрКоманды = Новый Массив;
			ПараметрКоманды.Добавить(Ссылка);
			
			Если НаПринтер Тогда
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.ПоступлениеТоваровУслуг", ИмяМакета, 
				ПараметрКоманды, Неопределено);
			Иначе
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПоступлениеТоваровУслуг", ИмяМакета, 
				ПараметрКоманды, Неопределено, Неопределено);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка(ВидОперации)), Ссылка);
		
	КонецПроцедуры // Печать
	
	// Возвращает доступные варианты печати документа
	//
	// Возвращаемое значение:
	//  Структура, каждая строка которой соответствует одному из вариантов печати
	//  
	Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
		
		СтруктураМакетов = Новый Структура;
		
		Если НЕ (ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства) тогда
			
			СтруктураМакетов.Вставить("ТОРГ12",          "ТОРГ-12 (Товарная накладная за поставщика с услугами)");
			СтруктураМакетов.Вставить("ТОРГ12_БезУслуг", "ТОРГ-12 (Товарная накладная за поставщика)");
			СтруктураМакетов.Вставить("ТОРГ4",           "ТОРГ-4 (Акт о приемке товара без счета поставщика)");
			СтруктураМакетов.Вставить("М4",              "М-4 (Приходный ордер)");
			
			Если  ОтражатьВУправленческомУчете тогда 
				СтруктураМакетов.Вставить("ОС14упр",     "ОС-14 (Акт о приеме оборудования) (упр. учет)");
			КонецЕсли;
			Если  ОтражатьВБухгалтерскомУчете тогда 
				СтруктураМакетов.Вставить("ОС14бух",     "ОС-14 (Акт о приеме оборудования) (бух. учет)");
			КонецЕсли;
			
			СтруктураМакетов.Вставить("Бланк",           "Бланк товарного наполнения");
		КонецЕсли;
		
		Если  ОтражатьВБухгалтерскомУчете тогда 
			СтруктураМакетов.Вставить( "СправкаРасчетВал", "Справка-расчет ""Рублевая сумма документа в валюте""");
		КонецЕсли;
		
		СтруктураМакетов.Вставить("Накладная",           "Приходная накладная");
		СтруктураМакетов.Вставить("Ценники", "Ценники на товары");
		СтруктураМакетов.Вставить("Этикетки",        "Этикетки");
		СтруктураМакетов.Вставить("СерийныеНомера",      "Список серийных номеров");
		
		// АБС ВСТАВКА
		СтруктураМакетов.Вставить("БланкСогласования",      "Бланк согласования акта агента");
		// АБС ВСТАВКА КОНЕЦ
		
		Возврат СтруктураМакетов;
		
	КонецФункции // ПолучитьСтруктуруПечатныхФорм()
	
#КонецЕсли

//АБС_Стрельцов+ добавлено: 31.10.2012
//------------------------------------
//
Процедура ПроверкаНаличияДоходныхПроектов(Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	""Шапка"" КАК ИмяЧастиДокумента,
	|	0 КАК НомерСтроки,
	|	ПоступлениеТМЦ.Проект КАК Проект,
	|	ПоступлениеТМЦ.абс_ЗакупочныйЗаказ КАК ЗакупочныйЗаказ
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТМЦ
	|ГДЕ
	|	ПоступлениеТМЦ.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Товары"",
	|	ПоступлениеТоваровУслугТовары.НомерСтроки,
	|	ПоступлениеТоваровУслугТовары.абс_Проект,
	|	ПоступлениеТоваровУслугТовары.абс_ЗакупочныйЗаказТЧ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	ПоступлениеТоваровУслугУслуги.НомерСтроки,
	|	ПоступлениеТоваровУслугУслуги.абс_Проект,
	|	ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Оборудование"",
	|	ПоступлениеТоваровУслугОборудование.НомерСтроки,
	|	ПоступлениеТоваровУслугОборудование.абс_Проект,
	|	ПоступлениеТоваровУслугОборудование.абс_ЗакупочныйЗаказТЧ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|ГДЕ
	|	ПоступлениеТоваровУслугОборудование.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ОбъектыСтроительства"",
	|	ПоступлениеТоваровУслугОбъектыСтроительства.НомерСтроки,
	|	NULL,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЗакупочныйЗаказТЧ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
	|ГДЕ
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""абс_ЗакупочныеЗаказы"",
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.НомерСтроки,
	|	NULL,
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы
	|ГДЕ
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.ИмяЧастиДокумента КАК ИмяЧастиДокумента,
	|	ВТ_ДанныеДокумента.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеДокумента.Проект.абс_Доходный
	|			ТОГДА ""ЕстьДоходныйПроектВПоступленииТМЦ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВДокументе,
	|	ВЫБОР
	|		КОГДА (НЕ абс_ЗакупочныйЗаказТовары.Ссылка ЕСТЬ NULL )
	|				ИЛИ (НЕ абс_ЗакупочныйЗаказРаспределениеПоПроектам.Ссылка ЕСТЬ NULL )
	|			ТОГДА ""ЕстьДоходныйПроектВЗакупочномЗаказе""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВЗакупочномЗаказе
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ЗакупочныйЗаказ.Товары КАК абс_ЗакупочныйЗаказТовары
	|		ПО (ВЫБОР
	|				КОГДА абс_ЗакупочныйЗаказТовары.абс_Проект <> НЕОПРЕДЕЛЕНО
	|						И абс_ЗакупочныйЗаказТовары.абс_Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						И абс_ЗакупочныйЗаказТовары.абс_Проект.абс_Доходный
	|					ТОГДА ВТ_ДанныеДокумента.ЗакупочныйЗаказ = абс_ЗакупочныйЗаказТовары.Ссылка
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ЗакупочныйЗаказ.РаспределениеПоПроектам КАК абс_ЗакупочныйЗаказРаспределениеПоПроектам
	|		ПО (ВЫБОР
	|				КОГДА абс_ЗакупочныйЗаказРаспределениеПоПроектам.Проект <> НЕОПРЕДЕЛЕНО
	|						И абс_ЗакупочныйЗаказРаспределениеПоПроектам.Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						И абс_ЗакупочныйЗаказРаспределениеПоПроектам.Проект.абс_Доходный
	|					ТОГДА ВТ_ДанныеДокумента.ЗакупочныйЗаказ = абс_ЗакупочныйЗаказРаспределениеПоПроектам.Ссылка
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	(ВТ_ДанныеДокумента.Проект.абс_Доходный
	|			ИЛИ (НЕ абс_ЗакупочныйЗаказТовары.Ссылка ЕСТЬ NULL )
	|			ИЛИ (НЕ абс_ЗакупочныйЗаказРаспределениеПоПроектам.Ссылка ЕСТЬ NULL ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДокумента.ИмяЧастиДокумента,
	|	ВТ_ДанныеДокумента.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеДокумента.Проект.абс_Доходный
	|			ТОГДА ""ЕстьДоходныйПроектВПоступленииТМЦ""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ абс_ЗакупочныйЗаказТовары.Ссылка ЕСТЬ NULL )
	|				ИЛИ (НЕ абс_ЗакупочныйЗаказРаспределениеПоПроектам.Ссылка ЕСТЬ NULL )
	|			ТОГДА ""ЕстьДоходныйПроектВЗакупочномЗаказе""
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ДанныеДокумента.ИмяЧастиДокумента,
	|	ВТ_ДанныеДокумента.НомерСтроки,
	|	ВДокументе УБЫВ,
	|	ВЗакупочномЗаказе УБЫВ
	|ИТОГИ ПО
	|	ИмяЧастиДокумента
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отказ = Не РезультатЗапроса.Пустой();
	
	//ТекстСообщения = "";
	//
	//Выборка0 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока Выборка0.Следующий() Цикл
	//	
	//	Выборка1 = Выборка0.Выбрать();
	//	Пока Выборка1.Следующий() Цикл
	//		
	//		Если Выборка0.ИмяЧастиДокумента = "Шапка" Тогда
	//			ТекстСообщения = "В шапке документа указан ";
	//		Иначе
	//			ТекстСообщения = "В табличной части """+Выборка0.ИмяЧастиДокумента+""" в строке № "+Строка(Выборка1.НомерСтроки)+" указан ";
	//		КонецЕСли;
	//		
	//		Если НЕ ПустаяСтрока(Выборка1.ВДокументе) Тогда
	//			ТекстСообщения = ТекстСообщения + " доходный проект!";
	//			
	//		ИначеЕсли НЕ ПустаяСтрока(Выборка1.ВЗакупочномЗаказе) Тогда
	//			ТекстСообщения = ТекстСообщения + " закупочный заказ, в котором существует доходный проект!";
	//		КонецЕсли;
	//		
	//		Прервать;
	//	КонецЦикла;
	//	
	//	Прервать;
	//КонецЦикла;
	//
	//ТекстСообщения = ТекстСообщения + Символы.ПС+ "Необходимо заполнить поле ""Акт об оказании производственных услуг "" на закладке ""Акты""";   
	//ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
	
КонецПроцедуры

// Очищает ненужные строки табличных частей
//
Процедура ОчиститьНенужныеТабличныеЧасти() Экспорт
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		Оборудование.Очистить();
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства Тогда
		ОбъектыСтроительства.Очистить();
	Иначе
		Товары.Очистить();
		ВозвратнаяТара.Очистить();
	КонецЕсли;
	
	// Если договор с комитентом, то надо почистить закладку "Услуги".
	Если Услуги.Количество() > 0
		И ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		
		Услуги.Очистить();
		
	КонецЕсли;
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		Услуги.Очистить();
		ВозвратнаяТара.Очистить();
	КонецЕсли;
	
	
КонецПроцедуры // ОчиститьНенужныеТабличныеЧасти()

// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьОборудование(ДокументОснование = Неопределено) Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуТовары.Ссылка.ВалютаДокумента       КАК ВалютаДокумента,
	|	СчетНаОплатуТовары.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	СчетНаОплатуТовары.ЕдиницаИзмерения,
	|	СчетНаОплатуТовары.Количество,
	|	СчетНаОплатуТовары.Коэффициент,
	|	СчетНаОплатуТовары.Номенклатура,
	|	СчетНаОплатуТовары.СтавкаНДС,
	|	СчетНаОплатуТовары.Сумма,
	|	СчетНаОплатуТовары.ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Оборудование КАК СчетНаОплатуТовары
	|
	|ГДЕ
	|	СчетНаОплатуТовары.Ссылка = &Счет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	ДокументОснованиеСклад = ДокументОснование.Склад;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = Оборудование.Добавить();
		
		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения     = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент          = Выборка.Коэффициент;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;
		
		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
		МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
		Выборка.КурсДокумента, Курс,
		Выборка.КратностьДокумента, Кратность),
		Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
		Выборка.СуммаВключаетНДС,
		УчитыватьНДС,
		СуммаВключаетНДС,
		УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Оборудование");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;		
		СтрокаТабличнойЧасти.ЗаказПоставщику 			= ДокументОснованиеЗаказПоставщику;
		СтрокаТабличнойЧасти.Склад 						= ДокументОснованиеСклад;
		
	КонецЦикла;
	
КонецПроцедуры // СкопироватьОборудование()

// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьТовары(ДокументОснование = Неопределено) Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуТовары.Ссылка.ВалютаДокумента       КАК ВалютаДокумента,
	|	СчетНаОплатуТовары.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	СчетНаОплатуТовары.ЕдиницаИзмерения,
	|	СчетНаОплатуТовары.ЕдиницаИзмеренияМест,
	|	СчетНаОплатуТовары.Количество,
	|	СчетНаОплатуТовары.КоличествоМест,
	|	СчетНаОплатуТовары.Коэффициент,
	|	СчетНаОплатуТовары.Номенклатура,
	|	СчетНаОплатуТовары.СтавкаНДС,
	|	СчетНаОплатуТовары.Сумма,
	|	СчетНаОплатуТовары.ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуТовары
	|
	|ГДЕ
	|	СчетНаОплатуТовары.Ссылка = &Счет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	ДокументОснованиеСклад = ДокументОснование.Склад;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = Товары.Добавить();
		
		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.КоличествоМест       = Выборка.КоличествоМест;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения     = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = Выборка.ЕдиницаИзмеренияМест;
		СтрокаТабличнойЧасти.Коэффициент          = Выборка.Коэффициент;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;
		
		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
		МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
		Выборка.КурсДокумента, Курс,
		Выборка.КратностьДокумента, Кратность),
		Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
		Выборка.СуммаВключаетНДС,
		УчитыватьНДС,
		СуммаВключаетНДС,
		УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.ЗаказПоставщику 			= ДокументОснованиеЗаказПоставщику;
		СтрокаТабличнойЧасти.Склад 						= ДокументОснованиеСклад;
		
	КонецЦикла;
	
КонецПроцедуры // СкопироватьТовары()

// Процедура выполняет копирование возвратной тары заказа поставщику в документ.
//
Процедура СкопироватьВозвратнуюТару(ДокументОснование = Неопределено) Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка.ВалютаДокумента                          КАК ВалютаДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуВозвратнаяТара.Ссылка.ВалютаДокумента = СчетНаОплатуВозвратнаяТара.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуВозвратнаяТара.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуВозвратнаяТара.Ссылка.ВалютаДокумента = СчетНаОплатуВозвратнаяТара.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуВозвратнаяТара.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуВозвратнаяТара.Количество,
	|	СчетНаОплатуВозвратнаяТара.Номенклатура,
	|	СчетНаОплатуВозвратнаяТара.Сумма
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.ВозвратнаяТара КАК СчетНаОплатуВозвратнаяТара
	|
	|ГДЕ
	|	СчетНаОплатуВозвратнаяТара.Ссылка = &Счет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	ДокументОснованиеСклад = ДокументОснование.Склад;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаВозвратнойТары = ВозвратнаяТара.Добавить();
		
		СтрокаВозвратнойТары.Номенклатура     = Выборка.Номенклатура;
		СтрокаВозвратнойТары.Количество       = Выборка.Количество;
		
		СтрокаВозвратнойТары.Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
		Выборка.ВалютаДокумента, 
		ВалютаДокумента,
		Выборка.КурсДокумента, Курс,
		Выборка.КратностьДокумента, Кратность);
		
		ОбработкаТабличныхЧастей.ПриИзмененииВозвратнойТарыТабЧасти(СтрокаВозвратнойТары, ЭтотОбъект);
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыВозвратнойТарыТабЧасти(СтрокаВозвратнойТары, ЭтотОбъект);
		СтрокаВозвратнойТары.ЗаказПоставщику  = ДокументОснованиеЗаказПоставщику;
		СтрокаВозвратнойТары.Склад 			  = ДокументОснованиеСклад;
		
	КонецЦикла;
	
КонецПроцедуры // СкопироватьВозвратнуюТару()

// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьУслуги(ДокументОснование = Неопределено) Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА СчетНаОплатуУслуги.Ссылка.ВалютаДокумента = СчетНаОплатуУслуги.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуУслуги.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуУслуги.Ссылка.ВалютаДокумента = СчетНаОплатуУслуги.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуУслуги.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуУслуги.Ссылка.ВалютаДокумента       КАК ВалютаДокумента,
	|	СчетНаОплатуУслуги.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	СчетНаОплатуУслуги.Содержание,
	|	СчетНаОплатуУслуги.Количество,
	|	СчетНаОплатуУслуги.Номенклатура,
	|	СчетНаОплатуУслуги.СтавкаНДС,
	|	СчетНаОплатуУслуги.Сумма
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Услуги КАК СчетНаОплатуУслуги
	|
	|ГДЕ
	|	СчетНаОплатуУслуги.Ссылка = &Счет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = Услуги.Добавить();
		
		СтрокаТабличнойЧасти.Номенклатура     = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество       = Выборка.Количество;
		СтрокаТабличнойЧасти.Содержание       = Выборка.Содержание;
		СтрокаТабличнойЧасти.СтавкаНДС        = Выборка.СтавкаНДС;
		
		СтрокаТабличнойЧасти.СтатьяЗатрат 		  = СтрокаТабличнойЧасти.Номенклатура.СтатьяЗатрат;
		СтрокаТабличнойЧасти.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.Номенклатура.НоменклатурнаяГруппаЗатрат;
		
		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
		МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
		Выборка.КурсДокумента, Курс,
		Выборка.КратностьДокумента, Кратность),
		Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
		Выборка.СуммаВключаетНДС,
		УчитыватьНДС,
		СуммаВключаетНДС,
		УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Услуги");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		СтрокаТабличнойЧасти.ЗаказПоставщику = ДокументОснованиеЗаказПоставщику;
		
	КонецЦикла;
	
КонецПроцедуры // СкопироватьУслуги()

// Заполняет регл. реквизиты после упр. заполнения
Процедура ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл(СтрокаТабличнойЧасти,Выборка)
	
	ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	
КонецПроцедуры // ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл()	

// Процедура выполняет заполниение табличной части неполученными ТМЦ по заказу поставщику.
//
Процедура ЗаполнитьТоварыПоОстаткамУпр(СтатусПартииСтр = "Купленный") Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("СтатусПартии", Перечисления.СтатусыПартийТоваров[СтатусПартииСтр]);
	Запрос.УстановитьПараметр("Договор",      ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Товар",        Перечисления.ТоварТара.Товар);
	Запрос.УстановитьПараметр("Сделка",       Сделка);
	Запрос.УстановитьПараметр("ТипЦен",       ТипЦен);
	Запрос.УстановитьПараметр("ПустойТипЦен", Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	СУММА(ВложенныйЗапрос.КоличествоОстатокПоЗаказу) КАК КоличествоОстатокПоЗаказу,
	|	СУММА(ВложенныйЗапрос.КоличествоПоРазмещению) КАК КоличествоПоРазмещению,
	|	ВложенныйЗапрос.Размещение КАК Размещение,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Коэффициент КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ТЧЗаказа.Номенклатура ЕСТЬ NULL 
	|			ТОГДА 99999999
	|		ИНАЧЕ МИНИМУМ(ТЧЗаказа.НомерСтрокиЗаказа)
	|	КОНЕЦ КАК НомерСтрокиЗаказа,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ТЧЗаказа.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Номенклатура КАК Номенклатура,
	|		Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		Остатки.Цена КАК Цена,
	|		Остатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Остатки.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|		Остатки.КоличествоОстаток КАК КоличествоОстатокПоЗаказу,
	|		0 КАК КоличествоПоРазмещению,
	|		НЕОПРЕДЕЛЕНО КАК Размещение,
	|		Остатки.СтавкаНДС КАК СтавкаНДС
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				&ДатаОстатков,
	|				ДоговорКонтрагента = &Договор
	|					И ЗаказПоставщику = &Сделка
	|					И СтатусПартии = &СтатусПартии) КАК Остатки
	|	ГДЕ
	|		(НЕ Остатки.Номенклатура.Услуга)
	|		И Остатки.КоличествоОстаток <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Размещение.Номенклатура,
	|		Размещение.ХарактеристикаНоменклатуры,
	|		0,
	|		ВЫБОР
	|			КОГДА &ТипЦен = &ПустойТипЦен
	|				ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения ЕСТЬ NULL 
	|						ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков
	|					ИНАЧЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения
	|				КОНЕЦ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ТипЦен = &ПустойТипЦен
	|				ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения ЕСТЬ NULL 
	|						ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	|					ИНАЧЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения.Коэффициент
	|				КОНЕЦ
	|		КОНЕЦ,
	|		0,
	|		Размещение.КоличествоОстаток,
	|		Размещение.ЗаказПокупателя,
	|		NULL
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|				&ДатаОстатков,
	|				ЗаказПоставщику = &Сделка
	|					И ТоварТара = &Товар) КАК Размещение
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	|			ПО Размещение.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	|				И Размещение.ХарактеристикаНоменклатуры = ЦеныНоменклатурыКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры
	|	ГДЕ
	|		(НЕ Размещение.Номенклатура.Услуга)
	|		И Размещение.КоличествоОстаток > 0) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|			ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			МИНИМУМ(ЗаказПоставщикуТовары.НомерСтроки) КАК НомерСтрокиЗаказа,
	|			ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ГДЕ
	|			ЗаказПоставщикуТовары.Ссылка = &Сделка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПоставщикуТовары.Номенклатура,
	|			ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры,
	|			ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест) КАК ТЧЗаказа
	|		ПО ВложенныйЗапрос.Номенклатура = ТЧЗаказа.Номенклатура
	|			И ВложенныйЗапрос.ХарактеристикаНоменклатуры = ТЧЗаказа.ХарактеристикаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Размещение,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Коэффициент,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	ТЧЗаказа.Номенклатура,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ТЧЗаказа.ЕдиницаИзмеренияМест";
	
	Запрос.УстановитьПараметр("Период", МоментВремени());
	РезультатЗапроса = Запрос.Выполнить();
	
	// Таблица остатков по размещению покупателям
	ТаблицаПоРазмещению = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоРазмещению.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоРазмещению.Получить(Сч);
		Если СтрокаТаблицы.КоличествоПоРазмещению <= 0 Тогда
			ТаблицаПоРазмещению.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Таблица остатков по заказу поставщику
	ТаблицаПоЗаказу = РезультатЗапроса.Выгрузить();
	ТаблицаПоЗаказу.Сортировать("НомерСтрокиЗаказа возр");
	Сч = 0;
	Пока Сч < ТаблицаПоЗаказу.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоЗаказу.Получить(Сч);
		Если СтрокаТаблицы.КоличествоОстатокПоЗаказу = 0 Тогда
			ТаблицаПоЗаказу.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Нам надо знать сколько на самом деле осталось номенклатуры
	ТаблицаБезЦен = ТаблицаПоЗаказу.Скопировать();
	ТаблицаБезЦен.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоОстатокПоЗаказу");
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	Для каждого СтрокаБезЦен ИЗ ТаблицаБезЦен Цикл
		ВсегоПоЗаказу = СтрокаБезЦен.КоличествоОстатокПоЗаказу;
		ВсегоСписано  = 0;
		
		Если ВсегоСписано >= ВсегоПоЗаказу Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",               СтрокаБезЦен.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаБезЦен.ХарактеристикаНоменклатуры);
		
		СтрокиПоРазмещению = ТаблицаПоРазмещению.НайтиСтроки(СтруктураПоиска);
		СтрокиПоЗаказу     = ТаблицаПоЗаказу.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаЗаказа Из СтрокиПоЗаказу Цикл
			КолвоПоЗаказу       = СтрокаЗаказа.КоличествоОстатокПоЗаказу;
			СписатьПоРазмещению = 0;
			СписатьПоЗаказу     = 0;
			СписаноПоСтроке     = 0;
			
			Если КолвоПоЗаказу <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Cписываем по размещению
			Для Каждого СтрокаРазмещения Из СтрокиПоРазмещению Цикл
				КолвоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению;
				
				Если КолвоПоРазмещению <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СписатьПоРазмещению = Мин(КолвоПоРазмещению, Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано));
				
				Если СписатьПоРазмещению<=0  Тогда 
					Продолжить; 
				КонецЕсли;
				
				
				СписаноПоСтроке     = СписаноПоСтроке + СписатьПоРазмещению;
				ВсегоСписано        = ВсегоСписано    + СписатьПоРазмещению;
				
				СтрокаТабличнойЧасти = Товары.Добавить();
				СтрокаТабличнойЧасти.Номенклатура               = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения           = СтрокаЗаказа.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Коэффициент                = СтрокаЗаказа.Коэффициент;
				СтрокаТабличнойЧасти.СтавкаНДС                  = СтрокаЗаказа.СтавкаНДС;
				СтрокаТабличнойЧасти.Заказ			            = СтрокаРазмещения.Размещение;
				СтрокаТабличнойЧасти.Количество                 = СписатьПоРазмещению * СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
				/СтрокаЗаказа.Коэффициент;
				
				Если ЗначениеЗаполнено(СтрокаЗаказа.ЕдиницаИзмеренияМест) Тогда
					СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = СтрокаЗаказа.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				Иначе
					ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				КонецЕсли;													  
				
				СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
				Сделка.ВалютаДокумента, ВалютаДокумента,
				ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
				ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
				Сделка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
				
				СтрокаТабличнойЧасти.Сумма  = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
				
				ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти,    ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти,   ЭтотОбъект);
				ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				
				СтрокаРазмещения.КоличествоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению - СписатьПоРазмещению;
				
				СтрокаТабличнойЧасти.ЗаказПоставщику    = Сделка;
				
				ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл(СтрокаТабличнойЧасти,СтрокаЗаказа);
			КонецЦикла;
			
			// Cписываем без размещения
			СписатьПоЗаказу = Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано);
			СписаноПоСтроке = СписаноПоСтроке + СписатьПоЗаказу;
			ВсегоСписано    = ВсегоСписано    + СписатьПоЗаказу;
			
			Если СписатьПоЗаказу > 0 Тогда
				СтрокаТабличнойЧасти = Товары.Добавить();
				СтрокаТабличнойЧасти.Номенклатура               = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения           = СтрокаЗаказа.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Коэффициент                = СтрокаЗаказа.Коэффициент;
				СтрокаТабличнойЧасти.СтавкаНДС                  = СтрокаЗаказа.СтавкаНДС;
				СтрокаТабличнойЧасти.Заказ			            = Неопределено;
				СтрокаТабличнойЧасти.Количество                 = СписатьПоЗаказу * СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
				/СтрокаЗаказа.Коэффициент;
				
				Если ЗначениеЗаполнено(СтрокаЗаказа.ЕдиницаИзмеренияМест) Тогда
					СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = СтрокаЗаказа.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				Иначе
					ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				КонецЕсли;
				
				СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
				Сделка.ВалютаДокумента, ВалютаДокумента,
				ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
				ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
				Сделка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
				
				СтрокаТабличнойЧасти.Сумма  = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
				
				ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти,    ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти,   ЭтотОбъект);
				ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				
				СтрокаТабличнойЧасти.ЗаказПоставщику    = Сделка;
				
			КонецЕсли;
			
			СтрокаЗаказа.КоличествоОстатокПоЗаказу = СтрокаЗаказа.КоличествоОстатокПоЗаказу - СписаноПоСтроке;
			
			ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл(СтрокаТабличнойЧасти,СтрокаЗаказа);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТоварыПоОстаткамУпр()

// Заполняет регл. реквизиты после упр. заполнения
// Процедура выполняет заполниение возвратной тары неполученными ТМЦ по заказу поставщику.
//
Процедура ЗаполнитьВозвратнуюТаруПоОстаткамУпр() Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;
	ИмяТЧ  = "ЗаказПоставщику.ВозвратнаяТара";
	
	Запрос.УстановитьПараметр("СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	Запрос.УстановитьПараметр("Договор",      ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сделка",       Сделка);
	Запрос.УстановитьПараметр("Тара",         Перечисления.ТоварТара.Тара);
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	СУММА(ВложенныйЗапрос.КоличествоОстатокПоЗаказу) КАК КоличествоОстатокПоЗаказу,
	|	СУММА(ВложенныйЗапрос.КоличествоПоРазмещению) КАК КоличествоПоРазмещению,
	|	ВложенныйЗапрос.Размещение КАК Размещение,
	|	ВЫБОР
	|		КОГДА ТЧЗаказа.Номенклатура ЕСТЬ NULL 
	|			ТОГДА 99999999
	|		ИНАЧЕ МИНИМУМ(ТЧЗаказа.НомерСтрокиЗаказа)
	|	КОНЕЦ КАК НомерСтрокиЗаказа
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Номенклатура КАК Номенклатура,
	|		Остатки.Цена КАК Цена,
	|		Остатки.КоличествоОстаток КАК КоличествоОстатокПоЗаказу,
	|		0 КАК КоличествоПоРазмещению,
	|		НЕОПРЕДЕЛЕНО КАК Размещение
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОстатков
	|			,
	|			ДоговорКонтрагента = &Договор
	|			    И ЗаказПоставщику = &Сделка
	|			    И СтатусПартии = &СтатусПартии) КАК Остатки
	|	ГДЕ
	|		(НЕ Остатки.Номенклатура.Услуга)
	|		И Остатки.КоличествоОстаток <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Размещение.Номенклатура,
	|		0,
	|		0,
	|		Размещение.КоличествоОстаток,
	|		Размещение.ЗаказПокупателя
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&ДатаОстатков
	|			,
	|			ЗаказПоставщику = &Сделка
	|				И ТоварТара = &Тара) КАК Размещение
	|	ГДЕ
	|		(НЕ Размещение.Номенклатура.Услуга)
	|		И Размещение.КоличествоОстаток > 0) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|			МИНИМУМ(ЗаказПоставщикуТовары.НомерСтроки) КАК НомерСтрокиЗаказа
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ГДЕ
	|			ЗаказПоставщикуТовары.Ссылка = &Сделка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПоставщикуТовары.Номенклатура) КАК ТЧЗаказа
	|		ПО ВложенныйЗапрос.Номенклатура = ТЧЗаказа.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Размещение,
	|	ВложенныйЗапрос.Цена,
	|	ТЧЗаказа.Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Таблица остатков по размещению покупателям
	ТаблицаПоРазмещению = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоРазмещению.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоРазмещению.Получить(Сч);
		Если СтрокаТаблицы.КоличествоПоРазмещению <= 0 Тогда
			ТаблицаПоРазмещению.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Таблица остатков по заказу поставщику
	ТаблицаПоЗаказу = РезультатЗапроса.Выгрузить();
	ТаблицаПоЗаказу.Сортировать("НомерСтрокиЗаказа возр");
	Сч = 0;
	Пока Сч < ТаблицаПоЗаказу.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоЗаказу.Получить(Сч);
		Если СтрокаТаблицы.КоличествоОстатокПоЗаказу = 0 Тогда
			ТаблицаПоЗаказу.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Нам надо знать сколько на самом деле осталось номенклатуры
	ТаблицаБезЦен = ТаблицаПоЗаказу.Скопировать();
	ТаблицаБезЦен.Свернуть("Номенклатура", "КоличествоОстатокПоЗаказу");
	
	Для каждого СтрокаБезЦен ИЗ ТаблицаБезЦен Цикл
		ВсегоПоЗаказу = СтрокаБезЦен.КоличествоОстатокПоЗаказу;
		ВсегоСписано  = 0;
		
		Если ВсегоСписано >= ВсегоПоЗаказу Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаБезЦен.Номенклатура);
		
		СтрокиПоРазмещению = ТаблицаПоРазмещению.НайтиСтроки(СтруктураПоиска);
		СтрокиПоЗаказу     = ТаблицаПоЗаказу.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаЗаказа Из СтрокиПоЗаказу Цикл
			КолвоПоЗаказу       = СтрокаЗаказа.КоличествоОстатокПоЗаказу;
			СписатьПоРазмещению = 0;
			СписатьПоЗаказу     = 0;
			СписаноПоСтроке     = 0;
			
			Если КолвоПоЗаказу <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Cписываем по размещению
			Для Каждого СтрокаРазмещения Из СтрокиПоРазмещению Цикл
				КолвоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению;
				
				Если КолвоПоРазмещению <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СписатьПоРазмещению = Мин(КолвоПоРазмещению, Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано));
				СписаноПоСтроке     = СписаноПоСтроке + СписатьПоРазмещению;
				ВсегоСписано        = ВсегоСписано + СписатьПоРазмещению;
				
				Если КолвоПоРазмещению > 0 Тогда
					СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
					СтрокаТабличнойЧасти.Номенклатура    = СтрокаЗаказа.Номенклатура;
					СтрокаТабличнойЧасти.Заказ			 = СтрокаРазмещения.Размещение;
					СтрокаТабличнойЧасти.Количество      = СписатьПоРазмещению;
					
					СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
					Сделка.ВалютаДокумента, ВалютаДокумента,
					ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
					ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность);
					
					ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
					ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
					ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
					
					СтрокаРазмещения.КоличествоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению - СписатьПоРазмещению;
					
					СтрокаТабличнойЧасти.ЗаказПоставщику    = Сделка;
				КонецЕсли;
			КонецЦикла;
			
			// Cписываем без размещения
			СписатьПоЗаказу = Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано);
			СписаноПоСтроке = СписаноПоСтроке + СписатьПоЗаказу;
			ВсегоСписано    = ВсегоСписано    + СписатьПоЗаказу;
			
			Если СписатьПоЗаказу > 0 Тогда
				СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
				СтрокаТабличнойЧасти.Номенклатура    = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.Заказ			 = Неопределено;
				СтрокаТабличнойЧасти.Количество      = СписатьПоЗаказу;
				
				СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
				Сделка.ВалютаДокумента, ВалютаДокумента,
				ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
				ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность);
				
				ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
				
				СтрокаТабличнойЧасти.ЗаказПоставщику = Сделка;
				
			КонецЕсли;
			
			СтрокаЗаказа.КоличествоОстатокПоЗаказу = СтрокаЗаказа.КоличествоОстатокПоЗаказу - СписаноПоСтроке;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьВозвратнуюТаруПоОстаткамУпр()

// Процедура выполняет заполниение услуг неполученными услугами по заказу поставщику.
//
Процедура ЗаполнитьУслугиПоОстаткамУпр() Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Товар",   Перечисления.ТоварТара.Товар);
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сделка",  Сделка);
	Запрос.УстановитьПараметр("ВозвратнаяТара", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.СтавкаНДС КАК СтавкаНДС,
	|	Остатки.Цена,
	|	Остатки.КоличествоОстаток КАК КоличествоОстатокПоЗаказу
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОстатков
	|		,
	|		ДоговорКонтрагента = &Договор
	|			И ЗаказПоставщику = &Сделка
	|			И СтатусПартии <> &ВозвратнаяТара) КАК Остатки
	|ГДЕ
	|	Остатки.Номенклатура.Услуга
	|	И Остатки.КоличествоОстаток>0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗапросСодержаний = Новый Запрос;
	ЗапросСодержаний.УстановитьПараметр("Сделка",  Сделка);
	ЗапросСодержаний.Текст = 
	"ВЫБРАТЬ
	|	Док.Номенклатура,
	|	Док.Содержание
	|ИЗ
	|	Документ.ЗаказПоставщику.Услуги КАК Док
	|ГДЕ
	|	Док.Ссылка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки";
	
	ТабСодержаний = ЗапросСодержаний.Выполнить().Выгрузить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаУслуг = Услуги.Добавить();
		СтрокаУслуг.Номенклатура = Выборка.Номенклатура;
		СтрокаУслуг.Количество   = Выборка.КоличествоОстатокПоЗаказу;
		СтрокаУслуг.СтавкаНДС    = Выборка.СтавкаНДС;
		
		СтрокаСодержания = ТабСодержаний.Найти(Выборка.Номенклатура, "Номенклатура");
		
		Если СтрокаСодержания = Неопределено Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьСодержаниеТабЧасти(СтрокаУслуг, ЭтотОбъект);
		Иначе
			СтрокаУслуг.Содержание = СтрокаСодержания.Содержание;
		КонецЕсли;
		
		СтрокаУслуг.СтатьяЗатрат         = СтрокаУслуг.Номенклатура.СтатьяЗатрат;
		СтрокаУслуг.НоменклатурнаяГруппа = СтрокаУслуг.Номенклатура.НоменклатурнаяГруппаЗатрат;
		
		СтрокаУслуг.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена,
		Сделка.ВалютаДокумента, ВалютаДокумента,
		ЗаполнениеДокументов.КурсДокумента(Сделка,     мВалютаРегламентированногоУчета),
		Курс,
		ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета),
		Кратность);
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаУслуг, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаУслуг, ЭтотОбъект);
		СтрокаУслуг.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
		
		СтрокаУслуг.ЗаказПоставщику = Сделка;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьУслугиПоОстаткамУпр()

// Процедура выполняет заполниение услуг неполученными услугами по заказу поставщику.
//
Процедура ЗаполнитьОборудованиеПоОстаткамУпр() Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Если ЭтоНовый() Тогда
		ДатаОстатков = Дата('00010101');
	Иначе
		ДатаОстатков = Дата;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить( "УчитыватьНДС",     Сделка.УчитыватьНДС);
	ДопПараметры.Вставить( "СуммаВключаетНДС", Сделка.СуммаВключаетНДС);
	
	УправлениеЗаказами.ЗаполнитьТабЧастьОборудованиеПоЗаказуПоставщику(Сделка, Оборудование, УправлениеЗаказами.ОстаткиОборудованияПоЗаказуПоставщику  ( Сделка, Сделка.ДоговорКонтрагента, ДатаОстатков), ДопПараметры);
	Для каждого Строка из Оборудование Цикл
		Строка.ЗаказПоставщику = Сделка;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьУслугиПоОстаткамУпр()

// Заполняет счета БУ и НУ в строке табличной части
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	Если ИмяТабЧасти = "ОбъектыСтроительства" Тогда
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства(СтрокаТЧ, ЗаполнятьБУ, ЗаполнятьНУ);
	Иначе
		СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаТабличнойЧасти(ИмяТабЧасти, СтрокаТЧ, ЭтотОбъект, ЗаполнятьБУ, ЗаполнятьНУ);
		//***** Гетц. Проектный учет.
		Если Константы.абс_ПроведениеПоМеханизмуПроектногоУчета.Получить() И ИмяТабЧасти = "Услуги" Тогда 
			#Если Клиент Тогда 
				ПроставитьСчетаПоПроекту(ИмяТабЧасти, СтрокаТЧ, ЭтотОбъект, ЗаполнятьБУ, ЗаполнятьНУ);				
			#КонецЕсли
		КонецЕсли;
		//***** Гетц \\
	КонецЕсли;	
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Заполняет счета БУ и НУ в табличной части документа
//
Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	Если ИмяТабЧасти = "ОбъектыСтроительства" Тогда
		ЗаполнитьСчетаУчетаВТабЧастиПоОбъектамСтроительства(ОбъектыСтроительства, ЗаполнятьБУ, ЗаполнятьНУ);
	Иначе
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()

// Возвращает структуру со значениями по-умолчанию счетов учета шапки.
//
Функция ЗаполнитьСтруктуруСчетовУчетаШапки(ЗаполнятьБУ=Истина, ЗаполнятьНУ=Истина) Экспорт
	
	СтруктураСчетов = Новый Структура();
	
	Если ЗаполнятьБУ и ОтражатьВБухгалтерскомУчете Тогда
		
		СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, ДоговорКонтрагента);
		
		Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтруктураСчетов.Вставить("СчетУчетаРасчетовСКонтрагентом",	СчетаУчета.СчетРасчетовСКомитентом);
		Иначе
			СтруктураСчетов.Вставить("СчетУчетаРасчетовСКонтрагентом",	СчетаУчета.СчетРасчетов);
		КонецЕсли;
		СтруктураСчетов.Вставить("СчетУчетаРасчетовПоАвансам",		СчетаУчета.СчетАвансов);
		СтруктураСчетов.Вставить("СчетУчетаРасчетовПоТаре",			СчетаУчета.СчетУчетаТары);
		
	КонецЕсли;
	
	Возврат СтруктураСчетов;
	
КонецФункции

// Заполняет счета БУ и НУ в строке табличной части "Объекты строительства"
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства(СтрокаТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	СчетаУчета = УправлениеВнеоборотнымиАктивами.ПолучитьСчетаУчетаОбъектовСтроительства(Организация, СтрокаТабЧасти.ОбъектСтроительства);
	
	Если ЗаполнятьБУ = Истина Тогда
		СтрокаТабЧасти.СчетУчетаБУ  = СчетаУчета.СчетУчетаБУ;
		СтрокаТабЧасти.СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
	ИначеЕсли ЗаполнятьБУ = Ложь Тогда
		СтрокаТабЧасти.СчетУчетаБУ  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СтрокаТабЧасти.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполнятьНУ = Истина Тогда
		СтрокаТабЧасти.СчетУчетаНУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", СтрокаТабЧасти.СчетУчетаБУ));
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		СтрокаТабЧасти.СчетУчетаНУ = ПланыСчетов.Налоговый.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства()

// Заполняет счета БУ и НУ в табличной части "Объекты строительства"
//
Процедура ЗаполнитьСчетаУчетаВТабЧастиПоОбъектамСтроительства(ТабличнаяЧасть, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства(СтрокаТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЦикла;
	
КонецПроцедуры // обЗаполнитьСчетаУчетаВТабЧастиПоОбъектамСтроительства()

// Процедура выполняет заполнение табличной части по приходному ордеру товаров.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание (приходный ордер товаров).
//
Процедура ЗаполнитьТоварыПоОснованиюУпр(ДокументОснование, ТабличнаяЧасть) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Если ТабличнаяЧасть = ВозвратнаяТара Тогда
		ИмяТабличнойЧасти = "ВозвратнаяТара";
	Иначе
		ИмяТабличнойЧасти = "Товары";
	КонецЕсли;
	
	ДополнительныеРеглПоляОбщ		= "";
	ДополнительныеРеглПоляТовары 	= "";
	
	Запрос.УстановитьПараметр("Склад",        ДокументОснование.Склад);
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	
	СкладыВТабличнойЧасти = мУказаниеСкладовВТЧ Или ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ДокТовары.НомерСтроки) КАК НомерСтроки,
	|	ДокТовары.Номенклатура,
	|	ДокТовары.Номенклатура.СтавкаНДС                            КАК СтавкаНДС,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков             КАК ЕдиницаХранения,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения," +
	ДополнительныеРеглПоляОбщ +"
	|	СУММА(ДокТовары.Количество)                        КАК КоличествоПоДокументу,
	|	NULL                                               КАК ЦенаВРознице, " + 
	?(ТабличнаяЧасть = Товары, "
	|	ДокТовары.СерияНоменклатуры," +
	ДополнительныеРеглПоляТовары +"
	|	ДокТовары.ХарактеристикаНоменклатуры, ", "") +
	?(СкладыВТабличнойЧасти, "
	|   Остатки.Склад                                      КАК Склад,", "") + 
	?(ТабличнаяЧасть = Товары, "
	|	СУММА(ДокТовары.Количество*ДокТовары.Коэффициент)","
	|	СУММА(ДокТовары.Количество)")+" КАК КоличествоПоСерии, 
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                КАК КоличествоОстатокКомпании,
	|   МАКСИМУМ("+
	?(ТабличнаяЧасть = Товары, "
	|       ДокТовары.ЕдиницаИзмерения ","
	|       Остатки.Номенклатура.ЕдиницаХраненияОстатков ")+"
	|)                                                   КАК ЕдиницаИзмерения,
	|   МАКСИМУМ("+
	?(ТабличнаяЧасть = Товары, "
	|		ДокТовары.ЕдиницаИзмерения.Коэффициент ","
	|       Остатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент ")+"
	|)                                                   КАК Коэффициент
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары." + ИмяТабличнойЧасти + " КАК ДокТовары
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(&ДатаОстатков, ДокументПолучения = &ДокументОснование" +
	?(СкладыВТабличнойЧасти, "", "
	|                                                       И Склад = &Склад") + ") КАК Остатки
	|ПО
	|	ДокТовары.Номенклатура = Остатки.Номенклатура" + 
	?(ТабличнаяЧасть = Товары, "
	| И ДокТовары.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	| И ДокТовары.СерияНоменклатуры          = Остатки.СерияНоменклатуры	", "") + " 
	|
	|ГДЕ
	|	ДокТовары.Ссылка = &ДокументОснование
	|	И Остатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТовары.Номенклатура" +
	?(ТабличнаяЧасть = Товары, ",
	|   ДокТовары.ЕдиницаИзмерения,
	|	ДокТовары.СерияНоменклатуры,
	|	ДокТовары.ХарактеристикаНоменклатуры", "") + 
	?(СкладыВТабличнойЧасти, ",
	|	Остатки.Склад", "") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ТабличнаяЧасть = Товары Тогда
			
			СтрокаТабличнойЧасти = Товары.Добавить();
			
			СтрокаТабличнойЧасти.Номенклатура               = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.Количество                 = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии)
			*Выборка.КоэффициентЕдиницыХранения / Выборка.Коэффициент;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент                = Выборка.Коэффициент;
			СтрокаТабличнойЧасти.СтавкаНДС                  = Выборка.СтавкаНДС;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
			
			ОбработкаТабличныхЧастей.ЗаполнитьЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			
			
		Иначе
			
			СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
			
			СтрокаТабличнойЧасти.Номенклатура = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.Количество   = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии);
			
			ОбработкаТабличныхЧастей.ЗаполнитьЦенуВозвратнойТарыТабЧастиПоступление(СтрокаТабличнойЧасти, ЭтотОбъект, мВалютаРегламентированногоУчета);
			ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти , ЭтотОбъект);
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ПриходныйОрдер = ДокументОснование;
		Если СкладыВТабличнойЧасти Тогда
			СтрокаТабличнойЧасти.Склад          = Выборка.Склад;
		Иначе
			СтрокаТабличнойЧасти.Склад          = ДокументОснование.Склад;
		КонецЕсли;
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
		
	КонецЦикла; // Выборка.Следующий()
	
КонецПроцедуры // ЗаполнитьТоварыПоОснованию()

Процедура СкопироватьРеквизитыРегл(ЭтоТовары, НоваяСтрока, СтрокаТЧ)
	
	НоваяСтрока.СчетУчетаБУ      = СтрокаТЧ.СчетУчетаБУ;
	НоваяСтрока.СчетУчетаНУ      = СтрокаТЧ.СчетУчетаНУ;
	Если ЭтоТовары Тогда
		НоваяСтрока.СчетУчетаНДС        = СтрокаТЧ.СчетУчетаНДС;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет табличную часть при оперативном проведении
//
Процедура ЗаполнитьТабличныеЧастиПередПроведениемУпр() Экспорт
	Перем ИспользоватьЗаказыНаПроизводство;
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка",          Ссылка);
	Запрос.УстановитьПараметр("Купленный", Перечисления.СтатусыПартийТоваров.Купленный);
	
	КопияТовары = Товары.Выгрузить();
	КопияТовары.Свернуть("Номенклатура",);
	КопияВозвратнаяТара = ВозвратнаяТара.Выгрузить();
	КопияВозвратнаяТара.Свернуть("Номенклатура",);
	
	// Сформируем массив номенклатуры по товарам и таре для фильтров запросов.
	МассивНоменклатуры = КопияТовары.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатурыТара = КопияВозвратнаяТара.ВыгрузитьКолонку("Номенклатура");
	Для Каждого ЭлементТара Из МассивНоменклатурыТара Цикл
		МассивНоменклатуры.Добавить(ЭлементТара);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	КопияТовары = Товары.Выгрузить();
	КопияТовары.Свернуть("ЗаказПоставщику",);
	КопияВозвратнаяТара = ВозвратнаяТара.Выгрузить();
	КопияВозвратнаяТара.Свернуть("ЗаказПоставщику",);
	
	// Сформируем массив заказов покупателей по товарам и таре для фильтров запросов.
	МассивЗаказов = КопияТовары.ВыгрузитьКолонку("ЗаказПоставщику");
	МассивЗаказовТара = КопияВозвратнаяТара.ВыгрузитьКолонку("ЗаказПоставщику");
	Для Каждого ЭлементТара Из МассивЗаказовТара Цикл
		МассивЗаказов.Добавить(ЭлементТара);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	
	ИспользоватьЗаказыНаПроизводство = УправлениеЗаказами.ИспользоватьЗаказыНаПроизводство();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателей.Номенклатура,
	|	РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя ИЛИ
	|		РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ВнутреннийЗаказ Тогда
	|		ЗаказыПокупателейОстатки.СтатусПартии
	|	ИНАЧЕ &Купленный 
	|	КОНЕЦ КАК СтатусПартии,
	|	РазмещениеЗаказовПокупателей.ЗаказПокупателя,
	|	РазмещениеЗаказовПокупателей.ЗаказПоставщику,
	|	ВЫБОР КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя Тогда
	|		Естьnull(ЗаказыПокупателейОстатки.КоличествоОстаток,0)
	|	КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ВнутреннийЗаказ ТОГДА
	|		Естьnull(ВнутренниеЗаказыОстатки.КоличествоОстаток,0)" +
	?(ИспользоватьЗаказыНаПроизводство, "
	|	КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ЗаказНаПроизводство ТОГДА
	|		Естьnull(ПотребностиЗаказовНаПроизводствоОстатки.КоличествоОстаток,0)", "")+ "
	|	ИНАЧЕ 0 КОНЕЦ КАК Количество,
	|	РазмещениеЗаказовПокупателей.КоличествоОстаток КАК Размещение,
	|   Естьnull(ОстаткиРезерв.КоличествоОстаток,0)  КАК Резерв
	|ИЗ  РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 И ЗаказПоставщику В (&МассивЗаказов)) КАК РазмещениеЗаказовПокупателей
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)) КАК ОстаткиРезерв
	|	ПО ОстаткиРезерв.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ОстаткиРезерв.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ОстаткиРезерв.ДокументРезерва = РазмещениеЗаказовПокупателей.ЗаказПокупателя
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 ) КАК ЗаказыПокупателейОстатки
	|	ПО ЗаказыПокупателейОстатки.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ЗаказыПокупателейОстатки.ЗаказПокупателя = РазмещениеЗаказовПокупателей.ЗаказПокупателя
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ВнутренниеЗаказы.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 ) КАК ВнутренниеЗаказыОстатки
	|	ПО ВнутренниеЗаказыОстатки.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ВнутренниеЗаказыОстатки.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ВнутренниеЗаказыОстатки.ВнутреннийЗаказ = РазмещениеЗаказовПокупателей.ЗаказПокупателя " +
	?(ИспользоватьЗаказыНаПроизводство, "
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПотребностиЗаказовНаПроизводство.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 ) КАК ПотребностиЗаказовНаПроизводствоОстатки
	|	ПО ПотребностиЗаказовНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ПотребностиЗаказовНаПроизводствоОстатки.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ПотребностиЗаказовНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовПокупателей.ЗаказПокупателя", "");
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка ИЗ Таблица Цикл
		ПотребностьЗаказа = Макс(Строка.Количество - Строка.Резерв,0);
		Строка.Количество = Мин(ПотребностьЗаказа, Строка.Размещение);
	КонецЦикла;
	
	ПустаяХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	// Заполним массив, хранящий две таблицы значений, в которых задано распределение по
	// заказам покупателей для товаров и возвратной тары
	МассивТаблицСтрок = Новый Массив(2);
	
	Для Сч = 0 По 1 Цикл
		
		Если Сч = 0 Тогда
			ТабличнаяЧасть = Товары;
			ЭтоТовары = Истина;
		Иначе
			ТабличнаяЧасть = ВозвратнаяТара;
			ЭтоТовары = Ложь;
		КонецЕсли;
		
		ТаблицаТЧ = ТабличнаяЧасть.Выгрузить();
		ТаблицаТЧ.Колонки.Добавить("КоличествоЕдиницХранения");
		
		МассивТаблицСтрок[Сч] = ТабличнаяЧасть.Выгрузить();
		МассивТаблицСтрок[Сч].Очистить();
		МассивТаблицСтрок[Сч].Колонки.Добавить("ИндексИсходнойСтроки");
		МассивТаблицСтрок[Сч].Колонки.Добавить("СкладРозничный");
		
		Для Каждого СтрокаТЧ Из ТаблицаТЧ Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЗаказПоставщику) Тогда
				Продолжить;
			КонецЕсли; 
			
			// Пересчитаем в единицы хранения
			Если ЭтоТовары Тогда
				СтрокаТЧ.КоличествоЕдиницХранения = Окр(СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент 
				/ СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,3);
			Иначе
				СтрокаТЧ.КоличествоЕдиницХранения = СтрокаТЧ.Количество;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
			СтруктураПоиска.Вставить("ЗаказПоставщику", СтрокаТЧ.ЗаказПоставщику);
			
			Если ЭтоТовары Тогда
				СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТЧ.ХарактеристикаНоменклатуры);
			Иначе
				СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", ПустаяХарактеристикаНоменклатуры);
			КонецЕсли; 
			
			НайденныеСтроки = Таблица.НайтиСтроки(СтруктураПоиска);
			
			// Погашаем количество в таблице
			КоличествоОсталосьПогасить = СтрокаТЧ.КоличествоЕдиницХранения;
			СуммаОсталосьПогасить      = СтрокаТЧ.Сумма;
			
			// Погашаем количество в таблице, записывая способ списания
			Для Каждого Строка Из НайденныеСтроки Цикл
				
				Если КоличествоОсталосьПогасить <= 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если Строка.Количество <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если Строка.Количество >= КоличествоОсталосьПогасить Тогда
					КоэффСписания = КоличествоОсталосьПогасить / Строка.Количество ;
				Иначе
					КоэффСписания = 1;
				КонецЕсли;
				
				СписанноеКоличество = Окр(Строка.Количество  * КоэффСписания, 3, РежимОкругления.Окр15как20);
				Если ЭтоТовары Тогда
					СписанноеКоличество_ВЕдиницахДокумента = Окр(СписанноеКоличество * СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / СтрокаТЧ.Коэффициент,3);
				Иначе
					СписанноеКоличество_ВЕдиницахДокумента = СписанноеКоличество;
				КонецЕсли;
				
				// Добавляем строку с данными о распределенном количестве
				НоваяСтрока = МассивТаблицСтрок[Сч].Добавить();
				НоваяСтрока.ИндексИсходнойСтроки = ТаблицаТЧ.Индекс(СтрокаТЧ);
				
				НоваяСтрока.Номенклатура     = СтрокаТЧ.Номенклатура;
				
				НоваяСтрока.Количество     = СписанноеКоличество_ВЕдиницахДокумента;
				
				Если ЭтоТовары Тогда
					НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
					НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
					НоваяСтрока.СтавкаНДС           = СтрокаТЧ.СтавкаНДС;
					НоваяСтрока.КоличествоМест = ?(СтрокаТЧ.Коэффициент <> 0, СписанноеКоличество
					* НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / СтрокаТЧ.Коэффициент 
					, 0);
					НоваяСтрока.Коэффициент = СтрокаТЧ.Коэффициент;
					
				КонецЕсли;
				
				СкопироватьРеквизитыРегл(ЭтоТовары, НоваяСтрока, СтрокаТЧ);
				
				НоваяСтрока.Цена = СтрокаТЧ.Цена;
				
				
				КоэффПогашения = СписанноеКоличество / КоличествоОсталосьПогасить;
				
				НоваяСтрока.Сумма = Окр(СуммаОсталосьПогасить * КоэффПогашения, 2 ,1);
				
				НоваяСтрока.Заказ = Строка.ЗаказПокупателя;
				НоваяСтрока.ЗаказПоставщику = Строка.ЗаказПоставщику;
				
				
				КоличествоОсталосьПогасить = КоличествоОсталосьПогасить - СписанноеКоличество;
				СуммаОсталосьПогасить = СуммаОсталосьПогасить - НоваяСтрока.Сумма;
				
				// Уменьшаем количество в исходной строке
				Если ЭтоТовары Тогда
					СтрокаТЧ.Количество = Окр((СтрокаТЧ.КоличествоЕдиницХранения - СписанноеКоличество) * СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / СтрокаТЧ.Коэффициент,3);
				Иначе
					СтрокаТЧ.Количество = СтрокаТЧ.КоличествоЕдиницХранения - СписанноеКоличество;
				КонецЕсли;
				
				// Уменьшаем количество в строке остатков
				Строка.Количество   = Строка.Количество - СписанноеКоличество;
				
			КонецЦикла;
			
			Если КоличествоОсталосьПогасить > 0 Тогда
				
				// Добавляем строку с данными о распределенном количестве
				НоваяСтрока = МассивТаблицСтрок[Сч].Добавить();
				НоваяСтрока.ИндексИсходнойСтроки = ТаблицаТЧ.Индекс(СтрокаТЧ);
				НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
				
				НоваяСтрока.Количество     = КоличествоОсталосьПогасить;
				
				Если ЭтоТовары Тогда
					НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
					НоваяСтрока.СтавкаНДС           = СтрокаТЧ.СтавкаНДС;
					НоваяСтрока.ЕдиницаИзмерения    = СтрокаТЧ.ЕдиницаИзмерения;
					НоваяСтрока.Коэффициент         = СтрокаТЧ.Коэффициент;
					НоваяСтрока.Количество = Окр(НоваяСтрока.Количество * СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / НоваяСтрока.Коэффициент ,3);
				КонецЕсли;
				
				СкопироватьРеквизитыРегл(ЭтоТовары, НоваяСтрока, СтрокаТЧ);
				
				НоваяСтрока.Цена = СтрокаТЧ.Цена;
				
				НоваяСтрока.СкладРозничный = Ложь;
				
				
				НоваяСтрока.Сумма = Окр(СуммаОсталосьПогасить, 2, 1);
				
				НоваяСтрока.ЗаказПОставщику = СтрокаТЧ.ЗаказПоставщику;
				
			КонецЕсли; 
			
		КонецЦикла;
	КонецЦикла;
	
	// Изменяем табличную часть
	Для Сч = 0 По 1 Цикл
		Если Сч = 0 Тогда
			ТабличнаяЧасть = Товары;
			ЭтоТовары = Истина;
		Иначе
			ТабличнаяЧасть = ВозвратнаяТара;
			ЭтоТовары = Ложь;
		КонецЕсли;
		
		ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
		ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
		ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
		ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
		
		// Серийные номера используются только для товаров.
		СтруктДанныеСерНомера = ?(Сч = 0, УчетСерийныхНомеров.СформироватьИсходнуюТаблицуСерийныйНомеров(Товары, СерийныеНомера), Неопределено);
		
		ТекИндексИсходнойСтроки = Неопределено;
		Для Каждого Строка Из МассивТаблицСтрок[Сч] Цикл
			
			// Если строка с таким индексом уже обрабатывалась, то добавляем новую
			Если ТекИндексИсходнойСтроки = Строка.ИндексИсходнойСтроки Тогда
				Стр = ТабличнаяЧасть[Строка.ИндексИсходнойСтроки];
				РедактируемаяСтрока = ТабличнаяЧасть.Добавить();
				РедактируемаяСтрока.Номенклатура = Стр.Номенклатура;
				Если ЭтоТовары Тогда
					
					РедактируемаяСтрока.ХарактеристикаНоменклатуры = Стр.ХарактеристикаНоменклатуры;
					РедактируемаяСтрока.СтавкаНДС = Стр.СтавкаНДС;
					
					УчетСерийныхНомеров.КорректироватьТабЧастьСерийныеНомера(СтруктДанныеСерНомера, Строка.ИндексИсходнойСтроки, Стр.Количество, РедактируемаяСтрока, Строка.Количество);
					
				КонецЕсли;
			Иначе
				РедактируемаяСтрока = ТабличнаяЧасть[Строка.ИндексИсходнойСтроки];
			КонецЕсли; 
			
			РедактируемаяСтрока.Заказ = Строка.Заказ;
			РедактируемаяСтрока.ЗаказПоставщику = Строка.ЗаказПоставщику;
			
			
			Если РедактируемаяСтрока.Количество = Строка.Количество Тогда
				Продолжить;
			КонецЕсли;
			
			РедактируемаяСтрока.Количество = Строка.Количество;
			
			Если ЭтоТовары Тогда
				РедактируемаяСтрока.СтавкаНДС = Строка.СтавкаНДС;
				Если Строка.СкладРозничный = Истина Тогда
					РедактируемаяСтрока.Цена = Строка.Цена;
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(РедактируемаяСтрока, ЭтотОбъект);
				Иначе
					РедактируемаяСтрока.Сумма = Строка.Сумма;
					ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(РедактируемаяСтрока, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
				КонецЕсли; 
				РедактируемаяСтрока.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
				РедактируемаяСтрока.Коэффициент      = Строка.Коэффициент;
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(РедактируемаяСтрока, ЭтотОбъект);
			Иначе
				РедактируемаяСтрока.Сумма = Строка.Сумма;
				РедактируемаяСтрока.Цена = ?(РедактируемаяСтрока.Количество <> 0, РедактируемаяСтрока.Сумма/РедактируемаяСтрока.Количество, 0);
			КонецЕсли;
			
			ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(РедактируемаяСтрока, ЭтотОбъект);
			
			СкопироватьРеквизитыРегл(ЭтоТовары, РедактируемаяСтрока, Строка);
			
			ТекИндексИсходнойСтроки = Строка.ИндексИсходнойСтроки;
			
		КонецЦикла; 
	КонецЦикла;
	Товары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЕдиницаИзмерения,ЕдиницаИзмеренияМест,Коэффициент,Цена,СтавкаНДС,Заказ,Склад,ПриходныйОрдер,ЗаказПоставщику,КлючСвязи,ОтражениеВУСН,СчетУчетаБУ,СчетУчетаНДС, СчетУчетаНУ","Количество,КоличествоМест,Сумма,СуммаНДС");
	ВозвратнаяТара.Свернуть("Номенклатура,Цена,Заказ,Склад,ПриходныйОрдер,ЗаказПоставщику, СчетУчетаБУ,СчетУчетаНУ","Количество,Сумма");
	
	//УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	//УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	
КонецПроцедуры // ЗаполнитьТабличныеЧастиПередПроведением()

// Процедура выполняет заполнение ТЧ "Товары" по документу-основанию Реализация.
// При заполнении копируется состав документа.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьТоварыПоОснованиюРеализация(ДокументОснование) Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КурсВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КурсДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КратностьВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КратностьДокумента,
	|	Док.Ссылка.УчитыватьНДС,
	|	Док.Ссылка.СуммаВключаетНДС,
	|	Док.Номенклатура,
	|	Док.ЕдиницаИзмерения,
	|	Док.ЕдиницаИзмеренияМест,
	|	Док.Коэффициент,
	|	Док.СтавкаНДС,
	|	Док.Количество,
	|	Док.КоличествоМест,
	|	Док.Сумма,
	|	Док.ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|	И (НЕ Док.Номенклатура.Услуга)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = Товары.Добавить();
		
		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.КоличествоМест       = Выборка.КоличествоМест;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения     = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = Выборка.ЕдиницаИзмеренияМест;
		СтрокаТабличнойЧасти.Коэффициент          = Выборка.Коэффициент;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;
		
		// Т.к. в Реализации могла быть скидка. то цену рассчитываем от суммы
		СтрокаТабличнойЧасти.Сумма                = Выборка.Сумма;
		
		// Пересчитаем сумму в валюту документа (может отличаться от валюты основания).
		Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента, 
		Выборка.КурсДокумента, Курс,
		Выборка.КратностьДокумента, Кратность);
		
		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Сумма,
		Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
		Выборка.УчитыватьНДС И Выборка.СуммаВключаетНДС,
		УчитыватьНДС,
		СуммаВключаетНДС,
		УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ОтражениеВУСН 				= Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТоварыПоОснованиюРеализация()

// Процедура выполняет заполнение ТЧ "Услуги" по документу-основанию Реализация.
// При заполнении копируется состав документа.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьУслугиПоОснованиюРеализация(ДокументОснование) Экспорт
	Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КурсВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КурсДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КратностьВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КратностьДокумента,
	|	Док.Ссылка.УчитыватьНДС,
	|	Док.Ссылка.СуммаВключаетНДС,
	|	Док.Номенклатура,
	|	Док.Содержание,
	|	Док.СтавкаНДС,
	|	Док.Количество,
	|	Док.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Док
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|	И Док.Номенклатура.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = Услуги.Добавить();
		
		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Содержание           = Выборка.Содержание;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;
		
		// Т.к. в Реализации могла быть скидка. то цену рассчитываем от суммы
		СтрокаТабличнойЧасти.Сумма                = Выборка.Сумма;
		
		// Пересчитаем сумму в валюту документа (может отличаться от валюты основания).
		Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента, 
		Выборка.КурсДокумента, Курс,
		Выборка.КратностьДокумента, Кратность);
		
		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Сумма,
		Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
		Выборка.УчитыватьНДС И Выборка.СуммаВключаетНДС,
		УчитыватьНДС,
		СуммаВключаетНДС,
		УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Услуги");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		
		СтрокаТабличнойЧасти.ОтражениеВУСН 				= Перечисления.ОтражениеВУСН.Принимаются;
		
		СтрокаТабличнойЧасти.СтатьяЗатрат = СтрокаТабличнойЧасти.Номенклатура.СтатьяЗатрат;
		
		СтрокаТабличнойЧасти.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.Номенклатура.НоменклатурнаяГруппаЗатрат;
		
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "Услуги", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьУслугиПоОснованиюРеализация()

// Процедура выполняет заполнение ТЧ "Возвратная тара" по документу-основанию Реализация.
// При заполнении копируется состав документа.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьВозвратнуюТаруПоОснованиюРеализация(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Док.Ссылка.КурсВзаиморасчетов,
	|	Док.Ссылка.КратностьВзаиморасчетов,
	|	Док.Номенклатура,
	|	Док.Количество,
	|	Док.Цена
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК Док
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаВозвратнойТары = ВозвратнаяТара.Добавить();
		
		СтрокаВозвратнойТары.Номенклатура     = Выборка.Номенклатура;
		СтрокаВозвратнойТары.Количество       = Выборка.Количество;
		СтрокаВозвратнойТары.Цена             = Выборка.Цена;
		
		// Пересчитаем цену в валюту взаиморасчетов (в документах договоры могут отличаться).
		Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаВозвратнойТары.Цена, 
		Выборка.ВалютаВзаиморасчетов, ДоговорКонтрагента.ВалютаВзаиморасчетов,
		Выборка.КурсВзаиморасчетов, КурсВзаиморасчетов,
		Выборка.КратностьВзаиморасчетов, КратностьВзаиморасчетов);
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаВозвратнойТары, ЭтотОбъект);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТоварыПоОснованиюРеализация()

// Процедура очищает розничный/НТТ склад в шапке и таб. части "Оборудование", при виде операции "Оборудование".
// Поступление оборудования возможно только на оптовый склад.
//
//	Параметры:
//		ТолькоПроверка - если Ложь, то выполняется очистка неверно указанного склада,
//						 иначе только выдача сообщения.
//	Возврат:
//		Истина - были обнаружены ошибки, иначе - Ложь.
//
Функция ОчиститьСкладПриВидеОперацииОборудование(ТолькоПроверка = Истина) Экспорт
	
	// Оборудование может поступать только на оптовый склад
	ФлагСообщали = Ложь;
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		Возврат ФлагСообщали;
	КонецЕсли;
	
	Если ВидПоступления <> Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		Если НЕ ФлагСообщали Тогда
			Сообщить("При виде операции ""Оборудование"" вид поступления может быть только на склад.", СтатусСообщения.ОченьВажное);
			ФлагСообщали = Истина;
		КонецЕсли;
		Если НЕ ТолькоПроверка Тогда
			ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		КонецЕсли;
	КонецЕсли;
	
	ТекстСообщения = "При виде операции ""Оборудование"" поступление возможно только на оптовый склад!"
	+ ?(ТолькоПроверка, "", Символы.ПС + "Склад будет очищен!");
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
		И ЗначениеЗаполнено(СкладОрдер)
		И (ТипЗнч(СкладОрдер) <> Тип("СправочникСсылка.Склады")
		ИЛИ СкладОрдер.ВидСклада <> Перечисления.ВидыСкладов.Оптовый) Тогда
		Если НЕ ФлагСообщали Тогда
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
			ФлагСообщали = Истина;
		КонецЕсли;
		Если НЕ ТолькоПроверка Тогда
			СкладОрдер = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	// Заполнить склад в табличных частях
	Если мУказаниеСкладовВТЧ Тогда
		Для Каждого СтрокаТЧ Из Оборудование Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Склад)
				И СтрокаТЧ.Склад.ВидСклада <> Перечисления.ВидыСкладов.Оптовый Тогда
				Если НЕ ТолькоПроверка Тогда
					СтрокаТЧ.Склад = Справочники.Склады.ПустаяСсылка();
				КонецЕсли;
				Если НЕ ФлагСообщали Тогда
					Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
					ФлагСообщали = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ФлагСообщали;
	
КонецФункции // ОчиститьСкладПриВидеОперацииОборудование()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)
	
	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	// Создаем колонку "Стоимость" и копируем в нее колонку "Сумма"
	ТаблицаТоваров.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Сумма") , "Стоимость");
	
	ТаблицаТоваров.Колонки.Добавить("КоличествоМинус", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			СтрокаТаблицы.КоличествоМинус = - СтрокаТаблицы.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
	// Порядок вызова в данном случае важен
	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТоваров;
	
КонецФункции // ПодготовитьТаблицуТоваров()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуОбъектовСтроительства(РезультатЗапросаПоОбъектамСтроительства, СтруктураШапкиДокумента)
	
	ТаблицаОбъектовСтроительства = РезультатЗапросаПоОбъектамСтроительства.Выгрузить();
	
	ТаблицаОбъектовСтроительства.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаОбъектовСтроительства.ЗагрузитьКолонку(ТаблицаОбъектовСтроительства.ВыгрузитьКолонку("Сумма") , "Стоимость");
	ТаблицаОбъектовСтроительства.Колонки.Добавить("КоличествоМинус", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаОбъектовСтроительства.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаОбъектовСтроительства.ЗаполнитьЗначения(1, "Количество");
	
	ТаблицаОбъектовСтроительства.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Для Каждого СтрокаТаблицы из ТаблицаОбъектовСтроительства Цикл
		СтрокаТаблицы.Цена  = СтрокаТаблицы.Сумма;
	КонецЦикла;
	
	ПодготовитьТаблицуТоваровРегл(ТаблицаОбъектовСтроительства, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровУпр(ТаблицаОбъектовСтроительства,  СтруктураШапкиДокумента);
	
	Возврат ТаблицаОбъектовСтроительства;
	
КонецФункции // ПодготовитьТаблицуОбъектовСтроительства()

Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)
	
	ЕстьЦена = ТаблицаТоваров.Колонки.Найти("Цена") <> Неопределено;
	
	ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТоваров, "Склад", "ВидСкладаРазмещения");
	Если ЕстьРозничныйСклад Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТоваров.ВыгрузитьКолонку("Склад"),
		ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();
		
		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам, "ВидСкладаРазмещения");
	КонецЕсли;
	
	ТаблицаТоваров.Колонки.Добавить("ЦенаВВалютеЗаказа"  , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаТоваров.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаУпр"           , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"             , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	// Надо рассчитать стоимость без НДС.
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		// Считаем, что поступление выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			СтруктураШапкиДокумента.ВалютаЗаказа,
			СтруктураШапкиДокумента.КурсДокумента, 
			СтруктураШапкиДокумента.КурсЗаказа,
			СтруктураШапкиДокумента.КратностьДокумента, 
			СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;
		
		СтоимостьСНДС  = СтрокаТаблицы.Стоимость + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
		
		Если СтруктураШапкиДокумента.НеВключатьНДСВСтоимостьПартий 
			И НЕ (СтруктураШапкиДокумента.НДСВключенВСтоимость) 
			И НЕ СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтрокаТаблицы.Стоимость = СтрокаТаблицы.Стоимость - ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
		Иначе
			СтрокаТаблицы.Стоимость = СтоимостьСНДС;
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.УчетАгентскогоНДС Тогда
			СтоимостьДляВзаиморасчетов = СтоимостьСНДС - СтрокаТаблицы.НДС;
		Иначе
			СтоимостьДляВзаиморасчетов = СтоимостьСНДС;
		КонецЕсли;
		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьДляВзаиморасчетов, ВалютаДокумента, 
		СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
		КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
		
		// Суммы пересчитаем в валюту упр. учета
		Если НЕ абс_РасчетРеглСуммыНДСОтРеглСуммыВсего Тогда
			СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			СтруктураШапкиДокумента.КратностьДокумента, 
			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДС, ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			СтруктураШапкиДокумента.КратностьДокумента, 
			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, СтруктураШапкиДокумента.ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
			СтруктураШапкиДокумента.КурсДокумента,
			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
			СтруктураШапкиДокумента.КратностьДокумента,
			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
		Иначе
			СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьСНДС, ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			СтруктураШапкиДокумента.КратностьДокумента, 
			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаТаблицы.НДСУпр = УчетНДС.РассчитатьСуммуНДС(СтрокаТаблицы.СуммаУпр,
			Истина, Истина,
			УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС));
			
			СтрокаТаблицы.Стоимость = СтрокаТаблицы.СуммаУпр - СтрокаТаблицы.НДСУпр;
			
		КонецЕсли;
		
		
		// Цена нужна для проведения по заказам поставщиков, поэтому ее необходимо пересчитать в валюту заказа
		Если ЕстьЦена И ЗначениеЗаполнено(СтруктураШапкиДокумента.Сделка) 
			И (ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПоставщику")
			ИЛИ ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
			СтруктураКурсаВалютыЗаказа = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаЗаказа, Дата);
			СтрокаТаблицы.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, СтруктураШапкиДокумента.ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаЗаказа,
			СтруктураШапкиДокумента.КурсДокумента,
			СтруктураКурсаВалютыЗаказа.Курс, 
			СтруктураШапкиДокумента.КратностьДокумента,
			СтруктураКурсаВалютыЗаказа.Кратность);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента)
	
	ТаблицаТоваров.Колонки.Добавить("СуммаРегл",        Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТоваров.Колонки.Добавить("ПроводкаСумма",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТоваров.Колонки.Добавить("ПроводкаСуммаНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	ЕстьСкладВТабличнойЧасти = (НЕ ТаблицаТоваров.Колонки.Найти("Склад") = Неопределено);
	Если ЕстьСкладВТабличнойЧасти Тогда
		ТаблицаТоваров.Колонки.Добавить("СкладПроводок", Новый описаниеТипов("СправочникСсылка.Склады"));
	КонецЕсли;
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, Дата);
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Если ЕстьСкладВТабличнойЧасти Тогда
			Если СтруктураШапкиДокумента.СкладВТабличнойЧасти Тогда
				Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
					СтрокаТаблицы.СкладПроводок = СтрокаТаблицы.Склад;
				ИначеЕсли СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
					// если склад в табличной части не заполнен - тогда переписываем его из ордера
					Если СтрокаТаблицы.Склад = Неопределено тогда
						СтрокаТаблицы.СкладПроводок = СтрокаТаблицы.ПриходныйОрдерСклад;
					Иначе
						СтрокаТаблицы.СкладПроводок = СтрокаТаблицы.Склад;
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
					СтрокаТаблицы.СкладПроводок = СтруктураШапкиДокумента.СкладОрдер;
				ИначеЕсли ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
					Если СтруктураШапкиДокумента.Свойство("СкладПриходногоОрдера") Тогда
						СтрокаТаблицы.СкладПроводок = СтруктураШапкиДокумента.СкладПриходногоОрдера;
					Иначе
						СтрокаТаблицы.СкладПроводок = СтруктураШапкиДокумента.СкладОрдер.Склад;	
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		
		НДС   = СтрокаТаблицы.НДС;
		Сумма = ?(СуммаВключаетНДС, СтрокаТаблицы.Стоимость - НДС, СтрокаТаблицы.Стоимость);
		
		Если СтруктураШапкиДокумента.ВалютаДокумента = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.ПроводкаСумма    = Сумма;
			СтрокаТаблицы.ПроводкаСуммаНДС = НДС;
		Иначе
			
			Если НЕ абс_РасчетРеглСуммыНДСОтРеглСуммыВсего Тогда
				СтрокаТаблицы.ПроводкаСумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Сумма, СтруктураШапкиДокумента.ВалютаДокумента,
				СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
				СтруктураШапкиДокумента.КурсДокумента,
				Данные.Курс, 
				СтруктураШапкиДокумента.КратностьДокумента,
				Данные.Кратность);
				СтрокаТаблицы.ПроводкаСуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(НДС, СтруктураШапкиДокумента.ВалютаДокумента,
				СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
				СтруктураШапкиДокумента.КурсДокумента,
				Данные.Курс, 
				СтруктураШапкиДокумента.КратностьДокумента,
				Данные.Кратность);
				
			Иначе
				СуммаВсего = Сумма + НДС;
				
				СуммаВсегоРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаВсего, СтруктураШапкиДокумента.ВалютаДокумента,
				СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
				СтруктураШапкиДокумента.КурсДокумента,
				Данные.Курс, 
				СтруктураШапкиДокумента.КратностьДокумента,
				Данные.Кратность);
				
				СтрокаТаблицы.ПроводкаСуммаНДС = УчетНДС.РассчитатьСуммуНДС(СуммаВсегоРегл,
				Истина, Истина,
				УчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС));
				
				СтрокаТаблицы.ПроводкаСумма = СуммаВсегоРегл - СтрокаТаблицы.ПроводкаСуммаНДС
			КонецЕсли;										 
		КонецЕсли;
		
		СтрокаТаблицы.СуммаРегл = СтрокаТаблицы.ПроводкаСумма + СтрокаТаблицы.ПроводкаСуммаНДС;  // Используется в процедурах отражения затрат
		
	КонецЦикла;
	
КонецПроцедуры // ПодготовитьТаблицуТоваровРегл()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента)
	
	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();
	
	// Переименуем колонку "Сумма" в "Стоимость" (как в регистрах).
	ТаблицаТары.Колонки.Сумма.Имя = "Стоимость";
	ТаблицаТары.Колонки.Добавить("ВестиПартионныйУчетПоСериям", Новый ОписаниеТипов("Булево"));
	ТаблицаТары.Колонки.Добавить("ХарактеристикаНоменклатуры",  Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТары.Колонки.Добавить("СерияНоменклатуры",           Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	// Порядок вызова в данном случае важен
	ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТары;
	
КонецФункции // ПодготовитьТаблицуТары()

Процедура ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента)
	
	ТаблицаТары.Колонки.Добавить("СуммаПродажная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТары, "Склад", "ВидСкладаРазмещения");
	Если ЕстьРозничныйСклад Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТары.ВыгрузитьКолонку("Склад"),
		ТаблицаТары.ВыгрузитьКолонку("Номенклатура")).Выгрузить();
		
		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТары, ТаблицаПоЦенам, "ВидСкладаРазмещения");
	КонецЕсли;
	
	ТаблицаТары.Колонки.Добавить("ЦенаВВалютеЗаказа"  , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаТары.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТары.Колонки.Добавить("СуммаУпр"           , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	// Надо рассчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл
		
		// Счиатем, что поступление выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			СтруктураШапкиДокумента.ВалютаЗаказа,
			СтруктураШапкиДокумента.КурсДокумента, 
			СтруктураШапкиДокумента.КурсЗаказа,
			СтруктураШапкиДокумента.КратностьДокумента, 
			СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;
		
		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента, 
		СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
		КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
		
		СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
		СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
		СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
		СтруктураШапкиДокумента.КратностьДокумента, 
		СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		
		// Суммы пересчитаем в валюту упр. учета. По таре считаем, что СуммаБезНДС = Сумма
		СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
		СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
		СтруктураШапкиДокумента.КурсДокумента,
		СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		СтруктураШапкиДокумента.КратностьДокумента,
		СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
		
		
	КонецЦикла;
	
КонецПроцедуры // ПодготовитьТаблицуТарыУпр()

Процедура ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента)
	
	ТаблицаТары.Колонки.Добавить("ПроводкаСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, Дата);
	
	// Надо рассчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл
		
		Если СтруктураШапкиДокумента.ВалютаВзаиморасчетов = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.ПроводкаСумма    = СтрокаТаблицы.Стоимость;
		Иначе
			СтрокаТаблицы.ПроводкаСумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, СтруктураШапкиДокумента.ВалютаВзаиморасчетов,
			СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
			СтруктураШапкиДокумента.КурсДокумента,
			Данные.Курс, 
			СтруктураШапкиДокумента.КратностьДокумента,
			Данные.Кратность);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПодготовитьТаблицуТарыРегл()

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруОбязательныхПолейШапкиУпр(СтруктураОбязательныхПолей, СтруктураШапкиДокумента)
	
	// Если установлен призник "Обновлять цены поставщиков при поступлении товаров",
	// то надо обязательно указывать тип цен
	Если РегистрироватьЦеныПоставщика И СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("ТипЦен", "Для обновления цен поставщиков необходимо указывать тип цен!");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруОбязательныхПолейШапкиРегл(СтруктураОбязательныхПолей, СтруктураШапкиДокумента)
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если НЕ (ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
			И СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
			И (ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку) 
			Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоАвансам");
		КонецЕсли;
		
		Если ВозвратнаяТара.Количество() > 0 Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоТаре");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверки,которые нужны только для регл. учета
Процедура ПроверитьЗаполнениеШапкиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	СтруктураОбязательныхПолей = Новый Структура();
	ДополнитьСтруктуруОбязательныхПолейШапкиРегл(СтруктураОбязательныхПолей, СтруктураШапкиДокумента);
	ОбщегоНазначенияКлиентСервер.ПроверитьЗаполнениеВычисляемыхРеквизитовШапки(ЭтотОбъект, СтруктураОбязательныхПолей, СтруктураШапкиДокумента, Отказ, Заголовок);
КонецПроцедуры



//АБС 36815
// Выполняет проверки,заполненности реквизитов ТТК (ЗЗ, Статус)
Процедура ПроверитьЗаполнениеШапкиТТК(СтруктураШапкиДокумента, Отказ, Заголовок)
	//Сторчевой А.Н. НФС 2018 { Закомментировано
	//Если СтруктураШапкиДокумента.ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветХранение
	//	И СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.Пустая() Тогда
	//	Отказ = истина;
	//	ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен Закупочный Заказ!", Отказ, Заголовок);
	//КонецЕсли;
	//} Сторчевой А.Н. НФС 2018
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.абс_ДатаПоставки) Тогда
		Отказ = Истина;
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнена дата поставки!", Отказ, Заголовок);
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветХранение
		И НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Подразделение) Тогда
		Отказ = Истина;
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено подразделение (ЦФО)!", Отказ, Заголовок);
	КонецЕсли;
	
	//Если Дата >= '20111001000000' И НЕ абс_ЗакупочныйЗаказ.НефиксированнаяСумма И НЕ абс_ЗакупочныйЗаказ.УбыткиПрошлыхЛет Тогда
	//	Если НЕ НачалоМесяца(Дата) = НачалоМесяца(абс_ДатаПоставки) Тогда
	//		ttk_ОбщегоНазначения.СообщитьОбОшибке("Дата поставки должна быть в том же месяце что и дата документа.", Отказ, заголовок);
	//	КонецЕсли;
	//КонецЕсли;
	
	абс_ИсключитьДатуИзГрафикаПоставок = Константы.абс_ИсключитьДатуИзГрафикаПоставок.Получить();
	Если ЗначениеЗаполнено(абс_ИсключитьДатуИзГрафикаПоставок) и НачалоДня(Дата) = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок) Тогда
		врДатаПоставки = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок)-1;
	Иначе
		врДатаПоставки = Дата;
	КонецЕсли;		
	
	//Сторчевой А.Н. НФС 2018 {Если ЗначениеЗаполнено( СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ) Тогда                                  
	//Сторчевой А.Н. 77273560 13.02.2018 {закомментировано
	//Если СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.УбыткиПрошлыхЛет Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Если СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.РасходыБудущихПериодов Тогда
	//	Возврат;
	//КонецЕсли;
	// } Сторчевой А.Н. 77273560 13.02.2018
	// АБС Фролов 20120509
	// Для организаций ДЗО
	// для поставок по ЗЗ с нефиксированной суммой:
	// 1. не контролируем график поставок
	// 2. производим списание лимитов документом поставки при их наличии
	// 3. при отсутствии лимита не проводим документ
	
	КонтрольЛимитовНефиксЗЗвПОставке = (ПараметрыСеанса.абс_ПользовательДЗО 
	или Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.ДЗО
	или Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.Филиал)
	//АБС ВСТАВКА №35063,000023920 НАЧАЛО
	и глЗначениеПеременной("абс_СписаниеИКонтрольЛимитовПоСхемеГоловнойКомпании") > СтруктураШапкиДокумента.Дата
	//\\АБС ВСТАВКА №35063 КОНЕЦ
	;
	
	
	Если мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <> '00010101'  
		и мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <= СтруктураШапкиДокумента.Дата Тогда
		//ххх Брель Виктор Андреевич 03.04.2018 12:30:41, заявка <<<            		
		Запрос = Новый Запрос;
		//Если абс_ЗакупочныеЗаказы.Количество() > 0 Тогда
		//	// Start КТТК Ермолов Е.Л.  06.11.2015 Контроль лимитов 4 квартал
		//	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//	//			   |	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ КАК ЗакупочныйЗаказ,
		//	//			   |	ЕСТЬNULL(ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_СуммаБезНДС, 0) КАК СуммаИзДокумента,
		//	//			   |	ВЫБОР
		//	//			   |		КОГДА ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.НефиксированнаяСумма
		//	//			   |			ТОГДА ЕСТЬNULL(ГрафикПоставкиЗакупочногоЗаказаОстатки_Общий.СуммаОстаток, 0)
		//	//			   |		ИНАЧЕ ЕСТЬNULL(ГрафикПоставкиЗакупочногоЗаказаОстатки_ПоПериоду.СуммаОстаток, 0)
		//	//			   |	КОНЕЦ КАК Остаток,
		//	//			   |	абс_СписокСтатейБезКонтроляЛимита.СтатьяОборотовПоБюджетам
		//	//			   |ИЗ
		//	//			   |	Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы
		//	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(, ЗакупочныйЗаказ В (&СписокЗакупочныхЗаказов)) КАК ГрафикПоставкиЗакупочногоЗаказаОстатки_Общий
		//	//			   |		ПО ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = ГрафикПоставкиЗакупочногоЗаказаОстатки_Общий.ЗакупочныйЗаказ
		//	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(
		//	//			   |				,
		//	//			   |				ЗакупочныйЗаказ В (&СписокЗакупочныхЗаказов)
		//	//			   |					И ПериодПоставки = &ПериодПоставки) КАК ГрафикПоставкиЗакупочногоЗаказаОстатки_ПоПериоду
		//	//			   |		ПО ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = ГрафикПоставкиЗакупочногоЗаказаОстатки_ПоПериоду.ЗакупочныйЗаказ
		//	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СписокСтатейБезКонтроляЛимита КАК абс_СписокСтатейБезКонтроляЛимита
		//	//			   |		ПО ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.БюджетнаяСтатья = абс_СписокСтатейБезКонтроляЛимита.СтатьяОборотовПоБюджетам
		//	//			   |ГДЕ
		//	//			   |	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = &Ссылка
		//	//			   |	И ВЫБОР
		//	//			   |			КОГДА &ОтборПоГоловной
		//	//			   |					И ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.НефиксированнаяСумма
		//	//			   |				ТОГДА ЕСТЬNULL(абс_СписокСтатейБезКонтроляЛимита.СтатьяОборотовПоБюджетам, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		//	//			   |			ИНАЧЕ ИСТИНА
		//	//			   |		КОНЕЦ";
		//	 Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//	 |	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ КАК ЗакупочныйЗаказ,
		//	 |	ЕСТЬNULL(ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_СуммаБезНДС, 0) КАК СуммаИзДокумента,
		//	 |	ВЫБОР
		//	 |		КОГДА ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.НефиксированнаяСумма
		//	 |			ТОГДА ЕСТЬNULL(ГрафикПоставкиЗакупочногоЗаказаОстатки_Общий.СуммаОстаток, 0)
		//	 |		ИНАЧЕ ЕСТЬNULL(ГрафикПоставкиЗакупочногоЗаказаОстатки_ПоПериоду.СуммаОстаток, 0)
		//	 |	КОНЕЦ КАК Остаток,
		//	 |	абс_СписокСтатейБезКонтроляЛимита.СтатьяОборотовПоБюджетам
		//	 |ИЗ
		//	 |	Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы
		//	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(, ЗакупочныйЗаказ В (&СписокЗакупочныхЗаказов)) КАК ГрафикПоставкиЗакупочногоЗаказаОстатки_Общий
		//	 |		ПО ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = ГрафикПоставкиЗакупочногоЗаказаОстатки_Общий.ЗакупочныйЗаказ
		//	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(
		//	 |				,
		//	 |				ЗакупочныйЗаказ В (&СписокЗакупочныхЗаказов)
		//	 |					И ПериодПоставки = &ПериодПоставки) КАК ГрафикПоставкиЗакупочногоЗаказаОстатки_ПоПериоду
		//	 |		ПО ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = ГрафикПоставкиЗакупочногоЗаказаОстатки_ПоПериоду.ЗакупочныйЗаказ
		//	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СписокСтатейБезКонтроляЛимита КАК абс_СписокСтатейБезКонтроляЛимита
		//	 |		ПО ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.БюджетнаяСтатья = абс_СписокСтатейБезКонтроляЛимита.СтатьяОборотовПоБюджетам
		//	 |			И (ВЫБОР
		//	 |				КОГДА ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.Организация = &KTTK
		//	 |					ТОГДА ИСТИНА
		//	 |				ИНАЧЕ ЛОЖЬ
		//	 |			КОНЕЦ = абс_СписокСтатейБезКонтроляЛимита.ТолькоДляКТТК)
		//	 |ГДЕ
		//	 |	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = &Ссылка
		//	 |	И ВЫБОР
		//	 |			КОГДА &ОтборПоГоловной
		//	 |					И ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.НефиксированнаяСумма
		//	 |				ТОГДА ЕСТЬNULL(абс_СписокСтатейБезКонтроляЛимита.СтатьяОборотовПоБюджетам, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		//	 |			ИНАЧЕ ИСТИНА
		//	 |		КОНЕЦ";
		//	Запрос.УстановитьПараметр("KTTK", Справочники.Организации.НайтиПоКоду("000000001"));
		//	// Stop КТТК Ермолов Е.Л.  06.11.2015
		//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		////	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Дата,ВидГраницы.Исключая));
		//	Запрос.УстановитьПараметр("СписокЗакупочныхЗаказов", абс_ЗакупочныеЗаказы.ВыгрузитьКолонку("абс_ЗакупочныйЗаказТЧ"));
		//	Запрос.УстановитьПараметр("ПериодПоставки", НачалоМесяца(врДатаПоставки));
		//	Запрос.УстановитьПараметр("ОтборПоГоловной", Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.ГоловнаяОрганизация 
		//													//АБС ВСТАВКА №35063,000023920 НАЧАЛО
		//													или (глЗначениеПеременной("абс_СписаниеИКонтрольЛимитовПоСхемеГоловнойКомпании") <= СтруктураШапкиДокумента.Дата 
		//														и ЗначениеЗаполнено(глЗначениеПеременной("абс_СписаниеИКонтрольЛимитовПоСхемеГоловнойКомпании")))
		//													//\\АБС ВСТАВКА №35063 КОНЕЦ
		//													);
		//Иначе
		//	
		//	Если абс_ЗакупочныйЗаказ.НефиксированнаяСумма Тогда
		//		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ЗакупочныйЗаказ КАК ЗакупочныйЗаказ,
		//		               |	&СуммаДокумента КАК СуммаИзДокумента,
		//		               |	ЕСТЬNULL(абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.СуммаОстаток, 0) КАК Остаток
		//		               |ИЗ
		//		               |	РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(, ЗакупочныйЗаказ = &ЗакупочныйЗаказ) КАК абс_ГрафикПоставкиЗакупочногоЗаказаОстатки";
		//	Иначе
		//		
		//		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ЗакупочныйЗаказ КАК ЗакупочныйЗаказ,
		//		|	&СуммаДокумента КАК СуммаИзДокумента,
		//		|	ЕСТЬNULL(абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.СуммаОстаток, 0) КАК Остаток
		//		|ИЗ
		//		|	РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(
		//		|			,
		//		|			ЗакупочныйЗаказ = &ЗакупочныйЗаказ
		//		|				И ПериодПоставки = &ПериодПоставки) КАК абс_ГрафикПоставкиЗакупочногоЗаказаОстатки";
		//	КонецЕсли;
		//	
		//	
		//	Запрос.УстановитьПараметр("ЗакупочныйЗаказ", абс_ЗакупочныйЗаказ);
		//	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(врДатаПоставки,ВидГраницы.Исключая));
		//	Запрос.УстановитьПараметр("СуммаДокумента", УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект) - УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект));    
		//	Запрос.УстановитьПараметр("ПериодПоставки", НачалоМесяца(врДатаПоставки));
		//КонецЕсли;
		
		Запрос.Текст = ПолучитьТекстЗапроса();
		Запрос.УстановитьПараметр("Дата", Неопределено);
		Запрос.УстановитьПараметр("ПериодПоставки", НачалоМесяца(врДатаПоставки));
		Если НачалоМесяца(Дата)<>Дата("20180101") Тогда
			ПериодПоставкиВХ = НачалоМесяца(?(НачалоМесяца(ДатаВходящегоДокумента)<Дата("20180101"),Дата("20180201"),НачалоМесяца(ДатаВходящегоДокумента)));
		ИначеЕсли НачалоМесяца(Дата)=Дата("20180101") Тогда
			ПериодПоставкиВХ = Дата("20180101");
		Иначе
			ПериодПоставкиВХ  = НачалоМесяца(Дата); 
		КонецЕсли;	
		Запрос.УстановитьПараметр("ПериодПоставкиВХ", ПериодПоставкиВХ);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ТЗДвиженияПоГрафикуПоставок = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Выгрузить();
		ТЗДвиженияПоГрафикуПоставок.Очистить();
		ТЗДвиженияПоГрафикуПоставок.Колонки.Удалить("Активность");
		ТЗДвиженияПоГрафикуПоставок.Колонки.Добавить("ttk_УсловноеНачисление");
		ТЗДвиженияПоГрафикуПоставок.Колонки.Добавить("СуммаВал");
		// Брель Виктор Андреевич 03.04.2018 12:30:41 >>>
		
		СтруктураШапкиДокумента.Вставить("ТЗДвиженияПоГрафикуПоставок", ТЗДвиженияПоГрафикуПоставок);
		// } Сторчевой А.Н. 05.12.2017 НФС 2018
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		ТекстСообщения = "";
		ЕстОшибки = Ложь;
		
		//ххх Брель Виктор Андреевич 12.04.2018 13:13:53, заявка <<<
		
		Если НЕ ( абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка
			ИЛИ   абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ 
			ИЛИ  абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена) Тогда
			
			// Брель Виктор Андреевич 12.04.2018 13:13:53 >>>


		Если Выборка.Количество() = 0 Тогда

			Если абс_ЗакупочныйЗаказ.НефиксированнаяСумма //НФС 2018И КонтрольЛимитовНефиксЗЗвПОставке 
				Тогда					
				Если НЕ КонтрольЛимитов(УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект) - УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект),абс_ЗакупочныйЗаказ) Тогда
					Отказ = истина;
					ТекстСообщения = "Сумма по документу " + абс_ЗакупочныйЗаказ + " превышает лимит!";
				КонецЕсли;
			Иначе
				
				//// {{ТТК Лапин А. Заявка Обнуление лимитов 27.10.2015 начало
				// Правки Ермолова...  отменяю 
				
				//// Ермолов 13.10.2015 +
				////Если НЕ (абс_ЗакупочныйЗаказ.НефиксированнаяСумма и абс_Бюджетирование.ПоСтатьеРазрешеноПревышениеБюджета(абс_ЗакупочныйЗаказ.БюджетнаяСтатья)) Тогда // Ермолов 13.10.2015
				//Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) и  ТипЗнч(ЭтотОбъект.Сделка) = Тип("ДокументСсылка.абс_СчетНаОплату") Тогда 
				//	СуммаПоСчету = ЭтотОбъект.Сделка.СуммаПлатежа;
				//	//УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект.Сделка) - УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект.Сделка);	
				//Иначе
				//	СуммаПоСчету = 0;
				//КонецЕсли;
				//СуммаЛимита = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект) - УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект) - СуммаПоСчету; 
				//Если НЕ (абс_ЗакупочныйЗаказ.НефиксированнаяСумма и КонтрольЛимитов(СуммаЛимита  ,абс_ЗакупочныйЗаказ)) Тогда // Ермолов 13.10.2015
				
				//	Если НЕ (абс_ЗакупочныйЗаказ.НефиксированнаяСумма и абс_Бюджетирование.ПоСтатьеРазрешеноПревышениеБюджета(абс_ЗакупочныйЗаказ.БюджетнаяСтатья)) Тогда // Ермолов 13.10.2015 Лапин 27.10.2015
				Если НЕ (абс_ЗакупочныйЗаказ.НефиксированнаяСумма и абс_Бюджетирование.ПоСтатьеРазрешеноПревышениеБюджета(абс_ЗакупочныйЗаказ.БюджетнаяСтатья, Организация)) Тогда 
					// }}ТТК Лапин А. Заявка № Обнуление лимитов 27.10.2015 окончание	
					Отказ = истина;
					//ТекстСообщения = "Сумма по документу " + абс_ЗакупочныйЗаказ + " превышает лимит!";  // Ермолов 13.10.2015
					ТекстСообщения = "Сумма по документу " + абс_ЗакупочныйЗаказ + " превышает сумму по графику поставок!";
				КонецЕсли;
				//// Ермолов 13.10.2015 - // }}ТТК Лапин А. Обнуление лимитов 27.10.2015 
				
			КонецЕсли;
			
		Иначе   				    	
			
			Пока Выборка.Следующий() Цикл
				//Сторчевой А.Н. НФС 2018 {
				Если НЕ Выборка.ЗакупочныйЗаказ.УбыткиПрошлыхЛет И НЕ Выборка.ЗакупочныйЗаказ.РасходыБудущихПериодов Тогда 
					
					НоваяСтрока = ТЗДвиженияПоГрафикуПоставок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.ПериодПоставки = НачалоМесяца(врДатаПоставки);
					// } Сторчевой А.Н. НФС 2018
					Если Выборка.ЗакупочныйЗаказ.НефиксированнаяСумма //НФС 2018И КонтрольЛимитовНефиксЗЗвПОставке 
						Тогда
						
						//Если Не КонтрольЛимитов(Выборка.СуммаИзДокумента,Выборка.ЗакупочныйЗаказ) Тогда
						ТекВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
						ТекКурс = ?(ВалютаДокумента <> ТекВалютаВзаиморасчетов, МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, врДатаПоставки).Курс, КурсВзаиморасчетов);
						//Сторчевой А.Н. НФС 2018 {Если Не КонтрольЛимитов(Выборка.СуммаИзДокумента*ТекКурс,Выборка.ЗакупочныйЗаказ) Тогда	  //АБС Коломиец 12392
						СтруктураАналитик = НОВЫЙ Структура;
						СтруктураАналитик.Вставить("Организация",Выборка.ЗакупочныйЗаказ.Организация);
						СтруктураАналитик.Вставить("абс_ЦФУ", Выборка.абс_ЦФУ);
						СтруктураАналитик.Вставить("ЦФО", Выборка.ЗакупочныйЗаказ.ЦФО);
						СтруктураАналитик.Вставить("абс_ТипРасхода", Выборка.ЗакупочныйЗаказ.ТипРасхода);
						СтруктураАналитик.Вставить("абс_ТипКонтрагента", Выборка.ЗакупочныйЗаказ.ТипКонтрагента);
						СтруктураАналитик.Вставить("абс_КВ", Выборка.абс_КВ);
						СтруктураАналитик.Вставить("абс_ТЭО", Выборка.абс_ТЭО);
						СтруктураАналитик.Вставить("СтатьяОборотов", Выборка.СтатьяОборотов);
						//ххх Брель Виктор Андреевич 26.07.2018 13:42:14, заявка <<<
						//СтруктураАналитик.Вставить("абс_ТипСети", Выборка.абс_ТипСети);
						// Брель Виктор Андреевич 26.07.2018 13:42:14 >>>
						СтруктураАналитик.Вставить("ttk_ОбъектБюджетирования", Выборка.ttk_ОбъектБюджетирования);
						
						НоваяСтрока.Сумма = Выборка.СуммаИзДокумента*ТекКурс;
						НоваяСтрока.СуммаВал =?(мВалютаРегламентированногоУчета <> ТекВалютаВзаиморасчетов,Выборка.СуммаИзДокумента,0);
						Если Не КонтрольЛимитов(Выборка.СуммаИзДокумента*ТекКурс, СтруктураАналитик) Тогда
							// } Сторчевой А.Н. НФС 2018
							
							//ххх Брель Виктор Андреевич 06.04.2018 14:24:06, заявка <<<
							// Контроль лимитов
							// Только Нефиксированная Сумма
							ЕстОшибки  = Истина;
							Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Или   абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером   Тогда
								Отказ = истина;
							КонецЕсли;
							// Брель Виктор Андреевич 06.04.2018 14:24:06 >>>
							ТекстСообщения = ТекстСообщения + "Сумма по документу " + Выборка.ЗакупочныйЗаказ + " превышает лимит!";
							//Сторчевой А.Н. 05.12.2017 НФС 2018 {
							ТекстСообщения = ТекстСообщения + "По аналитикам:" + "
							| Статья оборотов - " +  СтруктураАналитик.СтатьяОборотов + " Код: "+  ?(ЗначениеЗаполнено(СтруктураАналитик.СтатьяОборотов),СтруктураАналитик.СтатьяОборотов.Код,"") +"
							//| Тип сети - " +  СтруктураАналитик.абс_ТипСети + "
							| КВ и ТЗ - " +  СтруктураАналитик.абс_КВ + "
							| ТЭО - " +  СтруктураАналитик.абс_ТЭО + "
							| ЦФУ - " +  СтруктураАналитик.абс_ЦФУ + "
							| Объект бюджетирования - " +  СтруктураАналитик.ttk_ОбъектБюджетирования + "
							| Тип контрагента: "    + СтруктураАналитик.абс_ТипКонтрагента + Символы.ПС;
						КонецЕсли;
						
					Иначе
						//Задача 19053
						Разница = Выборка.Остаток - Выборка.СуммаИзДокумента;
						ТекВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
						ТекКурс = ?(ВалютаДокумента <> ТекВалютаВзаиморасчетов, МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, врДатаПоставки).Курс, КурсВзаиморасчетов);
						НоваяСтрока.Сумма = Мин(Выборка.Остаток, Выборка.СуммаИзДокумента)*ТекКурс;
						НоваяСтрока.СуммаВал =?(мВалютаРегламентированногоУчета <> ТекВалютаВзаиморасчетов,Мин(Выборка.Остаток, Выборка.СуммаИзДокумента),0);
						Если Разница < -1 Тогда
							//ххх Брель Виктор Андреевич 06.04.2018 14:24:06, заявка <<<
							// Контроль графика 
							// Только фиксированная сумма
							ЕстОшибки  = Истина;
							Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Или   абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером   Тогда
								Отказ = истина;
							КонецЕсли;
							// Брель Виктор Андреевич 06.04.2018 14:24:06 >>>
							
							
							ТекстСообщения = ТекстСообщения + "Сумма по документу " + Выборка.ЗакупочныйЗаказ + " превышает сумму по графику поставок на "+(Выборка.СуммаИзДокумента - Выборка.Остаток)+" !" + Символы.ПС;
							//Сторчевой А.Н. 05.12.2017 НФС 2018 {
							ТекстСообщения = ТекстСообщения + "По аналитикам:" + "
							| Статья оборотов - " + Выборка.СтатьяОборотов + "
							//| Тип сети - " + Выборка.абс_ТипСети + "
							| КВ и ТЗ - " + Выборка.абс_КВ + "
							| ТЭО - " + Выборка.абс_ТЭО + "
							| ЦФУ - " + Выборка.абс_ЦФУ + "
							| Объект бюджетирования - " + Выборка.ttk_ОбъектБюджетирования + Символы.ПС;
						КонецЕсли;
					КонецЕсли;
					//Сторчевой А.Н. 05.12.2017 НФС 2018 {
				КонецЕсли;
				// } Сторчевой А.Н. 05.12.2017 НФС 2018
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

		
		Если Отказ Или ЕстОшибки Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
		
		
	Иначе
		
		// АБС ВСТАВКА Фролов 1455
		Если СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.НефиксированнаяСумма Тогда
			Возврат;
		КонецЕсли;
		// АБС ВСТАВКА Фролов 1455 КОНЕЦ
		
		Запрос = Новый Запрос;
		
		Если СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.НефиксированнаяСумма Тогда 
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НАЧАЛОПЕРИОДА(абс_СчетНаОплату.ПериодПлатежа, МЕСЯЦ) КАК Период,
			|	СУММА(абс_СчетНаОплату.ВалютнаяСумма) КАК СуммаСНДС
			|ИЗ
			|	Документ.абс_СчетНаОплату КАК абс_СчетНаОплату
			|ГДЕ
			|	абс_СчетНаОплату.Проведен = ИСТИНА
			|	И абс_СчетНаОплату.ЗакупочныйЗаказ = &Ссылка
			|	И НАЧАЛОПЕРИОДА(абс_СчетНаОплату.ПериодПлатежа, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&дата, МЕСЯЦ)
			|
			|СГРУППИРОВАТЬ ПО
			|	НАЧАЛОПЕРИОДА(абс_СчетНаОплату.ПериодПлатежа, МЕСЯЦ)";
			
		Иначе
			
			Запрос.Текст=
			"ВЫБРАТЬ
			|	абс_ЗакупочныйЗаказГрафикПоставок.Период, ";
			
			// АБС ВСТАВКА Пополитов 4233 НАЧАЛО
			ДатаФункционала = Константы.абс_ДатаНовогоФункционалаДляЗакупочныхЗаказов.Получить();
			Если ДатаФункционала <> '00010101' Тогда 
				//и ДатаФункционала <= СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.Дата 
				Запрос.Текст=Запрос.Текст+"
				|	СУММА(ЕСТЬNULL(абс_ЗакупочныйЗаказГрафикПоставок.ВалютнаяСуммаБезНДС, 0)) КАК СуммаСНДС";
			Иначе
				Запрос.Текст=Запрос.Текст+"
				|	СУММА(ЕСТЬNULL(абс_ЗакупочныйЗаказГрафикПоставок.ВалютнаяСуммаСНДС, 0)) КАК СуммаСНДС";
			КонецЕсли;
			Запрос.Текст=Запрос.Текст+"
			// АБС ВСТАВКА Пополитов 4233 КОНЕЦ
			
			|ИЗ
			|	Документ.абс_ЗакупочныйЗаказ.ГрафикПоставок КАК абс_ЗакупочныйЗаказГрафикПоставок
			|ГДЕ
			|	абс_ЗакупочныйЗаказГрафикПоставок.Ссылка = &Ссылка
			|	И НАЧАЛОПЕРИОДА(абс_ЗакупочныйЗаказГрафикПоставок.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
			|
			|СГРУППИРОВАТЬ ПО
			|	абс_ЗакупочныйЗаказГрафикПоставок.Период";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Дата"	,СтруктураШапкиДокумента.абс_ДатаПоставки);
		Запрос.УстановитьПараметр("Ссылка"	,СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ);
		
		ЗапросПоСформированнымПоставкам = Новый Запрос(
		"ВЫБРАТЬ
		|	СУММА(ПоДокументам.СуммаДокумента) КАК СуммаДокумента,
		|	ПоДокументам.Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(ПоступлениеТоваровУслуг.СуммаДокумента, 0) - ЕСТЬNULL(ПоступлениеТоваровУслуг.абс_СуммаНДС, 0) КАК СуммаДокумента,
		|		НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.абс_ДатаПоставки, МЕСЯЦ) КАК Период
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.абс_ДатаПоставки, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
		|		И ПоступлениеТоваровУслуг.ОтражатьВУправленческомУчете = ИСТИНА
		|		И ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ = &Ссылка
		|		И (НЕ ПоступлениеТоваровУслуг.Ссылка = &ТекДокумент)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АвансовыйОтчет.абс_СуммаДокументаБезНоменклатурыБезДвижений,
		|		НАЧАЛОПЕРИОДА(АвансовыйОтчет.абс_ДатаПоставки, МЕСЯЦ)
		|	ИЗ
		|		Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(АвансовыйОтчет.абс_ДатаПоставки, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|		И АвансовыйОтчет.Проведен = ИСТИНА
		|		И АвансовыйОтчет.ОтражатьВУправленческомУчете = ИСТИНА
		|		И АвансовыйОтчет.абс_ЗакупочныйЗаказ = &Ссылка
		|		И (НЕ АвансовыйОтчет.Ссылка = &ТекДокумент)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЕСТЬNULL(ПоступлениеДопРасходов.СуммаДокумента, 0) - ЕСТЬNULL(ПоступлениеДопРасходов.абс_СуммаНДС, 0),
		|		НАЧАЛОПЕРИОДА(ПоступлениеДопРасходов.абс_ДатаПоставки, МЕСЯЦ)
		|	ИЗ
		|		Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(ПоступлениеДопРасходов.абс_ДатаПоставки, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|		И ПоступлениеДопРасходов.Проведен = ИСТИНА
		|		И ПоступлениеДопРасходов.ОтражатьВУправленческомУчете = ИСТИНА
		|		И ПоступлениеДопРасходов.абс_ЗакупочныйЗаказ = &Ссылка
		|		И (НЕ ПоступлениеДопРасходов.Ссылка = &ТекДокумент)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-ЕСТЬNULL(ВЫБОР
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеТоваровУслуг).СуммаДокумента - ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеТоваровУслуг).абс_СуммаНДС
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.АвансовыйОтчет
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.АвансовыйОтчет).абс_СуммаДокументаБезНДСБезНоменклатурыБезДвижений
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.ПоступлениеДопРасходов
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеДопРасходов).СуммаДокумента - ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеДопРасходов).абс_СуммаНДС
		|			КОНЕЦ, 0),
		|		НАЧАЛОПЕРИОДА(ВЫБОР
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеТоваровУслуг).Дата
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.АвансовыйОтчет
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.АвансовыйОтчет).Дата
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.ПоступлениеДопРасходов
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеДопРасходов).Дата
		|			КОНЕЦ, МЕСЯЦ)
		|	ИЗ
		|		Документ.КорректировкаЗаписейРегистров.ЗаполнениеДвижений КАК КорректировкаЗаписейРегистровЗаполнениеДвижений
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеТоваровУслуг).абс_ЗакупочныйЗаказ
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.АвансовыйОтчет
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.АвансовыйОтчет).абс_ЗакупочныйЗаказ
		|				КОГДА КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ ССЫЛКА Документ.ПоступлениеДопРасходов
		|					ТОГДА ВЫРАЗИТЬ(КорректировкаЗаписейРегистровЗаполнениеДвижений.Документ КАК Документ.ПоступлениеДопРасходов).абс_ЗакупочныйЗаказ
		|			КОНЕЦ = &Ссылка
		|		И (НЕ КорректировкаЗаписейРегистровЗаполнениеДвижений.Ссылка.ПометкаУдаления)) КАК ПоДокументам
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоДокументам.Период");
		
		ЗапросПоСформированнымПоставкам.УстановитьПараметр("Дата"	, СтруктураШапкиДокумента.абс_ДатаПоставки);
		ЗапросПоСформированнымПоставкам.УстановитьПараметр("Ссылка"	, СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ); 
		ЗапросПоСформированнымПоставкам.УстановитьПараметр("ТекДокумент", СтруктураШапкиДокумента.Ссылка);
		
		ВыборкаСформированныхПоставок = ЗапросПоСформированнымПоставкам.Выполнить().Выбрать();
		
		СуммаСформированныхПоставок = 0;
		
		Если ВыборкаСформированныхПоставок.Следующий() Тогда
			СуммаСформированныхПоставок = ВыборкаСформированныхПоставок.СуммаДокумента;
		КонецЕсли;
		
		ТекстСообщения = "";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			//Проверяем что сумма поступления <=сумме по графику
			//впоследствии в запрос нужно встроить контроль с учетом ранее отраженных документов
			
			// АБС ВСТАВКА Пополитов 4233 НАЧАЛО
			СуммаДокументаИтог = Окр(СтруктураШапкиДокумента.СуммаДокумента - УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект));	
			//\\ АБС ВСТАВКА Пополитов 4233 КОНЕЦ
			
			Если Окр(Выборка.СуммаСНДС - СуммаСформированныхПоставок + 0.5) < СуммаДокументаИтог Тогда
				Отказ = истина; 
				ТекстСообщения = "Сумма документа превышает сумму по графику поставок!";
				
				//ttk_ОбщегоНазначения.СообщитьОбОшибке( "Сумма документа превышает сумму по графику поставок!", Отказ, Заголовок);
			КонецЕсли;
		Иначе
			Отказ = истина;
			ТекстСообщения = "Не заполнен график поставок Закупочного Заказа на дату документа.";
			//ttk_ОбщегоНазначения.СообщитьОбОшибке( "Не заполнен график поставок Закупочного Заказа на дату документа", Отказ, Заголовок);
		КонецЕсли;
		
		Если Отказ И абс_ЗакупочныйЗаказ.НефиксированнаяСумма Тогда
			
			ТекстСообщения = ТекстСообщения + " Для заказов с нефиксированной суммой график поставок формируется по счетам.";
			
		КонецЕсли;
		
		Если Отказ Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЕсли;
	//Сторчевой А.Н. НФС 2018 { КонецЕсли; }
	
	
КонецПроцедуры
//\\АБС 36815

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура();
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
		И НЕ СтруктураШапкиДокумента.ЗаказВТабличнойЧасти Тогда
		СтруктураОбязательныхПолей.Вставить( "Сделка", 
		"Заполните поле ""Заказ покупателя""!");
	Иначе	
		// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
			И НЕ СтруктураШапкиДокумента.ЗаказВТабличнойЧасти Тогда
			СтруктураОбязательныхПолей.Вставить( "Сделка", 
			"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам (счетам)""! 
			|Заполните поле ""Заказ поставщику""!");
		ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			СтруктураОбязательныхПолей.Вставить( "Сделка", 
			"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам (счетам)""! 
			|Заполните поле ""Счет поставщика""!");
		КонецЕсли;
	КонецЕсли;
	
	ДополнитьСтруктуруОбязательныхПолейШапкиУпр(СтруктураОбязательныхПолей, СтруктураШапкиДокумента);
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеШапкиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	//АБС 56815
	ПроверитьЗаполнениеШапкиТТК(СтруктураШапкиДокумента, Отказ, Заголовок); 
	//\\АБС 56815 
	
	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок);
	
	Отказ = ОчиститьСкладПриВидеОперацииОборудование(Истина) ИЛИ Отказ;
	
	Если НЕ Отказ
		И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
		И СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке( "Документ с видом операции ""В переработку"" не должен отражаться в налоговом учете.", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ Отказ
		И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование
		И СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке( "Документ с видом операции ""Оборудование"" не может оформляться с видом поступления ""По ордеру"".", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Выполняет проверки,которые нужны только для упр. учета
Процедура ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Если склад указывается в ТЧ, то в шапке он может быть не заполнен или указан неправильно,
	// это ни на что не влияет, потому что при проведении используется склад в ТЧ.
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
		И Не СтруктураШапкиДокумента.СкладВТабличнойЧасти 
		И СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Документ не может осуществлять поступление на НТТ!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)
	ИмяТабличнойЧасти = "Товары";
	
	// Укажем, что надо проверить
	//Проверяем здесь, а не в ОбработкаПроверкиЗаполнения, т.к. эти реквизиты заполняются 
	//	в ПередЗаписью - после того как выполняется ОбработкаПроверкиЗаполнения
	СтруктураОбязательныхПолей = Новый Структура("Склад");
	
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;
	
	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(ВидОперации, ДоговорКонтрагента, "Поступление") Тогда
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику", "Не заполнено значение реквизита ""Заказ покупателя""!");
			
		Иначе	
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		СтруктураОбязательныхПолей.Вставить("Сумма");
	КонецЕсли;
	
	//АБС КОНТРОЛЬ "Коэффициент"
	СтруктураОбязательныхПолей.Вставить("Коэффициент");
	//\\АБС
	
	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей, СтруктураШапкиДокумента.ВидСклада);
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь НТТ быть не должно.
	УправлениеЗапасами.ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Проверка заполнения номера ГТД в серии
	УправлениеЗапасами.ПроверитьЧтоВСерииЗаполненНомерГТД(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "Товары", "ЗаказПоставщику", Отказ, Заголовок);
	
	// Проверка наличия продажных цен на приходуемый товар.
	УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ,
	Заголовок, "ВидСкладаРазмещения");
	
	УчетСерийныхНомеров.ПроверитьКоличествоСерийныхНомеровВДокументе(ЭтотОбъект, "Товары", Заголовок);
	
	//проверка наличия резервирования под заказ с обособленным учетом при поступлении по ордеру с правом продажи
	ПроверитьРезервИВидПоступления(ТаблицаПоТоварам, "Товары", Заголовок, Отказ);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

Процедура ПроверитьРезервИВидПоступления(Таб, ИмяТЧ, Заголовок, Отказ)
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		Для каждого Строка из Таб цикл
			Если НЕ ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда 
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Строка.ЗаказПокупателя)<>Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(Строка.НомерСтроки) +
			""" табличной части """ + ИмяТЧ + """: ";
			
			Если Строка.БезПраваПродажи=ложь И Строка.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "выбран заказ покупателя с обособленным учетом. "+
				"Резервировать под такие заказы можно только в случае, если приходный ордер без права продажи ", Отказ, Заголовок);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "Услуги";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Сумма");
	
	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(ВидОперации, ДоговорКонтрагента, "Поступление") Тогда
		СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
	КонецЕсли;
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей, СтруктураШапкиДокумента.ВидСклада);
	Иначе
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей);
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// АБС ИЗМЕНЕНО Фролов 
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		//ххх Брель Виктор Андреевич 27.04.2018 18:29:58, заявка <<<
		Если СтатусПоРегистру  = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка 
			И абс_Статус =  Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК  Тогда
			ПроверитьЗаполнениеТабличнойЧастиУслугиРегл(ТаблицаПоУслугам, Отказ, Заголовок);
		КонецЕсли;	  
		// Брель Виктор Андреевич 27.04.2018 18:29:58 >>>
	КонецЕсли;
	// АБС ИЗМЕНЕНО Фролов КОНЕЦ
	
	// Здесь товаров быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетТоваров(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);
	
	// Здесь комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);
	
	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "Услуги", "ЗаказПоставщику", Отказ, Заголовок);
	
	// Проверим соответствие подразделения и оранизации.
	УправлениеЗатратами.ПроверитьПодразделениеОрганизацииВСтрокахТабЧасти(ЭтотОбъект, ТаблицаПоУслугам, "Услуги",, Отказ, Заголовок);
	
	// Проверить обязательные поля для производственных статей затрат
	//АБС
	абс_ЕстьНГ = ТаблицаПоУслугам.Колонки.Найти("НоменклатурнаяГруппа")<>Неопределено; 
	//АБС
	Для Каждого СтрокаУслуг Из ТаблицаПоУслугам Цикл
		Если СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве
			ИЛИ СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы
			ИЛИ СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщехозяйственныеРасходы
			ИЛИ СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
				Если СтрокаУслуг.Подразделение.Пустая() Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("В строке номер """ + СтрокаУслуг.НомерСтроки + """ табличной части ""Услуги"": Не заполнено значение реквизита ""Подразделение""!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
				Если СтрокаУслуг.ПодразделениеОрганизации.Пустая() Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("В строке номер """ + СтрокаУслуг.НомерСтроки + """ табличной части ""Услуги"": Не заполнено значение реквизита ""Подразделение организации""!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//АБС корреткировка по номенклатурной группе, она не должна заполняться в регистрах Затраты для 44 и 26 счетов
		Если абс_ЕстьНГ Тогда
			Если ЗначениеЗаполнено(СтрокаУслуг.СчетЗатрат) 
				И (СтрокаУслуг.СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасходыНаПродажу) ИЛИ СтрокаУслуг.СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы)) 
				И ЗначениеЗаполнено(СтрокаУслуг.НоменклатурнаяГруппа) Тогда
				СтрокаУслуг.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
		//АБС корреткировка по номенклатурной группе, она не должна заполняться в регистрах Затраты для 44 и 26 счетов
		
		//Гущина С. вставка 21.04.2016  по заявке 7715734
		//+++
		Если СтрокаУслуг.ОбъектСтроительства.абс_ДатаЗакрытия<> Дата('00010101') тогда
			Если СтрокаУслуг.ОбъектСтроительства.абс_ДатаЗакрытия<= Дата тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("В строке номер """ + СтрокаУслуг.НомерСтроки + """ табличной части ""Услуги"": выбран закрытый объект строительства!Дата закрытия объекта должна быть больше даты документа или пустой (для любых изменений).", Отказ, Заголовок);
			Иначе 
				Сообщить("!!! В строке номер """ + СтрокаУслуг.НомерСтроки + """ табличной части ""Услуги"": выбран объект строительства установленной датой закрытия = "+ СтрокаУслуг.ОбъектСтроительства.абс_ДатаЗакрытия);
			КонецЕсли;	
		КонецЕсли;	
		//---	
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

// Выполняет проверки,которые нужны только для регл. учета
Процедура ПроверитьЗаполнениеТабличнойЧастиУслугиРегл(ТаблицаПоУслугам, Отказ, Заголовок)
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяЗатрат) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнены значения ""Статья затрат"" (строка № " + СтрокаТаблицы.НомерСтроки + " табличной части ""Услуги"")", Отказ, Заголовок);
		Иначе
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяЗатрат.ХарактерЗатрат) Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("В статье затрат """ + СтрокаТаблицы.СтатьяЗатрат + """ не указан вид расхода (строка № " + СтрокаТаблицы.НомерСтроки + " табличной части ""Услуги"")", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслугиРегл()

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "ВозвратнаяТара";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТара();
	
	// Склад в ТЧ всегда должен быть заполнен, иначе проведение будет неправильным.
	СтруктураОбязательныхПолей.Вставить("Склад");
	
	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(ВидОперации, ДоговорКонтрагента, "Поступление") Тогда
		СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей, СтруктураШапкиДокумента.ВидСклада);
	Иначе
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей);
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки заполнения.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара",СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Здесь НТТ быть не должно.
	УправлениеЗапасами.ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// По возвратной таре не должен вестись учет по характеристикам.
	УправлениеЗапасами.ПроверитьЧтоНетНоменклатурыСХарактеристиками(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);
	
	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "ВозвратнаяТара", "ЗаказПоставщику", Отказ, Заголовок);
	
	// Проверка наличия продажных цен на приходуемый товар.
	УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ,
	Заголовок, "ВидСкладаРазмещения");
	
	//проверка наличия резервирования под заказ с обособленным учетом при поступлении по ордеру с правом продажи
	ПроверитьРезервИВидПоступления(ТаблицаПоТаре, "Возвратная тара", Заголовок, Отказ);
	
	// Нельзя резервировать возвратную тару под заказ покупателя с обособленным учетом
	УправлениеЗаказами.ПроверитьРезервированиеТарыПодЗаказСОбособленнымУчетом(ЭтотОбъект,"Заказ", ложь, ,Отказ, Заголовок);													   
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

// Проверяет правильность заполнения строк табличной части "Оборудование".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОборудование(ТаблицаПоОборудованию, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТовары();
	
	// Склад в ТЧ всегда должен быть заполнен, иначе проведение будет неправильным.
	СтруктураОбязательныхПолей.Вставить("Склад");
	
	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(ВидОперации, ДоговорКонтрагента, "Поступление") Тогда
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику", "Не заполнено значение реквизита ""Заказ покупателя""!");
		Иначе
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Оборудование", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "Оборудование", "ЗаказПоставщику", Отказ, Заголовок);
	
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОборудование()

// Проверяет правильность заполнения строк табличной части "Оборудование".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОбъектыСтроительства(ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ОбъектСтроительства, СпособСтроительства, СтатьяЗатрат, Сумма");
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		Если НЕ НДСВключенВСтоимость Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаНУ");
		КонецЕсли;
		
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОбъектыСтроительства", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОбъектыСтроительства()

// Функция удаляет из исходной таблицы строки в которых сброшен флаг БезПраваПродажи
// Возвращается КОПИЯ исходной таблицы.
//
Функция УдалитьСтрокиБезПраваПродажи(ТабТовары)
	
	ТаблицаБезПраваПродажи = ТабТовары.Скопировать();
	
	// Сначала удалим из таблицы строки, по которым не надо списывать резерв.
	Сч = 0;
	Пока Сч < ТаблицаБезПраваПродажи.Количество() Цикл
		
		СтрокаТаблицы = ТаблицаБезПраваПродажи.Получить(Сч);
		Если Не СтрокаТаблицы.БезПраваПродажи Тогда
			ТаблицаБезПраваПродажи.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаБезПраваПродажи;
	
КонецФункции // УдалитьСтрокиБезПраваПродажи()

// Функция удаляет из исходной таблицы строки для которых не надо делать размещение под заказ
// Возвращается КОПИЯ исходной таблицы.
//
Функция УдалитьСтрокиНеТребующиеРазмещенияВЗаказе(ТабТовары)
	
	ТаблицаПоТоварамРазмещение = ТабТовары.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамРазмещение.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамРазмещение.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПоставщику) Тогда
			ТаблицаПоТоварамРазмещение.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПоТоварамРазмещение;
	
КонецФункции // УдалитьСтрокиНеТребующиеРазмещенияВЗаказе()

// Процедура удаляет строки из таблицы значений с пустым заказом или с внутренним заказом (по которым не надо делать резерв)
//
Процедура УдалитьСтрокиБезЗаказаДляРезерва(ТаблицаПоТоварамЗаказамПокупателей)
	
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамЗаказамПокупателей.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамЗаказамПокупателей.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
			ИЛИ (ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
			И  СтрокаТаблицы.ЗаказПокупателя.Заказчик = СтрокаТаблицы.Склад) Тогда             // Резерв в это случае делать не надо.
			ТаблицаПоТоварамЗаказамПокупателей.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьСтрокиБезЗаказаДляРезерва()

Процедура ОпределитьСделкуВСтрокахТаблицыЗначений(ТаблицыДанныхДокумента, ИмяТаблицы, ИмяКолонкиСделка, СтруктураШапкиДокумента)
	
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		//сделку надо очистить
		ТаблицыДанныхДокумента[ИмяТаблицы].ЗаполнитьЗначения(неопределено,ИмяКолонкиСделка);
	ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		//сделку надо взять из шапки документа
		ТаблицыДанныхДокумента[ИмяТаблицы].ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента),ИмяКолонкиСделка);
	КонецЕсли;
КонецПроцедуры

Процедура ДвиженияПоРегиструТоварыОрганизацийРегл(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВРегламентированномУчете Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		
		// Заполним таблицу движений.
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоТоварам, ТаблицаДвижений);
		
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
		ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
		
		Если Не СтруктураШапкиДокумента.ВестиУчетТоваровОрганизацийВРазрезеСкладов Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
		КонецЕсли;
		
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.ТоварыОрганизаций.ВыполнитьПриход();
		КонецЕсли;
		
	Иначе // По ордеру
		
		// По ордеру нужно сторнировать движения по товарам организаций,
		// если в ордере была указана не та организация.
		// Удалим строки, по которым не нужно делать движений (организации совпадают).
		КопияТаблицыТоваров = ТаблицаПоТоварам.Скопировать();
		КолвоЭлементовКоллекции = КопияТаблицыТоваров.Количество();
		Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
			ЭлементКоллекции = КопияТаблицыТоваров[КолвоЭлементовКоллекции - ОбратныйИндекс];
			Если ЭлементКоллекции.ОрганизацияДокументаПолучения = СтруктураШапкиДокумента.Организация Тогда
				КопияТаблицыТоваров.Удалить(ЭлементКоллекции);
			КонецЕсли;
		КонецЦикла;
		
		Если КопияТаблицыТоваров.Количество() > 0 Тогда // Есть что проводить.
			
			// Вначале сторнируем
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаДвижений.Очистить();
			
			// Заполним таблицу движений.
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(КопияТаблицыТоваров, ТаблицаДвижений);
			
			// Недостающие поля.
			ТаблицаДвижений.ЗагрузитьКолонку(КопияТаблицыТоваров.ВыгрузитьКолонку("ОрганизацияДокументаПолучения"), "Организация");
			ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
			
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.ТоварыОрганизаций.ВыполнитьРасход();
			КонецЕсли;
			
			// Теперь сделаем движения с правильной организацией.
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,"Организация");
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.ТоварыОрганизаций.ВыполнитьПриход();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	
	// ОБОРУДОВАНИЕ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	// Заполним таблицу движений.
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоОборудованию, ТаблицаДвижений);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	Если Не СтруктураШапкиДокумента.ВестиУчетТоваровОрганизацийВРазрезеСкладов Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегиструТоварыОрганизацийРегл()


// Проводит табличные части "Товары" и "Возвратная тара" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, ТаблицаПоУслугам, ТаблицаПоОбъектамСтроительства, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	// Определим код операции движений по регистру партий
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия Тогда
		Если СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеНаКомиссию;
		Иначе
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.Поступление;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеВПереработку;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеОборудования;
	Иначе
		КодОперацииПартииТоваров = Неопределено;
	КонецЕсли;
	
	// ТОВАРЫ, ТАРА И ОБОРУДОВАНИЕ ПО РЕГИСТРУ ТоварыНаСкладах.
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		
		ОтборСкладОптовый    = Новый Структура("ВидСкладаРазмещения", Перечисления.ВидыСкладов.Оптовый);
		ОтборСкладРозничный  = Новый Структура("ВидСкладаРазмещения", Перечисления.ВидыСкладов.Розничный);
		
		ТаблицаТоварыОпт     = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам, ОтборСкладОптовый  ).Выгрузить();
		//Бобылев А.А. 19.10.2018
		ТаблицаТоварыОпт.Колонки.СчетУчетаБУ.Имя = "СчетУчета";
		//Бобылев А.А. ----------
		ТаблицаТараОпт       = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТаре,    ОтборСкладОптовый  ).Выгрузить();
		ТаблицаТоварыРозница = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам, ОтборСкладРозничный).Выгрузить();
		//Бобылев А.А. 19.10.2018
		ТаблицаТоварыРозница.Колонки.СчетУчетаБУ.Имя = "СчетУчета";
		//Бобылев А.А. ----------
		ТаблицаТараРозница   = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТаре,    ОтборСкладРозничный).Выгрузить();
		//+ Машута А. 22.10.2018 задача 907
		// Так как движения заполняются не в явном виде, а через процедуры вида "ЗаполнитьЗначениеСвойств", то необходимо переименовать колонку
		// таблицы значений, что бы корректно заполнить таблицу движений согласно требованиям в задаче.
		ttk_ttk_ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоОборудованию, "СчетУчетаБУ", "СчетУчета");
		//- Машута А. 22.10.2018 задача 907
		
		СтруктТаблицДокументаОпт = Новый Структура;
		СтруктТаблицДокументаОпт.Вставить("ТаблицаПоТоварам",      ТаблицаТоварыОпт);
		СтруктТаблицДокументаОпт.Вставить("ТаблицаПоТаре",         ТаблицаТараОпт);
		СтруктТаблицДокументаОпт.Вставить("ТаблицаПоОборудованию", ТаблицаПоОборудованию);
		
		СтруктТаблицДокументаРозница = Новый Структура;
		СтруктТаблицДокументаРозница.Вставить("ТаблицаПоТоварам", ТаблицаТоварыРозница);
		СтруктТаблицДокументаРозница.Вставить("ТаблицаПоТаре",    ТаблицаТараРозница);
		
		ТаблицыДанныхДокументаОпт     = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыНаСкладах, СтруктТаблицДокументаОпт);
		ТаблицыДанныхДокументаРозница = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыВРознице, СтруктТаблицДокументаРозница);
		
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокументаОпт,     "Качество", Справочники.Качество.Новый);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокументаРозница, "Качество", Справочники.Качество.Новый);
		
		ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыНаСкладах, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокументаОпт,     Дата);
		ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРознице, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокументаРозница, Дата);
		
		//+ Машута А. 22.10.2018 задача 907
		// для того что бы не внести непредвиденных изменений в существующий функцонмла внесем обратно старые наименования колонок
		ttk_ttk_ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаТоварыОпт, "СчетУчета", "СчетУчетаБУ");
		ttk_ttk_ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаТараОпт, "СчетУчета", "СчетУчетаБУ");
		ttk_ttk_ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоОборудованию, "СчетУчета", "СчетУчетаБУ");
		//- Машута А. 22.10.2018 задача 907
		
	Иначе // Приход по ордеру
		
		// Контроль остатков товара
		Если Товары.Количество() <> 0 Тогда
			ПроцедурыКонтроляОстатков.ТоварыКПолучениюНаСкладыКонтрольОстатков("Товары", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		КонецЕсли;
		Если ВозвратнаяТара.Количество() <> 0 Тогда
			ПроцедурыКонтроляОстатков.ТоварыКПолучениюНаСкладыКонтрольОстатков("ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		КонецЕсли;
		Если Оборудование.Количество() <> 0 Тогда
			ПроцедурыКонтроляОстатков.ТоварыКПолучениюНаСкладыКонтрольОстатков("Оборудование", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		КонецЕсли;
		
		НаборДвижений = Движения.ТоварыКПолучениюНаСклады;
		
		Если НЕ Отказ Тогда
			
			// Подготовка таблицы товаров к получению
			ТаблицаТоварыКПолучению = ТаблицаПоТоварам.Скопировать();
			ТаблицаТоварыКПолучению.Колонки.Добавить("ДокументРезерва");
			
			// Документ резерва - приходный ордрер без права продажи.
			Для каждого СтрокаТаблицы из ТаблицаТоварыКПолучению Цикл
				Если СтрокаТаблицы.БезПраваПродажи Тогда
					СтрокаТаблицы.ДокументРезерва = СтрокаТаблицы.ДокументПолучения;
				КонецЕсли;
			КонецЦикла;
			
			// Подготовка таблицы тара к получению
			ТаблицаТараКПолучению = ТаблицаПоТаре.Скопировать();
			ТаблицаТараКПолучению.Колонки.Добавить("ДокументРезерва");
			
			// Документ резерва - приходный ордрер без права продажи.
			Для каждого СтрокаТаблицы из ТаблицаТараКПолучению Цикл
				Если СтрокаТаблицы.БезПраваПродажи Тогда
					СтрокаТаблицы.ДокументРезерва = СтрокаТаблицы.ДокументПолучения;
				КонецЕсли;
			КонецЦикла;
			
			// Движение по товарам к получению
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаТоварыКПолучению", ТаблицаТоварыКПолучению);
			СтруктТаблицДокумента.Вставить("ТаблицаТараКПолучению",   ТаблицаТараКПолучению);
			СтруктТаблицДокумента.Вставить("ТаблицаОборудование",     ТаблицаПоОборудованию);
			
			ТаблицыДанныхДокумента = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыКПолучениюНаСклады, СтруктТаблицДокумента);
			
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество",          Справочники.Качество.Новый);
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",      Перечисления.СтатусыПартийТоваров.Купленный,      "ТаблицаТоварыКПолучению, ТаблицаОборудование");
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",      Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ТаблицаТараКПолучению");
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументПолучения", СкладОрдер,                                       "ТаблицаОборудование");
			
			ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПолучениюНаСклады, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеЗапасамиПартионныйУчет.ВыполнитьПриходПоРегистрамПартий(
	?(ДополнительныеСвойства.Свойство("ТаблицаСтаройРегистрацииВПоследовательности"),ДополнительныеСвойства.ТаблицаСтаройРегистрацииВПоследовательности,Неопределено),
	СтруктураШапкиДокумента, Отказ, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию,СтруктураШапкиДокумента.ОтражатьВУправленческомУчете);
	
	// ТОВАРЫ, УСЛУГИ И ОБОРУДОВАНИЕ ПО РЕГИСТРУ Закупки.
	Если НЕ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		
		КопияТаблицыТоваров = ТаблицаПоТоварам.Скопировать();
		КопияТаблицыТоваров.ЗагрузитьКолонку(КопияТаблицыТоваров.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");
		
		КопияТаблицыУслуги = ТаблицаПоУслугам.Скопировать();
		КопияТаблицыУслуги.ЗагрузитьКолонку(КопияТаблицыУслуги.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");
		
		КопияТаблицыОборудование = ТаблицаПоОборудованию.Скопировать();
		КопияТаблицыОборудование.ЗагрузитьКолонку(КопияТаблицыОборудование.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");
		
		КопияТаблицыТоваров.Колонки.НДС   .Имя = "_НДС";
		КопияТаблицыТоваров.Колонки.НДСУпр.Имя = "НДС";
		
		КопияТаблицыУслуги.Колонки.НДС   .Имя = "_НДС";
		КопияТаблицыУслуги.Колонки.НДСУпр.Имя = "НДС";
		
		КопияТаблицыОборудование.Колонки.НДС   .Имя = "_НДС";
		КопияТаблицыОборудование.Колонки.НДСУпр.Имя = "НДС";
		
		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
			
			// В этом случае таблицы документа обрабатываются особым образом
			ТаблицаДвижений = Движения.Закупки.Выгрузить();
			ТаблицаДвижений.Очистить();
			ТаблицаДвиженийТовары       = ТаблицаДвижений.Скопировать();
			ТаблицаДвиженийУслуги       = ТаблицаДвижений.Скопировать();
			ТаблицаДвиженийОборудование = ТаблицаДвижений.Скопировать();
			
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыТоваров,      ТаблицаДвиженийТовары,       Проект, Дата, "Закупки");
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыУслуги,       ТаблицаДвиженийУслуги,       Проект, Дата, "Закупки");
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыОборудование, ТаблицаДвиженийОборудование, Проект, Дата, "Закупки");
			
			// Вставляем уже подготовленные таблицы движений
			ТаблицыДанныхДокумента = Новый Структура;
			ТаблицыДанныхДокумента.Вставить("ТаблицаПоТоварам",      ТаблицаДвиженийТовары);
			ТаблицыДанныхДокумента.Вставить("ТаблицаПоУслугам",      ТаблицаДвиженийУслуги);
			ТаблицыДанныхДокумента.Вставить("ТаблицаПоОборудованию", ТаблицаДвиженийОборудование);
			
		Иначе
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам",      КопияТаблицыТоваров);
			СтруктТаблицДокумента.Вставить("ТаблицаПоУслугам",      КопияТаблицыУслуги);
			СтруктТаблицДокумента.Вставить("ТаблицаПоОборудованию", КопияТаблицыОборудование);
			
			ТаблицыДанныхДокумента = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.Закупки, СтруктТаблицДокумента);
			
		КонецЕсли;
		
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",       УправлениеЗапасамиПартионныйУчет.ОпределитьСтатусПартииПриходаУпр(СтруктураШапкиДокумента));
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументЗакупки",    Ссылка);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Подразделение",      Подразделение, "ТаблицаПоТоварам");
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику", СтруктураШапкиДокумента.Сделка);
		КонецЕсли;
		
		ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.Закупки, Неопределено, ТаблицыДанныхДокумента, Дата);
		
	КонецЕсли;	
	
КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартийУпр()

// Проводит табличные части "Товары" и "Возвратная тара" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ТоварыИТараПоРегистрамОстатковИПартийРегл(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	// Определим код операции движений по регистру партий
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия Тогда
		Если СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеНаКомиссию;
		Иначе
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.Поступление;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеВПереработку;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.Поступление;
	Иначе
		КодОперацииПартииТоваров = Неопределено;
	КонецЕсли;
	
	УправлениеЗапасамиПартионныйУчет.ВыполнитьПриходПоРегистрамПартий(
	?(ДополнительныеСвойства.Свойство("ТаблицаСтаройРегистрацииВПоследовательности"),ДополнительныеСвойства.ТаблицаСтаройРегистрацииВПоследовательности,Неопределено),
	СтруктураШапкиДокумента, Отказ, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию,, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, СтруктураШапкиДокумента.ОтражатьВНалоговомУчете ИЛИ СтруктураШапкиДокумента.ОтражатьВНалоговомУчетеУСН);
	
КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартий()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
	Отказ, Заголовок);
	
	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
	Отказ, Заголовок);
	
	
	
	// АБС ВСТАВКА 02390 начало
	Если мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <> '00010101'  
		и мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <= СтруктураШапкиДокумента.Дата Тогда
		Если Не СтруктураШапкиДокумента.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ и 
			//ххх Брель Виктор Андреевич 12.04.2018 13:16:13, заявка <<<
			Не СтруктураШапкиДокумента.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка 		 
			// Брель Виктор Андреевич 12.04.2018 13:16:13 >>>		
			И Не СтруктураШапкиДокумента.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена Тогда			
			//Сторчевой А.Н. 05.12.2017 НФС 2018 { ДвиженияПоРегиструГрафикПоставкиЗакупочногоЗаказа(СтруктураШапкиДокумента,Отказ);
			ДвиженияПоРегиструГрафикПоставкиЗакупочногоЗаказа2018(СтруктураШапкиДокумента,Отказ);
			// } Сторчевой А.Н. 05.12.2017 НФС 2018
		КонецЕсли;
	КонецЕсли;
	// АБС ВСТАВКА 02390 конец
	
	//АБС ВСТАВКА №35863, 37395 НАЧАЛО 	
	Если ttk_ОбщегоНазначения.абс_НеВыполнятьДвиженияВСтатусе(СтруктураШапкиДокумента) или не ОтражатьВБухгалтерскомУчете или Отказ Тогда
		Возврат;
	КонецЕсли;	
	//\\АБС ВСТАВКА №35863, 37395 КОНЕЦ		
	
	// АБС ВСТАВКА Фролов Проверим аналитику РБП в Документе	
	АналитикаСовпадает = Истина;
	ТекстСообщения = "Проверка аналитик РБП и аналитик закупочного заказа:";
	
	Для Каждого СтрокаУслуги Из ТаблицаПоУслугам Цикл
		
		СтрокаВидаСубконто = СтрокаУслуги.СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
		
		Если СтрокаВидаСубконто = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексВидаСубконто = СтрокаУслуги.СчетЗатрат.ВидыСубконто.Индекс(СтрокаВидаСубконто);
		
		НаименованиеКолонкиСубконто = "";
		
		Если ИндексВидаСубконто = 0 Тогда
			НаименованиеКолонкиСубконто = "Субконто1";
		ИначеЕсли ИндексВидаСубконто = 1 Тогда
			НаименованиеКолонкиСубконто = "Субконто2";
		ИначеЕсли ИндексВидаСубконто = 2 Тогда
			НаименованиеКолонкиСубконто = "Субконто3";
		КонецЕсли;			
		
		АналитикаРБП = СтрокаУслуги[НаименованиеКолонкиСубконто];
		
		// Сравним аналитику РБП и аналитику ЗЗ
		//Павлов 26798
		//Сторчевой А.Н. 00-00000020 02.03.2018 { Решили закомментировать                                  
		//Если НЕ АналитикаРБП.абс_ЦФУ = ?(ЗначениеЗаполнено(СтрокаУслуги.абс_ЗакупочныйЗаказТЧ), СтрокаУслуги.абс_ЗакупочныйЗаказТЧ.ЦФУ, абс_ЗакупочныйЗаказ.ЦФУ)Тогда
		//	
		//	АналитикаСовпадает = Ложь;
		//	ТекстСообщения = ТекстСообщения + Символы.ПС + "В строке " + СтрокаУслуги.НомерСтроки + " ТЧ услуги не совпадает ЦФУ статьи РБП с ЦФУ указанном в закупочном заказе."
		//	
		//КонецЕсли;
		
		//Если НЕ АналитикаРБП.абс_БюджетнаяСтатья = ?(ЗначениеЗаполнено(СтрокаУслуги.абс_ЗакупочныйЗаказТЧ), СтрокаУслуги.абс_ЗакупочныйЗаказТЧ.БюджетнаяСтатья, абс_ЗакупочныйЗаказ.БюджетнаяСтатья)Тогда
		//	
		//	АналитикаСовпадает = Ложь;
		//	ТекстСообщения = ТекстСообщения + Символы.ПС + "В строке " + СтрокаУслуги.НомерСтроки + " ТЧ услуги не совпадает бюджетная статья статьи РБП с бюджетной сатьей указанной в закупочном заказе."			
		//	
		//КонецЕсли;
		// } Сторчевой А.Н. 00-00000020 02.03.2018
		
		Если НЕ АналитикаРБП.абс_ЦФО = ?(ЗначениеЗаполнено(СтрокаУслуги.абс_ЗакупочныйЗаказТЧ), СтрокаУслуги.абс_ЗакупочныйЗаказТЧ.ЦФО, абс_ЗакупочныйЗаказ.ЦФО) Тогда
			
			АналитикаСовпадает = Ложь;
			ТекстСообщения = ТекстСообщения + Символы.ПС + "В строке " + СтрокаУслуги.НомерСтроки + " ТЧ услуги не совпадает ЦФО статьи РБП с ЦФО указанном в закупочном заказе."			
			
		КонецЕсли;
		
		// 26798
		
	КонецЦикла;	
	
	Если НЕ АналитикаСовпадает Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
	КонецЕсли;	
	// АБС ВСТАВКА Фролов Проверим аналитику РБП в Документе КОНЕЦ
	
	
	Если НЕ СтруктураШапкиДокумента.СпособВеденияПартионногоУчетаПоОрганизации = Перечисления.СпособыВеденияПартионногоУчетаПоОрганизациям.НеВедется Тогда
		ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, 
		ТаблицаПоТаре, Отказ, Заголовок);
	КонецЕсли;							  
	
	// Движения по регистрам подсистемы НДС.
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
		И СтруктураШапкиДокумента.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		
		ТаблицыДокумента = Новый Структура();
		ТаблицыДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
		ТаблицыДокумента.Вставить("ТаблицаПоУслугам", ТаблицаПоУслугам);
		ТаблицыДокумента.Вставить("ТаблицаПоОборудованию", ТаблицаПоОборудованию);
		ТаблицыДокумента.Вставить("ТаблицаПоОбъектамСтроительства", ТаблицаПоОбъектамСтроительства);
		
		// Выполнить движения по спецрегистрам подсистемы учета НДС
		ДвиженияРегистровПодсистемыНДС(СтруктураШапкиДокумента, ТаблицыДокумента, Отказ);
		
	КонецЕсли;
	
	// Формирование движений по отражению затрат.
	УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
	СтруктураШапкиДокумента, 
	ТаблицаПоУслугам
	);
	
	ДвиженияПоРегиструТоварыОрганизацийРегл(РежимПроведения, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, 
	Отказ, Заголовок, СтруктураШапкиДокумента);
	
	ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам,
	Отказ, Заголовок, СтруктураШапкиДокумента);
	
	ПроводкиНУ = ?(СтруктураШапкиДокумента.ОтражатьВНалоговомУчете,Движения.Налоговый,Неопределено);
	
	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, Отказ, Заголовок,ПроводкиНУ);
	
	ДвиженияПоРегистрамУСНРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, 
	ТаблицаПоОборудованию, Отказ, Заголовок);
	
	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить 
	// корректировку списания
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете И ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру тогда
		
		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());
		
	КонецЕсли;
	
	// Разницы по ПБУ18/02
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		Если ТаблицаПоУслугам.Количество() > 0 Тогда
			ДвиженияПоРазницамПоУслугам(СтруктураШапкиДокумента, ТаблицаПоУслугам,ПроводкиНУ);
		КонецЕсли;
	КонецЕсли;
	Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		Движения.Налоговый.Записать(Ложь);	
	КонецЕсли;
	
	// АБС ВСТАВКА Движения по льготам
	ПодчиненныйСФ = УчетНДС.НайтиПодчиненныйСчетФактуру(Ссылка, "СчетФактураПолученный");	
	
	Для Каждого СтрокаУслуга Из ТаблицаПоУслугам Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаУслуга.абс_ЛьготаПоНДС) Тогда   			
			Продолжить; 			
		КонецЕсли;
		
		ДвижениеЛьготы = Движения.абс_ЛьготаПоНДС.Добавить();  		
		ДвижениеЛьготы.Период 				= СтруктураШапкиДокумента.Дата;
		ДвижениеЛьготы.Регистратор 			= СтруктураШапкиДокумента.Ссылка; 		
		ДвижениеЛьготы.Организация			= СтруктураШапкиДокумента.Организация;
		ДвижениеЛьготы.Номенклатура 		= СтрокаУслуга.Номенклатура;
		ДвижениеЛьготы.Контрагент 			= СтруктураШапкиДокумента.Контрагент;
		ДвижениеЛьготы.ДоговорКонтрагента 	= СтруктураШапкиДокумента.ДоговорКонтрагента;
		ДвижениеЛьготы.ВидНДС				= Перечисления.абс_ВидыНДС.НДСПокупок;
		ДвижениеЛьготы.ЛьготаПоНДС			= СтрокаУслуга.абс_ЛьготаПоНДС;  		
		ДвижениеЛьготы.СуммаБезНДС			= СтрокаУслуга.ПроводкаСумма;
		ДвижениеЛьготы.НДС					= СтрокаУслуга.ПроводкаСуммаНДС;		
		ДвижениеЛьготы.СчетФактура			= ПодчиненныйСФ;
		//++ Задача № 9662 Логинчев А.С.		
		ДвижениеЛьготы.СтавкаНДС 			= СтрокаУслуга.СтавкаНДС;
		//-- Задача № 9662 Логинчев А.С.
	КонецЦикла;
	
	Если Движения.абс_ЛьготаПоНДС.Количество() > 0 И НЕ ЗначениеЗаполнено(ПодчиненныйСФ) Тогда  		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Введите сч.фактуру и перепроведите документ. В противном случае Отчет ""Льготы по НДС"" покажет некортекные данные");  		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

// АБС ВСТАВКА 9287 начало
Функция КонтрольЛимитов(СуммаПроверка,СтруктураАналитик)
	
	Если УправлениеДопПравамиПользователей.РазрешеноПревышениеКонтролируемыхЗначенийПоБюджетам() Тогда
		возврат Истина;
	КонецЕсли;
	
	// {{ТТК Лапин А. Заявка Обнуление лимитов 27.10.2015 начало
	//	Если абс_Бюджетирование.ПоСтатьеРазрешеноПревышениеБюджета(ДокЗЗ.БюджетнаяСтатья) Тогда
	Если абс_Бюджетирование.ПоСтатьеРазрешеноПревышениеБюджета(СтруктураАналитик.СтатьяОборотов, Организация) Тогда
		// }}ТТК Лапин А. Заявка № Обнуление лимитов 27.10.2015 окончание	
		возврат Истина;
	КонецЕсли;
	
	//СтруктураАналитик = НОВЫЙ Структура;
	//СтруктураАналитик.Вставить("Организация",ДокЗЗ.Организация);
	//СтруктураАналитик.Вставить("абс_ЦФУ", ДокЗЗ.абс_ЦФУ);
	//СтруктураАналитик.Вставить("ЦФО", ДокЗЗ.ЦФО);
	//СтруктураАналитик.Вставить("абс_ТипРасхода", ДокЗЗ.абс_ТипРасхода);
	//СтруктураАналитик.Вставить("абс_ТипКонтрагента", ДокЗЗ.абс_ТипКонтрагента);
	//СтруктураАналитик.Вставить("абс_ТипСети", ДокЗЗ.абс_ТипСети);
	//СтруктураАналитик.Вставить("абс_КВ",ДокЗЗ.абс_КВ);
	//СтруктураАналитик.Вставить("абс_ТЭО", ДокЗЗ.абс_ТЭО);
	//СтруктураАналитик.Вставить("СтатьяОборотов", ДокЗЗ.СтатьяОборотов);
	////Сторчевой А.Н. НФС 2018 {
	//СтруктураАналитик.Вставить("ttk_ОбъектБюджетирования", ДокЗЗ.ttk_ОбъектБюджетирования);
	//// } Сторчевой А.Н. НФС 2018
	
	СтрокаСообщения = "";
	Остаток = абс_Бюджетирование.ОстатокЛимитаПоБюджету(НачалоМесяца(Дата),КонецМесяца(Дата), СтруктураАналитик);
	//Задача 19053
	Разница = Остаток - СуммаПроверка;
	//абс 27626 СМ
	Если Разница < -1 Тогда
		//\\абс 27626 СМ  - заменено с кода "Если Разница < 1 Тогда"
		//Н-пр, бюджет 640 руб, сумма 640 руб. Разница=0,списать можно -а у нас не списывалось, т.к. сумма<1 была.
		
		//Задача 19053
		Если Остаток = -2 тогда
			СтрокаСообщения = СтрокаСообщения+"В периоде "+ абс_СлужебныеФункции.ВернутьНазваниеМесяца(Дата)+" не задан лимит!";
		Иначе
			СтрокаСообщения = СтрокаСообщения+"В периоде "+ абс_СлужебныеФункции.ВернутьНазваниеМесяца(Дата)+" сумма превышает лимит! Сумма = "+ОбщегоНазначения.ФорматСумм(СуммаПроверка)+", лимит = "+Остаток+Символы.ПС;
		КонецЕсли;
		ttk_ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции	

Процедура СписатьЛимиты(СуммаПотрЛимитов,ДокЗЗ)
	//ххх Брель Виктор Андреевич 21.06.2018 11:52:32, заявка 77356750<<<
	КВпоПост = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост");
	ГоловнаяКомпания = Справочники.абс_ТипыКонтрагентов.НайтиПоКоду("ТК02020013");
	ТК0101ДЗОТТК = Справочники.абс_ТипыКонтрагентов.НайтиПоКоду("ТК0101");
	ТК0102ФилиалыТТК = Справочники.абс_ТипыКонтрагентов.НайтиПоКоду("ТК0102");
	// Брель Виктор Андреевич 21.06.2018 11:52:32 >>>


	ТекВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	ТекКурс = ?(ВалютаДокумента <> ТекВалютаВзаиморасчетов, МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата).Курс, КурсВзаиморасчетов);
	
	Движение = Движения.КонтролируемыеЗначенияБюджетов.Добавить();
	Движение.Период 					= Дата;
	Движение.СтатьяОборотов 			= ДокЗЗ.БюджетнаяСтатья;
	Движение.ЦФО 						= ДокЗЗ.ЦФО;
	//ххх Брель Виктор Андреевич 21.06.2018 11:52:32, заявка 77356750<<<
	Если ДокЗЗ.ТипКонтрагента.Родитель = ТК0101ДЗОТТК ИЛИ ДокЗЗ.ТипКонтрагента.Родитель.Родитель = ТК0101ДЗОТТК ИЛИ ДокЗЗ.ТипКонтрагента.Родитель.Родитель.Родитель= ТК0101ДЗОТТК ИЛИ 
		ДокЗЗ.ТипКонтрагента.Родитель = ТК0102ФилиалыТТК ИЛИ     ДокЗЗ.ТипКонтрагента.Родитель.Родитель = ТК0102ФилиалыТТК ИЛИ ДокЗЗ.ТипКонтрагента.Родитель.Родитель.Родитель = ТК0102ФилиалыТТК ИЛИ
		ДокЗЗ.ТипКонтрагента = ГоловнаяКомпания Тогда
		Движение.абс_ТипКонтрагента 		= ДокЗЗ.ТипКонтрагента;
	КонецЕсли;
	//Движение.абс_ТипСети 				= ДокЗЗ.ТипСети;
	Если  ДокЗЗ.БюджетнаяСтатья = КВпоПост Тогда
		Движение.абс_КВ 					= ДокЗЗ.КВ;
	КонецЕсли;
	// Брель Виктор Андреевич 21.06.2018 13:10:12 >>>
	Движение.абс_ТЭО 					= ДокЗЗ.ТЭО;
	Движение.абс_ЦФУ 					= ДокЗЗ.ЦФУ;
	Движение.абс_ТипРасхода 			= ДокЗЗ.ТипРасхода;
	Движение.Организация 				= Организация;
	Движение.СуммаСценарияИсполнение	= СуммаПотрЛимитов*ТекКурс;   //АБС Коломиец 12392
	Движение.СуммаСценарияИсполнениеВал = СуммаПотрЛимитов;
	Движение.Валюта						= ВалютаДокумента;
	
КонецПроцедуры // )
// АБС ВСТАВКА 9287 конец

// АБС ВСТАВКА 02390 начало
Процедура ДвиженияПоРегиструГрафикПоставкиЗакупочногоЗаказа(СтруктураШапкиДокумента,Отказ)
	
	Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Записывать = Истина;
	Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Очистить();
	
	Если СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.УбыткиПрошлыхЛет Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.абс_ЗакупочныйЗаказ.РасходыБудущихПериодов Тогда
		Возврат;
	КонецЕсли;
	
	абс_ИсключитьДатуИзГрафикаПоставок = Константы.абс_ИсключитьДатуИзГрафикаПоставок.Получить();
	Если ЗначениеЗаполнено(абс_ИсключитьДатуИзГрафикаПоставок) и НачалоДня(Дата) = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок) Тогда
		врДатаПоставки = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок)-1;
	Иначе
		врДатаПоставки = Дата;
	КонецЕсли;	
	
	// АБС Фролов 20120509
	// Для организаций ДЗО
	// для поставок по ЗЗ с нефиксированной суммой:
	// 1. не контролируем график поставок
	// 2. производим списание лимитов документом поставки при их наличии
	// 3. при отсутствии лимита не проводим документ
	
	КонтрольЛимитовНефиксЗЗвПОставке = (ПараметрыСеанса.абс_ПользовательДЗО 
	или Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.ДЗО
	или Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.Филиал)
	//АБС ВСТАВКА №35063,000023920 НАЧАЛО
	и глЗначениеПеременной("абс_СписаниеИКонтрольЛимитовПоСхемеГоловнойКомпании") > СтруктураШапкиДокумента.Дата
	//\\АБС ВСТАВКА №35063 КОНЕЦ
	;	
	
	врСуммаОтгрузки = 0;
	//++ Задача № 10097 Логинчев А.С. 16.05.2012 17:04:28
	ПерваяЗаписьвРНКонтролируемыеЗначенияПоБюджету = Истина;
	//-- Задача № 10097 Логинчев А.С.
	Для Каждого ТекСтрокаГрафикПоставок Из абс_ЗакупочныеЗаказы Цикл  
		
		врабс_ЗакупочныйЗаказ = ТекСтрокаГрафикПоставок.абс_ЗакупочныйЗаказТЧ;
		
		Если врабс_ЗакупочныйЗаказ.НефиксированнаяСумма Тогда
			
			//АБС ВСТАВКА №10351 НАЧАЛО
			Если КонтрольЛимитовНефиксЗЗвПОставке Тогда
				
				врСумма = ТекСтрокаГрафикПоставок.абс_СуммаБезНДС;//СуммаДокумента - абс_СуммаНДС;
				
				//+ПРИХОД
				Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
				Движение.ВидДвижения     = ВидДвиженияНакопления.Приход;
				Движение.Период          = Дата;
				Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
				Движение.ПериодПоставки  = НачалоМесяца(врДатаПоставки);
				Движение.Сумма           = врСумма;
				//-РАСХОД
				Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
				Движение.ВидДвижения     = ВидДвиженияНакопления.Расход;
				Движение.Период          = Дата;
				Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
				Движение.ПериодПоставки  = НачалоМесяца(врДатаПоставки);
				Движение.Сумма           = врСумма;  		
				//++ Задача № 10097 Логинчев А.С. 16.05.2012 17:05:36
				Если ПерваяЗаписьвРНКонтролируемыеЗначенияПоБюджету Тогда
					Движения.КонтролируемыеЗначенияБюджетов.Записывать = Истина;
					Движения.КонтролируемыеЗначенияБюджетов.Очистить();
					Движения.КонтролируемыеЗначенияБюджетов.Записать();
					ПерваяЗаписьвРНКонтролируемыеЗначенияПоБюджету = Ложь;
				КонецЕсли;
				//-- Задача № 10097 Логинчев А.С.
				СписатьЛимиты(врСумма, врабс_ЗакупочныйЗаказ);
				
			Иначе	
				
				ЗапросСтатьиБезЛимитов = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СтатьяБезКонтроляЛимита.СтатьяОборотовПоБюджетам
				|ИЗ
				|	РегистрСведений.абс_СписокСтатейБезКонтроляЛимита КАК СтатьяБезКонтроляЛимита
				|ГДЕ
				|	СтатьяБезКонтроляЛимита.СтатьяОборотовПоБюджетам В(&СтатьяОборотовПоБюджетам)
				|
				|СГРУППИРОВАТЬ ПО
				|	СтатьяБезКонтроляЛимита.СтатьяОборотовПоБюджетам");
				ЗапросСтатьиБезЛимитов.УстановитьПараметр("СтатьяОборотовПоБюджетам", врабс_ЗакупочныйЗаказ.БюджетнаяСтатья);
				Если НЕ ЗапросСтатьиБезЛимитов.Выполнить().Пустой() Тогда
					Продолжить;
				КонецЕсли;				
				
				Запрос = Новый Запрос; 				
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ПериодПоставки КАК ПериодПоставки,
				|	ЕСТЬNULL(абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.СуммаОстаток, 0) КАК Остаток
				|ИЗ
				|	РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(, ЗакупочныйЗаказ = &ЗакупочныйЗаказ) КАК абс_ГрафикПоставкиЗакупочногоЗаказаОстатки
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПериодПоставки";
				
				Запрос.УстановитьПараметр("ЗакупочныйЗаказ", врабс_ЗакупочныйЗаказ);
				
				врСуммаОтгрузки = ТекСтрокаГрафикПоставок.абс_СуммаБезНДС;
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				врОстаток = 0;
				врОтгрузка = врСуммаОтгрузки;
				
				Пока Выборка.Следующий() Цикл
					
					врСуммаДвижения = Мин(врСуммаОтгрузки, Выборка.Остаток);
					
					врОстаток = врОстаток + Выборка.Остаток;
					
					Если врСуммаДвижения > 0 Тогда  						                         		
						
						Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
						Движение.ПериодПоставки = НачалоМесяца(Выборка.ПериодПоставки);
						Движение.Сумма = врСуммаДвижения;
						
						врСуммаОтгрузки = врСуммаОтгрузки -  врСуммаДвижения; 		
						
					КонецЕсли;	
					
				КонецЦикла;
				
				//Контроль графика поставок "начало"
				//Отказ = врОтгрузка > врОстаток; 					
				//Если Отказ Тогда
				//Задача 19053
				Разница = врОстаток - врОтгрузка;
				Если Разница < -1 Тогда
					ТекстСообщения = "Сумма по документу превышает сумму по графику поставок на "+(врОтгрузка - врОстаток)+" !";
					ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
				КонецЕсли;
				//\\конец				
				
			КонецЕсли;
			//\\АБС ВСТАВКА №10351 КОНЕЦ					
			
		Иначе
			
			//ВКЛЮЧЕН КОНТРОЛЬ
			
			//Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//Движение.Период = Дата;
			//Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
			//Движение.ПериодПоставки = НачалоМесяца(Дата);
			//Движение.Сумма = ТекСтрокаГрафикПоставок.абс_СуммаБезНДС;
			//ххх Брель Виктор Андреевич 24.03.2018 15:26:10, заявка 77354995<<<
			//Добавлена Аналитака
			// 14.06.2018 Убрали ТипСети
			
			Запрос = Новый Запрос; 			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ПериодПоставки КАК ПериодПоставки,
			               |	ЕСТЬNULL(абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.СуммаОстаток, 0) КАК Остаток,
			               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ttk_ОбъектБюджетирования,
			               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.абс_КВ,
			               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.абс_ТЭО,
			               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.абс_ЦФУ,
			               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.СтатьяОборотов
			               |ИЗ
			               |	РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(, ЗакупочныйЗаказ = &ЗакупочныйЗаказ) КАК абс_ГрафикПоставкиЗакупочногоЗаказаОстатки
			               |ГДЕ
			               |	абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ПериодПоставки МЕЖДУ &Дата И &Дата1
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ПериодПоставки";			 
			
			Запрос.УстановитьПараметр("ЗакупочныйЗаказ", врабс_ЗакупочныйЗаказ);
			Запрос.УстановитьПараметр("Дата"           , НачалоМесяца(врДатаПоставки));
			Запрос.УстановитьПараметр("Дата1"          , КонецМесяца(врДатаПоставки));
			
			врСуммаОтгрузки = ТекСтрокаГрафикПоставок.абс_СуммаБезНДС;
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			врОстаток = 0;
			врОтгрузка = врСуммаОтгрузки;
			
			Пока Выборка.Следующий() Цикл
				
				врСуммаДвижения = Мин(врСуммаОтгрузки, Выборка.Остаток);
				
				врОстаток = врОстаток + Выборка.Остаток;
				
				Если врСуммаДвижения > 0 Тогда  						                         		
					
					Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
					ЗаполнитьЗначенияСвойств(Движение,Выборка);
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
					Движение.ПериодПоставки = НачалоМесяца(Выборка.ПериодПоставки);
					Движение.Сумма = врСуммаДвижения;
					
					врСуммаОтгрузки = врСуммаОтгрузки -  врСуммаДвижения; 		
					
				КонецЕсли;	
				
			КонецЦикла;
			// Брель Виктор Андреевич 24.03.2018 15:26:10 >>>
			
			//Контроль графика поставок "начало"
			//Задача 19053
			Разница = врОстаток - врОтгрузка;
			Если Разница < -1 Тогда
				ТекстСообщения = "Сумма по документу превышает сумму по графику поставок на "+(врОтгрузка - врОстаток)+" !";
				ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
			//\\конец							
			
		КонецЕсли;
		
	КонецЦикла;     	
	
КонецПроцедуры
// АБС ВСТАВКА 02390 конец

// По результату запроса по шапке документа формируем движения по регистрам для целей упр. учета.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  ТаблицаПоОборудованию     - таблица значений, содержащая данные для проведения и проверки ТЧ "Оборудование",
//  ТаблицаПоОбъектамСтроительства - таблица значений, содержащая данные для проведения и проверки ТЧ "Объекты строительства",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
	Отказ, Заголовок);
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	////АБС 56815
	//Если СтруктураШапкиДокумента.абс_Статус<> Перечисления.абс_СтатусыПервичныхДокументов.Согласован и 
	//	СтруктураШапкиДокумента.абс_Статус<> Перечисления.абс_СтатусыПервичныхДокументов.Завершен и
	//	СтруктураШапкиДокумента.абс_Статус<> Перечисления.абс_СтатусыПервичныхДокументов.ОбработанБухгалтером Тогда
	//	Возврат;
	//КонецЕсли;
	////\\АБС 56815
	
	Если СтруктураШапкиДокумента.ВидОперации    = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия
		И СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
		И  (СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ
		ИЛИ СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
		УправлениеСертификациейНоменклатуры.ПроверитьНаСертификацию( ТаблицаПоТоварам.ВыгрузитьКолонку("СерияНоменклатуры"), Дата, Ложь, Заголовок);
	КонецЕсли;
	
	УправлениеВзаиморасчетами.ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ЭтотОбъект, СтруктураШапкиДокумента, 
	мСтруктураПараметровВзаиморасчетов, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	ВидДвиженияНакопления.Расход, Отказ, Заголовок);
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	
	ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, ТаблицаПоУслугам, ТаблицаПоОбъектамСтроительства, Отказ, Заголовок, СтруктураШапкиДокумента);
	
	Если НЕ Отказ Тогда
		
		// ТОВАР, ТАРА ПО РЕГИСТРУ ТоварыПолученные.
		СтруктТаблицДокумента = Новый Структура;
		ТабИменТара = неопределено;
		ТабИменТовары = Неопределено;
		
		ttk_ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоТаре, ТабИменТара, "ЗаказПоставщику", "Сделка");
		
		СтруктТаблицДокумента.Вставить("ТаблицаПоТаре", ТаблицаПоТаре);
		
		
		Если (ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
			И СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда 
				ttk_ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоТоварам, ТабИменТовары, "ЗаказПокупателя", "Сделка");
			Иначе
				ttk_ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоТоварам, ТабИменТовары, "ЗаказПоставщику", "Сделка");
			КонецЕсли;
			
			
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			
		КонецЕсли;
		
		ТаблицыДанныхДокумента = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыПолученные, СтруктТаблицДокумента);
		
		ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоТаре, ТабИменТара);
		Если ТабИменТовары<>неопределено Тогда
			ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоТоварам, ТабИменТовары);
		КонецЕсли;
		
		
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
		ОпределитьСделкуВСтрокахТаблицыЗначений(ТаблицыДанныхДокумента, "ТаблицаПоТаре", "Сделка", СтруктураШапкиДокумента);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения",    Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара,     "ТаблицаПоТаре");
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
			И СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			ОпределитьСделкуВСтрокахТаблицыЗначений(ТаблицыДанныхДокумента, "ТаблицаПоТоварам", "Сделка", СтруктураШапкиДокумента);
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения", Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию, "ТаблицаПоТоварам");
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения", Перечисления.СтатусыПолученияПередачиТоваров.ВПереработку, "ТаблицаПоТоварам");
		КонецЕсли;
		
		ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыПолученные, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
		
		// ТОВАР, ТАРА И ОБОРУДОВАНИЕ ПО РЕГИСТРУ ЗаказыПоставщикам.
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам",      ТаблицаПоТоварам);
		СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",         ТаблицаПоТаре);
		СтруктТаблицДокумента.Вставить("ТаблицаПоОборудованию", ТаблицаПоОборудованию);
		Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			СтруктТаблицДокумента.Вставить("ТаблицаПоУслугам",        ТаблицаПоУслугам);
		КонецЕсли;
		
		ТаблицыДанныхДокумента = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ЗаказыПоставщикам, СтруктТаблицДокумента);
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			//при поступлении материалов в переработку должны сформироваться движения, значение измерения ЗаказПоставщику = заказ покупателя на переработку
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику", СтруктураШапкиДокумента.Сделка, "ТаблицаПоТоварам");
		КонецЕсли;
		
		ОбщегоНазначения.УдалитьСтрокиИзТаблицДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику");
		
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", СтруктураШапкиДокумента.ДоговорКонтрагента);
		
		СтатусПартии = ?(ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку, Перечисления.СтатусыПартийТоваров.ВПереработку, Перечисления.СтатусыПартийТоваров.Купленный);
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", СтатусПартии,                                     "ТаблицаПоТоварам");
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ТаблицаПоТаре");
		ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.Оборудование,   "ТаблицаПоОборудованию");
		Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", СтатусПартии, "ТаблицаПоУслугам");
		КонецЕсли;
		
		ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ЗаказыПоставщикам, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
		
	КонецЕсли;
	
	// Снятие резерва по приходному ордеру
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру И НЕ Отказ Тогда
		
		// Сначала удалим из таблицы строки, по которым не надо списывать резерв.
		ТаблицаПоТоварамПоОрдерамБезПраваПродажи = УдалитьСтрокиБезПраваПродажи(ТаблицаПоТоварам);
		ТаблицаПоТоварамПоОрдерамБезПраваПродажи.Колонки.ДокументПолучения.Имя = "ДокументРезерва";
		
		ТаблицаПоТареПоОрдерамБезПраваПродажи = УдалитьСтрокиБезПраваПродажи(ТаблицаПоТаре);
		ТаблицаПоТареПоОрдерамБезПраваПродажи.Колонки.ДокументПолучения.Имя = "ДокументРезерва";
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамПоОрдерамБезПраваПродажи);
		СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареПоОрдерамБезПраваПродажи);
		
		ТаблицыДанныхДокумента = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);
		
		ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
		
	КонецЕсли;
	
	// Резервирование по заказам покупателей
	
	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит ЗаказПокупателя пуст)
	ТаблицаПоТоварамЗаказамПокупателей = ТаблицаПоТоварам.Скопировать();
	
	//для вида операции ВПереработку реквизит ЗаказПокупателя всегда заполнен, поэтому вид операции не проверяем
	УдалитьСтрокиБезЗаказаДляРезерва(ТаблицаПоТоварамЗаказамПокупателей);
	
	// Теперь зарезервируем возвратную тару
	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит ЗаказПокупателя пуст)
	ТаблицаПоТареЗаказамПокупателей = ТаблицаПоТаре.Скопировать();
	УдалитьСтрокиБезЗаказаДляРезерва(ТаблицаПоТареЗаказамПокупателей);
	
	Если ТаблицаПоТоварамЗаказамПокупателей.Количество() > 0 ИЛИ ТаблицаПоТареЗаказамПокупателей.Количество() > 0 Тогда
		
		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
			// Контроль остатков товара
			Если ТаблицаПоТоварамЗаказамПокупателей.Количество() <> 0 Тогда
				ПроцедурыКонтроляОстатков.ТоварыВРезервеНаСкладахКонтрольОстатков("Товары", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
			КонецЕсли;
			Если ТаблицаПоТареЗаказамПокупателей.Количество() <> 0 Тогда
				ПроцедурыКонтроляОстатков.ТоварыВРезервеНаСкладахКонтрольОстатков("ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			ТаблицаПоТоварамЗаказамПокупателей.Колонки.ЗаказПокупателя.Имя = "ДокументРезерва";
			ТаблицаПоТареЗаказамПокупателей   .Колонки.ЗаказПокупателя.Имя = "ДокументРезерва";
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамЗаказамПокупателей);
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареЗаказамПокупателей);
			
			ТаблицыДанныхДокумента = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);
			
			ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Товары и тара по регистру "Размещение заказов покупателей"
	ТаблицаПоТоварамРазмещение = УдалитьСтрокиНеТребующиеРазмещенияВЗаказе(ТаблицаПоТоварам);
	ТаблицаПоТареРазмещение    = УдалитьСтрокиНеТребующиеРазмещенияВЗаказе(ТаблицаПоТаре);
	
	Если ТаблицаПоТоварамРазмещение.Количество() > 0 ИЛИ ТаблицаПоТареРазмещение.Количество() > 0 Тогда
		
		Движения.РазмещениеЗаказовПокупателей.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		Движения.РазмещениеЗаказовПокупателей.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		
		Если НЕ Отказ Тогда
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамРазмещение);
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареРазмещение);
			
			ТаблицыДанныхДокумента = ttk_ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.РазмещениеЗаказовПокупателей, СтруктТаблицДокумента);
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ТоварТара", Перечисления.ТоварТара.Товар, "ТаблицаПоТоварам");
			ttk_ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ТоварТара", Перечисления.ТоварТара.Тара,  "ТаблицаПоТаре");
			
			ttk_ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.РазмещениеЗаказовПокупателей, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если установлен флаг РегистрироватьЦеныПоставщика, нужно зарегистрировать цены
	Если РегистрироватьЦеныПоставщика Тогда
		
		НаборДвижений = Движения.ЦеныНоменклатурыКонтрагентов;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		ТаблицаПоТоварамЦены = ТаблицаПоТоварам.Скопировать();
		СпособЗаполненияЦен  = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
		
		// Пересчитаем цены, согласно флагу типа цен контрагентов (цена включает НДС)
		Если ТипЦен.ЦенаВключаетНДС Тогда
			Если НЕ СуммаВключаетНДС Тогда
				Для Каждого СтрокаТабличнойЧасти Из ТаблицаПоТоварамЦены Цикл
					СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(СтрокаТабличнойЧасти.Цена,
					СпособЗаполненияЦен, Ложь, Истина, Истина,
					УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если СуммаВключаетНДС Тогда
				Для Каждого СтрокаТабличнойЧасти Из ТаблицаПоТоварамЦены Цикл
					СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(СтрокаТабличнойЧасти.Цена,
					СпособЗаполненияЦен, Истина, Ложь, Ложь,
					УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// Удалим строки с одинаковым товаром и характеристикой.
		МассивСтрокДляУдаления = Новый Массив;
		СписокСвернутыхСтрок   = Новый СписокЗначений;
		
		Для Каждого СтрокаТаблицыПоТоварамЦены Из ТаблицаПоТоварамЦены Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", СтрокаТаблицыПоТоварамЦены.Номенклатура);
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаТаблицыПоТоварамЦены.ХарактеристикаНоменклатуры);
			СтрокиПоТовару = ТаблицаПоТоварамЦены.НайтиСтроки(СтруктураОтбора);
			Если СтрокиПоТовару.Количество() > 0 Тогда //Есть несколько строк по товару.
				ПерваяСтрока = СтрокиПоТовару[0];
				Цена = 0;
				Для каждого СтрокаПоТовару Из СтрокиПоТовару Цикл
					Если СписокСвернутыхСтрок.НайтиПоЗначению(СтрокаПоТовару) = Неопределено Тогда
						СписокСвернутыхСтрок.Добавить(СтрокаПоТовару);
					Иначе
						Продолжить;
					КонецЕсли;
					Цена = Цена + СтрокаПоТовару.Цена/СтрокаПоТовару.Коэффициент;
					Если СтрокаПоТовару <> ПерваяСтрока Тогда
						МассивСтрокДляУдаления.Добавить(СтрокаПоТовару);
					КонецЕсли;
				КонецЦикла;
				Если Цена > 0 Тогда
					ПерваяСтрока.Цена = Цена / СтрокиПоТовару.Количество() * ПерваяСтрока.Коэффициент;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
			ТаблицаПоТоварамЦены.Удалить(СтрокаДляУдаления);
		КонецЦикла;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	Цены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК Цены
		|ГДЕ
		|	Цены.Период = &ДатаЦен
		|	И Цены.ТипЦен = &ТипЦен
		|	И Цены.Номенклатура В (&СписокНоменклатуры)
		|");
		
		Запрос.УстановитьПараметр("ДатаЦен", НачалоДня(Дата));
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		Запрос.УстановитьПараметр("СписокНоменклатуры", ТаблицаПоТоварамЦены.ВыгрузитьКолонку("Номенклатура"));
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура");
		СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтбора.Номенклатура = Выборка.Номенклатура;
			СтруктураОтбора.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			
			СтрокиПоТовару = ТаблицаПоТоварамЦены.НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаТовара Из СтрокиПоТовару Цикл
				ТаблицаПоТоварамЦены.Удалить(СтрокаТовара);
			КонецЦикла;
		КонецЦикла;
		
		// Заполним таблицу движений.
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоТоварамЦены, ТаблицаДвижений);
		
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(ТипЦен,"ТипЦен");
		
		Если СтруктураШапкиДокумента.Свойство("ВалютаЗаказа") Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ВалютаЗаказа,"Валюта");
		Иначе
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ВалютаДокумента,"Валюта");
		КонецЕсли;
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.ЦеныНоменклатурыКонтрагентов.ВыполнитьДвижения();
		КонецЕсли;
		
	КонецЕсли;
	
	// если вид операции = объекты строительства
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства Тогда
		НаборДвижений = Движения.СтроительствоОбъектовОсновныхСредств;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийОбъектыСтроительства = НаборДвижений.Выгрузить();
		ТаблицаДвиженийОбъектыСтроительства.Очистить();
		
		// Заполним таблицу движений.
		ТаблицаПоОбъектамСтроительства.Колонки.Сумма.Имя 	 = "СуммаДок";
		ТаблицаПоОбъектамСтроительства.Колонки.Стоимость.Имя = "Сумма";
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоОбъектамСтроительства, ТаблицаДвиженийОбъектыСтроительства);
		
		// Недостающие поля.
		//ТаблицаДвижений.ЗаполнитьЗначения(СкладОрдер,"ДокументРезерва");
		//ТаблицаДвижений.ЗаполнитьЗначения(СкладОрдер.Склад,"Склад");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвиженийОбъектыСтроительства;
		
		Если Не Отказ Тогда
			Движения.СтроительствоОбъектовОсновныхСредств.ВыполнитьПриход();
			Движения.СтроительствоОбъектовОсновныхСредств.Записать(Ложь);
		КонецЕсли;
		
		НаборДвижений = Движения.ЗатратыНаСтроительствоОбъектовОсновныхСредств;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийОбъектыСтроительства = НаборДвижений.Выгрузить();
		ТаблицаДвиженийОбъектыСтроительства.Очистить();
		
		// Заполним таблицу движений.
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоОбъектамСтроительства, ТаблицаДвиженийОбъектыСтроительства);
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвиженийОбъектыСтроительства;
		
		Если Не Отказ Тогда
			Движения.ЗатратыНаСтроительствоОбъектовОсновныхСредств.ДобавитьДвижение();
			Движения.ЗатратыНаСтроительствоОбъектовОсновныхСредств.Записать(Ложь);
		КонецЕсли;
		
		ТаблицаПоОбъектамСтроительства.Колонки.Сумма.Имя 	 = "Стоимость";
		ТаблицаПоОбъектамСтроительства.Колонки.СуммаДок.Имя = "Сумма";
		
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		
		// Погашение внутренних заказов в случае Заказчик = Склад поступления
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить( "СтатусПартии",          Перечисления.СтатусыПартийТоваров.Купленный);
		ДопПараметры.Вставить( "РежимПроведения",       РежимПроведения);
		ДопПараметры.Вставить( "ИмяРеквизитаЗаказ",     "Заказ");
		ДопПараметры.Вставить( "ЗаказВШапке",           Ложь);
		ДопПараметры.Вставить( "ИмяТабЧасти",           "Товары");
		
		ТабИсходная = ТаблицаПоТоварам.Скопировать();
		
		ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.Купленный);
		Если ТабИсходная.Количество() > 0 Тогда
			УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
		КонецЕсли;
		
		ТабИсходная.Очистить();
		ТабИсходная = ТаблицаПоТаре.Скопировать();
		ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
		
		
		Если ТабИсходная.Количество() > 0 Тогда
			ДопПараметры.Вставить( "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
			ДопПараметры.Вставить( "ИмяТабЧасти",  "ВозвратнаяТара");
			
			УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрамУпр()

Процедура  ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, знач СтатусПартии)
	Сч = 0;
	
	Пока Сч < ТабИсходная.Количество() Цикл
		СтрокаТаблицы = ТабИсходная.Получить(Сч);
		Если ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
			И СтрокаТаблицы.ЗаказПокупателя.Заказчик = СтрокаТаблицы.Склад Тогда
			// Проверим остаток по регистру "Внутренние заказы", если в остатках не хватает количества, 
			// то, вероятно, заказаны комплектующие для комплектов, по ним движений не делаем
			КоличествоОстаток = УправлениеЗаказами.ПолучитьОстатокПоВнутреннемуЗаказу(СтрокаТаблицы.ЗаказПокупателя, 
			СтрокаТаблицы.Количество, 
			СтрокаТаблицы.Номенклатура, 
			?(СтатусПартии=Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,неопределено,СтрокаТаблицы.ХарактеристикаНоменклатуры),
			СтрокаТаблицы.ЕдиницаИзмерения,
			СтатусПартии);
			Если КоличествоОстаток > 0 Тогда
				СтрокаТаблицы.Количество = Мин(СтрокаТаблицы.Количество, КоличествоОстаток);
				Сч = Сч + 1;
			Иначе
				ТабИсходная.Удалить(СтрокаТаблицы);
			КонецЕсли;
		Иначе
			ТабИсходная.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	ТабИсходная.Колонки.ЗаказПокупателя.Имя = "Заказ";
КонецПроцедуры


// Формирует движения по регистру "Взаиморасчеты с контрагентами по документам расчетов",
// если по договору ведется учет в разрезе документов
//
Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Если НЕ мСтруктураПараметровВзаиморасчетов.ПроводитьПоВзаиморасчетам Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	УправлениеВзаиморасчетами.ОтражениеЗадолженностиВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ТаблицаПоВзаиморасчетам, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамУСНРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию,Отказ, Заголовок)
	
	Если (Не СтруктураШапкиДокумента.ОтражатьВНалоговомУчетеУСН) ИЛИ 
		(СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		
		НаборДвижений = Движения.РасходыПриУСН;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		Если (НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства) Тогда
			НалоговыйУчетУСН.ПоступлениеРасходовУСН(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаДвижений, 
			Перечисления.ВидыРасходовУСН.Номенклатура, СтруктураШапкиДокумента.ДоговорКонтрагента,
			Перечисления.СтатусыПартийУСН.Купленные, СтруктураШапкиДокумента.СуммаВключаетНДС);
		КонецЕсли;
		
		НалоговыйУчетУСН.ПоступлениеРасходовУСН(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаДвижений, 
		Перечисления.ВидыРасходовУСН.Услуги, СтруктураШапкиДокумента.ДоговорКонтрагента,
		Перечисления.СтатусыПартийУСН.Купленные, СтруктураШапкиДокумента.СуммаВключаетНДС);
		
		//НалоговыйУчетУСН.ПоступлениеРасходовУСН(СтруктураШапкиДокумента, ТаблицаПоОборудованию, ТаблицаДвижений, 
		//						Перечисления.ВидыРасходовУСН.Номенклатура, СтруктураШапкиДокумента.ДоговорКонтрагента,
		//						Перечисления.СтатусыПартийУСН.Купленные, СтруктураШапкиДокумента.СуммаВключаетНДС);
		
		//Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.РасходыПриУСН.ВыполнитьПриход();
			НаборДвижений.Записать(Истина);
		КонецЕсли;
		
		//Зачет аванса													
		НалоговыйУчетУСН.ДвиженияУСН(Ссылка, РежимПроведения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, 
	ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, Отказ, Заголовок, ПроводкиНУ);
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия
		или ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
		или ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветХранение
		или ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		
		// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
		// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
		// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		ТоварыИТараПоРегистрамОстатковИПартийРегл(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, Отказ, Заголовок, СтруктураШапкиДокумента);
		
	КонецЕсли; 	
	УправлениеЗапасамиПартионныйУчет.СформироватьПроводкиПоПоступлениюТМЦ(СтруктураШапкиДокумента, Отказ, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, СтруктураШапкиДокумента.ОтражатьВНалоговомУчете);
	
	ПроводкиБУ = Движения.Хозрасчетный;
	
	// Движения по взаиморасчетам
	Если мСтруктураПараметровВзаиморасчетов.ПроводитьПоВзаиморасчетам Тогда
		СкладПроводок = Справочники.Склады.ПустаяСсылка();
		Если ТаблицаПоТоварам.Количество()>0 Тогда
			Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
				СкладПроводок = ТаблицаПоТоварам[0].Склад;
			ИначеЕсли ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
				СкладПроводок = ТаблицаПоТоварам[0].ПриходныйОрдерСклад;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПараметровЗачетАванса = БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаСтруктурыПараметровДляЗачетаАванса(Ссылка, мВалютаРегламентированногоУчета, Заголовок,, ТаблицаПоВзаиморасчетам);
		Если НЕ СтруктураПараметровЗачетАванса = Ложь Тогда
			// Движения по регистру сведений РасчетыПоПриобретениюОрганизации
			// и проводки по зачету аванса
			ТаблицаРасчетовПоПриобретению = БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовитьТаблицуДляРегистраРасчетовПоПриобретению(
			мСтруктураПараметровВзаиморасчетов, СтруктураШапкиДокумента);
			СтруктураПараметровЗачетАванса.Вставить("Склад", СкладПроводок);
			СуммаАванса = БухгалтерскийУчетРасчетовСКонтрагентами.ЗачетАванса(СтруктураПараметровЗачетАванса, 
			ПроводкиБУ, мВалютаРегламентированногоУчета, РежимПроведения, ЭтотОбъект, ТаблицаРасчетовПоПриобретению);
			// Движения по регистру РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации
			Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
				СтруктураПараметровЗачетАванса.Вставить("ПроводкиНУ", Движения.Налоговый);
			Конецесли;
			ДвиженияСУчетомКорректировок = БухгалтерскийУчетРасчетовСКонтрагентами.РасчетыВУсловныхЕдиницахПриобретениеРеализация(СтруктураПараметровЗачетАванса, 
			мВалютаРегламентированногоУчета, РежимПроведения, ПроводкиБУ, ЭтотОбъект, Отказ, , Истина);
			
			ЕстьОшибка = Ложь;	
			Если ДвиженияСУчетомКорректировок = Истина Тогда
				//нет корректировок
			ИначеЕсли ДвиженияСУчетомКорректировок = Ложь Тогда
				ЕстьОшибка = Истина;
				
			Иначе
				Для Каждого Движение Из ДвиженияСУчетомКорректировок Цикл
					Если Движение.Значение.Модифицированность() Тогда
						Движение.Значение.Записать();
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		Конецесли;
		
	КонецЕсли;
	
	//абс Родин Лимитный контроль 
	Если глЗначениеПеременной("абс_ИспользоватьКонтрольЛимитовПоДоговорам") Тогда
		//СформироватьДвиженияПоКонтролируемымЗатратам(ТаблицаПоТоварам,ТаблицаПоУслугам,Ложь,Отказ);
		
		
		Если Не Отказ И ДоговорКонтрагента.абс_ОсобыйПорядкокКонтроляЛимитов Тогда
			
			СообщениеПриОтказе = "";
			
			СтруктураТаблиц = Новый Структура();
			СтруктураТаблиц.Вставить("ТаблицаПоТоварам",ТаблицаПоТоварам);
			СтруктураТаблиц.Вставить("ТаблицаПоУслугам",ТаблицаПоУслугам);
			
			НаборДвижений = ЭтотОбъект.Движения.абс_ЗатратыПоДоговорамСКонтролемЛимитов;
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаДвижений.Очистить();			
			
			абс_Бюджетирование.ФормированиеДвиженийПоКонтролируемымЗатратам(Ссылка,Отказ,СообщениеПриОтказе,СтруктураТаблиц,Ложь,ТаблицаДвижений,НаборДвижений);
			
			Если Отказ И СообщениеПриОтказе <> "" Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке(СообщениеПриОтказе,Отказ); 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	//абс Родин Лимитный контроль
	
	Движения.Хозрасчетный.Записать(ложь);
	Движения.Налоговый.Записать(ложь);
	
	// Лапин 33960 27.08.2015 начало 
	//сразу после записи проводок по БУ и НУ было распределение ранее
	// делаем костыль с корректировкой НДС и СуммыСНДС, если заполнены на закладке "Дополнительно"
	
	Если ВалютаДокумента <> мВалютаРегламентированногоУчета Тогда
		
		Если абс_СуммаНДСПоСчетуФактуре <> 0 ИЛИ ОбщаяСтоимостьСНДСПоСчетуФактуре <> 0 Тогда
			
			КорректировкаСуммДвиженийРегистровПоЗначениямИзФактурыПоставщика();
			
		КонецЕсли;		
		
	КонецЕсли;		
	// Лапин 33960 27.08.2015 окончание
	
КонецПроцедуры // ДвиженияПоРегистрамРегл()

Процедура КорректировкаСуммДвиженийРегистровПоЗначениямИзФактурыПоставщика()
	
	// считаем только что записанные проводки по БУ и поправим их, затем запищем обратно
	
	НаборЗаписейБУ = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейБУ.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейБУ.Прочитать();
	
	ТЗ_ПроводкиБУ = НаборЗаписейБУ.Выгрузить();
	ТЗ_ПроводкиБУ.Сортировать("Сумма Убыв, СчетДт Возр");
	
	// это нужно, чтобы посчитать разницу между тем, что получилось и суммами Фактуры поставщика
	Сумма19 = 0;	
	Сумма60 = 0; 
	Для Каждого стрПроводок Из ТЗ_ПроводкиБУ Цикл
		
		Если Лев(Строка(стрПроводок.СчетДт), 2) = "19" Тогда	
			Сумма19 = Сумма19 + стрПроводок.Сумма;
		ИначеЕсли Лев(Строка(стрПроводок.СчетДт), 2) = "60" И Лев(Строка(стрПроводок.СчетКт), 2) = "60" Тогда
			// пропустим зачет аванса поставщику Дт 60.31	Кт 60.32
			Продолжить;
		ИначеЕсли Лев(Строка(стрПроводок.СчетКт), 2) = "60" Тогда
			Сумма60 = Сумма60 + стрПроводок.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	// теперь:
	// вычислим разницу между  ОбщаяСтоимостьСНДСПоСчетуФактуре И Сумма60
	// вычислим разницу между  абс_СуммаНДСПоСчетуФактуре 		И Сумма19 
	
	Если ОбщаяСтоимостьСНДСПоСчетуФактуре <> 0 Тогда
		Сумма60и19 = Сумма60 + Сумма19;
		СуммаБезНДСПоСчетуФактуре = ОбщаяСтоимостьСНДСПоСчетуФактуре - абс_СуммаНДСПоСчетуФактуре;
		Разница60СНДС = ОбщаяСтоимостьСНДСПоСчетуФактуре - Сумма60и19;
		Разница60 = СуммаБезНДСПоСчетуФактуре - Сумма60;
	Иначе
		Сумма60и19 = 0;
		СуммаБезНДСПоСчетуФактуре = 0;
		Разница60СНДС = 0;
		Разница60 = 0;	
	КонецЕсли;
	Если абс_СуммаНДСПоСчетуФактуре <> 0 Тогда
		Разница19 = абс_СуммаНДСПоСчетуФактуре - Сумма19;
	Иначе
		Разница19 = 0;	
	КонецЕсли;
	
	Разница60Внесена = Ложь;
	Разница19Внесена = Ложь;
	
	КорректируемоеЗначение19 = 0;
	КорректируемоеЗначение60 = 0;
	
	//Для Каждого стрПроводок Из ТЗ_ПроводкиБУ Цикл
	Для сч = 0 По ТЗ_ПроводкиБУ.Количество() - 1 Цикл
		
		стрПроводок = ТЗ_ПроводкиБУ.Получить(сч);
		
		Если Разница60Внесена И Разница19Внесена Тогда 
			// ускорим, если все разнесли, то и перебор больше не нужен
			Прервать;					
		Конецесли;
		
		Если Лев(Строка(стрПроводок.СчетДт), 2) = "08" ИЛИ Лев(Строка(стрПроводок.СчетДт), 2) = "07" ИЛИ Лев(Строка(стрПроводок.СчетДт), 2) = "41" Тогда 
			// сюда в одну строку добавляем разницу
			Если Разница60Внесена = Ложь Тогда
				стрПроводок.Сумма = стрПроводок.Сумма + Разница60;
				Разница60Внесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли Лев(Строка(стрПроводок.СчетДт), 2) = "60" И Лев(Строка(стрПроводок.СчетКт), 2) = "60" Тогда
			// пропустим зачет аванса поставщику Дт 60.31	Кт 60.32
			Продолжить;
			
		ИначеЕсли Лев(Строка(стрПроводок.СчетДт), 2) = "10" ИЛИ Лев(Строка(стрПроводок.СчетДт), 2) = "15" Тогда 	
			
			// 08 нет, значит
			// сюда в две строки подряд добавляем разницу  
			Если Разница60Внесена = Ложь Тогда
				
				Сумма1 = стрПроводок.Сумма;
				
				СледующаяСтрока60 = ТЗ_ПроводкиБУ.Получить(сч + 1);
				
				Сумма2 = СледующаяСтрока60.Сумма;
				КорректируемоеЗначение60 = стрПроводок.Сумма;
				Если Сумма1 = Сумма2 Тогда
					стрПроводок.Сумма = стрПроводок.Сумма + Разница60;
					
					СледующаяСтрока60.Сумма = СледующаяСтрока60.Сумма + Разница60;
					
					Разница60Внесена = Истина;
				Иначе
					// хз продолжить
					Продолжить;
				Конецесли;
			Иначе
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли Лев(Строка(стрПроводок.СчетДт), 2) = "19" Тогда 	
			
			// НДС
			// 19 все равно искать надо, но вдруг он первый встал, потому здестт пропустить можно или флаг взвести, 
			// что обработан после обработки
			Если Разница19Внесена = Ложь Тогда
				КорректируемоеЗначение19 = стрПроводок.Сумма;
				стрПроводок.Сумма = стрПроводок.Сумма + Разница19;    
				Разница19Внесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
		Иначе
			// хз другие счета.. доделывать надо ... услуги например... пока не встречалось
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ_ПроводкиБУ.Сортировать("НомерСтроки Возр");
	НаборЗаписейБУ.Загрузить(ТЗ_ПроводкиБУ);
	НаборЗаписейБУ.Записать();
	
	//ТЗСвернутаяПо19Счетам = ТЗ_ПроводкиБУ.Свернуть("СчетДт","Сумма");
	
	
	//************************* И для НУ выполнить также !!!!	****************
	
	// считаем только что записанные проводки по НУ и поправим их, затем запищем обратно
	
	НаборЗаписейНУ = РегистрыБухгалтерии.Налоговый.СоздатьНаборЗаписей();
	НаборЗаписейНУ.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейНУ.Прочитать();
	
	ТЗ_ПроводкиНУ = НаборЗаписейНУ.Выгрузить();
	ТЗ_ПроводкиНУ.Сортировать("Сумма Убыв, СчетДт Возр");
	
	// это нужно, чтобы посчитать разницу между тем, что получилось и суммами Фактуры поставщика
	СуммаПВ = 0; 
	Для Каждого стрПроводок Из ТЗ_ПроводкиНУ Цикл
		
		Если Лев(Строка(стрПроводок.СчетКт), 2) = "ПВ" Тогда
			СуммаПВ = СуммаПВ + стрПроводок.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	// теперь:
	// вычислим разницу между  ОбщаяСтоимостьСНДСПоСчетуФактуре И СуммаПВ
	
	Если ОбщаяСтоимостьСНДСПоСчетуФактуре <> 0 Тогда
		СуммаБезНДСПоСчетуФактуре = ОбщаяСтоимостьСНДСПоСчетуФактуре - абс_СуммаНДСПоСчетуФактуре;
		РазницаПВ = СуммаБезНДСПоСчетуФактуре - СуммаПВ;
	Иначе
		РазницаПВ = 0;	
	КонецЕсли;
	
	РазницаПВВнесена = Ложь;
	
	//Для Каждого стрПроводок Из ТЗ_ПроводкиНУ Цикл
	Для сч = 0 По ТЗ_ПроводкиНУ.Количество() - 1 Цикл
		
		стрПроводок = ТЗ_ПроводкиНУ.Получить(сч);
		
		//Если РазницаПВВнесена Тогда 
		//	// ускорим, если все разнесли, то и перебор больше не нужен
		//	Прервать;					
		//Конецесли;
		
		Если Лев(Строка(стрПроводок.СчетДт), 2) = "08" ИЛИ Лев(Строка(стрПроводок.СчетДт), 2) = "07" ИЛИ Лев(Строка(стрПроводок.СчетДт), 2) = "41" Тогда 
			// сюда в одну строку добавляем разницу
			Если РазницаПВВнесена = Ложь Тогда
				стрПроводок.Сумма = стрПроводок.Сумма + РазницаПВ;
				РазницаПВВнесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли Лев(Строка(стрПроводок.СчетДт), 2) = "10" ИЛИ Лев(Строка(стрПроводок.СчетДт), 2) = "15" Тогда 	
			
			// 08 нет, значит
			// сюда в две строки подряд добавляем разницу  
			Если РазницаПВВнесена = Ложь Тогда
				
				стрПроводок.Сумма = стрПроводок.Сумма + РазницаПВ;
				
				СледующаяСтрокаПВ = ТЗ_ПроводкиНУ.Получить(сч + 1);
				СледующаяСтрокаПВ.Сумма = СледующаяСтрокаПВ.Сумма + РазницаПВ;
				
				РазницаПВВнесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
		Иначе
			// хз другие счета.. доделывать надо ... услуги например... пока не встречалось
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ_ПроводкиНУ.Сортировать("НомерСтроки Возр");
	НаборЗаписейНУ.Загрузить(ТЗ_ПроводкиНУ);
	НаборЗаписейНУ.Записать();
	
	// ************************* регистры накопления **********************
	
	Если Разница60СНДС <> 0 Тогда //по регистрам расчеты и прочее
		
		
		// ***** "Расчеты по приобретению (бухгалтерский учет)" *****
		
		// Alex Lapin
		
		//Если ВызванРегламентнойПроцедурой тогда
		//	ДвиженияПоРегиструУЕ = ОбщегоНазначения.ПолучитьНаборЗаписейПоСсылке(Ссылка, РегистрыНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации);
		//	//***** Гетц. Разнесение платежей. 14.11.12
		//	ИспользоватьРазнесениеПлатежей = ПолучитьИспользованиеРаспределенияПлатежей(СтруктураПараметров.Ссылка);
		//	Если ИспользоватьРазнесениеПлатежей Тогда 
		//		Если СтруктураПараметров.Свойство("ПорядокОбходаВосставновления") И СтруктураПараметров.ПорядокОбходаВосставновления = 1 Тогда 
		//			ДвиженияПоРегиструУЕ.Прочитать(); // При втором обходе, движения первого затирать не нужно
		//		КонецЕсли;
		//	КонецЕсли;
		//	//***** Гетц. Разнесение платежей \\
		//Иначе
		НаборЗаписейПоПриобретению = ОбщегоНазначения.ПолучитьДвижение(ЭтотОбъект, "РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации");
		//КонецЕсли;
		
		ТЗ_Движений = НаборЗаписейПоПриобретению.Выгрузить();
		ТЗ_Движений.Сортировать("СуммаРег Убыв");
		
		Для Каждого стрДвижение Из ТЗ_Движений Цикл
			стрДвижение.СуммаРег = стрДвижение.СуммаРег + Разница60СНДС;
			Прервать;
		КонецЦикла;
		
		ТЗ_Движений.Сортировать("НомерСтроки Возр");
		НаборЗаписейПоПриобретению.Загрузить(ТЗ_Движений);
		НаборЗаписейПоПриобретению.Записать();
		
		
		// ****************************** Регистр накопления "ПартииТоваровНаСкладахБухгалтерскийУчет"  *************************  
		
		//НаборЗаписейПартииБУ = ОбщегоНазначения.ПолучитьДвижение(ЭтотОбъект, "ПартииТоваровНаСкладахБухгалтерскийУчет");
		
		НаборЗаписейПартииБУ = РегистрыНакопления.ПартииТоваровНаСкладахБухгалтерскийУчет.СоздатьНаборЗаписей();
		НаборЗаписейПартииБУ.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейПартииБУ.Прочитать();
		
		ТЗ_Движений = НаборЗаписейПартииБУ.Выгрузить();
		ТЗ_Движений.Сортировать("Стоимость Убыв");
		
		Разница60Внесена = Ложь;
		
		Для сч = 0 По ТЗ_Движений.Количество() - 1 Цикл
			стрПроводок = ТЗ_Движений.Получить(сч);
			
			Если Разница60Внесена Тогда 
				// ускорим, если все разнесли, то и перебор больше не нужен
				Прервать;					
			Конецесли;
			
			ДваЛевыхСимвоса = Лев(Строка(стрПроводок.СчетУчета), 2);
			// наверное, можно не проверять счета, для всех одинаково... собрать статистику и проверить
			Если ДваЛевыхСимвоса = "08" ИЛИ ДваЛевыхСимвоса = "07" ИЛИ ДваЛевыхСимвоса = "41" ИЛИ ДваЛевыхСимвоса = "10" Тогда 
				// сюда в одну строку добавляем разницу
				Если Разница60Внесена = Ложь Тогда
					стрПроводок.Стоимость = стрПроводок.Стоимость + Разница60; // Разница60СНДС;
					Разница60Внесена = Истина;
				Иначе
					Продолжить;
				КонецЕсли;
				
				
			Иначе
				// хз другие счета.. доделывать надо ... услуги например... пока не встречалось
				
			КонецЕсли;
			
			стрДвижение.СуммаРег = стрДвижение.СуммаРег + Разница60СНДС;
			//Прервать;
		КонецЦикла;
		
		ТЗ_Движений.Сортировать("НомерСтроки Возр");
		НаборЗаписейПартииБУ.Загрузить(ТЗ_Движений);
		НаборЗаписейПартииБУ.Записать();
		
		
		// ******************************  Регистр накопления "ПартииТоваровНаСкладахНалоговыйУчет"  *************************  
		
		НаборЗаписейПартииНУ = РегистрыНакопления.ПартииТоваровНаСкладахНалоговыйУчет.СоздатьНаборЗаписей();
		НаборЗаписейПартииНУ.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейПартииНУ.Прочитать();
		
		ТЗ_Движений = НаборЗаписейПартииНУ.Выгрузить();
		ТЗ_Движений.Сортировать("Стоимость Убыв");
		
		Разница60Внесена = Ложь;
		
		Для сч = 0 По ТЗ_Движений.Количество() - 1 Цикл
			стрПроводок = ТЗ_Движений.Получить(сч);
			
			Если Разница60Внесена Тогда 
				// ускорим, если все разнесли, то и перебор больше не нужен
				Прервать;					
			Конецесли;
			
			ДваЛевыхСимвоса = Лев(Строка(стрПроводок.СчетУчета), 2);
			// наверное, можно не проверять счета, для всех одинаково... собрать статистику и проверить
			Если ДваЛевыхСимвоса = "08" ИЛИ ДваЛевыхСимвоса = "07" ИЛИ ДваЛевыхСимвоса = "41" ИЛИ ДваЛевыхСимвоса = "10" Тогда 
				// сюда в одну строку добавляем разницу
				Если Разница60Внесена = Ложь Тогда
					стрПроводок.Стоимость = стрПроводок.Стоимость + Разница60; // Разница60СНДС;
					Разница60Внесена = Истина;
				Иначе
					Продолжить;
				КонецЕсли;
				
			Иначе
				// хз другие счета.. доделывать надо ... услуги например... пока не встречалось
				
			КонецЕсли;
			
			стрДвижение.СуммаРег = стрДвижение.СуммаРег + Разница60СНДС;
			//Прервать;
		КонецЦикла;
		
		ТЗ_Движений.Сортировать("НомерСтроки Возр");
		НаборЗаписейПартииНУ.Загрузить(ТЗ_Движений);
		НаборЗаписейПартииНУ.Записать();
		
		// ******************************  Регистр накопления "ПартииТоваровНаСкладах"  *************************  
		
		НаборЗаписейПартииНУ = РегистрыНакопления.ПартииТоваровНаСкладах.СоздатьНаборЗаписей();
		НаборЗаписейПартииНУ.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейПартииНУ.Прочитать();
		
		ТЗ_Движений = НаборЗаписейПартииНУ.Выгрузить();
		ТЗ_Движений.Сортировать("Стоимость Убыв");
		
		Разница60Внесена = Ложь;
		
		Для сч = 0 По ТЗ_Движений.Количество() - 1 Цикл
			стрПроводок = ТЗ_Движений.Получить(сч);
			
			Если Разница60Внесена Тогда 
				// ускорим, если все разнесли, то и перебор больше не нужен
				Прервать;					
			Конецесли;
			
			Если Разница60Внесена = Ложь Тогда
				стрПроводок.Стоимость = стрПроводок.Стоимость + Разница60; // Разница60СНДС;
				Разница60Внесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
			стрДвижение.СуммаРег = стрДвижение.СуммаРег + Разница60СНДС;
			//Прервать;
		КонецЦикла;
		
		ТЗ_Движений.Сортировать("НомерСтроки Возр");
		НаборЗаписейПартииНУ.Загрузить(ТЗ_Движений);
		НаборЗаписейПартииНУ.Записать();
		
		//***************** может еще какие-нибудь регистры  пересчитать
		
		
		
		
		
	КонецЕсли;
	
	
	
	
	
	Если Разница19 <> 0 Тогда //по регистрам НДС
		
		// для след регистров заново пересчитать разницу по 19 и заодно по 60,  так как система для них иначе считает корректировки курсовых разниц
		// может совпадать, а может и не совпадать :). пример: поступления КТТ00000000010447 и КТТ00000000010653 от 21.07.2015
		// в КТТ00000000010447 одинаково, а в КТТ00000000010653 нет
		
		
		// ********************** 	НДСПредъявленный 	***********************************
		
		НаборЗаписейНДСПредъявленный = РегистрыНакопления.НДСПредъявленный.СоздатьНаборЗаписей();
		НаборЗаписейНДСПредъявленный.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейНДСПредъявленный.Прочитать();
		
		ТЗ_Движений = НаборЗаписейНДСПредъявленный.Выгрузить();
		ТЗ_Движений.Сортировать("СуммаБезНДС Убыв, НДС Убыв");
		
		// {{ рассчитаем разницы для текущего регистра
		// это нужно, чтобы посчитать разницу между тем, что получилось и суммами Фактуры поставщика
		Сумма19 = 0;	
		Сумма60 = 0; 
		Для Каждого стрПроводок Из ТЗ_Движений Цикл
			Сумма19 = Сумма19 + стрПроводок.НДС;
			Сумма60 = Сумма60 + стрПроводок.СуммаБезНДС;
		КонецЦикла;
		
		// теперь:
		// вычислим разницу между  ОбщаяСтоимостьСНДСПоСчетуФактуре И Сумма60
		// вычислим разницу между  абс_СуммаНДСПоСчетуФактуре 		И Сумма19 
		
		Если ОбщаяСтоимостьСНДСПоСчетуФактуре <> 0 Тогда
			Сумма60и19 = Сумма60 + Сумма19;
			СуммаБезНДСПоСчетуФактуре = ОбщаяСтоимостьСНДСПоСчетуФактуре - абс_СуммаНДСПоСчетуФактуре;
			Разница60СНДС = ОбщаяСтоимостьСНДСПоСчетуФактуре - Сумма60и19;
			Разница60 = СуммаБезНДСПоСчетуФактуре - Сумма60;
		Иначе
			Сумма60и19 = 0;
			СуммаБезНДСПоСчетуФактуре = 0;
			Разница60СНДС = 0;
			Разница60 = 0;	
		КонецЕсли;
		Если абс_СуммаНДСПоСчетуФактуре <> 0 Тогда
			Разница19 = абс_СуммаНДСПоСчетуФактуре - Сумма19;
		Иначе
			Разница19 = 0;	
		КонецЕсли;
		// рассчитали разницы для текущего регистра }} 
		
		
		Разница60Внесена = Ложь;
		Разница19Внесена = Ложь;
		
		Для сч = 0 По ТЗ_Движений.Количество() - 1 Цикл
			стрПроводок = ТЗ_Движений.Получить(сч);
			
			Если Разница60Внесена И Разница19Внесена Тогда 
				// ускорим, если все разнесли, то и перебор больше не нужен
				Прервать;					
			Конецесли;
			
			Если Разница60Внесена = Ложь Тогда
				стрПроводок.СуммаБезНДС = стрПроводок.СуммаБезНДС + Разница60; // Разница60СНДС;
				Разница60Внесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
			Если Разница19Внесена = Ложь Тогда
				стрПроводок.НДС = стрПроводок.НДС + Разница19;
				Разница19Внесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
		ТЗ_Движений.Сортировать("НомерСтроки Возр");
		НаборЗаписейНДСПредъявленный.Загрузить(ТЗ_Движений);
		НаборЗаписейНДСПредъявленный.Записать();
		
		// ********************** 	НДСПартииТоваров 	***********************************  НО ТОЛЬКО ЕСЛИ КОРРЕКТИРОВАЛИСЬ ОС В ПРЕД РЕГИСТРАХ
		
		НаборЗаписейНДСПартииТоваров = РегистрыНакопления.НДСПартииТоваров.СоздатьНаборЗаписей();
		НаборЗаписейНДСПартииТоваров.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейНДСПартииТоваров.Прочитать();
		
		ТЗ_Движений = НаборЗаписейНДСПартииТоваров.Выгрузить();
		ТЗ_Движений.Сортировать("Стоимость Убыв, НДС Убыв");
		
		// {{ рассчитаем разницы для текущего регистра
		// это нужно, чтобы посчитать разницу между тем, что получилось и суммами Фактуры поставщика
		Сумма19 = 0;	
		Сумма60 = 0; 
		Для Каждого стрПроводок Из ТЗ_Движений Цикл
			Сумма19 = Сумма19 + стрПроводок.НДС;
			Сумма60 = Сумма60 + стрПроводок.Стоимость;
		КонецЦикла;
		
		// теперь:
		// вычислим разницу между  ОбщаяСтоимостьСНДСПоСчетуФактуре И Сумма60
		// вычислим разницу между  абс_СуммаНДСПоСчетуФактуре 		И Сумма19 
		
		Если ОбщаяСтоимостьСНДСПоСчетуФактуре <> 0 Тогда
			Сумма60и19 = Сумма60 + Сумма19;
			СуммаБезНДСПоСчетуФактуре = ОбщаяСтоимостьСНДСПоСчетуФактуре - абс_СуммаНДСПоСчетуФактуре;
			Разница60СНДС = ОбщаяСтоимостьСНДСПоСчетуФактуре - Сумма60и19;
			Разница60 = СуммаБезНДСПоСчетуФактуре - Сумма60;
		Иначе
			Сумма60и19 = 0;
			СуммаБезНДСПоСчетуФактуре = 0;
			Разница60СНДС = 0;
			Разница60 = 0;	
		КонецЕсли;
		Если абс_СуммаНДСПоСчетуФактуре <> 0 Тогда
			Разница19 = абс_СуммаНДСПоСчетуФактуре - Сумма19;
		Иначе
			Разница19 = 0;	
		КонецЕсли;
		// рассчитали разницы для текущего регистра }} 
		
		Разница60Внесена = Ложь;
		Разница19Внесена = Ложь;
		КорректировкаСделанаПоОС_НМА = Ложь;
		
		Для сч = 0 По ТЗ_Движений.Количество() - 1 Цикл
			стрПроводок = ТЗ_Движений.Получить(сч);
			
			Если Разница60Внесена И Разница19Внесена Тогда 
				// ускорим, если все разнесли, то и перебор больше не нужен
				Прервать;					
			Конецесли;
			
			Если Разница60Внесена = Ложь Тогда
				стрПроводок.Стоимость = стрПроводок.Стоимость + Разница60; // Разница60СНДС;
				Разница60Внесена = Истина;
				
				Если стрПроводок.ВидЦенности = Перечисления.ВидыЦенностей.ОС ИЛИ стрПроводок.ВидЦенности = Перечисления.ВидыЦенностей.НМА Тогда
					КорректировкаСделанаПоОС_НМА = Истина;
				КонецЕсли;
				
			Иначе
				Продолжить;
			КонецЕсли;
			
			Если Разница19Внесена = Ложь Тогда
				
				стрПроводок.НДС = стрПроводок.НДС + Разница19;    
				Разница19Внесена = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
		ТЗ_Движений.Сортировать("НомерСтроки Возр");
		НаборЗаписейНДСПартииТоваров.Загрузить(ТЗ_Движений);
		НаборЗаписейНДСПартииТоваров.Записать();
		
		
		
		// ********************** 	НДС по ОС, НМА 	***********************************  НО ТОЛЬКО ЕСЛИ КОРРЕКТИРОВАЛИСЬ ОС В ПРЕД РЕГИСТРАХ
		
		НаборЗаписейНДСпоОСиНМА = РегистрыНакопления.НДСпоОСиНМА.СоздатьНаборЗаписей();
		НаборЗаписейНДСпоОСиНМА.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейНДСпоОСиНМА.Прочитать();
		
		ТЗ_Движений = НаборЗаписейНДСпоОСиНМА.Выгрузить();
		
		Если ТЗ_Движений.Количество() > 0 Тогда	
			
			Если КорректировкаСделанаПоОС_НМА = Истина Тогда 
				
				ТЗ_Движений.Сортировать("СуммаБезНДС Убыв, НДС Убыв");    
				
				// {{ рассчитаем разницы для текущего регистра
				// это нужно, чтобы посчитать разницу между тем, что получилось и суммами Фактуры поставщика
				Сумма19 = 0;	
				Сумма60 = 0; 
				Для Каждого стрПроводок Из ТЗ_Движений Цикл
					Сумма19 = Сумма19 + стрПроводок.НДС;
					Сумма60 = Сумма60 + стрПроводок.СуммаБезНДС;
				КонецЦикла;
				
				// теперь:
				// вычислим разницу между  ОбщаяСтоимостьСНДСПоСчетуФактуре И Сумма60
				// вычислим разницу между  абс_СуммаНДСПоСчетуФактуре 		И Сумма19 
				
				Если ОбщаяСтоимостьСНДСПоСчетуФактуре <> 0 Тогда
					Сумма60и19 = Сумма60 + Сумма19;
					СуммаБезНДСПоСчетуФактуре = ОбщаяСтоимостьСНДСПоСчетуФактуре - абс_СуммаНДСПоСчетуФактуре;
					Разница60СНДС = ОбщаяСтоимостьСНДСПоСчетуФактуре - Сумма60и19;
					Разница60 = СуммаБезНДСПоСчетуФактуре - Сумма60;
				Иначе
					Сумма60и19 = 0;
					СуммаБезНДСПоСчетуФактуре = 0;
					Разница60СНДС = 0;
					Разница60 = 0;	
				КонецЕсли;
				Если абс_СуммаНДСПоСчетуФактуре <> 0 Тогда
					Разница19 = абс_СуммаНДСПоСчетуФактуре - Сумма19;
				Иначе
					Разница19 = 0;	
				КонецЕсли;
				// рассчитали разницы для текущего регистра }} 
				
				Разница60Внесена = Ложь;
				Разница19Внесена = Ложь;
				
				Для сч = 0 По ТЗ_Движений.Количество() - 1 Цикл
					стрПроводок = ТЗ_Движений.Получить(сч);
					
					Если Разница60Внесена И Разница19Внесена Тогда 
						// ускорим, если все разнесли, то и перебор больше не нужен
						Прервать;					
					Конецесли;
					
					Если Разница60Внесена = Ложь Тогда
						стрПроводок.СуммаБезНДС = стрПроводок.СуммаБезНДС + Разница60; // Разница60СНДС;
						Разница60Внесена = Истина;
					Иначе
						Продолжить;
					КонецЕсли;
					
					Если Разница19Внесена = Ложь Тогда
						
						стрПроводок.НДС = стрПроводок.НДС + Разница19;    
						Разница19Внесена = Истина;
					Иначе
						Продолжить;
					КонецЕсли;
					
				КонецЦикла;
				
				ТЗ_Движений.Сортировать("НомерСтроки Возр");
				НаборЗаписейНДСпоОСиНМА.Загрузить(ТЗ_Движений);
				НаборЗаписейНДСпоОСиНМА.Записать();
				
			КонецЕсли;
			
		КонецЕсли;		
		
		
		
	КонецЕсли;
	
КонецПроцедуры // КорректировкаСуммДвиженийРегистровПоЗначениямИзФактурыПоставщика()

Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, 
	ТаблицаПоТаре, Отказ, Заголовок)
	
	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить корректировку списания
	// Приходный ордер может быть указан не только в шапке, но и в табличной части как "Документ получения"
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру тогда
		
		МассивПриходныхОрдеров = Новый Массив;
		Для каждого Строка Из ТаблицаПоТоварам Цикл
			
			Если  ТипЗнч(Строка.ДокументПолучения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
				И Строка.БезПраваПродажи =Ложь Тогда
				МассивПриходныхОрдеров.Добавить(Строка.ДокументПолучения);
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого Строка Из ТаблицаПоТаре Цикл
			
			Если  ТипЗнч(Строка.ДокументПолучения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
				И Строка.БезПраваПродажи =Ложь Тогда
				МассивПриходныхОрдеров.Добавить(Строка.ДокументПолучения);
			КонецЕсли;
			
		КонецЦикла;
		
		ttk_ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивПриходныхОрдеров);
		
		// ПО РЕГИСТРУ СписанныеТовары: формируем записи с указанием приходных ордеров, которые будут обрабатываться при списании
		НаборДвижений = Движения.СписанныеТовары;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		Инд = 0;
		Для каждого Элемент Из МассивПриходныхОрдеров Цикл
			
			НоваяСтрока = ТаблицаДвижений.Добавить();
			НоваяСтрока.ПоступлениеПриходныйОрдер = Элемент;
			Инд = Инд+1;
			НоваяСтрока.НомерСтрокиДокумента = Инд;
			НоваяСтрока.Организация = СтруктураШапкиДокумента.Организация;
		КонецЦикла;
		
		ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
		
		ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.СписанныеТовары.ВыполнитьДвижения();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Движения.СписанныеТовары.Модифицированность() Тогда
		Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегиструСписанныеТовары

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ НДС

// Процедура вызывается из тела процедуры ДвиженияПоРегистрам
// Формирует движения по регистрам подсистемы учета НДС.
//
Процедура ДвиженияРегистровПодсистемыНДС(СтруктураШапкиДокумента, ТаблицыДокумента, Отказ) Экспорт
	
	Если Не УчетНДС.ПроводитьДокументДляЦелейНДС(СтруктураШапкиДокумента) Тогда
		// Движения по этому документу делать не нужно
		Возврат;
	КонецЕсли;
	
	Для Каждого ТаблицаДокумента Из ТаблицыДокумента Цикл
		
		ТабЧасть   = ТаблицаДокумента.Значение;
		
		Если Не ТабЧасть.Количество() = 0 Тогда 
			УчетНДСФормированиеДвижений.СформироватьДвиженияПоРегиструНДСПредъявленный(СтруктураШапкиДокумента, ТабЧасть, Отказ);
			
		КонецЕсли; 
	КонецЦикла;
	
	// Если по договору с контрагентом организация выступает в качестве налогового агента, требуется отразить начисление НДС
	Если СтруктураШапкиДокумента.УчетАгентскогоНДС Тогда
		УчетНДСФормированиеДвижений.СформироватьДвиженияПоРегиструНДСНачисленный_ПоступлениеАгентскогоНДС(СтруктураШапкиДокумента);
	КонецЕсли; 
	
	// При необходимости, отражаем в регистре партионного учета для НДС
	// Отражение партий по товарам
	Если (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
		Или СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование)
		И ТаблицыДокумента.Свойство("ТаблицаПоТоварам") 
		И Не ТаблицыДокумента.ТаблицаПоТоварам.Количество() = 0 Тогда
		
		УчетНДСФормированиеДвижений.СформироватьДвиженияПоступленияПоРегиструНДСПартииТоваров(СтруктураШапкиДокумента, ТаблицыДокумента.ТаблицаПоТоварам.Скопировать(), , Отказ);
	КонецЕсли;
	
	// Отражение партий по оборудованию
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование
		И (ТаблицыДокумента.Свойство("ТаблицаПоОборудованию") 
		И Не ТаблицыДокумента.ТаблицаПоОборудованию.Количество() = 0) Тогда
		
		УчетНДСФормированиеДвижений.СформироватьДвиженияПоступленияПоРегиструНДСПартииТоваров(СтруктураШапкиДокумента, ТаблицыДокумента.ТаблицаПоОборудованию.Скопировать(), , Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры // ДвиженияРегистровПодсистемыНДС()

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке)
	
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "ВалютаУправленческогоУчета"        , "ВалютаУправленческогоУчета");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "КурсВалютыУправленческогоУчета"    , "КурсВалютыУправленческогоУчета");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "НастройкаСпособовВеденияУправленческогоПартионногоУчета", "СпособВеденияПартионногоУчетаПоОрганизации", "СпособВеденияПартионногоУчетаПоОрганизации");
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьДеревоПолейЗапросаПоШапкеРегл(ДеревоПолейЗапросаПоШапке)
	
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиТоварыРегл(СтруктураПолей, СтруктураШапкиДокумента)
	
	СтруктураПолей.Вставить("СчетУчетаБУ"                      , "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНДС"                     , "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНУ"                      , "СчетУчетаНУ");
	СтруктураПолей.Вставить("ОтражениеВУСН"                    , "ОтражениеВУСН");
	
	//Для определения счетов учета при проведении документов
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("СкладВидСклада"            , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("СкладВидСклада"            , "Склад.ВидСклада");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараУпр(СтруктураПолей)
	
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараРегл(СтруктураПолей, СтруктураШапкиДокумента)
	
	СтруктураПолей.Вставить("СчетУчетаБУ"          , "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНУ"          , "СчетУчетаНУ");
	
	//Для определения счетов учета при проведении документов
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("СкладВидСклада"            , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("СкладВидСклада"            , "Склад.ВидСклада");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиУслугиУпр(СтруктураПолей)
	
	СтруктураПолей.Вставить("НоменклатурнаяГруппа",           "НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("Цена",                           "Цена");
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиУслугиРегл(СтруктураПолей)
	
	СтруктураПолей.Вставить("НоменклатурнаяГруппа",     "НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("ПодразделениеОрганизации", "ПодразделениеОрганизации");
	СтруктураПолей.Вставить("ОбъектСтроительства",      "ОбъектСтроительства");
	СтруктураПолей.Вставить("СпособСтроительства",      "СпособСтроительства");
	СтруктураПолей.Вставить("СчетЗатрат",   "СчетЗатрат" );
	СтруктураПолей.Вставить("СчетУчетаНДС", "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетЗатратНУ", "СчетЗатратНУ" );
	СтруктураПолей.Вставить("Субконто1",    "Субконто1");
	СтруктураПолей.Вставить("Субконто2",    "Субконто2");
	СтруктураПолей.Вставить("Субконто3",    "Субконто3");
	СтруктураПолей.Вставить("СубконтоНУ1",  "СубконтоНУ1");
	СтруктураПолей.Вставить("СубконтоНУ2",  "СубконтоНУ2");
	СтруктураПолей.Вставить("СубконтоНУ3",  "СубконтоНУ3");
	СтруктураПолей.Вставить("ОтражениеВУСН",  "ОтражениеВУСН");
	
КонецПроцедуры

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеУпр(СтруктураПолей)
	
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеРегл(СтруктураПолей, СтруктураШапкиДокумента)
	
	СтруктураПолей.Вставить("СчетУчетаБУ",  "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНДС", "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНУ",  "СчетУчетаНУ");
	
	//Для определения счетов учета при проведении документов
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("СкладВидСклада"            , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("СкладВидСклада"            , "Склад.ВидСклада");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиОбъектыСтроительстваРегл(СтруктураПолей, СтруктураШапкиДокумента)
	
	СтруктураПолей.Вставить("СчетУчетаБУ",  "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНДС", "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНУ",  "СчетУчетаНУ");
	
КонецПроцедуры

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(Отказ, Заголовок, СтруктураШапкиДокумента)
	мУчетнаяПолитика   = ttk_ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиУпр(Дата,истина);
	Если НЕ ЗначениеЗаполнено(мУчетнаяПолитика) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ (СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете
		ИЛИ СтруктураШапкиДокумента.ОтражатьВНалоговомУчете) Тогда
		
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаРегл = ttk_ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(Дата, Организация,истина);
	Если НЕ ЗначениеЗаполнено(УчетнаяПолитикаРегл) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Если Не Основание.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.Переработка Тогда
			Возврат;
		КонецЕсли;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку;
		
		Сделка = Основание;
		
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		
		// Заполним табличные части неполученными ТМЦ по заказу поставщику.
		ЗаполнитьТоварыПоОстаткамУпр("ВПереработку");
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		СкладОрдер     = Основание.Склад;
		
		ОрганизацияКонтрагента = ЗаполнениеДокументов.ПолучитьОрганизациюПоКонтрагенту(Основание.Контрагент);
		
		Если ЗначениеЗаполнено(ОрганизацияКонтрагента) Тогда
			
			// Документ не отражается в управленческом учете (внутреняя передача товара),
			// поменяем организацию и контрагента местами.
			Организация = ОрганизацияКонтрагента;
			Контрагент  = ЗаполнениеДокументов.ПолучитьКонтрагентаПоОрганизации(Основание.Организация);
			
			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
			
			// Заполним номер и дату вхоящего документа.
			НомерВходящегоДокумента = Основание.Номер;
			ДатаВходящегоДокумента  = Основание.Дата;
			
			ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);
			
		Иначе
			//переносить контрагента и договор нет смысла при такой цепочке
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
		СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		КурсВзаиморасчетов           = СтруктураКурсаВзаиморасчетов.Курс;
		КратностьВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Кратность;
		
		// Заполним табличные части.
		ЗаполнитьТоварыПоОснованиюРеализация(Основание);
		ЗаполнитьУслугиПоОснованиюРеализация(Основание);
		ЗаполнитьВозвратнуюТаруПоОснованиюРеализация(Основание);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПередачаТоваров") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Если Основание.ВидОперации <> Перечисления.ВидыОперацийПередачаТоваров.ВПереработку Тогда
			//договор мог уже заполниться - перезаполним
			ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);
			
			Возврат;
		КонецЕсли;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		// Заполнение шапки.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		
		СчетУчетаРасчетовПоТаре      = Основание.СчетУчетаРасчетовПоТаре;
		ВидОперации					 = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку;
		
		ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);
		
		Для Каждого ТекСтрокаВозвратнаяТара Из Основание.ВозвратнаяТара Цикл
			
			НоваяСтрока = ВозвратнаяТара.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаВозвратнаяТара);
			
		КонецЦикла;
		
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
			
			// Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ЭтотОбъект, "Приобретение"); 
			СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
			Контрагент, ТипЦен, ДоговорКонтрагента, Дата,ВалютаДокумента, УчитыватьНДС,СуммаВключаетНДС);
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(НоваяСтрока, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета); 
			
			// Рассчитываем реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
			
		КонецЦикла;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ОтражатьВУправленческомУчете = Истина;
		Ответственный = Основание.Ответственный;
		Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			//сейчас возможности ввести заказ поставщику на основании счета в случае договора по счетам не поддерживается
			//поэтому считаем что Основание - всегда счет
			Сделка = Основание;
		Иначе  //по заказам или по договору в целом
			Если   ТипОснования  = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
				Сделка = Основание;
			ИначеЕсли ТипЗнч(Основание.ДокументОснование)  = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Сделка = Основание.ДокументОснование;
			КонецЕсли;
		КонецЕсли;
		
		// Не нужно заполнять табличные части, если основание заказ поставщику на переработку.
		Если (ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику")) Тогда
			Если Основание.ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.Переработка Тогда
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		
		
		Если Основание.Оборудование.Количество() = 0 Тогда
			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование;
		КонецЕсли;
		
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		СкладОрдер     = Основание.Склад;
		
		Если ЗначениеЗаполнено(Сделка) И Сделка.Проведен Тогда
			
			// Заполним табличные части неполученными ТМЦ по заказу поставщику.
			ЗаполнитьТоварыПоОстаткамУпр();
			ЗаполнитьВозвратнуюТаруПоОстаткамУпр();
			ЗаполнитьУслугиПоОстаткамУпр();
			
			Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
				ЗаполнитьОборудованиеПоОстаткамУпр();
			КонецЕсли;
			
			ЗаполнитьСчетаУчетаВТабЧасти(Товары, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
			
			ЗаполнитьСчетаУчетаВТабЧасти(ВозвратнаяТара, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			
			СкопироватьОборудование(Основание);
			СкопироватьТовары(Основание);
			СкопироватьВозвратнуюТару(Основание);
			СкопироватьУслуги(Основание);
			
		КонецЕсли;
		
		ОчиститьСкладПриВидеОперацииОборудование(Ложь);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		СкладОрдер     = Основание;
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру;
		
		Если Контрагент.ОсновнойДоговорКонтрагента.Организация = Организация и
			Контрагент.ОсновнойДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			ДоговорКонтрагента           = Контрагент.ОсновнойДоговорКонтрагента;
		Иначе
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ Первые 1 Ссылка 
			|ИЗ Справочник.ДоговорыКонтрагентов
			|Где Организация = &Организация и Владелец = &Контрагент и ВидДоговора = &ВидДоговора и ПометкаУдаления = ложь";
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Организация",Организация);
			Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			
			ВыборкаДоговоров = Запрос.Выполнить().Выбрать();
			Если ВыборкаДоговоров.Следующий() Тогда
				ДоговорКонтрагента = ВыборкаДоговоров.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		ТипЦен                       = ДоговорКонтрагента.ТипЦен;
		УчитыватьНДС                 = Истина;
		СуммаВключаетНДС             = ТипЦен.ЦенаВключаетНДС;
		СуммаВключаетНДС             = ?(ЗначениеЗаполнено(ТипЦен), ТипЦен.ЦенаВключаетНДС, Истина);
		ВалютаДокумента              = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		СтруктураКурса               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсВзаиморасчетов           = СтруктураКурса.Курс;
		КратностьВзаиморасчетов      = СтруктураКурса.Кратность;
		
		Если Основание.Проведен Тогда
			
			// Заполним табличную часть "Товары" по приходному ордеру на товары.
			ЗаполнитьТоварыПоОснованиюУпр(Основание, Товары);
			ЗаполнитьТоварыПоОснованиюУпр(Основание, ВозвратнаяТара);
		КонецЕсли;
		//Абсолют-Софт	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.абс_ЗакупочныйЗаказ") Тогда
		абс_МассивСтрокПо08Счету = Новый Массив;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		абс_ДатаПоставки 	= Дата;
		
		абс_ЗакупочныйЗаказ     = Основание;
		//АБС Е 431
		Подразделение = Основание.ЦФО;
		
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ 
		|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
		|ИЗ
		|	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
		|ГДЕ
		|	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = &Подразделение
		|	И СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПодразделениеОрганизации=Выборка.ПодразделениеОрганизации;
		КонецЕсли;
		
		//\\АБС Е
		ОтражатьВБухгалтерскомУчете		= Ложь;
		ОтражатьВНалоговомУчете 		= Ложь;
		
		
		Если абс_ЗакупочныйЗаказ.ТипЗакупочногоЗаказа = Перечисления.абсТипЗакупочногоЗаказа.Оборудование Тогда
			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		КонецЕсли;
		
		ВидПоступления 		= Перечисления.ВидыПоступленияТоваров.НаСклад;
		
		Если абс_ЗакупочныйЗаказ.Договоры.Количество() > 0 Тогда
			ДоговорКонтрагента        = абс_ЗакупочныйЗаказ.Договоры[0].ДоговорКонтрагента;
		КонецЕсли;
		
		ТипЦен                       = ДоговорКонтрагента.ТипЦен;
		УчитыватьНДС                 = Истина;
		//СуммаВключаетНДС             = Истина;//?(ЗначениеЗаполнено(ТипЦен), ТипЦен.ЦенаВключаетНДС, Истина);
		СуммаВключаетНДС             = Основание.СуммаВключаетНДС;
		ВалютаДокумента              = Основание.ВалютаДокумента;
		СтруктураКурса               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсВзаиморасчетов           = СтруктураКурса.Курс;
		КратностьВзаиморасчетов      = СтруктураКурса.Кратность;
		
		//АБС НАЧАЛО Задача №08759
		ЗаказПроект = Документы.ЗаказПокупателя.ПустаяСсылка();
		Если абс_ЗакупочныйЗаказ.РаспределениеПоПроектам.Количество()=1 Тогда 
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ЗаказПокупателя.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗаказПроект
			|ИЗ
			|	Документ.абс_ЗакупочныйЗаказ.РаспределениеПоПроектам КАК абс_ЗакупочныйЗаказРаспределениеПоПроектам
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|		ПО абс_ЗакупочныйЗаказРаспределениеПоПроектам.Проект = ЗаказПокупателя.Проект
			|ГДЕ
			|	абс_ЗакупочныйЗаказРаспределениеПоПроектам.Ссылка = &ЗакупочныйЗаказ
			|	И ЕСТЬNULL(ЗаказПокупателя.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
			|			И ЕСТЬNULL(абс_ЗакупочныйЗаказРаспределениеПоПроектам.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
			
			Запрос.УстановитьПараметр("ЗакупочныйЗаказ", абс_ЗакупочныйЗаказ);
			
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			ЕСли ВыборкаЗапроса.Следующий() Тогда
				ЗаказПроект = ВыборкаЗапроса.ЗаказПроект;
			КонецЕсли;
			
			//ЗаказПроект = Документы.ЗаказПокупателя.НайтиПоРеквизиту("Проект", абс_ЗакупочныйЗаказ.РаспределениеПоПроектам[0].Проект);
			//АБС ВСТАВКА 32518  24.03.2014 15:28:12  Гетц
			Проект = абс_ЗакупочныйЗаказ.РаспределениеПоПроектам[0].Проект;
			//АБС ВСТАВКА 32518 КОНЕЦ
		КонецЕсли;
		//\\АБС КОНЕЦ Задача №08759
		ТЧ_Товары = абс_ЗакупочныйЗаказ.ПолучитьОбъект().ПолучитьТаблицуТоваровСУчетомРаспределения(); 	// 17.05.13. Гетц, таблица товаров берется с учетом распределения по проектам
		Для Каждого Инд из ТЧ_Товары Цикл // абс_ЗакупочныйЗаказ.Товары 				// 17.05.13. Гетц, таблица товаров берется с учетом распределения по проектам
			
			Если НЕ Инд.Номенклатура.Услуга Тогда
				
				Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
					СтрокаТч = Оборудование.Добавить();
				Иначе
					СтрокаТЧ = Товары.Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,Инд);
				СтрокаТЧ.ЕдиницаИзмерения = Инд.Номенклатура.ЕдиницаХраненияОстатков;
				СтрокаТЧ.Коэффициент = 1;
				
				//АБС Коломиец 4737+
				Если Инд.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
					ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);   
				Иначе
					СтрокаТЧ.СчетУчетаНУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", СтрокаТЧ.СчетУчетаБУ)); 
				КонецЕсли;
				//АБС Коломиец 4737-				
				
			Иначе
				СтрокаТЧ = Услуги.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,Инд);
				Если ПустаяСтрока(СтрокаТЧ.Содержание) Тогда
					СтрокаТЧ.Содержание = СТрокаТЧ.Номенклатура.НаименованиеПолное;
				КонецЕсли;
				
				//АБС 431
				СтрокаТЧ.Подразделение = Подразделение;
				СтрокаТЧ.ПодразделениеОрганизации = ПодразделениеОрганизации;
				//\\АБС Е 431
				//АБС ВСТАВКА 000022382  18.11.2013 12:06:25  Манжела
				ОбъектСтроительства = Неопределено;
				Попытка
					ОбъектСтроительства = Основание.Товары.Найти(Инд.НомерСтроки, "НомерСтроки").ОбъектСтроительства;
				Исключение
				КонецПопытки;
				
				Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда //запомним строки по 08 счету, чтобы потом подставить его
					абс_МассивСтрокПо08Счету.Добавить(Новый Структура("НомерСтроки, Номенклатура, ОбъектСтроительства", СтрокаТЧ.НомерСтроки, СтрокаТЧ.Номенклатура, ОбъектСтроительства));
				КонецЕсли;
				//АБС ВСТАВКА 000022382 КОНЕЦ
			КонецЕсли;
			
			//АБС НАЧАЛО Задача №08759
			Попытка
				
				СтрокаТч.Заказ = Инд.Заказ;
				Если СтрокаТч.Заказ.Пустая() И НЕ ЗаказПроект.Пустая() Тогда 
					СтрокаТч.Заказ = ЗаказПроект;
				КонецЕсли;
			Исключение
			КонецПопытки;
			//\\АБС КОНЕЦ Задача №08759
			абс_ПроектныйУчет.ПроектПриИзменении(СтрокаТч, "абс_Проект", "Заказ", Организация, Дата);//***** Гетц. Проектный учет. 28.06.13 - проставление заказов по проектам
			
			СтрокаТЧ.Цена 		= ?(СуммаВключаетНДС,Инд.ВалютнаяЦенаСНДС,Инд.ВалютнаяЦенаБезНДС);
			СтрокаТЧ.СуммаНДС 	= Инд.ВалютнаяСуммаСНДС - Инд.ВалютнаяСуммаБезНДС;
			СтрокаТЧ.Сумма 		= ?(СуммаВключаетНДС,Инд.ВалютнаяСуммаСНДС,Инд.ВалютнаяСуммаБезНДС);
			Если мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <> '00010101'  
				и мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <= абс_СерверныеФункции.ПолучитьДатуСервера() Тогда
				СтрокаТЧ.абс_ЗакупочныйЗаказТЧ = Основание.Ссылка;   
			КонецЕсли;
		КонецЦикла;
		
		Если мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <> '00010101'  
			и мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <= абс_СерверныеФункции.ПолучитьДатуСервера() Тогда
			СтрокаТЧ = абс_ЗакупочныеЗаказы.Добавить();
			СтрокаТЧ.абс_ЗакупочныйЗаказТЧ = Основание.Ссылка;
			СтрокаТЧ.абс_СуммаБезНДС = абс_ЗакупочныйЗаказ.Товары.Итог("ВалютнаяСуммаБезНДС");
		КонецЕсли;
		//Распределить(ЭтотОбъект); // Глебов. 01.11.13. Проектный учет.
		//***** Гетц. 13.12.13. Новый реквизит
		Если Не Константы.абс_ПроектныйУчет.Получить() Тогда 
			абс_Ресурс = Основание.Ресурс;
		КонецЕсли;
		//***** Гетц. 13.12.13\\
		//Абсолют-Софт
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.НастройкиЗаполненияФорм") Тогда
		
		ХранилищаНастроек.ДанныеФорм.ЗаполнитьОбъектПоНастройке(ЭтотОбъект, Основание, Документы.ПоступлениеТоваровУслуг.СтруктураДополнительныхДанныхФормы());
		
	КонецЕсли;
	
	//УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	//УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	
	// Заполним значения счетов по бухгалтерскому и налоговому учету.
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Услуги Цикл
		СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;
	
	ЗаполнитьСчетаУчетаВТабЧасти(Товары, 		 "Товары", 			ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	ЗаполнитьСчетаУчетаВТабЧасти(Услуги, 		 "Услуги", 			ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	ЗаполнитьСчетаУчетаВТабЧасти(ВозвратнаяТара, "ВозвратнаяТара", 	ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	ЗаполнитьСчетаУчетаВТабЧасти(Оборудование, 	 "Оборудование", 	ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	
	//АБС ВСТАВКА   18.11.2013 15:23:53  Манжела проставим 08 счет по сохранненым строкам (если не будет находиться по номеру строки то переделать на поиск по номенклатуре)
	Если ТипЗнч(абс_МассивСтрокПо08Счету) = Тип("Массив") Тогда 
		Для Каждого ЭлементМассива Из абс_МассивСтрокПо08Счету Цикл
			НайденнаяСтрока = Услуги.Найти(ЭлементМассива.НомерСтроки, "НомерСтроки");
			НайденнаяСтрока.СчетЗатрат = ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств;
			НайденнаяСтрока.Субконто1 = ЭлементМассива.ОбъектСтроительства;
			НайденнаяСтрока.СчетЗатратНУ = ПланыСчетов.Налоговый.СтроительствоОбъектовОсновныхСредств;
			НайденнаяСтрока.СубконтоНУ1 = ЭлементМассива.ОбъектСтроительства;
			//АБС ВСТАВКА 34980  16.12.2013 17:12:07  Шамов
			НайденнаяСтрока.ОбъектСтроительства = ЭлементМассива.ОбъектСтроительства;
			//АБС ВСТАВКА 34980 КОНЕЦ
		КонецЦикла;
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ
	
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаполнитьСтруктуруСчетовУчетаШапки());
	
	// Заполнить реквизиты значениями по умолчанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, "Покупка");
	// Скорректируем заполнившиеся по умолчанию признаки отражения в учетах
	Если  ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		ОтражатьВНалоговомУчете = Ложь;
	КонецЕсли;
	//Заполним склад значением корректного типа
	Если НЕ ЗначениеЗаполнено(СкладОрдер) Тогда
		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
			СкладОрдер = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
		Иначе
			СкладОрдер = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Сделка) И ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") 
		И Сделка.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.Переработка Тогда
		НДСВключенВСтоимость    = Истина;
		УчитыватьНДС            = Ложь;
		СуммаВключаетНДС        = Ложь;
	КонецЕсли; 
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		РегистрироватьЦеныПоставщика = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РегистрироватьЦеныПоставщика");
	КонецЕсли;
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Бобылев А.А. 11.10.2018 416
	Если ttk_ИнтеграцияБП30Сервер.ПроверкаПометкиУдаления(Дата, ПометкаУдаления) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Запрещено устанавливать пометку удаления", Истина);
		Ссылка.ПометкаУдаления = Ложь;
	КонецЕсли;
	//Бобылев А.А.---------------

	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//ххх Брель Виктор Андреевич 26.04.2018 15:22:30, заявка <<<
	Если ЭтоНовый() Тогда
		ОтражатьВБухгалтерскомУчете = Истина;
	КонецЕсли;
	// Брель Виктор Андреевич 26.04.2018 15:22:30 >>>
	
	// +++ввв 13.01.2017 г.
	Если (НЕ ЗначениеЗаполнено(ЭтотОбъект.ttk_ДатаСФ) ИЛИ ПустаяСтрока(ЭтотОбъект.ttk_НомерСФ))
		И ЭтотОбъект.Ссылка.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка И
		ЭтотОбъект.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда
		Для каждого йТабла Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
			Если ЭтотОбъект[йТабла.Имя].Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если ЭтотОбъект.Метаданные().ТабличныеЧасти[йТабла.Имя].Реквизиты.Найти("СтавкаНДС") = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для каждого йСтр Из ЭтотОбъект[йТабла.Имя] Цикл
				Если йСтр.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
					Отказ=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Отказ Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнены Дата или Номер СФ !",Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// ---ввв 13.01.2017 г.
	
	//АБС ВСТАВКА №35863 НАЧАЛО
	ttk_ОбщегоНазначения.абс_УстановитьРежимЗаписиДокумента(абс_Статус, Проведен, РежимЗаписи);
	//\\АБС ВСТАВКА №35863 КОНЕЦ
	
	//АБС ВСТАВКА   28.03.2014 11:44:57  Гетц. Движения не делаются, если не менялось ничего, кроме статуса
	СтруктураПараметров = Новый Структура("Ссылка, ТекущийСтатус, НовыйСтатус, ДокументОбъект, Проведен", Ссылка, Ссылка.абс_Статус, абс_Статус, ЭтотОбъект, Проведен);
	РежимЗаписи = абс_СлужебныеФункции.ПолучитьРежимЗаписиПриСменеСтатуса(СтруктураПараметров, РежимЗаписи);
	//АБС ВСТАВКА  КОНЕЦ
	
	//АБС ВСТАВКА №14995 НАЧАЛО
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ Константы.абс_ОтклКонтрольПроведенияДокументовНеКонцомДня.Получить() 
		И Дата = КонецДня(Дата) Тогда
		Дата = Дата - 1;	
	КонецЕсли;	
	//\\АБС ВСТАВКА №14995 КОНЕЦ	
	
	//АБС ВСТАВКА №4706,42953 НАЧАЛО
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И не ttk_ОбщегоНазначения.абс_НеВыполнятьДвиженияВСтатусе(Новый Структура("Ссылка, абс_Статус", Ссылка, абс_Статус)) 
		и ОтражатьВБухгалтерскомУчете
		и (НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСКонтрагентом) 
		или НЕ ЗначениеЗаполнено(СчетУчетаРасчетовПоАвансам)) Тогда
		Сообщить("Не заполнены счета учета расчетов!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	//\\АБС ВСТАВКА №4706,42953 КОНЕЦ      	
	
	//АБС ВСТАВКА №13110 Начало
	Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК 
		и ((Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.ГоловнаяОрганизация 
		и Константы.абс_КонтрольВГоловнойПоБухгалтеру.Получить())
		или (не Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.ГоловнаяОрганизация 
		и Константы.абс_КонтрольВДЗОпоБухгалтеру.Получить()))
		и (Не ЗначениеЗаполнено(абс_ОтветственныйБухгалтер) или Не ЗначениеЗаполнено(НомерВходящегоДокумента) или Не ЗначениеЗаполнено(ДатаВходящегоДокумента)) Тогда
		//абс_ОтветственныйБухгалтер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"абс_ОтветственныйБухгалтер");
		//Если Не ЗначениеЗаполнено(абс_ОтветственныйБухгалтер) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен на закладке ""дополнительно"" ответственный бухгалтер или вх. номер или вх. дата!",Отказ); 
		//КонецЕсли;	
	КонецЕсли;	
	//\\АБС ВСТАВКА №13110 Конец 
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветХранение Тогда
		//Сторчевой А.Н. НФС 2018 { Закомментировано
		//Если абс_ЗакупочныйЗаказ.Пустая() Тогда
		//	Отказ = истина;
		//	ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен Закупочный Заказ!", Отказ);
		//КонецЕсли;
		//} Сторчевой А.Н. НФС 2018
		//АБС ВСТАВКА 02390
		ЗаполнитьТЧ_ЗЗ();
		//АБСКОНЕЦ
	КонецЕсли;
	ОчиститьНенужныеТабличныеЧасти();
	
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Оборудование);
	
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Услуги);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Оборудование);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, ОбъектыСтроительства);
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	// АБС ВСТАВКА Пополитов 4233 НАЧАЛО
	абс_СуммаНДС = УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект);
	//\\ АБС ВСТАВКА Пополитов 4233 КОНЕЦ 	
	
	УчетНДС.СинхронизацияПометкиНаУдалениеУСчетаФактуры(ЭтотОбъект, "СчетФактураПолученный");
	
	// Заполнить склад и ордер в табличных частях
	СкладИзШапки    =  (Не мУказаниеСкладовВТЧ) И (ВидПоступления <> Перечисления.ВидыПоступленияТоваров.ПоОрдеру);
	
	УправлениеЗаказами.ЗаполнитьЗаказПоставщикуВТЧ(ВидОперации,ЭтотОбъект, "Поступление");
	//при поступлении в переработку все товары должны быть зарезервированы под заказ из шапки
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку и ЗначениеЗаполнено(Сделка) Тогда
		Для каждого СтрокаТЧ из Товары цикл
			СтрокаТЧ.Заказ = Сделка;
		КонецЦикла;
	КонецЕсли;
	
	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, Товары,         СкладИзШапки);
	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, ВозвратнаяТара, СкладИзШапки);
	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, Оборудование,   СкладИзШапки);
	
	Если Не мУказаниеПроектовВТабличнойЧастиДокументов Тогда
		УправлениеПроектами.ЗаполнитьПроектВСтрокахТабЧасти(ЭтотОбъект, Услуги);
	КонецЕсли;
	
	// Удаление неиспользуемых строк табличной части "Серийные номера".
	УчетСерийныхНомеров.УдалитьНеиспользуемыеСтрокиПодчиненнойТЧ(ЭтотОбъект, мПараметрыСвязиСтрокТЧ, "Товары");
	
	УчетНДС.ПроверитьСоответствиеРеквизитовСчетаФактуры(ЭтотОбъект, "СчетФактураПолученный");
	
	// Заполним субконто затрат
	СчетаУчетаВДокументах.ЗаполнитьСубконтоТабличнойЧасти("Услуги", ЭтотОбъект, ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	
	мУдалятьДвижения = НЕ ЭтоНовый();                    
	
	// АБС ВСТАВКА Фролов
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(абс_Статус) Тогда
		
		абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
		
	КонецЕсли;
	// АБС ВСТАВКА Фролов КОНЕЦ
	
	// АБС ВСТАВКА Не разрешаем проводить ППД без файлов 20111010 Инициатор: Калымкин
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветХранение Тогда
		Если НЕ абс_БизнесПроцессы.ПроверитьНаличиеФайловППД(Ссылка, Ссылка.абс_Статус, абс_Статус) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не прикреплены файлы к ППД.", Отказ);
		КонецЕсли;	
		// АБС ВСТАВКА Не разрешаем проводить ППД без файлов 20111010 Инициатор: Калымкин КОНЕЦ
		
		Если Ссылка.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка И 
			(абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером ИЛИ абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК) Тогда
			
			//АБС Коломиец+
			Если Дата >= '20111001000000' И НЕ абс_ЗакупочныйЗаказ.НефиксированнаяСумма И НЕ абс_ЗакупочныйЗаказ.УбыткиПрошлыхЛет Тогда
				Если НЕ НачалоМесяца(Дата) = НачалоМесяца(абс_ДатаПоставки) Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("Дата поставки должна быть в том же месяце что и дата документа.", Отказ);
				КонецЕсли;
			КонецЕсли;	
			
			//Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Или
			//	 абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда		 
			//	 Если Дата >= '20111001000000' И НЕ абс_ЗакупочныйЗаказ.НефиксированнаяСумма И НЕ абс_ЗакупочныйЗаказ.УбыткиПрошлыхЛет Тогда
			//	 	Если НЕ НачалоМесяца(Дата) = НачалоМесяца(абс_ДатаПоставки) Тогда
			//	 		ttk_ОбщегоНазначения.СообщитьОбОшибке("Дата поставки должна быть в том же месяце что и дата документа.", Отказ);
			//	 	КонецЕсли;
			//	 КонецЕсли;						 
			//Иначе
			Если 	
				Дата >= '20111001000000' И НЕ абс_ЗакупочныйЗаказ.НефиксированнаяСумма И НЕ абс_ЗакупочныйЗаказ.УбыткиПрошлыхЛет Тогда  //АБС Коломиец
				Если НЕ НачалоМесяца(Дата) = НачалоМесяца(абс_ДатаПоставки)
					И НЕ (НачалоДня(Дата) = '20120101000000' И НачалоМесяца(абс_ДатаПоставки) = '20111201000000') Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("Дата поставки должна быть в том же месяце что и дата документа.", Отказ);
				КонецЕсли;
			КонецЕсли;
			//АБС Коломиец-
			
			//Сторчевой А.Н. НФС 2018 {ЗАКОММЕНТИРОВАНО
			//Если НЕ абс_ЗакупочныйЗаказ.АгентскаяСхема И НЕ Контрагент = абс_ЗакупочныйЗаказ.Контрагент Тогда
			//	ttk_ОбщегоНазначения.СообщитьОбОшибке("Контрагент не соответствует контрагенту в закупочном заказе.", Отказ);
			//КонецЕсли;
			//} Сторчевой А.Н. НФС 2018
			
			//АБС ВСТАВКА 000021727  07.11.2013 11:58:30  Тупиков
			Для Каждого Стр Из абс_ЗакупочныеЗаказы Цикл
				Если НЕ Стр.абс_ЗакупочныйЗаказТЧ.АгентскаяСхема И НЕ Контрагент = Стр.абс_ЗакупочныйЗаказТЧ.Контрагент Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("В табличной части ""Закупочные заказы"" в строке "+Стр.НомерСтроки+ " контрагент не соответствует контрагенту в закупочном заказе.", Отказ);
				КонецЕсли;
			КонецЦикла;
			//АБС ВСТАВКА 000021727 КОНЕЦ
			
		КонецЕсли;
		
		// АБС ВСТАВКА 3030
		// Проверяем статус ЗЗ, если ЗЗ не согласован, не даем обработать документ
		Если Ссылка.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК И абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером Тогда
			
			//Сторчевой А.Н. НФС 2018 {                                   
			//Если НЕ абс_ЗакупочныйЗаказ.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Согласован И НЕ абс_ЗакупочныйЗаказ.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Исполнение Тогда
			//	ttk_ОбщегоНазначения.СообщитьОбОшибке("" + абс_ЗакупочныйЗаказ + " не согласован!", Отказ);
			//КонецЕсли;
			Для Каждого Стр Из абс_ЗакупочныеЗаказы Цикл
				Если НЕ Стр.абс_ЗакупочныйЗаказТЧ.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Согласован И НЕ Стр.абс_ЗакупочныйЗаказТЧ.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Исполнение Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("" + Стр.абс_ЗакупочныйЗаказТЧ + " не согласован!", Отказ);
				КонецЕсли;
			КонецЦикла;
			// } Сторчевой А.Н. НФС 2018
			
		КонецЕсли;
		// АБС ВСТАВКА 3030 КОНЕЦ	
	КонецЕсли;
	
	// АБС ВСТАВКА 
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не указан ответственный", Отказ);
	КонецЕсли;	
	// АБС ВСТАВКА КОНЕЦ	
	
	Если Ссылка.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка И          //АБС Коломиец 20532
		(абс_Статус <> Ссылка.абс_Статус И абс_Статус <> Перечисления.абс_СтатусыПервичныхДокументов.Отказ И абс_Статус <> Перечисления.абс_СтатусыПервичныхДокументов.Отмена) Тогда 
		Если НЕ абс_БизнесПроцессы.ПроверитьНаличиеФайловБюджетныйКомитет(Ссылка) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не приложен файл подтверждения от Бюджетного комитета.", Отказ);
		КонецЕсли;		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

// Процедура - обработчик события "ПриЗаписи"
//
Процедура ПриЗаписи(Отказ)
	
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//АБС ВСТАВКА №15486 НАЧАЛО (для условных начислений)
	Если Константы.абс_ДатаВходящегоДокументаКонтроль.Получить()
		и НЕ ЗначениеЗаполнено(ДатаВходящегоДокумента)
		и НЕ (абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ 
		или абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена
		или абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.УточнениеБухгалтерией
		или абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.УточнениеОФК
		или абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнена дата входящего документа, на закладке ""Дополнительно""!",Отказ);	
	КонецЕсли;
	//\\АБС ВСТАВКА №15486 КОНЕЦ (для условных начислений)	
	
	//АБС ВСТАВКА №11811 НАЧАЛО 
	Если НЕ Константы.абс_ВыклКонтрольСтатусаЗавершенВЗакупочномЗаказе.Получить()
		и абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("абс_Статус",Перечисления.абсСтатусЗакупочногоЗаказа.Завершен);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслугТовары.абс_ЗакупочныйЗаказТЧ КАК ЗакупочныйЗаказ,
		|	ПоступлениеТоваровУслугТовары.НомерСтроки,
		|	""Товары"" КАК Область,
		|	ПоступлениеТоваровУслугТовары.абс_ЗакупочныйЗаказТЧ.Статус КАК СтатусЗЗ
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугТовары.абс_ЗакупочныйЗаказТЧ.Статус В(&абс_Статус)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.абс_ЗакупочныйЗаказТЧ,
		|	ПоступлениеТоваровУслугТовары.НомерСтроки,
		|	ПоступлениеТоваровУслугТовары.абс_ЗакупочныйЗаказТЧ.Статус
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ,
		|	ПоступлениеТоваровУслугУслуги.НомерСтроки,
		|	""Услуги"",
		|	ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ.Статус
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ.Статус В(&абс_Статус)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ,
		|	ПоступлениеТоваровУслугУслуги.НомерСтроки,
		|	ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ.Статус
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугОборудование.абс_ЗакупочныйЗаказТЧ,
		|	ПоступлениеТоваровУслугОборудование.НомерСтроки,
		|	""Оборудование"",
		|	ПоступлениеТоваровУслугОборудование.абс_ЗакупочныйЗаказТЧ.Статус
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
		|ГДЕ
		|	ПоступлениеТоваровУслугОборудование.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугОборудование.абс_ЗакупочныйЗаказТЧ.Статус В(&абс_Статус)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугОборудование.абс_ЗакупочныйЗаказТЧ,
		|	ПоступлениеТоваровУслугОборудование.НомерСтроки,
		|	ПоступлениеТоваровУслугОборудование.абс_ЗакупочныйЗаказТЧ.Статус
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЗакупочныйЗаказТЧ,
		|	ПоступлениеТоваровУслугОбъектыСтроительства.НомерСтроки,
		|	""Объекты строительства"",
		|	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЗакупочныйЗаказТЧ.Статус
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
		|ГДЕ
		|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЗакупочныйЗаказТЧ.Статус В(&абс_Статус)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЗакупочныйЗаказТЧ,
		|	ПоступлениеТоваровУслугОбъектыСтроительства.НомерСтроки,
		|	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЗакупочныйЗаказТЧ.Статус
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ,
		|	0,
		|	""Шапке документа"",
		|	ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ.Статус
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ.Статус В(&абс_Статус)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ,
		|	ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ.Статус";
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			НомерСтроки = ?(Результат.НомерСтроки=NULL,0,Результат.НомерСтроки);
			Если НомерСтроки = 0 Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("В """+Результат.Область+""" выбран ЗЗ со статусом """+Результат.СтатусЗЗ+"""!",Отказ);
			Иначе	
				ttk_ОбщегоНазначения.СообщитьОбОшибке("В таб. части """+Результат.Область+""" выбран ЗЗ со статусом """+Результат.СтатусЗЗ+""" строка №"+НомерСтроки,Отказ);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	//\\АБС ВСТАВКА №11811 КОНЕЦ 	
	
	// АБС ВСТАВКА Согласование первичных документов
	Попытка
		
		СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусПервичногоДокументаПоРегистру(Ссылка);
		
		Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда
			//Сторчевой А.Н. 77269088 06.02.2018 {
			Если ЗначениеЗаполнено(абс_ЗакупочныйЗаказ) и Дата < '20180101' Тогда
				//} Сторчевой А.Н. 77269088 06.02.2018
				Если НЕ абс_БизнесПроцессы.МожноСогласовыватьСчетНаОплатуПоСтатусуЗЗ(абс_ЗакупочныйЗаказ.Статус) Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("Закупочный заказ не находится на статусе Согласован ОФК.", Отказ);
				КонецЕсли;
				//Сторчевой А.Н. 77269088 06.02.2018 {
			Иначе
				Для Каждого зСтр Из абс_ЗакупочныеЗаказы Цикл
					Если НЕ абс_БизнесПроцессы.МожноСогласовыватьСчетНаОплатуПоСтатусуЗЗ(зСтр.абс_ЗакупочныйЗаказТЧ.Статус) Тогда
						ttk_ОбщегоНазначения.СообщитьОбОшибке("" + зСтр.абс_ЗакупочныйЗаказТЧ + " не находится на статусе Согласован ОФК.", Отказ);
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
			//} Сторчевой А.Н. 77269088 06.02.2018
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
		
		Если НЕ абс_Статус = СтатусПоРегистру Тогда
			ЗаписатьНовыйСтатус(абс_Статус, абс_ПричинаИзмененияСтатуса);
			
			абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомлениеППД(Ссылка, абс_Статус);
		КонецЕсли;
		
		// АБС Новоселов+ Агентская схема
		ТекстОшибки = "";
		ОтменитьПроведение = Ложь;
		Если Не Отказ И Не ЗаписатьЧерезВэбСервис(ТекстОшибки) Тогда 
			ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
		КонецЕсли; // АБС Новоселов-
		
		// АБС ВСТАВКА 20120419 Фролов
		// Временно отключаем формирование задач по ППД
		Возврат;
		// АБС ВСТАВКА 20120419 Фролов 
		
		// Запустим БП если он еще не запущен
		Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда
			БПСогласование = НайтиБПСогласование();
			
			Если Не ЗначениеЗаполнено(БПСогласование) Тогда
				абс_БизнесПроцессы.ЗапуститьБПСогласованияПервичногоДокумента(Ссылка);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.УточнениеБухгалтерией Тогда
			
			БПСогласование = НайтиБПСогласование();
			
			Если Не ЗначениеЗаполнено(БПСогласование) Тогда
				абс_БизнесПроцессы.ЗапуститьБПСогласованияПервичногоДокументаУточнениеБухгалтером(Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
		// Попробуем закрыть задачу согласования
		ЗадачаСогласование = ПолучитьЗадачуПоПервичномуДокументуСогласование();
		
		Если ЗадачаСогласование = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗадачаСогласование.Выполнена Тогда
			
			ЗадачаОбъект = ЗадачаСогласование.ПолучитьОбъект();			
			ЗадачаОбъект.ВыполнитьЗадачу();
		КонецЕсли;
		
	Исключение
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при записи документа: " + ОписаниеОшибки() + ".", Отказ);
		
	КонецПопытки;	
	
	// АБС ВСТАВКА Согласование первичных документов КОНЕЦ
	
КонецПроцедуры

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения=неопределено,Отказ=ложь) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ttk_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ttk_ОбщегоНазначения.СформироватьСтруктуруШапкиДокументаИПроверитьОтражениеВУчете(ЭтотОбъект, Отказ, Заголовок);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьВСтруктуруШапкиСведенияОСчетахРасчетов(ЭтотОбъект, СтруктураШапкиДокумента);
	
	Если РежимПроведения = Неопределено Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
	
	// Для определения где нужно проверять склад: в шапке или в ТЧ.
	СтруктураШапкиДокумента.Вставить("СкладВТабличнойЧасти", мУказаниеСкладовВТЧ);
	
	// Если есть колонка заказ, то заполнение поля Сделка не обязательно
	ЗаказВТабличнойЧасти = УправлениеЗаказами.ЕстьЗаказВТабличнойЧасти(ВидОперации, ДоговорКонтрагента, "Поступление");
	СтруктураШапкиДокумента.Вставить("ЗаказВТабличнойЧасти", ЗаказВТабличнойЧасти);
	
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = УправлениеЗапасами.СформироватьДеревоПолейЗапросаПоШапке();
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВедениеВзаиморасчетов"                   , "ВедениеВзаиморасчетов");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВалютаВзаиморасчетов"                    , "ВалютаВзаиморасчетов");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "Организация"                             , "ДоговорОрганизация");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВидДоговора"                             , "ВидДоговора");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "УчетАгентскогоНДС"                       , "УчетАгентскогоНДС");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВидАгентскогоДоговора"                   , "ВидАгентскогоДоговора");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "НалоговыйАгентПоОплате"                  , "НалоговыйАгентПоОплате");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "РасчетыВУсловныхЕдиницах"                , "РасчетыВУсловныхЕдиницах");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВестиПоДокументамРасчетовСКонтрагентом"  , "ВестиПоДокументамРасчетовСКонтрагентом");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Организация",          "ОтражатьВРегламентированномУчете"        , "ОтражатьВРегламентированномУчете");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка",               "ВидОперации"                             , "СделкаВидОперации");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"              , "ВидОперации"                             , "СделкаВидОперации");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",      "СписыватьПартииПриПроведенииДокументов"  , "СписыватьПартииПриПроведенииДокументов");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",      "ВестиПартионныйУчетПоСкладам"            , "ВестиПартионныйУчетПоСкладам");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "НеВключатьНДСВСтоимостьПартий"           , "НеВключатьНДСВСтоимостьПартий");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам"                  , "ВедениеУчетаПоПроектам");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВестиУчетТоваровОрганизацийВРазрезеСкладов"   , "ВестиУчетТоваровОрганизацийВРазрезеСкладов");
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер",       "ВидСклада",                              "ВидСклада");
	Иначе
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер",       "Склад",                                  "СкладПриходногоОрдера");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер",       "Склад.ВидСклада",                        "ВидСклада");
	КонецЕсли;
	
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер"      , "БезПраваПродажи"                   , "БезПраваПродажи");
	
	// Если сделка - Заказ поставщику, то надо цену для проведения пересчитать в валюту заказа.
	Если ЗначениеЗаполнено(Сделка) 
		И (ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "ВалютаДокумента"                       , "ВалютаЗаказа");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КурсВзаиморасчетов"                    , "КурсВзаиморасчетовЗаказа");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КратностьВзаиморасчетов"               , "КратностьВзаиморасчетовЗаказа");
	КонецЕсли;
	
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке);
	
	// Если надо пересчитывать цену в валюту заказа. то в структуре должна быть заполнена валюта заказа.
	ВалютаЗаказа = Неопределено;
	НужнаЦенаЗаказа = Ложь;
	Если СтруктураШапкиДокумента.Свойство("ВалютаЗаказа", ВалютаЗаказа) Тогда
		НужнаЦенаЗаказа = Истина;
		Если ВалютаЗаказа = мВалютаРегламентированногоУчета Тогда
			КурсЗаказа      = 1;
			КратностьЗаказа = 1;
		Иначе //ВалютаЗаказа = ВалютаВзаиморасчетов
			КурсЗаказа      = СтруктураШапкиДокумента.КурсВзаиморасчетовЗаказа;
			КратностьЗаказа = СтруктураШапкиДокумента.КратностьВзаиморасчетовЗаказа;
		КонецЕсли;
		СтруктураШапкиДокумента.Вставить("КурсЗаказа"     , КурсЗаказа);
		СтруктураШапкиДокумента.Вставить("КратностьЗаказа", КратностьЗаказа);
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("НужнаЦенаЗаказа", НужнаЦенаЗаказа);
	
	// Здесь контролировать сумму задолженности, предоплату и число дней задолженности не надо
	СтруктураШапкиДокумента.Вставить("КонтролироватьСуммуЗадолженности", Ложь);
	СтруктураШапкиДокумента.Вставить("ПроцентПредоплаты", 0);
	СтруктураШапкиДокумента.Вставить("КонтролироватьЧислоДнейЗадолженности", Ложь);
	
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке);
	ДополнитьДеревоПолейЗапросаПоШапкеРегл(ДеревоПолейЗапросаПоШапке);
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

//Процедура добавляет в структуру полей сведения о СтатьеЗатрат и НоменклатурнойГруппе из Номенклатуры
//	Эти сведения впоследствии могут пригодиться для заполнения незаполненных Статьи и НоменклатурнойГруппы
//	Также процедура готовит структуру, сопоставляющую поля из табличной части документа и поля из номенклатуры
Процедура ДополнитьСтруктуруПолейДаннымиНоменклатуры(СтруктураПолей, СтруктураОбрабатываемыхКолонок)
	//Поля для заполнения 
	СтруктураПолей.Вставить("СтатьяЗатратНоменклатуры", "Номенклатура.СтатьяЗатрат");
	СтруктураПолей.Вставить("ХарактерЗатратНоменклатуры", "Номенклатура.СтатьяЗатрат.ХарактерЗатрат");
	СтруктураПолей.Вставить("НоменклатурнаяГруппаНоменклатуры", "Номенклатура.НоменклатурнаяГруппаЗатрат");
	
	СтруктураОбрабатываемыхКолонок.Вставить("СтатьяЗатрат", 			"СтатьяЗатратНоменклатуры");
	СтруктураОбрабатываемыхКолонок.Вставить("НоменклатурнаяГруппа", 	"НоменклатурнаяГруппаНоменклатуры");
	СтруктураОбрабатываемыхКолонок.Вставить("ХарактерЗатрат", 			"ХарактерЗатратНоменклатуры");
КонецПроцедуры

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, ТаблицаПоТаре) Экспорт
	
	СкладИзШапки    =  Не мУказаниеСкладовВТЧ;
	
	// Получим необходимые данные для проведения и проверки заполнения данные по табличной части "Товары".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТовары();
	
	СтруктураПолей.Вставить("Услуга"                               , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                                , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                             , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("ЗаказПокупателя"                      , "Заказ");
	СтруктураПолей.Вставить("ВидЗаказаПокупателя"                  , "Заказ.ВидОперации");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"                , "Заказ.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	"Заказ.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"                     , "ЕдиницаИзмерения");
	
	Если СкладИзШапки и ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		СтруктураПолей.Вставить("Склад"                                , "Ссылка.СкладОрдер");
		СтруктураПолей.Вставить("ВидСкладаРазмещения"                  , "Ссылка.СкладОрдер.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("Склад"                                , "Склад");
		СтруктураПолей.Вставить("ВидСкладаРазмещения"                  , "Склад.ВидСклада");
	КонецЕсли;
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("ВидСклада"       , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		Если СкладИзШапки Тогда
			СтруктураПолей.Вставить("ВидСклада"   , "Ссылка.СкладОрдер.ВидСклада");
		Иначе
			СтруктураПолей.Вставить("ВидСклада"   , "Склад.ВидСклада");
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПолей.Вставить("ДокументПолучения"                    , "ПриходныйОрдер");
	СтруктураПолей.Вставить("ОрганизацияДокументаПолучения"        , "ПриходныйОрдер.Организация");
	СтруктураПолей.Вставить("БезПраваПродажи"                      , "ПриходныйОрдер.БезПраваПродажи");
	СтруктураПолей.Вставить("Цена"                                 , "Цена");
	СтруктураПолей.Вставить("НДС"                                  , "СуммаНДС");
	СтруктураПолей.Вставить("Коэффициент"                          , "Коэффициент");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"                  , "ПриходныйОрдер.Склад");
	СтруктураПолей.Вставить("УчетПоСериям"                         , "Номенклатура.ВестиУчетПоСериям");
	СтруктураПолей.Вставить("СтранаПроисхождения"                  , "СерияНоменклатуры.СтранаПроисхождения");
	СтруктураПолей.Вставить("НомерГТД"                             , "СерияНоменклатуры.НомерГТД");
	СтруктураПолей.Вставить("ЗаказПоставщику"                      , "ЗаказПоставщику");
	
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиТоварыРегл(СтруктураПолей, СтруктураШапкиДокумента);
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам И НЕ ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей=Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей=Неопределено;	
	КонецЕсли;
	
	РезультатЗапросаПоТоварам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураСложныхПолей);
	
	// Получим необходимые данные для проведения и проверки заполнения данные 
	// по табличной части "Услуги".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",             "Номенклатура");
	СтруктураПолей.Вставить("Количество",               "Количество");
	СтруктураПолей.Вставить("Сумма",                    "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС",                "СтавкаНДС");
	СтруктураПолей.Вставить("НДС",                      "СуммаНДС");
	СтруктураПолей.Вставить("СуммаНДС",                 "СуммаНДС");
	СтруктураПолей.Вставить("Содержание",               "Содержание");
	СтруктураПолей.Вставить("Услуга",                   "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор",                    "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект",                 "Номенклатура.Комплект");
	СтруктураПолей.Вставить("СтатьяЗатрат",             "СтатьяЗатрат");
	СтруктураПолей.Вставить("ХарактерЗатрат",           "СтатьяЗатрат.ХарактерЗатрат");
	СтруктураПолей.Вставить("Продукция",                "Продукция");
	СтруктураПолей.Вставить("ХарактеристикаПродукции",  "ХарактеристикаПродукции");
	СтруктураПолей.Вставить("СерияПродукции",           "СерияПродукции");
	СтруктураПолей.Вставить("Подразделение",            "Подразделение");
	СтруктураПолей.Вставить("ПодразделениеОрганизации", "ПодразделениеОрганизации");
	СтруктураПолей.Вставить("Заказ",                    "Заказ");
	СтруктураПолей.Вставить("ЗаказПоставщику",          "ЗаказПоставщику");
	СтруктураПолей.Вставить("СпособРаспределенияЗатратНаВыпуск", "СпособРаспределенияЗатратНаВыпуск");
	СтруктураПолей.Вставить("ПроектЗатрат", "Проект");
	// Павлов 26798
	СтруктураПолей.Вставить("абс_ЗакупочныйЗаказТЧ", "абс_ЗакупочныйЗаказТЧ");
	
	// АБС ВСТАВКА Движения по льготам по НДС
	СтруктураПолей.Вставить("абс_ЛьготаПоНДС", 			  "абс_ЛьготаПоНДС");
	СтруктураПолей.Вставить("абс_РасходыБудущихПериодов", "абс_РасходыБудущихПериодов");
	// АБС ВСТАВКА Движения по льготам по НДС КОНЕЦ
	
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиУслугиУпр(СтруктураПолей);
	ДополнитьСтруктуруПолейТабличнойЧастиУслугиРегл(СтруктураПолей);
	
	СтруктураОбрабатываемыхКолонок = Новый Структура();
	ДополнитьСтруктуруПолейДаннымиНоменклатуры(СтруктураПолей, СтруктураОбрабатываемыхКолонок);
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам И НЕ ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей=Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей=Неопределено;	
	КонецЕсли;
	
	РезультатЗапросаПоУслугам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей, СтруктураСложныхПолей);
	
	// Получим необходимые данные для проведения и проверки заполнения данные 
	// по табличной части "Оборудование".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТовары();
	СтруктураПолей.Вставить("Цена" ,            "Цена");
	СтруктураПолей.Вставить("ЕдиницаИзмерения", "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("ЗаказПоставщику",  "ЗаказПоставщику");
	Если СкладИзШапки и ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		СтруктураПолей.Вставить("Склад"                                , "Ссылка.СкладОрдер");
	Иначе
		СтруктураПолей.Вставить("Склад"                                , "Склад");
	КонецЕсли;
	
	//АБС НАЧАЛО Задача №08759
	СтруктураПолей.Вставить("Заказ",                    "Заказ");
	//\\АБС КОНЕЦ Задача №08759
	
	СтруктураПолей.Вставить("ДокументПолучения"                    , "ПриходныйОрдер");
	СтруктураПолей.Вставить("ОрганизацияДокументаПолучения"        , "ПриходныйОрдер.Организация");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"                  , "ПриходныйОрдер.Склад");
	СтруктураПолей.Вставить("БезПраваПродажи"                      , "ПриходныйОрдер.БезПраваПродажи");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам И НЕ ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей=Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей=Неопределено;	
	КонецЕсли;
	
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеУпр(СтруктураПолей);
	ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеРегл(СтруктураПолей, СтруктураШапкиДокумента);
	
	РезультатЗапросаПоОборудованию = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Оборудование", СтруктураПолей, СтруктураСложныхПолей);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ОбъектСтроительства", "ОбъектСтроительства");
	СтруктураПолей.Вставить("СпособСтроительства", "СпособСтроительства");
	СтруктураПолей.Вставить("СтатьяЗатрат"       , "СтатьяЗатрат");
	СтруктураПолей.Вставить("Сумма"              , "Сумма");
	СтруктураПолей.Вставить("СуммаНДС"           , "СуммаНДС");
	СтруктураПолей.Вставить("СтавкаНДС"			 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"				 , "СуммаНДС");
	
	ДополнитьСтруктуруПолейТабличнойЧастиОбъектыСтроительстваРегл(СтруктураПолей, СтруктураШапкиДокумента);
	
	РезультатЗапросаПоОбъектамСтроительства = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОбъектыСтроительства", СтруктураПолей);
	
	// Получим необходимые данные для проведения и проверки заполнения данные 
	// по табличной части "Возвратная тара".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТара();
	СтруктураПолей.Вставить("ЗаказПокупателя"           , "Заказ");
	СтруктураПолей.Вставить("Цена"                      , "Цена");
	Если СкладИзШапки и ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		СтруктураПолей.Вставить("Склад"                                , "Ссылка.СкладОрдер");
		СтруктураПолей.Вставить("ВидСклада"								, 	 "Ссылка.СкладОрдер.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("Склад"                                , "Склад");
		СтруктураПолей.Вставить("ВидСклада"								,"Склад.ВидСклада");
	КонецЕсли;
	СтруктураПолей.Вставить("ДокументПолучения"         , "ПриходныйОрдер");
	СтруктураПолей.Вставить("БезПраваПродажи"           , "ПриходныйОрдер.БезПраваПродажи");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"     , "Заказ.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	"Заказ.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("ВидСкладаРазмещения"       , "Склад.ВидСклада");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"       , "ПриходныйОрдер.Склад");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "Номенклатура.ЕдиницаХраненияОстатков");
	СтруктураПолей.Вставить("ЗаказПоставщику"           , "ЗаказПоставщику");
	
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараУпр(СтруктураПолей);
	ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараРегл(СтруктураПолей, СтруктураШапкиДокумента);
	
	РезультатЗапросаПоТаре = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей);
	
	// Подготовим таблицы товаров для проведения.
	ТаблицаПоТаре         = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента);
	
	ТаблицаПоТоварам      = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
	ТаблицаПоОборудованию = ПодготовитьТаблицуТоваров(РезультатЗапросаПоОборудованию, СтруктураШапкиДокумента);
	ТаблицаПоУслугам      = ПодготовитьТаблицуТоваров(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента);
	ТаблицаПоОбъектамСтроительства = ПодготовитьТаблицуОбъектовСтроительства(РезультатЗапросаПоОбъектамСтроительства, СтруктураШапкиДокумента);
	
	//Заполним в таблице по услугам подразделение организации
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуДокументаПодразделениемОрганизации(СтруктураШапкиДокумента, ТаблицаПоУслугам);
	
	//Заполнение незаполненных СтатьиЗатрат и НоменклатурнойГруппы по Номенклатуре в Таблице услуг
	ОбщегоНазначенияКлиентСервер.ЗаполнитьНоменклатурнуюГруппуИСтатьюЗатратВТаблицеДокумента(ТаблицаПоУслугам, СтруктураОбрабатываемыхКолонок);
	
	//Счета учета номенклатуры и затрат
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("Товары", 			ТаблицаПоТоварам, 		СтруктураШапкиДокумента);
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("ВозвратнаяТара", 	ТаблицаПоТаре, 			СтруктураШапкиДокумента);
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("Услуги", 			ТаблицаПоУслугам, 		СтруктураШапкиДокумента);
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("Оборудование", 	ТаблицаПоОборудованию, 	СтруктураШапкиДокумента);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоТоварам,               СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета);
		БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоОборудованию,          СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета);
		БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета);
		БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоУслугам              , СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета);
		БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоТаре                 , СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета);
	КонецЕсли;
	
	БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоТоварам, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоТоварам, "Поступление");
	БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоУслугам, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоУслугам, "");
	БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоОборудованию, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоОборудованию, "Поступление");
	БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоОбъектамСтроительства, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоОбъектамСтроительства, "Поступление");
	
КонецПроцедуры // СформироватьТаблицыДокумента()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, ТаблицаПоТаре;
	Перем ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам;
	
	//АБС ВСТАВКА №26714 НАЧАЛО «31 января 2014 г.», Пополитов
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ttk_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);	
	// Проверка ручной корректировки
	Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;	
	//\\АБС ВСТАВКА №26714 КОНЕЦ
	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, Истина, РежимПроведения);
	КонецЕсли;
	
	// АБС Новоселов+ Агентская схема
	Если ОтменитьПроведение Тогда 
		Возврат;
	КонецЕсли; // АБС Новоселов-
	
	//абсо{
	//(заявка 9747 - не делать проводок в статусе "отказ")
	Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//}абсо   		
	
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения,Отказ);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, ТаблицаПоТаре);
	
	ПроводитьПоВзаиморасчетам = (СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком 
	И ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
	мСтруктураПараметровВзаиморасчетов.Вставить("ПроводитьПоВзаиморасчетам", ПроводитьПоВзаиморасчетам);
	
	СтруктураПодготовленныхТаблиц = Новый Структура("Товары, Услуги, Оборудование, ОбъектыСтроительства", 
	ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства);
	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", СтруктураПодготовленныхТаблиц);
	УправлениеВзаиморасчетами.ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	ЭтотОбъект, мСтруктураПараметровВзаиморасчетов, СтруктураШапкиДокумента, 
	Отказ, Заголовок);
	
	// Проверить заполнение ТЧ 
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиОборудование(ТаблицаПоОборудованию, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиОбъектыСтроительства(ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// АБС ВСТАВКА Начало
	Если мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <> '00010101'  
		и мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <= СтруктураШапкиДокумента.Дата Тогда
		ПроверитьЗаполнениеТабличнойЧастиЗакупочныеЗаказы(Отказ, Заголовок);
	КонецЕсли;
	// АБС ВСТАВКА Конец
	
	//Счета учета номенклатуры и затрат
	//ххх Брель Виктор Андреевич 27.04.2018 19:04:27, заявка <<<
	Если СтатусПоРегистру  <> Перечисления.абс_СтатусыПервичныхДокументов.Подготовка 
		И СтатусПоРегистру  <> Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда	
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("Товары", 			ТаблицаПоТоварам, 		СтруктураШапкиДокумента, Отказ, Заголовок);
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("ВозвратнаяТара", 	ТаблицаПоТаре, 			СтруктураШапкиДокумента, Отказ, Заголовок);
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("Услуги", 			ТаблицаПоУслугам, 		СтруктураШапкиДокумента, Отказ, Заголовок);
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("Оборудование", 		ТаблицаПоОборудованию, 	СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;  
	// Брель Виктор Андреевич 27.04.2018 19:04:27 >>>
	

	//Проверим на возможность проведения в БУ и НУ
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете или СтруктураШапкиДокумента.ОтражатьВНалоговомУчете тогда
		УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, СтруктураШапкиДокумента.ВалютаДокумента,
		СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете,СтруктураШапкиДокумента.ОтражатьВНалоговомУчете,
		мВалютаРегламентированногоУчета, Ложь,Отказ, Заголовок);
	КонецЕсли;
	
	ПодготовитьПараметрыУчетнойПолитики(Отказ, Заголовок, СтруктураШапкиДокумента);
	
	// Лапин 33960 начало  
	//АБС ВСТАВКА 35750  27.01.2014 16:11:25  Шамов
	//нужно распределить сумму отклонения по таблицам
	Если ВалютаДокумента <> мВалютаРегламентированногоУчета 
		И (абс_СуммаНДСПоСчетуФактуре <> 0 ИЛИ ОбщаяСтоимостьСНДСПоСчетуФактуре <> 0) Тогда  // Лапин 33960 начало //ОбщаяСтоимостьСНДСПоСчетуФактуре
		
		Если ДокументыРасчетовСКонтрагентом.Количество() = 0 Тогда  // Лапин 33960 начало   Авансов нет
			мТаблицыДокумента = Новый Структура;
			мТаблицыДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			мТаблицыДокумента.Вставить("ТаблицаПоОборудованию", ТаблицаПоОборудованию);
			мТаблицыДокумента.Вставить("ТаблицаПоУслугам", ТаблицаПоУслугам);
			мТаблицыДокумента.Вставить("ТаблицаПоОбъектамСтроительства", ТаблицаПоОбъектамСтроительства);
			абс_РаспределитьНДСПоТаблицам(мТаблицыДокумента); 
		Иначе // Лапин 33960  
			// есть авансы.. значит распределение не делаем, а исправляем корректировочные записи!!! перед их записью 
		КонецЕсли;
		
	КонецЕсли;
	//АБС ВСТАВКА 35750 КОНЕЦ
	// Лапин 33960 окончание  
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
		ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
		ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
		Отказ, Заголовок);
	КонецЕсли;
	
	//Сделаем переменные доступными из подписок на события
	ДополнительныеСвойства.Вставить("СтруктураШапкиДокумента", СтруктураШапкиДокумента);
	ДополнительныеСвойства.Вставить("СтруктураТабличныхЧастей", Новый Структура("ТаблицаПоТоварам, ТаблицаПоОборудованию, ТаблицаПоТаре, ТаблицаПоОбъектамСтроительства, ТаблицаПоОборудованию", ТаблицаПоТоварам, ТаблицаПоОборудованию, ТаблицаПоТаре, ТаблицаПоОбъектамСтроительства, ТаблицаПоОборудованию));
	
	Если ОтражатьВНалоговомУчете Тогда
		КорректируемПроводки(Отказ);	
	КонецЕсли;
	
	//АБС ВСТАВКА №13098 НАЧАЛО
	Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда     
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;		
	//\\АБС ВСТАВКА №13098 КОНЕЦ	
	//*****АБС Гетц. Для проведения по проектному учету
	Движения.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации.Записать();
	//*****АБС Гетц.\\
	
	//абс Родин Лимитный контроль 
	Если глЗначениеПеременной("абс_ИспользоватьКонтрольЛимитовПоДоговорам") Тогда
		Если ДоговорКонтрагента.абс_ОсобыйПорядкокКонтроляЛимитов И абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда
			
			СообщениеПриОтказе = "";
			
			СтруктураТаблиц = Новый Структура();
			СтруктураТаблиц.Вставить("ТаблицаПоТоварам",ТаблицаПоТоварам);
			СтруктураТаблиц.Вставить("ТаблицаПоУслугам",ТаблицаПоУслугам);
			
			НаборДвижений = ЭтотОбъект.Движения.абс_ЗатратыПоДоговорамСКонтролемЛимитов;
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаДвижений.Очистить();			
			
			абс_Бюджетирование.ФормированиеДвиженийПоКонтролируемымЗатратам(Ссылка,Отказ,СообщениеПриОтказе,СтруктураТаблиц,Истина,ТаблицаДвижений,НаборДвижений);
			
			Если Отказ И СообщениеПриОтказе <> "" Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке(СообщениеПриОтказе,Отказ); 
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//Бобылев А.А. 20.09.2018 CHG146 
	////Бобылев А.А. 31.07.2018 СППР 00-00000110
	//Если НЕ Отказ И абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Завершен Тогда
	//	Для каждого Элемент ИЗ абс_ЗакупочныеЗаказы Цикл
	//		Если Элемент.абс_ЗакупочныйЗаказТЧ.ttk_Постоплата Тогда
	//			Док = Документы.абс_СчетНаОплату.СоздатьДокумент();
	//			ДанныеЗаполнения = Элемент.абс_ЗакупочныйЗаказТЧ;
	//			Док.ЗакупочныйЗаказ = ДанныеЗаполнения;
	//			Док.ЦФО = ДанныеЗаполнения.ЦФО;
	//			Док.ЦФУ = ДанныеЗаполнения.ЦФУ;
	//			Если Не ЗначениеЗаполнено(Док.ЦФУ) И ДанныеЗаполнения.Товары.Количество()>0 Тогда
	//				Док.ЦФУ = ДанныеЗаполнения.Товары[0].абс_ЦФУ;
	//			КонецЕсли;
	//			Док.ТипСети = ДанныеЗаполнения.ТипСети;
	//			Если Не ЗначениеЗаполнено(Док.ТипСети) И ДанныеЗаполнения.Товары.Количество()>0 Тогда
	//				Док.ТипСети = ДанныеЗаполнения.Товары[0].абс_ТипСети;
	//			КонецЕсли;
	//			Док.КВ = ДанныеЗаполнения.КВ;
	//			Если Не ЗначениеЗаполнено(Док.КВ) И ДанныеЗаполнения.Товары.Количество()>0 Тогда
	//				Док.КВ = ДанныеЗаполнения.Товары[0].абс_КВ;
	//			КонецЕсли;
	//			Док.ТЭО = ДанныеЗаполнения.ТЭО;
	//			Если Не ЗначениеЗаполнено(Док.ТЭО) И ДанныеЗаполнения.Товары.Количество()>0 Тогда
	//				Док.ТЭО	= ДанныеЗаполнения.Товары[0].абс_ТЭО;
	//			КонецЕсли;
	//			Док.ТипКонтрагента = ДанныеЗаполнения.ТипКонтрагента;
	//			Док.ТипРасхода = ДанныеЗаполнения.ТипРасхода;		
	//			Док.БюджетнаяСтатья	= ДанныеЗаполнения.БюджетнаяСтатья;
	//			Док.СуммаПлатежа = УчетНДС.ПолучитьСуммуДокументаСНДС(ДанныеЗаполнения.ПолучитьОбъект());
	//			Док.РаспределениеПоПроектам.Загрузить(ДанныеЗаполнения.РаспределениеПоПроектам.Выгрузить());
	//			Док.Валюта = ДанныеЗаполнения.ВалютаДокумента;
	//			Док.Контрагент = ДанныеЗаполнения.Контрагент;
	//			Если ДанныеЗаполнения.ТипЗакупочногоЗаказа = Перечисления.абсТипЗакупочногоЗаказа.ИнвестиционноеСтроительство Тогда //абсо
	//				Док.Организация	= Справочники.Организации.НайтиПоКоду("000000001");
	//				Док.ЗаказчикПлатежа	= ДанныеЗаполнения.Организация;
	//				Док.ДоговорКонтрагента = абс_БизнесПроцессыПривелегированный.СформироватьДоговорТрехсторонний(ДанныеЗаполнения, Док.Организация);
	//				Док.абс_ДЗО	= ДоговорКонтрагента.абс_ДЗО;
	//			Иначе
	//				Док.Организация	= ДанныеЗаполнения.Организация;
	//				Док.ЗаказчикПлатежа	= ДанныеЗаполнения.Организация;
	//				Если не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
	//					Док.ДоговорКонтрагента = ДанныеЗаполнения.Договоры[0].ДоговорКонтрагента;
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//			Если ЗначениеЗаполнено(Док.Контрагент) Тогда
	//				Док.СчетКонтрагента = Контрагент.ОсновнойБанковскийСчет;
	//			КонецЕсли;
	//			//Док.СуммаОплаты = ДанныеЗаполнения.ИтогСуммаСНДС;
	//			Если ДанныеЗаполнения.Товары.Количество()>0 Тогда
	//				Док.СтавкаНДС = ДанныеЗаполнения.Товары[0].СтавкаНДС;
	//			КонецЕсли;
	//			
	//			Если НЕ ЗначениеЗаполнено(Док.ДатаПлатежа) Тогда
	//				Док.ДатаПлатежа = ДанныеЗаполнения.Дата;
	//			КонецЕсли;
	//			
	//			СтруктураКурсаВалютаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(Док.Валюта, Док.Дата);
	//			Док.Курс = СтруктураКурсаВалютаДокумента.Курс;
	//			Док.Кратность = СтруктураКурсаВалютаДокумента.Кратность;
	//			
	//			Док.СтатусСчета = Перечисления.абсСтатусыСчетов.Подготовка;		
	//			СтруктураАналитик = Новый Структура;
	//			СтруктураАналитик.Вставить("абс_ТипРасхода", Док.ТипРасхода);
	//			СтруктураАналитик.Вставить("абс_ТипКонтрагента", Док.ТипКонтрагента);
	//			СтруктураАналитик.Вставить("СтатьяОборотов", Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка());
	//			СтруктураАналитик.Вставить("абс_ТипСети", Справочники.абс_ТипыСетей.ПустаяСсылка());
	//			СтруктураАналитик.Вставить("абс_КВ", Справочники.абс_КапитальныеВложения.ПустаяСсылка());
	//			СтруктураАналитик.Вставить("абс_ТЭО", Справочники.абс_ТЭО.ПустаяСсылка());
	//			СтруктураАналитик.Вставить("абс_ЦФУ", Справочники.абс_ЦФУ.ПустаяСсылка());
	//			СтруктураАналитик.Вставить("ttk_ОбъектБюджетирования", Справочники.ttk_ОбъектыБюджетирования.ПустаяСсылка());
	//			КолонкиАналитик = "СтатьяОборотов, абс_ТипСети, абс_КВ, абс_ТЭО, абс_ЦФУ, ttk_ОбъектБюджетирования, ttk_Город";
	//			КолонкиИтогов = "СуммаСНДС,ВалютнаяСуммаСНДС";
	//			ОплатыТЗ = ДанныеЗаполнения.Товары.Выгрузить(,КолонкиАналитик + ", " + КолонкиИтогов);
	//			ОплатыТЗ.Свернуть(КолонкиАналитик, КолонкиИтогов);
	//			ЗаполнитьОплату(ОплатыТЗ, Док);
	//			Док.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
	//			Док.Дата = ТекущаяДата();
	//			ДатаПлатежа = ДатаВходящегоДокумента + ДоговорКонтрагента.абс_КоличествоДнейОтсрочкиПлатежа;
	//			Если ДатаПлатежа < ТекущаяДата() ИЛИ Не ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
	//				ДатаПлатежа = ТекущаяДата() + (5*86400);
	//			КонецЕсли;
	//			Док.ДатаПлатежа = ДатаПлатежа;
	//			Док.ПериодПлатежа = ТекущаяДата();
	//			Док.ДатаВходящегоСчета = ДатаВходящегоДокумента;
	//			Док.НомерВходящегоСчета = НомерВходящегоДокумента;
	//			Док.НазначениеПлатежа = Справочники.абс_НазначенияПлатежа.НайтиПоКоду("000005455");
	//			Если Товары.Количество() > 0 Тогда
	//				ОснованиеНоменклатура = Товары[0].Номенклатура;					
	//			ИначеЕсли Услуги.Количество() > 0 Тогда
	//				ОснованиеНоменклатура = Услуги[0].Номенклатура; 					
	//			КонецЕсли;
	//			Док.ОснованиеПлатежа = "Оплата по акту " + НомерВходящегоДокумента + " от " + ДатаВходящегоДокумента + " по договору " + ДоговорКонтрагента + " за " + ОснованиеНоменклатура;
	//			Док.Комментарий = "сформирован обработкой";
	//			Если Элемент.абс_ЗакупочныйЗаказТЧ.Товары.Количество() > 0 Тогда
	//				СтатьяОборотов= Элемент.абс_ЗакупочныйЗаказТЧ.Товары[0].СтатьяОборотов;
	//				Док.СтатьяДвиженияДенежныхСредств = ПолучитьСтатьюДДС(СтатьяОборотов, Док.НазначениеПлатежа);
	//			КонецЕсли;
	//			 
	//			Док.Записать(РежимЗаписиДокумента.Проведение);
	//			Сообщить("Создан документ " + Док.Номер + " от " + Док.Дата);
	//			
	//			//ДокОбъект = Док.ПолучитьОбъект();
	//			Док.СтатусСчета = Перечисления.абсСтатусыСчетов.СогласованиеОФК;
	//			Док.Записать(РежимЗаписиДокумента.Проведение);
	//			
	//			//ДокОбъект = Док.ПолучитьОбъект();
	//			Если Док.Контрагент.НеЯвляетсяРезидентом Тогда
	//				Статус = Перечисления.абсСтатусыСчетов.НалоговыйКонтроль;
	//			ИначеЕсли Док.Контрагент.НеЯвляетсяРезидентом = Ложь И ПроверкаПИП(Док.Контрагент) тогда
	//				Статус = Перечисления.абсСтатусыСчетов.ОформлениеАВЗ;
	//			ИначеЕсли Док.Контрагент.НеЯвляетсяРезидентом = Ложь И Не ПроверкаПИП(Док.Контрагент) Тогда
	//				Статус = Перечисления.абсСтатусыСчетов.Согласован;
	//			КонецЕсли;
	//			Док.СтатусСчета = Статус;
	//			Док.Записать(РежимЗаписиДокумента.Проведение);

	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	//Бобылев А.А. -------------------------------------
	
	
	//абс Родин Лимитный контроль
	//// {{KM WARE Токарев Н.А. Заявка №33659 17.07.2015 начало
	//// Контроль лимитов по договору
	//Если Не Отказ и ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеОФКПослеКоррректировки тогда
	//	МассивДоговоров = Новый Массив;
	//	МассивДоговоров.Добавить(ДоговорКонтрагента.Ссылка);
	//	ТабПериоды = ПолучитьЛимитыПоДоговору(ДоговорКонтрагента);
	//	Если ТабПериоды.Количество() = 0 Тогда
	//		Возврат;
	//	Иначе
	//		ПредыдущаяДатаЛимита = ПолучитьДатуЛимита(ТабПериоды,Дата,"Предыдущая");
	//		ДатаНачала = Макс(ПредыдущаяДатаЛимита,ДоговорКонтрагента.kmw_ДатаРаспоряжения);
	//		ПоследняяДатаЛимита = ПолучитьДатуЛимита(ТабПериоды,Дата,"Последняя");
	//		
	//		ЛимитНаДатуДокумента = ТабПериоды.Найти(НачалоДня(КонецМесяца(Дата)));
	//		
	//		Если ЛимитНаДатуДокумента.Сумма <> 0 или ЛимитНаДатуДокумента.СуммаДляКорректировки <> 0 тогда
	//			ДатаОкончания = Мин(ПоследняяДатаЛимита,НачалоДня(КонецМесяца(Дата)));
	//		иначе
	//			ДатаОкончания = ПоследняяДатаЛимита;
	//		КонецЕсли;
	//		
	//		Если не ЗначениеЗаполнено(ПоследняяДатаЛимита) тогда
	//			Сообщить("После даты - " + Дата + " по договору - " + ДоговорКонтрагента + " не введены суммы лимитов!");
	//			 Отказ = истина;
	//		КонецЕсли;
	//		
	//		Если  ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеОФКПослеКоррректировки и не Отказ Тогда
	//			
	//			ОстатокПоЛимиту = абс_Бюджетирование.ПолучитьОстатокПоЛимитуПоДоговору(МассивДоговоров, НачалоМесяца(ДатаНачала), КонецМесяца(ДатаОкончания));
	//			СуммаЛимита = ОстатокПоЛимиту[ОстатокПоЛимиту.Количество()-1].СуммаЛимита;
	//			СуммаОборот = ОстатокПоЛимиту.Итог("СуммаОборот");
	//			
	//			Контроль = СуммаЛимита - СуммаОборот;
	//			
	//			Если Контроль < 0 тогда
	//				Сообщить("На дату " + Формат(Дата,"ДФ=dd/MM/yy")+ " лимит превышен на сумму " + Контроль);
	//				Отказ = Истина;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//// }}KM WARE Токарев Н.А. Заявка №33659 17.07.2015 окончание
	
	
КонецПроцедуры // ОбработкаПроведения()

//Бобылев А.А. 20.09.2018 CHG146
////Бобылев А.А. 06.08.2018 СППР 00-00000110
//Функция ПроверкаПИП(Контрагент)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ttk_КонтрагентыАВЗ.Контрагент
//	               |ИЗ
//	               |	РегистрСведений.ttk_КонтрагентыАВЗ КАК ttk_КонтрагентыАВЗ
//	               |ГДЕ
//	               |	ttk_КонтрагентыАВЗ.Контрагент = &Контрагент";
//	Запрос.УстановитьПараметр("Контрагент", Контрагент);
//	Результат = Запрос.Выполнить().Выгрузить();
//	Если Результат.Количество() > 0 Тогда
//		Возврат Истина;
//	Иначе 
//		Возврат Ложь;
//	КонецЕсли;
//КонецФункции
////Бобылев А.А. -------------------------------

// <Получим дату предыдущего лимита>
//
// Параметры
//  <ТабПериоды>  - <Таблица значений.Вид> - <Таблица лимитов по договору>
//                 <продолжение описания параметра>
//  <Дата>  -      <Дата.Вид> - <Дата проверяемого документа>
//                 <продолжение описания параметра>
//  <Вид>  -      <СТРОКА.Вид> - <параметр определяет какую дату получать>
//                 <продолжение описания параметра>
// Возвращаемое значение:
//   <Дата.Вид>   - <дата предыдущего лимита от даты документы>
//
// {{KM WARE Токарев Н.А. Заявка №336559 17.07.2015 начало
//Функция ПолучитьДатуЛимита(ТабПериоды,Дата,Вид)
//	
//	Граница = НачалоДня(КонецМесяца(Дата));
//	
//	ДатаЛимита = Граница;
//	
//	Если Вид = "Предыдущая" тогда
//		нашлиЛимит = ложь;
//		ТабПериоды.Сортировать("ДатаОкончанияЛимитногоКонтроля ВОЗР");
//		Для каждого стр из ТабПериоды цикл
//			
//			Если стр.ДатаОкончанияЛимитногоКонтроля >= Граница тогда
//				если НашлиЛимит тогда
//					Возврат ДобавитьМесяц(ДатаЛимита,1);
//					прервать;
//				иначе
//					Возврат Граница;
//				КонецЕсли;
//			иначе
//				
//				Если ЗначениеЗаполнено(стр.Сумма) или ЗначениеЗаполнено(стр.СуммаДляКорректировки) тогда
//					ДатаЛимита = стр.ДатаОкончанияЛимитногоКонтроля;
//					нашлиЛимит = Истина;
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	ИначеЕсли Вид = "Последняя" тогда 
//		НашлиЛимит = ложь;
//		ТабПериоды.Сортировать("ДатаОкончанияЛимитногоКонтроля УБЫВ");
//		Для каждого стр из ТабПериоды цикл
//			
//			Если стр.ДатаОкончанияЛимитногоКонтроля <= Граница тогда
//				если НашлиЛимит тогда
//					Возврат ДатаЛимита;
//					прервать;
//				иначе
//					Возврат Дата('00010101');
//				КонецЕсли;
//				
//			иначе
//				Если ЗначениеЗаполнено(стр.Сумма) или ЗначениеЗаполнено(стр.СуммаДляКорректировки) тогда
//					ДатаЛимита = стр.ДатаОкончанияЛимитногоКонтроля;
//					нашлиЛимит = Истина;
//				КонецЕсли;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецФункции // () }}KM WARE Токарев Н.А. Заявка №33659 17.07.2015 окончание

// <Получаем лимиты по договору контрагента>
//
// Параметры
//  <ДоговорКонтрагента>  - <справочникссылка.ДоговорыКонтрагентов.Вид> - <Договор для получения лимитов>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - <таблица лимитов по договору>
//
// {{KM WARE Токарев Н.А. Заявка №33659 17.07.2015 начало
//Функция ПолучитьЛимитыПоДоговору(ДоговорКонтрагента)
//
//   Запрос = Новый Запрос;
//   Запрос.Текст = 
//   	"ВЫБРАТЬ
//   	|	абс_ЛимитыПоДоговорам.Сумма,
//   	|	абс_ЛимитыПоДоговорам.СуммаДляКорректировки,
//   	|	абс_ЛимитыПоДоговорам.ТипКонтроля,
//   	|	абс_ЛимитыПоДоговорам.ТипКонтроляНовый,
//   	|	абс_ЛимитыПоДоговорам.ДатаНачалаЛимитногоКонтроля КАК ДатаНачалаЛимитногоКонтроля,
//   	|	абс_ЛимитыПоДоговорам.ДатаОкончанияЛимитногоКонтроля
//   	|ИЗ
//   	|	РегистрСведений.абс_ЛимитыПоДоговорам КАК абс_ЛимитыПоДоговорам
//   	|ГДЕ
//   	|	абс_ЛимитыПоДоговорам.Договор = &Договор
//   	|
//   	|УПОРЯДОЧИТЬ ПО
//   	|	ДатаНачалаЛимитногоКонтроля";

//   Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);

//   Результат = Запрос.Выполнить();

//   ТзЛимиты = Результат.Выгрузить();
//   Возврат ТзЛимиты;
//
//КонецФункции // ПолучитьЛимитыПоДоговору(ДоговорКонтрагента)() }}KM WARE Токарев Н.А. Заявка №33659 17.07.2015 окончание

Процедура КорректируемПроводки(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Налоговый.Прочитать();
	Счет_25 = ПланыСчетов.Налоговый.НайтиПоКоду(25);
	ПерезаписатьНУ = Ложь;
	Для каждого Проводка Из Движения.Налоговый Цикл
		Если Проводка.СчетДт.ПринадлежитЭлементу(Счет_25) и не ЗначениеЗаполнено(Проводка.СубконтоДт.ВидыДеятельности) Тогда
			ПерезаписатьНУ = Истина;
			//АБС Шамов 33004 Изменение Начало
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, НайтиСубконто3(Проводка.СубконтоДт.СтатьиЗатрат));
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, НайтиСубконто3(Проводка.СубконтоДт.Подразделения, Проводка.СубконтоДт.СтатьиЗатрат));
			//\\АБС Шамов 33004 Изменение Конец
		КонецЕсли;
	КонецЦикла;
	Если ПерезаписатьНУ Тогда
		Движения.Налоговый.ОбменДанными.Загрузка = Истина;//иначе будет задвоение по счетам НЕ.03
		Движения.Налоговый.Записать();
		Движения.Налоговый.ОбменДанными.Загрузка = Ложь;//Иначе при повторном проведение будет ошибка
	КонецЕсли;
	
КонецПроцедуры	

//АБС Шамов 33004 Изменение Начало
//Функция НайтиСубконто3(СтатьяЗатрат)
Функция НайтиСубконто3(ПодразделениеОрганизации, СтатьяЗатрат)
	//\\АБС Шамов 33004 Изменение Конец	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугУслуги.СубконтоНУ3
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	|	И ПоступлениеТоваровУслугУслуги.СтатьяЗатрат = &СтатьяЗатрат
	//АБС Шамов 33004 Вставка Начало
	|	И ПоступлениеТоваровУслугУслуги.ПодразделениеОрганизации = &ПодразделениеОрганизации
	//\\АБС Шамов 33004 Вставка Конец	
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугУслуги.СубконтоНУ3";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СтатьяЗатрат", СтатьяЗатрат); 
	//АБС Шамов 33004 Вставка Начало
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации); 
	//\\АБС Шамов 33004 Вставка Конец	
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Возврат Результат.СубконтоНУ3;
	
КонецФункции	

//АБС ВСТАВКА НАЧАЛО №4781
Функция КонтрольСчетов(Отказ)
	
	// АБС ВСТАВКА ИЗМЕНЕНО Фролов 20120311
	// Для пользователей ДЗО не проверяем счета учета взариморасчетов	
	Если ПараметрыСеанса.абс_ПользовательДЗО Тогда
		Возврат Ложь//Отказ; АБС Коломиец возвращаем возможность проведения. Согласовано с Плютто, 30462
	КонецЕсли;
	
	абсОтказ = Ложь;
	
	Если ОтражатьВБухгалтерскомУчете и ОтражатьВНалоговомУчете Тогда
		
		СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, ДоговорКонтрагента);
		
		Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			Если СчетаУчета.СчетРасчетовСКомитентом <> СчетУчетаРасчетовСКонтрагентом Тогда
				абсОтказ = Истина;	
			КонецЕсли;	
		Иначе
			Если СчетаУчета.СчетРасчетов <> СчетУчетаРасчетовСКонтрагентом Тогда
				абсОтказ = Истина;	
			КонецЕсли;
		КонецЕсли;
		Если СчетаУчета.СчетАвансов <> СчетУчетаРасчетовПоАвансам Тогда
			абсОтказ = Истина;	
		КонецЕсли;		
		
	КонецЕсли;
	
	Если абсОтказ Тогда
		Сообщить("Не соответствует счет учета расчетов с настройкой счетов в регистре сведений расчетов с контрагентами!",СтатусСообщения.Важное);
	КонецЕсли;
	Если Отказ = абсОтказ Тогда	
		Возврат Отказ;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции	
//\\АБС ВСТАВКА КОНЕЦ 

// Процедура вызывается из тела процедуры ДвиженияПоРегистрамРегл
// Формирует движения по постоянным и временным разницам по табличной части Услуги
Процедура ДвиженияПоРазницамПоУслугам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ПроводкиНУ)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если Не УчетнаяПолитикаРегл.ПоддержкаПБУ18 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДока   = Дата;
	абс_ПорядокФормированияВ_НУ = Константы.абс_ПорядокФормированияВ_НУ_по_счету_91_02_1.Получить();
	абс_ВалютнаяОперация = (не СтруктураШапкиДокумента.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") или СтруктураШапкиДокумента.РасчетыВУсловныхЕдиницах);
	
	// Подготовим структуру таблицы для отражения затрат.
	ТаблицаЗатрат = УправлениеЗатратами.СформироватьТаблицуЗатрат();
	
	Для Каждого СтрокаТЧ из ТаблицаПоУслугам Цикл
		
		//СуммаВПроводку = СтрокаТЧ.Сумма - СтрокаТЧ.СуммаНДС;
		СуммаВПроводку = СтрокаТЧ.ПроводкаСумма;
		
		Если Лев(СтрокаТЧ.СчетЗатратНУ.Код, 2) = "97" Тогда
			СтатьяЗатрат1 = СтрокаТЧ.СубконтоНУ1.СтатьяЗатрат;
			СтатьяЗатрат2 = Неопределено;
			СтатьяЗатрат3 = Неопределено;
		Иначе
			СтатьяЗатрат1 = СтрокаТЧ.СубконтоНУ1;
			СтатьяЗатрат2 = СтрокаТЧ.СубконтоНУ2;
			СтатьяЗатрат3 = СтрокаТЧ.СубконтоНУ3;
		КонецЕсли;
		
		Если ТипЗнч(СтатьяЗатрат1)=Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗатрат = СтатьяЗатрат1.ВидРасходовНУ;
			ВидУчета = ?(СтатьяЗатрат1.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения, Перечисления.ВидыУчетаПоПБУ18.ПР, Перечисления.ВидыУчетаПоПБУ18.ВР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат2)=Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗатрат = СтатьяЗатрат2.ВидРасходовНУ;
			ВидУчета = ?(СтатьяЗатрат2.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения, Перечисления.ВидыУчетаПоПБУ18.ПР, Перечисления.ВидыУчетаПоПБУ18.ВР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат3)=Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗатрат = СтатьяЗатрат3.ВидРасходовНУ;
			ВидУчета = ?(СтатьяЗатрат3.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения, Перечисления.ВидыУчетаПоПБУ18.ПР, Перечисления.ВидыУчетаПоПБУ18.ВР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат1)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗатрат = СтатьяЗатрат1.ВидПрочихДоходовИРасходов;
			ВидУчета = ?(СтатьяЗатрат1.ПринятиеКналоговомуУчету, Перечисления.ВидыУчетаПоПБУ18.ВР, Перечисления.ВидыУчетаПоПБУ18.ПР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат2)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗатрат = СтатьяЗатрат2.ВидПрочихДоходовИРасходов;
			ВидУчета = ?(СтатьяЗатрат2.ПринятиеКналоговомуУчету, Перечисления.ВидыУчетаПоПБУ18.ВР, Перечисления.ВидыУчетаПоПБУ18.ПР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат3)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗатрат = СтатьяЗатрат3.ВидПрочихДоходовИРасходов;
			ВидУчета = ?(СтатьяЗатрат3.ПринятиеКналоговомуУчету, Перечисления.ВидыУчетаПоПБУ18.ВР, Перечисления.ВидыУчетаПоПБУ18.ПР);
		Иначе
			ВидЗатрат = "";
			ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ВР;
		КонецЕсли;
		
		Если ВидЗатрат = "" Тогда
			СчетНУСоответствующийСчетуБУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ",СтрокаТЧ.СчетЗатрат), Ложь, Дата);
			Если СчетНУСоответствующийСчетуБУ = СтрокаТЧ.СчетЗатратНУ	Тогда
				Продолжить;
			КонецЕсли;
			Если СчетНУСоответствующийСчетуБУ.Родитель = СтрокаТЧ.СчетЗатратНУ.Родитель Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			СчетНУСоответствующийСчетуБУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ, ВидЗатратНУ",СтрокаТЧ.СчетЗатрат, ВидЗатрат), Ложь, Дата);
			Если СчетНУСоответствующийСчетуБУ = СтрокаТЧ.СчетЗатратНУ	Тогда
				Продолжить;
			КонецЕсли;
			Если СчетНУСоответствующийСчетуБУ.Родитель = СтрокаТЧ.СчетЗатратНУ.Родитель Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СчетНУСоответствующийСчетуБУ)	Тогда
				СчетНУСоответствующийСчетуБУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ",СтрокаТЧ.СчетЗатрат), Ложь, Дата);
				Если СчетНУСоответствующийСчетуБУ = СтрокаТЧ.СчетЗатратНУ	Тогда
					Продолжить;
				КонецЕсли;
				Если СчетНУСоответствующийСчетуБУ.Родитель = СтрокаТЧ.СчетЗатратНУ.Родитель Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Если соответствующий счет не найден, то разницы не рассчитаны
		Если НЕ ЗначениеЗаполнено(СчетНУСоответствующийСчетуБУ)	Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = ПроводкиНУ.Добавить();
		
		Проводка.Период      = ДатаДока;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = СтрокаТЧ.Содержание;
		
		Проводка.СчетДт      = СчетНУСоответствующийСчетуБУ;
		
		ПроизводственныеРасходыНУ = УправлениеЗатратами.ПроверитьСчетЗатратНаПроизводственныеРасходы(СчетНУСоответствующийСчетуБУ, "Налоговый");
		
		Если ПроизводственныеРасходыНУ Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Подразделения",        СтрокаТЧ.ПодразделениеОрганизации);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТЧ.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",         СтрокаТЧ.СтатьяЗатрат);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбъектыСтроительства", СтрокаТЧ.ОбъектСтроительства);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СпособыСтроительства", СтрокаТЧ.СпособСтроительства);
			Если ТипЗнч(СтрокаТЧ.СубконтоНУ3) = Тип("СправочникСсылка.абс_ВидыДеятельностиКТТК") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидыДеятельности", СтрокаТЧ.СубконтоНУ3);
			КонецЕсли;			
		Иначе
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтрокаТЧ.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтрокаТЧ.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтрокаТЧ.Субконто3);
		КонецЕсли;
		
		//АБС ВСТАВКА №000019830 НАЧАЛО
		Если не абс_ПорядокФормированияВ_НУ.Пустая()
			и ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.02.1") = СтрокаТЧ.СчетЗатрат
			и ТипЗнч(СтрокаТЧ.Субконто1) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы")
			и (СтрокаТЧ.Субконто1.ПринадлежитЭлементу(абс_ПорядокФормированияВ_НУ)
			или СтрокаТЧ.Субконто1 = абс_ПорядокФормированияВ_НУ) Тогда
			
			ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ПР;
			
			//АБС ВСТАВКА №38163 НАЧАЛО «25 февраля 2014 г.», Пополитов
			Если абс_ВалютнаяОперация Тогда
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ДатаНач",НачалоМинуты(Дата));
				Запрос.УстановитьПараметр("ДатаКон",Новый Граница(КонецМинуты(Дата),ВидГраницы.Включая));
				Запрос.УстановитьПараметр("Регистратор",Ссылка);
				Запрос.УстановитьПараметр("Организация",Организация);
				Запрос.УстановитьПараметр("Субконто1",СтрокаТЧ.Субконто1);
				Запрос.УстановитьПараметр("Счет",СтрокаТЧ.СчетЗатрат);
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК Сумма
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Обороты(
				|			&ДатаНач,
				|			&ДатаКон,
				|			Регистратор,
				|			Счет = &Счет,
				|			,
				|			Организация = &Организация
				|				И Субконто1 = &Субконто1,
				|			,
				|			) КАК ХозрасчетныйОбороты
				|ГДЕ
				|	(ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг)) = &Регистратор";
				Результат = Запрос.Выполнить().Выбрать();	   
				Если Результат.Следующий() и не ?(Результат.Сумма = Null,0,Результат.Сумма) = 0 Тогда	
					СуммаВПроводку = Результат.Сумма;	
				КонецЕсли;
			КонецЕсли;
			//\\АБС ВСТАВКА №38163 КОНЕЦ  
			
		КонецЕсли;
		//\\АБС ВСТАВКА №000019830 КОНЕЦ		
		
		Проводка.Сумма = СуммаВПроводку;		
		Проводка.ВидУчетаДт = ВидУчета;
		
		// Добавим строку в таблицу затрат.
		Если ПроизводственныеРасходыНУ Тогда
			НоваяСтрока = ТаблицаЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.СуммаБезНДС = 0;
			НоваяСтрока.СуммаРегл = 0;
			НоваяСтрока.СчетЗатратНУ = СчетНУСоответствующийСчетуБУ;
			
			Если ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ВР Тогда
				НоваяСтрока.ВременнаяРазница = СуммаВПроводку;
			ИначеЕсли ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ПР Тогда
				НоваяСтрока.ПостояннаяРазница = СуммаВПроводку;
			КонецЕсли;
		КонецЕсли;
		
		Проводка = ПроводкиНУ.Добавить();
		
		Проводка.Период      = ДатаДока;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = СтрокаТЧ.Содержание;
		
		ПроизводственныеРасходыНУ = УправлениеЗатратами.ПроверитьСчетЗатратНаПроизводственныеРасходы(СтрокаТЧ.СчетЗатратНУ, "Налоговый");
		
		Проводка.СчетДт = СтрокаТЧ.СчетЗатратНУ;
		Если ПроизводственныеРасходыНУ Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Подразделения",        СтрокаТЧ.ПодразделениеОрганизации);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТЧ.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",         СтрокаТЧ.СтатьяЗатрат);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбъектыСтроительства", СтрокаТЧ.ОбъектСтроительства);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СпособыСтроительства", СтрокаТЧ.СпособСтроительства);
			Если ТипЗнч(СтрокаТЧ.СубконтоНУ3) = Тип("СправочникСсылка.абс_ВидыДеятельностиКТТК") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидыДеятельности", СтрокаТЧ.СубконтоНУ3);
			КонецЕсли;    			
		Иначе
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтрокаТЧ.СубконтоНУ1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтрокаТЧ.СубконтоНУ2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтрокаТЧ.СубконтоНУ3);
			Проводка.Сумма = - СуммаВПроводку;
		КонецЕсли;
		Проводка.Сумма = - СуммаВПроводку;
		Проводка.ВидУчетаДт = ВидУчета;
		
		// Добавим строку в таблицу затрат.
		Если ПроизводственныеРасходыНУ Тогда
			НоваяСтрока = ТаблицаЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.СуммаБезНДС = 0;
			НоваяСтрока.СуммаРегл = 0;
			
			Если ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ВР Тогда
				НоваяСтрока.ВременнаяРазница = - СуммаВПроводку;
			ИначеЕсли ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ПР Тогда
				НоваяСтрока.ПостояннаяРазница = - СуммаВПроводку;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаЗатрат.Количество() > 0 Тогда
		
		ВремСтруктураШапкиДокумента = Новый Структура;
		ВремСтруктураШапкиДокумента.Вставить("Ссылка", СтруктураШапкиДокумента.Ссылка);
		ВремСтруктураШапкиДокумента.Вставить("Дата", СтруктураШапкиДокумента.Дата);
		ВремСтруктураШапкиДокумента.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		ВремСтруктураШапкиДокумента.Вставить("ОтражатьВБухгалтерскомУчете", Ложь);
		ВремСтруктураШапкиДокумента.Вставить("ОтражатьВНалоговомУчете", Истина);
		
		УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
		ВремСтруктураШапкиДокумента, 
		ТаблицаЗатрат
		);
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРазницамПоУслугам()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОтражатьВУправленческомУчете И НЕ ОтражатьВБухгалтерскомУчете Тогда
		СтрокаСообщения = Нстр("ru = 'Документ должен принадлежать хотя бы одному из видов учета: ""Управленческий"" и (или)  ""Бухгалтерский"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства Тогда
		//Не проверяем ВидПоступления
		НомерУдаляемогоЭлемента = ПроверяемыеРеквизиты.Найти("ВидПоступления");
		Если НомерУдаляемогоЭлемента <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоЭлемента);
		КонецЕсли;
	//+ Машута А. 23.10.2018 задача 917
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
	 	СтрокаСообщения = Нстр("ru = 'Формирование документа с видом операции Оборудование запрещено. Сформируйте новый документ Поступление товаров и услуг или выберите другой вид операции.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, ЭтотОбъект,,, Отказ);
	//- Машута А. 23.10.2018 задача 917
	КонецЕсли;
	
	Если ВидПоступления <> Перечисления.ВидыПоступленияТоваров.НаСклад
		ИЛИ мУказаниеСкладовВТЧ
		ИЛИ (Товары.Количество() + ВозвратнаяТара.Количество() + Оборудование.Количество()) > 0 Тогда
		//Не требуется указание склада в шапке
		НомерУдаляемогоЭлемента = ПроверяемыеРеквизиты.Найти("СкладОрдер");
		Если НомерУдаляемогоЭлемента <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоЭлемента);
		КонецЕсли;
	КонецЕсли;
	
	Если УчитыватьНДС Тогда
		ПроверяемыеРеквизиты.Добавить("Товары.СтавкаНДС");
		ПроверяемыеРеквизиты.Добавить("Услуги.СтавкаНДС");
	КонецЕсли;
	
	// Единица измерения мест должна быть заполнена, если указано количество мест
	ОбработкаТабличныхЧастейСервер.ПроверитьЗаполненаЕдиницаИзмеренияМест(Товары, ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)     
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, "Покупка", ОбъектКопирования.Ссылка);
	//АБС Тупиков начало 17042012 
	абс_ЗакупочныеЗаказы.Очистить();
	//\\АБС Тупиков конец
	//ххх Брель Виктор Андреевич 28.03.2018 17:40:37, заявка <<<
	абс_ЗакупочныйЗаказ = ОбъектКопирования.абс_ЗакупочныйЗаказ;		  
	// Брель Виктор Андреевич 28.03.2018 17:40:37 >>>	  
	//АБС ВСТАВКА 35750  28.01.2014 9:27:14  Шамов
	абс_СуммаНДСПоСчетуФактуре = 0;       
	// Лапин 33960 начало
	ОбщаяСтоимостьСНДСПоСчетуФактуре = 0; 
	// Лапин 33960 окончание
	//АБС ВСТАВКА 35750 КОНЕЦ
	
	//Сторчевой А.Н. 77155682 15.08.2017 {                                   
	ttk_УННеРегистрировались = Неопределено;
	ttk_УН = Неопределено;
	ttk_УН_Справка = Неопределено;
	// } Сторчевой А.Н. 77155682 15.08.2017
	//ххх Брель Виктор Андреевич 14.05.2018 12:53:48, заявка <<<
	Для Каждого Услуга Из ЭтотОбъект.Услуги Цикл
	 Услуга.ttk_УсловноеНачисление = Неопределено;
	КонецЦикла;
	Для Каждого Товар Из ЭтотОбъект.Товары Цикл
	 Товар.ttk_УсловноеНачисление = Неопределено;
	КонецЦикла;
	// Брель Виктор Андреевич 14.05.2018 12:53:48 >>>
	
	//+ Машута А. 23.10.2018 задача 917
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		ВызватьИсключение "Формирование документа с видом операции Оборудование запрещено. Сформируйте новый документ Поступление товаров и услуг."; 	
	КонецЕсли;
	//- Машута А. 23.10.2018 задача 917
	
КонецПроцедуры

// АБС ВСТАВКА Согласование первичных документов
Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено, ИмяПользователя = "") Экспорт
	
	// АБС Новоселов+ вставка Может передаваться имя пользователя ИСУЗК
	Если ЗначениеЗаполнено(ИмяПользователя) Тогда 
		ТекПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
		Если Не ЗначениеЗаполнено(ТекПользователь) Тогда 
			ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
		КонецЕсли;
	Иначе// АБС Новоселов-	
		ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовПервичныхДокументов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ПервичныйДокумент.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
	
	Запись.ПервичныйДокумент		= Ссылка;
	Запись.Пользователь 			= ТекПользователь;	
	Запись.СтатусДокумента			= НовыйСтатус;
	
	Запись.Комментарий 				= Комментарий;
	
	ОтветственныйСотрудник = абс_БизнесПроцессы.ПолучитьСотрудникаПользователя(ТекПользователь);
	
	Если НЕ ОтветственныйСотрудник = Неопределено Тогда
		Запись.ДолжностьОтветственного	= ОтветственныйСотрудник.Должность;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция НайтиБПСогласование() Экспорт
	
	Возврат абс_БизнесПроцессы.НайтиБизнесПроцессПоПервичномуДокументу(Ссылка, "абсСогласованиеПервичныхДокументов");	
	
КонецФункции

Функция ПолучитьЗадачуПоПервичномуДокументуСогласование() Экспорт
	
	БП = НайтиБПСогласование();
	
	Если БП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СпТочек = Новый Массив;
	
	Статус = абс_Статус;
	
	Если Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеУточнениеОФК);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеУточнениеБухгалтером);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеОтказ);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыПервичныхДокументов.УточнениеОФК Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеСогласованиеОФК);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыПервичныхДокументов.УточнениеБухгалтерией Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеОбработкаПринятыхДокументов);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ Тогда		
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеОбработкаБухгалтерией);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеСогласованиеОФК);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеОбработкаПринятыхДокументов);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыПервичныхДокументов.Завершен Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеОбработкаБухгалтерией);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеОбработкаПринятыхДокументов);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеСогласованиеОФК);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеУточнениеБухгалтером);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеУточнениеОФК);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеУточнениеБухгалтером);		
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыПервичныхДокументов.ДокументыПринятыБухгалтером Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеОбработкаБухгалтерией);
		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеПервичныхДокументов.ТочкиМаршрута.ДействиеУточнениеБухгалтером);
		
	КонецЕсли;
	
	Возврат абс_БизнесПроцессы.НайтиЗадачуЗЗ(БП, СпТочек ,, Ложь);
	
КонецФункции

Функция ПолучитьРежимЗаписиДокумента() Экспорт
	
	РежимЗаписи = Неопределено;                       	
	
	Если абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка ИЛИ
		
		абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ
		ИЛИ абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена Тогда			
		Если Проведен Тогда                                                          			
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;                     
		Иначе			
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
	ИначеЕсли абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.КорректировкаДокумента Тогда
		
		РежимЗаписи = РежимЗаписиДокумента.Запись;
		
	Иначе               		
		РежимЗаписи = РежимЗаписиДокумента.Проведение;		
	КонецЕсли;
	
	Возврат РежимЗаписи;
	
КонецФункции

// АБС ВСТАВКА Согласование первичных документов КОНЕЦ

// АБС ВСТАВКА 02390 Начало

// Проверка совпадения суммы по ТЧ Закупочные Заказы с суммами по остальным ТЧ
//
// Параметры:
//  Отказ     - флаг отказа в проведении,
//  Заголовок - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиЗакупочныеЗаказы(Отказ, Заголовок)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",      Ссылка);
	
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка,
	|	СУММА(ПоступлениеТоваровУслугОбъектыСтроительства.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_ОбъектыСтроительства
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
	|ГДЕ
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугОборудование.Ссылка,
	|	СУММА(ПоступлениеТоваровУслугОборудование.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугОборудование.Ссылка.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугОборудование.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_Оборудование
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|ГДЕ
	|	ПоступлениеТоваровУслугОборудование.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугОборудование.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка,
	|	СУММА(ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_СуммаБезНДС) КАК абс_СуммаБезНДС
	|ПОМЕСТИТЬ ВТ_ЗакупочныеЗаказы
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы
	|ГДЕ
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	СУММА(ПоступлениеТоваровУслугУслуги.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_Прочее
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугУслуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугВозвратнаяТара.Ссылка,
	|	СУММА(ПоступлениеТоваровУслугВозвратнаяТара.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Тара
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ВозвратнаяТара КАК ПоступлениеТоваровУслугВозвратнаяТара
	|ГДЕ
	|	ПоступлениеТоваровУслугВозвратнаяТара.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугВозвратнаяТара.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЗакупочныеЗаказы.Ссылка,
	|	ЕСТЬNULL(ВТ_ЗакупочныеЗаказы.абс_СуммаБезНДС, 0) - (ЕСТЬNULL(ВТ_Прочее.Сумма, 0) - ЕСТЬNULL(ВТ_Прочее.СуммаНДС, 0)) - (ЕСТЬNULL(ВТ_Товары.Сумма, 0) - ЕСТЬNULL(ВТ_Товары.СуммаНДС, 0)) - ЕСТЬNULL(ВТ_Тара.Сумма, 0) - (ЕСТЬNULL(ВТ_Оборудование.Сумма, 0) - ЕСТЬNULL(ВТ_Оборудование.СуммаНДС, 0)) - (ЕСТЬNULL(ВТ_ОбъектыСтроительства.Сумма, 0) - ЕСТЬNULL(ВТ_ОбъектыСтроительства.СуммаНДС, 0)) КАК Поле1
	|ИЗ
	|	ВТ_ЗакупочныеЗаказы КАК ВТ_ЗакупочныеЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО ВТ_ЗакупочныеЗаказы.Ссылка = ВТ_Товары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Прочее КАК ВТ_Прочее
	|		ПО ВТ_ЗакупочныеЗаказы.Ссылка = ВТ_Прочее.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Тара КАК ВТ_Тара
	|		ПО ВТ_ЗакупочныеЗаказы.Ссылка = ВТ_Тара.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыСтроительства КАК ВТ_ОбъектыСтроительства
	|		ПО ВТ_ЗакупочныеЗаказы.Ссылка = ВТ_ОбъектыСтроительства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оборудование КАК ВТ_Оборудование
	|		ПО ВТ_ЗакупочныеЗаказы.Ссылка = ВТ_Оборудование.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ЗакупочныеЗаказы.абс_СуммаБезНДС, 0) - (ЕСТЬNULL(ВТ_Прочее.Сумма, 0) - ЕСТЬNULL(ВТ_Прочее.СуммаНДС, 0)) - (ЕСТЬNULL(ВТ_Товары.Сумма, 0) - ЕСТЬNULL(ВТ_Товары.СуммаНДС, 0)) - ЕСТЬNULL(ВТ_Тара.Сумма, 0) - (ЕСТЬNULL(ВТ_Оборудование.Сумма, 0) - ЕСТЬNULL(ВТ_Оборудование.СуммаНДС, 0)) - (ЕСТЬNULL(ВТ_ОбъектыСтроительства.Сумма, 0) - ЕСТЬNULL(ВТ_ОбъектыСтроительства.СуммаНДС, 0)) <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрокаСообщенияОбОшибке = "Сумма документа не совпадает с суммой по Закупочным заказам!";
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщенияОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // 

Процедура ЗаполнитьТЧ_ЗЗ()  экспорт
	
	// АБС ВСТАВКА 02390 начало
	Если мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <> '00010101'  
		и мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа <= Дата Тогда
		
		врТЗ = абс_ЗакупочныеЗаказы.Выгрузить();
		врТЗ.Очистить();
		
		Для Каждого СтрокаТЧ Из Товары Цикл
			СтрокаТЗ = врТЗ.Добавить();
			СтрокаТЗ.абс_ЗакупочныйЗаказТЧ = ?(ЗначениеЗаполнено(СтрокаТЧ.абс_ЗакупочныйЗаказТЧ),СтрокаТЧ.абс_ЗакупочныйЗаказТЧ,абс_ЗакупочныйЗаказ);
			СтрокаТЗ.абс_СуммаБезНДС	   = СтрокаТЧ.Сумма - ?(СуммаВключаетНДС,СтрокаТЧ.СуммаНДС,0);
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из Услуги Цикл
			СтрокаТЗ = врТЗ.Добавить();
			СтрокаТЗ.абс_ЗакупочныйЗаказТЧ = ?(ЗначениеЗаполнено(СтрокаТЧ.абс_ЗакупочныйЗаказТЧ),СтрокаТЧ.абс_ЗакупочныйЗаказТЧ,абс_ЗакупочныйЗаказ);
			СтрокаТЗ.абс_СуммаБезНДС	   = СтрокаТЧ.Сумма - ?(СуммаВключаетНДС,СтрокаТЧ.СуммаНДС,0);
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из Оборудование Цикл
			СтрокаТЗ = врТЗ.Добавить();
			СтрокаТЗ.абс_ЗакупочныйЗаказТЧ = ?(ЗначениеЗаполнено(СтрокаТЧ.абс_ЗакупочныйЗаказТЧ),СтрокаТЧ.абс_ЗакупочныйЗаказТЧ,абс_ЗакупочныйЗаказ);
			СтрокаТЗ.абс_СуммаБезНДС	   = СтрокаТЧ.Сумма - ?(СуммаВключаетНДС,СтрокаТЧ.СуммаНДС,0);
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из ОбъектыСтроительства Цикл
			СтрокаТЗ = врТЗ.Добавить();
			СтрокаТЗ.абс_ЗакупочныйЗаказТЧ = ?(ЗначениеЗаполнено(СтрокаТЧ.абс_ЗакупочныйЗаказТЧ),СтрокаТЧ.абс_ЗакупочныйЗаказТЧ,абс_ЗакупочныйЗаказ);
			СтрокаТЗ.абс_СуммаБезНДС	   = СтрокаТЧ.Сумма - ?(СуммаВключаетНДС,СтрокаТЧ.СуммаНДС,0);
		КонецЦикла;
		
		врТЗ.Свернуть("абс_ЗакупочныйЗаказТЧ","абс_СуммаБезНДС");
		абс_ЗакупочныеЗаказы.Загрузить(врТЗ);
	КонецЕсли;
	// АБС ВСТАВКА 02390 конец
	
КОнецПРоцедуры

// АБС ВСТАВКА 02390 конец

//***** Гетц. Проектный учет.
Процедура ПроставитьСчетаПоПроекту(ИмяТабЧасти, ДанныеТабличнойЧасти, Объект, БУ, НУ) Экспорт 
	
	//Приведем данные к одинаковому виду (завернем строку в массив)
	ПередалиТабличнуюЧасть = (ТипЗнч(ДанныеТабличнойЧасти) = ТипЗнч(Объект[ИмяТабЧасти]));
	Если ПередалиТабличнуюЧасть Тогда
		СтрокиТабличнойЧасти = ДанныеТабличнойЧасти;
	Иначе
		СтрокиТабличнойЧасти = Новый Массив();
		СтрокиТабличнойЧасти.Добавить(ДанныеТабличнойЧасти);
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из СтрокиТабличнойЧасти Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.абс_Проект) Тогда 
			Продолжить;
		КонецЕсли;
		
		НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.НайтиПоРеквизиту("Проект", СтрокаТЧ.абс_Проект);
		Если Не ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда 
			Сообщить("Не найдена номенклатурная группа для проекта " + Строка(СтрокаТЧ.абс_Проект));
			Продолжить;
		КонецЕсли;
		
		Если Не ПередалиТабличнуюЧасть Тогда 
			#Если Клиент Тогда 
				Ответ = Вопрос("Установить счета по умолчанию для выбранного проекта?", РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Нет Тогда 
					Продолжить;
				КонецЕсли;
			#КонецЕсли
		КонецЕсли;
		
		СчетБУ = ПланыСчетов.Хозрасчетный.ОсновноеПроизводствоНеОблагаемоеЕНВД;
		Если БУ Тогда 
			СтрокаТЧ.СчетЗатрат = СчетБУ;
			СтрокаТЧ.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
		КонецЕсли;
		
		Если НУ Тогда 
			НалоговыйУчет.ЗаполнитьСчетНалоговогоУчетаВСтрокеТабличногоПоля(СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
//***** Гетц \\

// АБС Глебов. Проектный учет	
Функция ПолучитьТаблицуРаспределенияБюджетовПоПроектамПТиУ(Документ, ИмяТЧ) Экспорт //***** АБС. Проектный учет
	ПроводитьПоПроектномуУчету = Константы.абс_ПроведениеПоМеханизмуПроектногоУчета.Получить();
	Если Не ПроводитьПоПроектномуУчету Тогда 
		Возврат Неопределено;
	КонецЕсли;
	//АБС ВСТАВКА 35429 22.11.13 Гетц. Доработан запрос для заполнения ТЧ "Услуги"
	Если ИмяТЧ = "Услуги" Или ИмяТЧ = "Оборудование" Или ИмяТЧ = "Товары" Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Сумма,
		|	Таблица.абс_ЗакупочныйЗаказТЧ,
		|	Таблица.СуммаНДС,
		|	Таблица.Количество,
		|	" + ?(Не ИмяТЧ = "Услуги", "ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетЗатрат,", "Таблица.СчетЗатрат,") + "
		|	Таблица.абс_Проект
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	&ТЧ КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслугТаблица.ЗакупочныйЗаказ КАК ЗакупочныйЗаказ,
		|	ПоступлениеТоваровУслугТаблица.Сумма КАК Сумма,
		|	ПоступлениеТоваровУслугТаблица.Количество КАК Количество,
		|	ПоступлениеТоваровУслугТаблица.СуммаНДС КАК СуммаНДС,
		|	ВложенныйЗапрос.Проект КАК Проект,
		|	ВложенныйЗапрос.ДоляРаспределения КАК ДоляРаспределения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ПоступлениеТоваровУслугТаблица.абс_ЗакупочныйЗаказТЧ = ЗНАЧЕНИЕ(Документ.абс_ЗакупочныйЗаказ.ПустаяСсылка)
		|					ИЛИ ПоступлениеТоваровУслугТаблица.абс_ЗакупочныйЗаказТЧ = НЕОПРЕДЕЛЕНО
		|				ТОГДА &ЗЗ
		|			ИНАЧЕ ПоступлениеТоваровУслугТаблица.абс_ЗакупочныйЗаказТЧ
		|		КОНЕЦ КАК ЗакупочныйЗаказ,
		|		ПоступлениеТоваровУслугТаблица.СчетЗатрат КАК СчетЗатрат,
		|		СУММА(ПоступлениеТоваровУслугТаблица.Сумма) КАК Сумма,
		|		СУММА(ПоступлениеТоваровУслугТаблица.Количество) КАК Количество,
		|		СУММА(ПоступлениеТоваровУслугТаблица.СуммаНДС) КАК СуммаНДС
		|	ИЗ
		|		ВременнаяТаблица КАК ПоступлениеТоваровУслугТаблица
		|	ГДЕ
		|		(ПоступлениеТоваровУслугТаблица.абс_Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ИЛИ ПоступлениеТоваровУслугТаблица.абс_Проект = НЕОПРЕДЕЛЕНО)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫБОР
		|			КОГДА ПоступлениеТоваровУслугТаблица.абс_ЗакупочныйЗаказТЧ = ЗНАЧЕНИЕ(Документ.абс_ЗакупочныйЗаказ.ПустаяСсылка)
		|					ИЛИ ПоступлениеТоваровУслугТаблица.абс_ЗакупочныйЗаказТЧ = НЕОПРЕДЕЛЕНО
		|				ТОГДА &ЗЗ
		|			ИНАЧЕ ПоступлениеТоваровУслугТаблица.абс_ЗакупочныйЗаказТЧ
		|		КОНЕЦ,
		|		ПоступлениеТоваровУслугТаблица.СчетЗатрат) КАК ПоступлениеТоваровУслугТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			абс_ЗакупочныйЗаказРаспределениеПоПроектам.Ссылка КАК Ссылка,
		|			абс_ЗакупочныйЗаказРаспределениеПоПроектам.НомерСтроки КАК НомерСтроки,
		|			абс_ЗакупочныйЗаказРаспределениеПоПроектам.Проект КАК Проект,
		|			абс_ЗакупочныйЗаказРаспределениеПоПроектам.ДоляРаспределения КАК ДоляРаспределения
		|		ИЗ
		|			Документ.абс_ЗакупочныйЗаказ.РаспределениеПоПроектам КАК абс_ЗакупочныйЗаказРаспределениеПоПроектам) КАК ВложенныйЗапрос
		|		ПО ПоступлениеТоваровУслугТаблица.ЗакупочныйЗаказ = ВложенныйЗапрос.Ссылка
		|			И (ВложенныйЗапрос.ДоляРаспределения > 0)
		|		" + ?(Не ИмяТЧ = "Услуги", "", "И (ВЫБОР
		|				КОГДА ПоступлениеТоваровУслугТаблица.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
		|						ИЛИ ПоступлениеТоваровУслугТаблица.СчетЗатрат = НЕОПРЕДЕЛЕНО
		|					ТОГДА ВЫБОР
		|							КОГДА ПоступлениеТоваровУслугТаблица.ЗакупочныйЗаказ = ЗНАЧЕНИЕ(Документ.абс_ЗакупочныйЗаказ.ПустаяСсылка)
		|									ИЛИ ПоступлениеТоваровУслугТаблица.ЗакупочныйЗаказ = НЕОПРЕДЕЛЕНО
		|								ТОГДА НЕ &РБП
		|							ИНАЧЕ НЕ ПоступлениеТоваровУслугТаблица.ЗакупочныйЗаказ.РасходыБудущихПериодов
		|						КОНЕЦ
		|				ИНАЧЕ ПоступлениеТоваровУслугТаблица.СчетЗатрат В ИЕРАРХИИ (&СчетаУслуг)
		|			КОНЕЦ)") + "
		|ИТОГИ
		|	МАКСИМУМ(Сумма),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(СуммаНДС),
		|	СУММА(ДоляРаспределения)
		|ПО
		|	ЗакупочныйЗаказ";
		
		МассивСчетовУслуг = Новый Массив;
		МассивСчетовУслуг.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("08"));
		МассивСчетовУслуг.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("20"));
		МассивСчетовУслуг.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("25"));
		МассивСчетовУслуг.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("26"));
		МассивСчетовУслуг.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("44"));
		МассивСчетовУслуг.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("91"));
		
		Запрос.УстановитьПараметр("СчетаУслуг", МассивСчетовУслуг);
		Запрос.УстановитьПараметр("ТЧ", Документ[ИмяТЧ].Выгрузить());
		Запрос.УстановитьПараметр("ЗЗ", Документ.абс_ЗакупочныйЗаказ);
		Запрос.УстановитьПараметр("РБП", Документ.абс_ЗакупочныйЗаказ.РасходыБудущихПериодов);
		Запрос.УстановитьПараметр("СуммаВключаетНДС", Документ.СуммаВключаетНДС);
		
		//Запрос.УстановитьПараметр("Ссылка", Документ);
		ДеревоДляРаспределения = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		Возврат ДеревоДляРаспределения;
	Иначе 
		Возврат Неопределено
	КонецЕсли;
КонецФункции

Процедура РаспределитьБюджетыПоПроектамПТиУ(Документ, ДеревоДляРаспределения, ИмяТЧ) Экспорт
	
	ПроводитьПоПроектномуУчету = Константы.абс_ПроведениеПоМеханизмуПроектногоУчета.Получить();
	Если Не ПроводитьПоПроектномуУчету Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДеревоДляРаспределения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	НоваяТаблица = Документ[ИмяТЧ].Выгрузить().СкопироватьКолонки();
	
	Для Каждого СтрокаДокумента из Документ[ИмяТЧ] Цикл
		Если ЗначениеЗаполнено(СтрокаДокумента.абс_Проект) Тогда
			НоваяСтрока = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		Иначе			
			Для Каждого СтрокаЗЗ Из ДеревоДляРаспределения.Строки Цикл 
				ИсходнаяСумма = СтрокаДокумента.Сумма;
				СуммаРаспределенных = 0;
				ИсходноеКоличество = СтрокаДокумента.Количество;
				КоличествоРаспределенных = 0;
				ИсходнаяСуммаНДС = СтрокаДокумента.СуммаНДС;
				СуммаНДСРаспределенных = 0;
				Сч = 0;
				
				Для Каждого СтрокаПроект Из СтрокаЗЗ.Строки Цикл 
					Если Не ЗначениеЗаполнено(СтрокаПроект.Проект) Тогда 
						//Сообщить("Неверно заполнено распределение по проектам для закупочного заказа " + СтрокаЗЗ.ЗакупочныйЗаказ + ". Записаны обороты бюджета с пустым проектом.");
						ДоляРаспределения = 1;
						ДоляРаспределенияСумма = 1;
					Иначе 
						ДоляРаспределения = СтрокаПроект.ДоляРаспределения;
						ДоляРаспределенияСумма = СтрокаЗЗ.ДоляРаспределения;
					КонецЕсли;
					Сч = Сч + 1;
					
					
					ЗЗ = СтрокаПроект.ЗакупочныйЗаказ; 				
					
					НоваяСтрока = НоваяТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
					
					НоваяСтрока.абс_ЗакупочныйЗаказТЧ = ЗЗ;
					НоваяСтрока.абс_Проект = СтрокаПроект.Проект;
					Если мВалютаРегламентированногоУчета = Документ.ВалютаДокумента Тогда
						Курс = 1;
						Кратность = 1;
					Иначе
						Курс = Документ.КурсВзаиморасчетов;
						Кратность = Документ.КратностьВзаиморасчетов;					
					КонецЕсли;
					
					СуммаПоПроекту = СтрокаДокумента.Сумма / ДоляРаспределенияСумма * ДоляРаспределения;
					СуммаРаспределенных = СуммаРаспределенных + Окр(СуммаПоПроекту, 2);
					СуммаНДСПоПроекту = СтрокаДокумента.СуммаНДС / ДоляРаспределенияСумма * ДоляРаспределения;
					СуммаНДСРаспределенных = СуммаНДСРаспределенных + Окр(СуммаНДСПоПроекту, 2);
					КоличествоПоПроекту = СтрокаДокумента.Количество / ДоляРаспределенияСумма * ДоляРаспределения;
					КоличествоРаспределенных = КоличествоРаспределенных + Окр(КоличествоПоПроекту, 3);
					
					Если Сч = СтрокаЗЗ.Строки.Количество() Тогда 
						СуммаПоПроекту = СуммаПоПроекту + (ИсходнаяСумма - СуммаРаспределенных);
						СуммаНДСПоПроекту = СуммаНДСПоПроекту + (ИсходнаяСуммаНДС - СуммаНДСРаспределенных);
						КоличествоПоПроекту = КоличествоПоПроекту + (ИсходноеКоличество - КоличествоРаспределенных);
					КонецЕсли;
					
					НоваяСтрока.Сумма = СуммаПоПроекту;
					НоваяСтрока.Количество = КоличествоПоПроекту;
					НоваяСтрока.СуммаНДС = СуммаНДСПоПроекту;
					
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Документ[ИмяТЧ].Загрузить(НоваяТаблица);
КонецПроцедуры

Процедура Распределить(ДокО) Экспорт 	
	ДеревоДляРаспределенияТовары = ПолучитьТаблицуРаспределенияБюджетовПоПроектамПТиУ(ДокО, "Оборудование");
	РаспределитьБюджетыПоПроектамПТиУ(ДокО, ДеревоДляРаспределенияТовары, "Оборудование");
	ДеревоДляРаспределенияТовары = ПолучитьТаблицуРаспределенияБюджетовПоПроектамПТиУ(ДокО, "Товары");
	РаспределитьБюджетыПоПроектамПТиУ(ДокО, ДеревоДляРаспределенияТовары, "Товары");
	ДеревоДляРаспределенияТовары = ПолучитьТаблицуРаспределенияБюджетовПоПроектамПТиУ(ДокО, "Услуги");
	РаспределитьБюджетыПоПроектамПТиУ(ДокО, ДеревоДляРаспределенияТовары, "Услуги");		
КонецПроцедуры
//\\ АБС Глебов

// АБС Новоселов+ Агентская схема
Функция ЗаписатьЧерезВэбСервис(ТекстОшибки)
	
	Если ЭтоВэбСервис Тогда 
		ОтменитьПроведение = Истина;
		Возврат Истина;
	КонецЕсли;
	
	Если Услуги.Количество() = 0 Или Не ЗначениеЗаполнено(абс_Статус) Или абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка 
		Или Не ЗначениеЗаполнено(Контрагент) Или Контрагент.абс_ТипыКонтрагентов <> Справочники.абс_ТипыКонтрагентов.ФизическиеЛица 
		//АБС ВСТАВКА 49228  11.11.2014 15:24:41  Шамов
		ИЛИ НЕ абс_ЭтоАктАгента
		//АБС ВСТАВКА 49228 КОНЕЦ
		Тогда 
		Возврат Истина; // Ложь при ошибке
	КонецЕсли;
	
	//АБС ВСТАВКА №40078 НАЧАЛО «25 апреля 2014 г.», Пополитов
	Если не абс_СерверныеФункции.абс_ДаннаяБазаНеКопия() Тогда
		Возврат Истина;	
	КонецЕсли;	
	//\\АБС ВСТАВКА №40078 КОНЕЦ
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.абс_ДатаНачалаСинхронизацииАктовАгента,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.абс_ПроводитьПоступлениеПриОшибкахИСУЗК
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних");
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или Не ЗначениеЗаполнено(Выборка.абс_ДатаНачалаСинхронизацииАктовАгента) Или Дата < Выборка.абс_ДатаНачалаСинхронизацииАктовАгента Тогда 
		Возврат Истина;
	Иначе
		Проводить = Выборка.абс_ПроводитьПоступлениеПриОшибкахИСУЗК;
	КонецЕсли;
	
	ОтменитьПроведение = Истина;
	
	//АБС ВСТАВКА 35783  12.02.2014 18:36:45  Тупиков
	ДатаСреза = абс_СерверныеФункции.ПолучитьДатуСервера();
	СообщениеОбОшибке = "";
	Попытка
		
		СтруктураВозврата = абс_СерверныеФункции.ПолучитьСтраховойНомерПФРИзИСУЗК(Контрагент.абс_ФизЛицо.абс_КодИСУЗК, ДатаСреза, СообщениеОбОшибке);		
		
		//АБС ИЗМЕНЕНИЕ 39493  05.03.2014 14:58:35  Шамов
		//Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		//		Сообщить(СообщениеОбОшибке);
		//		Сообщить("Не удалось скорректировать документ в базе ИСУЗК!");
		//		СообщениеОбОшибке = "";
		//		Отказ = Истина;
		//		Возврат Ложь;
		//КонецЕсли;
		//АБС ИЗМЕНЕНИЕ 39493 КОНЕЦ
		
		Если Не ЗначениеЗаполнено(СтруктураВозврата.СтраховойНомерПФР) Тогда
			Сообщить(СообщениеОбОшибке);
			Сообщить("У агента не указан номер страхового свидетельства в базе ИСУЗК!");
			СообщениеОбОшибке = "";
			Отказ = Истина;
			Возврат Ложь;
		ИначеЕсли Не РегламентированнаяОтчетность.СтраховойНомерПФРСоответствуетТребованиям(СтруктураВозврата.СтраховойНомерПФР) Тогда
			Сообщить(СообщениеОбОшибке);
			Сообщить("У агента задан неверный номер страхового свидетельства в базе ИСУЗК!");
			СообщениеОбОшибке = "";
			Отказ = Истина;
			Возврат Ложь;
		КонецЕсли;
		
	Исключение	
		Сообщить(СообщениеОбОшибке);
		Сообщить("Не удалось получить номер страхового свидетельства из ИСУЗК!");
		СообщениеОбОшибке = "";
		Отказ = Истина;
		Возврат Ложь;
	КонецПопытки;
	
	//АБС ВСТАВКА 35783 КОНЕЦ
	
	
	// Передача документа с табличными частями
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Номер,
	|	ПоступлениеТоваровУслуг.Дата,
	|	ПоступлениеТоваровУслуг.Проведен,
	|	ПоступлениеТоваровУслуг.Контрагент.Код КАК Контрагент_Код,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Код КАК Договор_Код,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.Наименование КАК Договор_Имя,
	|	ПоступлениеТоваровУслуг.Организация.Код КАК Организация_Код,
	|	ПоступлениеТоваровУслуг.Подразделение.Код КАК Подразделение_Код,
	|	ПоступлениеТоваровУслуг.СуммаДокумента,
	|	ПоступлениеТоваровУслуг.абс_Статус.Порядок КАК Статус_Индекс,
	|	абс_ЦФУ_Спр.Код КАК ЦФУ_Код,
	|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации.абс_КодИСУЗК КАК ПодразделениеОрганизации_Код,
	|	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.Дата, МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ПоступлениеТоваровУслуг.Дата, МЕСЯЦ) КАК ДатаОкончания,
	|	ПоступлениеТоваровУслуг.Комментарий,
	|	ПоступлениеТоваровУслуг.абс_ПодразделениеНДФЛ.абс_КодИСУЗК Как абс_ПодразделениеНДФЛ_Код,
	|	ПоступлениеТоваровУслуг.абс_НачалоПериодаРаботы,
	|	ПоступлениеТоваровУслуг.абс_КонецПериодаРаботы
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.абс_ЦФУ КАК абс_ЦФУ_Спр
	|		ПО ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ.ЦФУ = абс_ЦФУ_Спр.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТЗДок = Запрос.Выполнить().Выгрузить();
	
	ТЗДок.Колонки.Добавить("СтруктураСвойств", Новый ОписаниеТипов("Структура"));
	СтруктураСвойств = Новый Структура();
	
	СтруктураСвойств.Вставить("ЗакупочныйЗаказ", "" + абс_ЗакупочныйЗаказ);
	СтруктураСвойств.Вставить("ОтражатьВБухгалтерскомУчете", ОтражатьВБухгалтерскомУчете);
	СтруктураСвойств.Вставить("ОтражатьВНалоговомУчете", ОтражатьВНалоговомУчете);
	СтруктураСвойств.Вставить("ОтражатьВУправленческомУчете", ОтражатьВУправленческомУчете);
	СтруктураСвойств.Вставить("ДатаВходящегоДокумента", ДатаВходящегоДокумента);
	СтруктураСвойств.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
	СтруктураСвойств.Вставить("абс_ОтветственныйБухгалтер", "" + абс_ОтветственныйБухгалтер);
	СтруктураСвойств.Вставить("ВидПоступления", "" + ВидПоступления);
	СтруктураСвойств.Вставить("СкладОрдер", "" + СкладОрдер);
	СтруктураСвойств.Вставить("ВидОперации", "" + ВидОперации);
	СтруктураСвойств.Вставить("БанковскийСчетКонтрагента", "" + БанковскийСчетКонтрагента);
	СтруктураСвойств.Вставить("Грузоотправитель", "" + Грузоотправитель);
	СтруктураСвойств.Вставить("Грузополучатель", "" + Грузополучатель);
	СтруктураСвойств.Вставить("абс_КомиссияТМЦ", "" + абс_КомиссияТМЦ);
	СтруктураСвойств.Вставить("абс_ДатаПоставки", абс_ДатаПоставки);
	СтруктураСвойств.Вставить("абс_ПоБухСправке", абс_ПоБухСправке);
	СтруктураСвойств.Вставить("Проект", "" + Проект);
	СтруктураСвойств.Вставить("Сделка", "" + Сделка);
	СтруктураСвойств.Вставить("абс_Продавец", "" + абс_Продавец);
	СтруктураСвойств.Вставить("абс_БезКонтроляМаппинга", абс_БезКонтроляМаппинга);
	СтруктураСвойств.Вставить("абс_ПериодОтражения", "" + абс_ПериодОтражения);
	СтруктураСвойств.Вставить("абс_РасчетРеглСуммыНДСОтРеглСуммыВсего", абс_РасчетРеглСуммыНДСОтРеглСуммыВсего);
	СтруктураСвойств.Вставить("абс_Основание", "" + абс_Основание);
	СтруктураСвойств.Вставить("абс_НомерПартии", абс_НомерПартии);
	СтруктураСвойств.Вставить("абс_ДатаПоставки", абс_ДатаПоставки);
	СтруктураСвойств.Вставить("ВсегоНДС", УчетНДС.ПолучитьНДСДокумента(ЭтотОбъект));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ИзменениеСтатусовПервичныхДокументов.Период КАК Период,
	|	ПРЕДСТАВЛЕНИЕ(абс_ИзменениеСтатусовПервичныхДокументов.СтатусДокумента) КАК СтатусДокумента,
	|	ПРЕДСТАВЛЕНИЕ(абс_ИзменениеСтатусовПервичныхДокументов.Пользователь) КАК Пользователь,
	|	абс_ИзменениеСтатусовПервичныхДокументов.Комментарий,
	|	ПРЕДСТАВЛЕНИЕ(абс_ИзменениеСтатусовПервичныхДокументов.ДолжностьОтветственного) КАК ДолжностьОтветственного,
	|	абс_ИзменениеСтатусовПервичныхДокументов.ВнутреннийНомер
	|ИЗ
	|	РегистрСведений.абс_ИзменениеСтатусовПервичныхДокументов КАК абс_ИзменениеСтатусовПервичныхДокументов
	|ГДЕ
	|	абс_ИзменениеСтатусовПервичныхДокументов.ПервичныйДокумент = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	СтруктураСвойств.Вставить("ТабличноеПолеСтатусы", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугУслуги.НомерСтроки КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.Номенклатура) КАК Номенклатура,
	|	ПоступлениеТоваровУслугУслуги.Содержание,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.Заказ) КАК Заказ,
	|	ПоступлениеТоваровУслугУслуги.Количество,
	|	ПоступлениеТоваровУслугУслуги.Цена,
	|	ПоступлениеТоваровУслугУслуги.Сумма,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.СтавкаНДС) КАК СтавкаНДС,
	|	ПоступлениеТоваровУслугУслуги.СуммаНДС,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.Подразделение) КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.СтатьяЗатрат) КАК СтатьяЗатрат,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.абс_ЛьготаПоНДС) КАК абс_ЛьготаПоНДС,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ) КАК абс_ЗакупочныйЗаказТЧ,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.абс_Регион) КАК абс_Регион,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.абс_Проект) КАК абс_Проект,
	|	ПоступлениеТоваровУслугУслуги.Подразделение.Код КАК КодПодразделение,
	|	ПоступлениеТоваровУслугУслуги.ПодразделениеОрганизации.Код КАК КодПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	|		ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ КАК Всего
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	СтруктураСвойств.Вставить("Услуги", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.НомерСтроки КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ) КАК абс_ЗакупочныйЗаказТЧ,
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_СуммаБезНДС,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.ЦФО) КАК ЦФО,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.ЦФУ) КАК ЦФУ,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ.БюджетнаяСтатья) КАК БюджетнаяСтатья
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы
	|ГДЕ
	|	ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	СтруктураСвойств.Вставить("абс_ЗакупочныеЗаказы", Запрос.Выполнить().Выгрузить());
	
	ТЗДок[0].СтруктураСвойств = СтруктураСвойств;
	ДанныеДок = ЗначениеВСтрокуВнутр(ТЗДок);
	
	Ответ = абс_WebServiceСервер.ИнициализацияAgentScheme(Номер, Дата, ДанныеДок, Строка(Ссылка.УникальныйИдентификатор()), ТекстОшибки);
	
	// Передача файла
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.ИмяФайла КАК Наименование,
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Объект
	|	И ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл)
	|	И ХранилищеДополнительнойИнформации.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	ТЗФайлов = Запрос.Выполнить().Выгрузить();
	
	СписокФайлов = Новый Соответствие;
	Для Каждого ТекФайл Из ТЗФайлов Цикл
		ТекФайл = Новый Структура("Ссылка, Наименование", ТекФайл.Ссылка, ТекФайл.Ссылка.Наименование);
		СписокФайлов.Вставить(ТекФайл.Ссылка, ТекФайл);
	КонецЦикла;
	
	СообщениеОбОшибке = "";
	Попытка
		Результат = абс_WebServiceСервер.ИнициализацияDogovor_PersonData_PutFile(СписокФайлов, Ссылка, СообщениеОбОшибке, "АктАгента");
	Исключение
		Сообщить(СообщениеОбОшибке);
		СообщениеОбОшибке = "";
		//Отказ = Истина;
		//Возврат Не Отказ;
	КонецПопытки;
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Сообщить(СообщениеОбОшибке);
	КонецЕсли;
	
	Если Проводить И Не Ответ Тогда 
		ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
	КонецЕсли;
	
	Возврат ?(Проводить, Истина, Ответ);
	
КонецФункции // АБС Новоселов-

//Сторчевой А.Н. 05.12.2017 НФС 2018 {
Функция ПолучитьТекстЗапроса()
	//ххх Брель Виктор Андреевич 03.04.2018 12:30:01, заявка <<<
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПоступлениеТоваровУслугТовары.абс_ЗакупочныйЗаказТЧ,
	               |	ПоступлениеТоваровУслугТовары.СтатьяОборотов,
	               |	ПоступлениеТоваровУслугТовары.абс_КВ,
	               |	ПоступлениеТоваровУслугТовары.абс_ТЭО,
	               |	ПоступлениеТоваровУслугТовары.абс_ЦФУ,
	               |	ПоступлениеТоваровУслугТовары.ttk_ОбъектБюджетирования,
	               |	ПоступлениеТоваровУслугТовары.Сумма - ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма,
	               |	ПоступлениеТоваровУслугТовары.ttk_УсловноеНачисление КАК ttk_УсловноеНачисление
	               |ПОМЕСТИТЬ ВТ_ТЧ
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугУслуги.абс_ЗакупочныйЗаказТЧ,
	               |	ПоступлениеТоваровУслугУслуги.СтатьяОборотов,
	               |	ПоступлениеТоваровУслугУслуги.абс_КВ,
	               |	ПоступлениеТоваровУслугУслуги.абс_ТЭО,
	               |	ПоступлениеТоваровУслугУслуги.абс_ЦФУ,
	               |	ПоступлениеТоваровУслугУслуги.ttk_ОбъектБюджетирования,
	               |	ПоступлениеТоваровУслугУслуги.Сумма - ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ПоступлениеТоваровУслугУслуги.ttk_УсловноеНачисление
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугОборудование.абс_ЗакупочныйЗаказТЧ,
	               |	ПоступлениеТоваровУслугОборудование.СтатьяОборотов,
	               |	ПоступлениеТоваровУслугОборудование.абс_КВ,
	               |	ПоступлениеТоваровУслугОборудование.абс_ТЭО,
	               |	ПоступлениеТоваровУслугОборудование.абс_ЦФУ,
	               |	ПоступлениеТоваровУслугОборудование.ttk_ОбъектБюджетирования,
	               |	ПоступлениеТоваровУслугОборудование.Сумма - ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугОборудование.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ПоступлениеТоваровУслугОборудование.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	NULL
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	               |ГДЕ
	               |	ПоступлениеТоваровУслугОборудование.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЗакупочныйЗаказТЧ,
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.СтатьяОборотов,
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.абс_КВ,
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ТЭО,
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.абс_ЦФУ,
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.ttk_ОбъектБюджетирования,
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.Сумма - ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	NULL
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
	               |ГДЕ
	               |	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТЧ.абс_ЗакупочныйЗаказТЧ,
	               |	ВТ_ТЧ.СтатьяОборотов,
	               |	ВТ_ТЧ.абс_КВ,
	               |	ВТ_ТЧ.абс_ТЭО,
	               |	ВТ_ТЧ.абс_ЦФУ,
	               |	ВТ_ТЧ.ttk_ОбъектБюджетирования,
	               |	СУММА(ВТ_ТЧ.Сумма) КАК Сумма,
	               |	ВТ_ТЧ.ttk_УсловноеНачисление
	               |ПОМЕСТИТЬ ВТ_АналитикиПроверки
	               |ИЗ
	               |	ВТ_ТЧ КАК ВТ_ТЧ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТЧ.абс_ЦФУ,
	               |	ВТ_ТЧ.абс_ТЭО,
	               |	ВТ_ТЧ.абс_ЗакупочныйЗаказТЧ,
	               |	ВТ_ТЧ.СтатьяОборотов,
	               |	ВТ_ТЧ.абс_КВ,
	               |	ВТ_ТЧ.ttk_ОбъектБюджетирования,
	               |	ВТ_ТЧ.ttk_УсловноеНачисление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_АналитикиПроверки.абс_ЗакупочныйЗаказТЧ КАК ЗакупочныйЗаказ,
	               |	ВТ_АналитикиПроверки.СтатьяОборотов,
	               |	ВТ_АналитикиПроверки.абс_КВ,
	               |	ВТ_АналитикиПроверки.абс_ТЭО,
	               |	ВТ_АналитикиПроверки.абс_ЦФУ,
	               |	ВТ_АналитикиПроверки.ttk_ОбъектБюджетирования,
	               |	ВТ_АналитикиПроверки.Сумма КАК СуммаИзДокумента,
	               |	ВЫБОР
	               |		КОГДА ВТ_АналитикиПроверки.ttk_УсловноеНачисление = ЗНАЧЕНИЕ(Документ.абс_РезервыПроизведенныхРасходов.ПустаяССЫлка)
	               |				ИЛИ ВТ_АналитикиПроверки.ttk_УсловноеНачисление ЕСТЬ NULL 
	               |			ТОГДА ЕСТЬNULL(абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.СуммаОстаток, 0)
	               |		ИНАЧЕ ЕСТЬNULL(абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ.СуммаОстаток, 0)
	               |	КОНЕЦ КАК Остаток,
	               |	ВТ_АналитикиПроверки.ttk_УсловноеНачисление
	               |ИЗ
	               |	ВТ_АналитикиПроверки КАК ВТ_АналитикиПроверки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(
	               |				&Дата,
	               |				ЗакупочныйЗаказ В
	               |						(ВЫБРАТЬ
	               |							ВТ_АналитикиПроверки.абс_ЗакупочныйЗаказТЧ
	               |						ИЗ
	               |							ВТ_АналитикиПроверки КАК ВТ_АналитикиПроверки)
	               |					И ПериодПоставки = &ПериодПоставки) КАК абс_ГрафикПоставкиЗакупочногоЗаказаОстатки
	               |		ПО ВТ_АналитикиПроверки.абс_ЗакупочныйЗаказТЧ = абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ЗакупочныйЗаказ
	               |			И ВТ_АналитикиПроверки.СтатьяОборотов = абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.СтатьяОборотов
	               |			И ВТ_АналитикиПроверки.абс_КВ = абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.абс_КВ
	               |			И ВТ_АналитикиПроверки.абс_ТЭО = абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.абс_ТЭО
	               |			И ВТ_АналитикиПроверки.абс_ЦФУ = абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.абс_ЦФУ
	               |			И ВТ_АналитикиПроверки.ttk_ОбъектБюджетирования = абс_ГрафикПоставкиЗакупочногоЗаказаОстатки.ttk_ОбъектБюджетирования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа.Остатки(
	               |				&Дата,
	               |				ЗакупочныйЗаказ В
	               |						(ВЫБРАТЬ
	               |							ВТ_АналитикиПроверки.абс_ЗакупочныйЗаказТЧ
	               |						ИЗ
	               |							ВТ_АналитикиПроверки КАК ВТ_АналитикиПроверки)
	               |					И ПериодПоставки = &ПериодПоставкиВХ) КАК абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ
	               |		ПО ВТ_АналитикиПроверки.ttk_ОбъектБюджетирования = абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ.ttk_ОбъектБюджетирования
	               |			И ВТ_АналитикиПроверки.СтатьяОборотов = абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ.СтатьяОборотов
	               |			И ВТ_АналитикиПроверки.абс_КВ = абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ.абс_КВ
	               |			И ВТ_АналитикиПроверки.абс_ТЭО = абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ.абс_ТЭО
	               |			И ВТ_АналитикиПроверки.абс_ЦФУ = абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ.абс_ЦФУ
	               |			И ВТ_АналитикиПроверки.абс_ЗакупочныйЗаказТЧ = абс_ГрафикПоставкиЗакупочногоЗаказаОстаткиВХ.ЗакупочныйЗаказ";
	
	Возврат ТекстЗапроса;
	
	// Брель Виктор Андреевич 03.04.2018 12:30:01 >>>
	
КонецФункции

Процедура ДвиженияПоРегиструГрафикПоставкиЗакупочногоЗаказа2018(СтруктураШапкиДокумента,Отказ)
	//ххх Брель Виктор Андреевич 21.06.2018 11:52:32, заявка 77356750<<<
	КВпоПост = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост");
	ГоловнаяКомпания = Справочники.абс_ТипыКонтрагентов.НайтиПоКоду("ТК02020013");
	ТК0101ДЗОТТК = Справочники.абс_ТипыКонтрагентов.НайтиПоКоду("ТК0101");
	ТК0102ФилиалыТТК = Справочники.абс_ТипыКонтрагентов.НайтиПоКоду("ТК0102");
	// Брель Виктор Андреевич 21.06.2018 11:52:32 >>>

	ТЗДвиженияПоГрафикуПоставок = СтруктураШапкиДокумента.ТЗДвиженияПоГрафикуПоставок;
	
	абс_ИсключитьДатуИзГрафикаПоставок = Константы.абс_ИсключитьДатуИзГрафикаПоставок.Получить();
	
	ТекВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	ТекКурс = ?(мВалютаРегламентированногоУчета <> ТекВалютаВзаиморасчетов, МодульВалютногоУчета.ПолучитьКурсВалюты(ТекВалютаВзаиморасчетов, Дата).Курс, КурсВзаиморасчетов);
	
	Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Записывать = Истина;
	Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Очистить();
	
	//++ Задача № 10097 Логинчев А.С. 16.05.2012 17:04:28
	ПерваяЗаписьвРНКонтролируемыеЗначенияПоБюджету = Истина;
	//-- Задача № 10097 Логинчев А.С.
	
	Для каждого ТекСтрокаГрафикПоставок Из ТЗДвиженияПоГрафикуПоставок Цикл
		Если ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.УбыткиПрошлыхЛет Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.РасходыБудущихПериодов Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(абс_ИсключитьДатуИзГрафикаПоставок) и НачалоДня(Дата) = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок) Тогда
			врДатаПоставки = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок)-1;
		Иначе
			врДатаПоставки = Дата;
		КонецЕсли;	
		
		// АБС Фролов 20120509
		// Для организаций ДЗО
		// для поставок по ЗЗ с нефиксированной суммой:
		// 1. не контролируем график поставок
		// 2. производим списание лимитов документом поставки при их наличии
		// 3. при отсутствии лимита не проводим документ
		
		КонтрольЛимитовНефиксЗЗвПОставке = (ПараметрыСеанса.абс_ПользовательДЗО 
		или Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.ДЗО
		или Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.Филиал)
		и глЗначениеПеременной("абс_СписаниеИКонтрольЛимитовПоСхемеГоловнойКомпании") > СтруктураШапкиДокумента.Дата
		;	
		
		врСуммаОтгрузки = 0;
		
		врабс_ЗакупочныйЗаказ = ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ;
		//ххх Брель Виктор Андреевич 24.03.2018 16:30:34, заявка <<<
		
		
		//	Если врабс_ЗакупочныйЗаказ.НефиксированнаяСумма //И КонтрольЛимитовНефиксЗЗвПОставке 
		//		Тогда
		//		
		//		
		//		//+ПРИХОД
		//		Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
		//		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаГрафикПоставок); 
		//		Движение.ВидДвижения     = ВидДвиженияНакопления.Приход;
		//		Движение.Период          = Дата;
		//		Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
		//		Движение.ПериодПоставки  = НачалоМесяца(врДатаПоставки);
		//		//++ Задача № 10097 Логинчев А.С. 16.05.2012 17:05:36
		//		Если ПерваяЗаписьвРНКонтролируемыеЗначенияПоБюджету Тогда
		//			Движения.КонтролируемыеЗначенияБюджетов.Записывать = Истина;
		//			Движения.КонтролируемыеЗначенияБюджетов.Очистить();
		//			Движения.КонтролируемыеЗначенияБюджетов.Записать();
		//			ПерваяЗаписьвРНКонтролируемыеЗначенияПоБюджету = Ложь;
		//		КонецЕсли;
		//		//-- Задача № 10097 Логинчев А.С.
		//
		//		Движение = Движения.КонтролируемыеЗначенияБюджетов.Добавить();
		//		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаГрафикПоставок);
		//		Движение.Период 					= Дата;
		//		Движение.ЦФО 						= ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ЦФО;
		//		Движение.абс_ТипКонтрагента 		= ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента;
		//		Движение.абс_ТипРасхода 			= ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипРасхода;
		//		Движение.Организация 				= Организация;
		//		Движение.СуммаСценарияИсполнение	= ТекСтрокаГрафикПоставок.Сумма;
		//		Движение.СуммаСценарияИсполнениеВал = ?(ТекВалютаВзаиморасчетов <> мВалютаРегламентированногоУчета
		//												, МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ТекСтрокаГрафикПоставок.Сумма, ТекВалютаВзаиморасчетов, мВалютаРегламентированногоУчета, 1, ТекКурс)
		//												, ТекСтрокаГрафикПоставок.Сумма);
		//		Движение.Валюта						= ВалютаДокумента;
		//		
		//	КонецЕсли;
		
		
		
		
		// Брель Виктор Андреевич 24.03.2018 16:30:34 >>>
		Если ОтражатьВБухгалтерскомУчете   Тогда
		Если врабс_ЗакупочныйЗаказ.НефиксированнаяСумма Тогда 
			//КонтролируемыеЗначенияБюджетов
			
			Движение = Движения.КонтролируемыеЗначенияБюджетов.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаГрафикПоставок);
			Движение.Период 					= Дата;
			Движение.ЦФО 						= ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ЦФО;
			Движение.абс_ТипРасхода 			= ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипРасхода;
			Движение.Организация 				= Организация;
			Движение.СуммаСценарияИсполнение = ТекСтрокаГрафикПоставок.Сумма;
			Движение.СуммаСценарияИсполнениеВал = ТекСтрокаГрафикПоставок.СуммаВал;
			Движение.Валюта						= ВалютаДокумента;
			//ххх Брель Виктор Андреевич 21.06.2018 11:52:32, заявка 77356750<<<
			Если ТекСтрокаГрафикПоставок.СтатьяОборотов <> КВпоПост Тогда
				Движение.абс_КВ 					= Неопределено;
			КонецЕсли;
			//ххх Брель Виктор Андреевич 21.06.2018 11:52:32, заявка 77356750<<<
			Если ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента.Родитель = ТК0101ДЗОТТК ИЛИ     ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента.Родитель.Родитель  = ТК0101ДЗОТТК ИЛИ ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента.Родитель.Родитель.Родитель  = ТК0101ДЗОТТК ИЛИ 
				ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента.Родитель = ТК0102ФилиалыТТК ИЛИ            ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента.Родитель.Родитель  = ТК0102ФилиалыТТК ИЛИ ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента.Родитель.Родитель.Родитель = ТК0102ФилиалыТТК ИЛИ
				ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента = ГоловнаяКомпания Тогда
				Движение.абс_ТипКонтрагента 		= ТекСтрокаГрафикПоставок.ЗакупочныйЗаказ.ТипКонтрагента;
			КонецЕсли;
			// Брель Виктор Андреевич 21.06.2018 13:10:12 >>>
			
			
			//абс_ГрафикПоставкиЗакупочногоЗаказа
			////-Приход
			Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаГрафикПоставок,"Период,ПериодПоставки,ttk_ОбъектБюджетирования,ЗакупочныйЗаказ,СтатьяОборотов,Сумма,абс_КВ,абс_ТЭО,абс_ТипСети,абс_ЦФУ");
			Движение.ВидДвижения     = ВидДвиженияНакопления.Приход;
			Движение.Период          = Дата;
			Движение.ПериодПоставки   = Дата;
			Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
			Движение.Сумма  = ?(мВалютаРегламентированногоУчета <> ТекВалютаВзаиморасчетов,ТекСтрокаГрафикПоставок.СуммаВал,ТекСтрокаГрафикПоставок.Сумма);

			////-РАСХОД
			Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаГрафикПоставок,"Период,ПериодПоставки,ttk_ОбъектБюджетирования,ЗакупочныйЗаказ,СтатьяОборотов,Сумма,абс_КВ,абс_ТЭО,абс_ТипСети,абс_ЦФУ");
			Движение.ВидДвижения     = ВидДвиженияНакопления.Расход;
			Движение.Период          = Дата;
			Движение.ПериодПоставки   = Дата;
			Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;			
		    Движение.Сумма  = ?(мВалютаРегламентированногоУчета <> ТекВалютаВзаиморасчетов,ТекСтрокаГрафикПоставок.СуммаВал,ТекСтрокаГрафикПоставок.Сумма);

		
	Иначе
		
		//абс_ГрафикПоставкиЗакупочногоЗаказа
		////-РАСХОД
		Движение = Движения.абс_ГрафикПоставкиЗакупочногоЗаказа.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаГрафикПоставок,"Период,ПериодПоставки,ttk_ОбъектБюджетирования,ЗакупочныйЗаказ,СтатьяОборотов,Сумма,абс_КВ,абс_ТЭО,абс_ТипСети,абс_ЦФУ");
		Движение.ВидДвижения     = ВидДвиженияНакопления.Расход;
		Движение.Сумма  = ?(мВалютаРегламентированногоУчета <> ТекВалютаВзаиморасчетов,ТекСтрокаГрафикПоставок.СуммаВал,ТекСтрокаГрафикПоставок.Сумма);
		Движение.Период          = Дата;
		Движение.ЗакупочныйЗаказ = врабс_ЗакупочныйЗаказ;
		Если ЗначениеЗаполнено(ТекСтрокаГрафикПоставок.ttk_УсловноеНачисление) И  НачалоМесяца(Дата)<>Дата("20180101") Тогда
			Движение.ПериодПоставки  = НачалоМесяца(?(НачалоМесяца(ДатаВходящегоДокумента)<Дата("20180101"),Дата("20180201"),НачалоМесяца(ДатаВходящегоДокумента)));
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаГрафикПоставок.ttk_УсловноеНачисление) И  НачалоМесяца(Дата)=Дата("20180101") Тогда
			Движение.ПериодПоставки  = Дата("20180101");
		Иначе
			Движение.ПериодПоставки =НачалоМесяца(Дата); 
		КонецЕсли;
		
	КонецЕсли;
	КонецЕсли;
	// Брель Виктор Андреевич 24.03.2018 16:30:34 >>>
	
	КонецЦикла;     	
	
КонецПроцедуры
// } Сторчевой А.Н. 05.12.2017 НФС 2018


//АБС ВСТАВКА 35750  27.01.2014 16:11:25  Шамов
Процедура абс_РаспределитьНДСПоТаблицам(мТаблицыДокумента)
	
	тзРаспределения = Новый ТаблицаЗначений();
	тзРаспределения.Колонки.Добавить("ТабличнаяЧасть");	
	тзРаспределения.Колонки.Добавить("НомерСтрокиТЧ");	
	тзРаспределения.Колонки.Добавить("ПроводкаСуммаНДС");	
	тзРаспределения.Колонки.Добавить("НДСУпр");	
	тзРаспределения.Колонки.Добавить("НДС");	
	
	Для Каждого Таблица Из мТаблицыДокумента Цикл
		Для Каждого СтрокаТЗ Из Таблица.Значение Цикл
			СтрокаРаспределения = тзРаспределения.Добавить();
			СтрокаРаспределения.ТабличнаяЧасть = Таблица.Ключ;
			СтрокаРаспределения.НомерСтрокиТЧ = СтрокаТЗ.НомерСтроки;
			СтрокаРаспределения.ПроводкаСуммаНДС = СтрокаТЗ.ПроводкаСуммаНДС;
			СтрокаРаспределения.НДСУпр = СтрокаТЗ.НДСУпр;
			СтрокаРаспределения.НДС = СтрокаТЗ.НДС;
		КонецЦикла;
	Конеццикла;	
	
	мНДСРегл = тзРаспределения.ВыгрузитьКолонку("ПроводкаСуммаНДС");
	мНДСРеглНовый = ttk_ОбщегоНазначения.РаспределитьПропорционально(абс_СуммаНДСПоСчетуФактуре, мНДСРегл);
	
	мНДСУпр = тзРаспределения.ВыгрузитьКолонку("НДСУпр");
	мНДСУпрНовый = ttk_ОбщегоНазначения.РаспределитьПропорционально(абс_СуммаНДСПоСчетуФактуре, мНДСУпр);
	
	мНДС = тзРаспределения.ВыгрузитьКолонку("НДС");
	мНДСНовый = ttk_ОбщегоНазначения.РаспределитьПропорционально(абс_СуммаНДСПоСчетуФактуре, мНДС);
	
	КоличествоЗаписей = тзРаспределения.Количество();
	Для Сч = 0 По КоличествоЗаписей-1 Цикл
		
		СтрокаТЗ = тзРаспределения[Сч];
		
		КорректируемаяСтрока = мТаблицыДокумента[СтрокаТЗ.ТабличнаяЧасть][СтрокаТЗ.НомерСтрокиТЧ-1]; 
		
		РазницаРегл = КорректируемаяСтрока.ПроводкаСуммаНДС - мНДСРеглНовый[Сч];
		КорректируемаяСтрока.ПроводкаСуммаНДС = мНДСРеглНовый[Сч];
		КорректируемаяСтрока.ПроводкаСумма = КорректируемаяСтрока.ПроводкаСумма + РазницаРегл;
		
		РазницаУпр = КорректируемаяСтрока.НДСУпр - мНДСУпрНовый[Сч];
		КорректируемаяСтрока.НДСУпр = мНДСУпрНовый[Сч];
		Если НЕ НДСВключенВСтоимость Тогда
			КорректируемаяСтрока.Стоимость = КорректируемаяСтрока.Стоимость + РазницаУпр;
		Иначе
			КорректируемаяСтрока.СуммаУпр = КорректируемаяСтрока.СуммаУпр + РазницаУпр;
		Конецесли;
		
		Разница = КорректируемаяСтрока.НДС - мНДСНовый[Сч];
		КорректируемаяСтрока.НДС = мНДСНовый[Сч];
		Если НЕ НДСВключенВСтоимость Тогда
			КорректируемаяСтрока.Сумма = КорректируемаяСтрока.Сумма + Разница;
			КорректируемаяСтрока.СуммаБУ = КорректируемаяСтрока.СуммаБУ + Разница;
		Конецесли;
		КорректируемаяСтрока.СуммаБезНДС = КорректируемаяСтрока.СуммаБезНДС + Разница;
		КорректируемаяСтрока.СуммаБУБезНДС = КорректируемаяСтрока.СуммаБУБезНДС + Разница;
		
	КонецЦикла;
	
КонецПроцедуры
//АБС ВСТАВКА 35750 КОНЕЦ
//ххх Брель Виктор Андреевич 14.05.2018 14:50:30, заявка <<<
Функция ПроверитьАналитикуПоЗЗ()
	
КонецФункции
// Брель Виктор Андреевич 14.05.2018 14:50:30 >>>

////Бобылев А.А. 31.07.2018 СППР 00-00000110
Процедура ЗаполнитьОплату(ДанныеЗаполнения = Неопределено, Док) Экспорт
	
	Если ДанныеЗаполнения <> Неопределено Тогда		
		Док.Оплаты.Очистить();		
		Для Каждого Стр Из ДанныеЗаполнения Цикл
			СтрокаОплаты = Док.Оплаты.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаОплаты, Док);//, Стр); //ЭтотОбъект);
			СтрокаОплаты.СтатусОплаты = Док.СтатусСчета;
			СтрокаОплаты.ttk_Город = Стр.ttk_Город;
			//СтрокаОплаты.ТипРасхода = Стр.абс_ТипРасхода;
			СтрокаОплаты.ЦФУ = Стр.абс_ЦФУ;		
			СтрокаОплаты.ТЭО = Стр.абс_ТЭО;
			СтрокаОплаты.КВ = Стр.абс_КВ;
			СтрокаОплаты.ТипСети = Стр.абс_ТипСети;
			СтрокаОплаты.БюджетнаяСтатья = Стр.СтатьяОборотов;		
			СтрокаОплаты.СуммаПлатежа = Стр.СуммаСНДС;
			СтрокаОплаты.Контрагент = Док.Контрагент;
			СтрокаОплаты.ДоговорКонтрагента = Док.ДоговорКонтрагента;
			СтрокаОплаты.Валюта = Док.Валюта;
			СтрокаОплаты.ВалютнаяСумма = Стр.ВалютнаяСуммаСНДС;
			СтрокаОплаты.Курс = Док.Курс;
			СтрокаОплаты.Кратность = Док.Кратность;
			СтрокаОплаты.СуммаРезерва = Док.СуммаРезерва;
			СтрокаОплаты.СуммаРезерваВалютная = Док.СуммаРезерваВалютная;
			Док.СтатьяДвиженияДенежныхСредств = ПолучитьСтатьюДДС(Стр.СтатьяОборотов, Док.НазначениеПлатежа);
			//НФС 2018
			//Крамаренко Д.М.
			Если ЗначениеЗаполнено(Стр.ttk_ОбъектБюджетирования) Тогда
				СтрокаОплаты.ttk_ОбъектБюджетирования = Стр.ttk_ОбъектБюджетирования;
			Иначе
				СтрокаОплаты.ttk_ОбъектБюджетирования = ttk_ОбщегоНазначения.ОпределитьОбъектБюджетирования(Док.Организация, Стр.абс_ЦФУ);
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтатьюДДС(врБюджетнаяСтатья,врНазначениеПлатежа) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДДС.БюджетнаяСтатья,
	               |	ДДС.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	ДДС.СтатьяДДС
	               |ИЗ
	               |	РегистрСведений.абс_СоответствияСтатейДДСИУправленческихСтатейЗатрат КАК ДДС
	               |ГДЕ
	               |	ДДС.БюджетнаяСтатья В(&БюджетнаяСтатья)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НазначениеПлатежа";
	
	Запрос.УстановитьПараметр("БюджетнаяСтатья",врБюджетнаяСтатья);	
	
	врТЗ = Запрос.Выполнить().Выгрузить();
	Если врТЗ.Количество() > 1 Тогда 		
		МассивДДС = врТЗ.НайтиСтроки(Новый Структура("НазначениеПлатежа",врНазначениеПлатежа));
		Если МассивДДС.Количество() > 0 Тогда
			Возврат МассивДДС[0].СтатьяДДС;	
		КонецЕсли;	
	ИначеЕсли врТЗ.Количество() > 0 Тогда			
		МассивДДС = врТЗ.ВыгрузитьКолонку("СтатьяДДС");
		Возврат МассивДДС[0];
	Иначе  
		Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции



////абс Родин Лимитный контроль 
//Процедура СформироватьДвиженияПоКонтролируемымЗатратам(ТаблицаПоТоварам,ТаблицаПоУслугам,ТолькоКонтрольЛимитов,Отказ)
//	
//	Если Не Отказ И ДоговорКонтрагента.абс_ОсобыйПорядкокКонтроляЛимитов Тогда
//		
//		СообщениеПриОтказе = "";
//		
//		СтруктураТаблиц = Новый Структура();
//		СтруктураТаблиц.Вставить("ТаблицаПоТоварам",ТаблицаПоТоварам);
//		СтруктураТаблиц.Вставить("ТаблицаПоУслугам",ТаблицаПоУслугам);
//		
//		абс_Бюджетирование.ФормированиеДвиженийПоКонтролируемымЗатратам(Ссылка,Отказ,СообщениеПриОтказе,СтруктураТаблиц,ТолькоКонтрольЛимитов);
//		
//		Если Отказ И СообщениеПриОтказе <> "" Тогда
//			ttk_ОбщегоНазначения.СообщитьОбОшибке(СообщениеПриОтказе,Отказ); 
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//абс Родин Лимитный контроль 


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

мУказаниеПроектовВТабличнойЧастиДокументов = УправлениеПроектами.УказаниеПроектовВТабличнойЧастиДокументов();

мСтруктураПараметровВзаиморасчетов = Новый Структура;
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары, Услуги, Оборудование, ОбъектыСтроительства"));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Истина);
мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях", "ЗаказПоставщику");

мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();

УказаниеСкладов = Константы.УказаниеСкладовВТабличнойЧастиДокументов.Получить();

мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления);

мИспользоватьТару = Константы.ИспользоватьВозвратнуюТару.Получить();

//абс_Стрельцов+ добавлено: 24.09.2012
//при переносе ПУ
мПроведениеПоМеханизмуПроектногоУчета = Константы.абс_ПроведениеПоМеханизмуПроектногоУчета.Получить();
//
//абс_Стрельцов-

мДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа = Константы.абс_ДатаНачалаИспользованияРегистраГрафикПоставкиЗакупочногоЗаказа.Получить();
// АБС Новоселов+
ЭтоВэбСервис = Ложь;
// АБС Новоселов-
