// Найти элемент по ИНН+КПП+Наименование
//
// Параметры
//  ИНН  - <Строка> - ИНН искомого
//  КПП  - <Строка> - КПП искомого
//  Наименование  - <Строка> - Наименование искомого
//
// Возвращаемое значение:
//   <СправочникСсылка.Контрагенты>   - Искомый элемент или пустая ссылка
//
// {{KM WARE Трухан А.Г. Агентский блок 14.09.2015 начало
Функция НайтиПоИНН_КПП_Наименованию(ИНН,КПП,Наименование) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.КПП = &КПП
		|	И (Контрагенты.Наименование ПОДОБНО &Наименование
		|			ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &Наименование)";

	Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
	Запрос.УстановитьПараметр("КПП", СокрЛП(КПП));
	Запрос.УстановитьПараметр("Наименование", Наименование);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Справочники.Контрагенты.ПустаяСсылка();

КонецФункции // НайтиПоИНН_КПП_Наименованию() }}KM WARE Трухан А.Г. Агентский блок 14.09.2015 окончание

