////////////////////////////////////////////////////////////////////////////////
// МЕТОДЫ ПОЛУЧЕНИЯ ДАННЫХ ДОКУМЕНТОВ

// Функция возвращает шапку документа ЗарплатаКВыплатеОрганизаций
//
// Параметры:
//  Ссылка  - документ-ссылка ЗарплатаКВыплате
//
// Возвращаемое значение:
//	Выборка с полями:
//		Организация
//		ПериодРегистрации
//		ХарактерВыплаты
//		СпособВыплаты
//
Функция ПолучитьДанныеДокумента(Ссылка) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Рубли", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизаций.Ссылка,
	|	ЗарплатаКВыплатеОрганизаций.ПометкаУдаления,
	|	ЗарплатаКВыплатеОрганизаций.Проведен,
	|	ЗарплатаКВыплатеОрганизаций.Организация,
	|	ЗарплатаКВыплатеОрганизаций.ПодразделениеОрганизации,
	|	ЗарплатаКВыплатеОрганизаций.ПериодРегистрации,
	|	ЗарплатаКВыплатеОрганизаций.ХарактерВыплаты,
	|	ЗарплатаКВыплатеОрганизаций.СпособВыплаты,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств = &Рубли
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетОрганизации,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|				И ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет.ВалютаДенежныхСредств = &Рубли
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк.ИНН
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ИННПолучателя,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк.КПП
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КПППолучателя,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ВЫРАЗИТЬ(ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет.ТекстКорреспондента КАК СТРОКА(300))
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ТекстПолучателя
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизаций.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

// Функция возвращает сумму к выплате по документу ЗарплатаКВыплатеОрганизаций
//
// Параметры:
//  Ведомость  - документ-ссылка ЗарплатаКВыплате
//  ВыплаченностьЗарплаты - Перечисления.ВыплаченностьЗарплаты
//  ПлатежныйДокумент - если указать, то выплаты по этому документу не учитываются
//
// Возвращаемое значение:
//	СуммаКВыплате
//
Функция ПолучитьДанныеДляВыплаты(Ведомости, ВыплаченностьЗарплаты = Неопределено, ПлатежныйДокумент = Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	Запрос.УстановитьПараметр("НеПроверятьВыплаченность", ВыплаченностьЗарплаты = Неопределено);
	Запрос.УстановитьПараметр("ВыплаченностьЗарплаты", ВыплаченностьЗарплаты);
	Запрос.УстановитьПараметр("ПоВсемРегистраторам", ПлатежныйДокумент = Неопределено);
	Запрос.УстановитьПараметр("ПлатежныйДокумент", ПлатежныйДокумент);

	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗарплатаКВыплатеЗарплата.Ссылка КАК Ведомость,
	|	ЗарплатаКВыплатеЗарплата.Физлицо КАК Физлицо,
	|	СУММА(ЗарплатаКВыплатеЗарплата.Сумма + ЗарплатаКВыплатеЗарплата.КомпенсацияЗаЗадержкуЗарплаты) КАК СуммаКВыплате
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК РанееВыплаченныеСуммы
	|		ПО ЗарплатаКВыплатеЗарплата.Ссылка = РанееВыплаченныеСуммы.Ведомость
	|			И ЗарплатаКВыплатеЗарплата.Физлицо = РанееВыплаченныеСуммы.Физлицо
	|			И (&ПоВсемРегистраторам
	|				ИЛИ РанееВыплаченныеСуммы.Регистратор <> &ПлатежныйДокумент)
	|ГДЕ
	|	ЗарплатаКВыплатеЗарплата.Ссылка В(&Ведомости)
	|	И РанееВыплаченныеСуммы.Физлицо ЕСТЬ NULL 
	|	И (&НеПроверятьВыплаченность
	|			ИЛИ ЗарплатаКВыплатеЗарплата.ВыплаченностьЗарплаты = &ВыплаченностьЗарплаты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеЗарплата.Ссылка,
	|	ЗарплатаКВыплатеЗарплата.Физлицо";

	Возврат Запрос.Выполнить().Выгрузить();;
	
КонецФункции

