
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Ссылка.Пустая() Тогда
		
		ИнициаторОтгрузки = глЗначениеПеременной("глТекущийПользователь");
		
	КонецЕсли;
	
	
	РежимЗаписи = РежимЗаписиДокумента.Проведение;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	Изменил = глЗначениеПеременной("глТекущийПользователь");

	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	
	Для каждого Строка из  ОбъектКопирования.Номенклатура Цикл
		
		 Строка.Документ = Неопределено;
		 
	КонецЦикла;
	
КонецПроцедуры

