
&НаКлиенте
Процедура ПрочитатьФайл()
	 		
	ДвоичныеДанные  = Новый ДвоичныеДанные(Файл);
    СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	РазобратьФайлСервер (СсылкаНаФайл);
	             					
КонецПроцедуры

&НаСервере
Процедура РазобратьФайлСервер(СсылкаНаФайл);
	
	ОбъектXML = Новый ЧтениеXML;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаНаФайл);
	
	ВремФайл = ПолучитьИмяВременногоФайла("xml");

	ДвоичныеДанные.Записать (ВремФайл);
	
	Попытка
		ОбъектXML.ОткрытьФайл(ВремФайл);
		ЭД = ФабрикаXDTO.ПрочитатьXML(ОбъектXML);
	Исключение
		ОбъектXML.Закрыть();		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Возникла ошибка при чтении данных из файла %1: %2'"), Файл, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;	

	Если НЕ ЭД.Тип() = ЭлектронныеДокументыФорматОбмена.ПолучитьТипЗначенияCML("Контрагент") Тогда
		Возврат;
	КонецЕсли;
		
	
	ДопустимыеТипы = "Страна, Регион, Район, Город, Улица, Дом, Корпус, Квартира";
		
	СвойствоЭД = ЭД.Свойства().Получить("РасчетныеСчета");
	Если СвойствоЭД <> Неопределено Тогда
		ЗнДанных = ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			Для Каждого ТекСв Из ЗнДанных.РасчетныйСчет Цикл
				РасчетныйСчет 		  = ТекСв.НомерСчета;
				БИК 				  = ТекСв.Банк.БИК;
				КорреспондентскийСчет = ТекСв.Банк.СчетКорреспондентский;
				Банк 	   			  = ТекСв.Банк.Наименование;
			КонецЦикла
        КонецЕсли;
	КонецЕсли;
	
	СвойствоЭД = ЭД.Свойства().Получить("ЮрЛицо");
	Если СвойствоЭД <> Неопределено Тогда
		ЗнДанных = ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			СвойствоИНН = ЗнДанных.Свойства().Получить("ИНН");
			Если СвойствоИНН <> Неопределено Тогда
				ИНН = ЗнДанных.Получить(СвойствоИНН);
			КонецЕсли;	
			СвойствоКПП = ЗнДанных.Свойства().Получить("КПП");
			Если СвойствоКПП <> Неопределено Тогда
				КПП = ЗнДанных.Получить(СвойствоКПП);
			КонецЕсли;	
			СвойствоОКПО = ЗнДанных.Свойства().Получить("ОКПО");
			Если СвойствоОКПО <> Неопределено Тогда
				ОКПО = ЗнДанных.Получить(СвойствоОКПО);
			КонецЕсли;	
			СвойствоОФНаим = ЗнДанных.Свойства().Получить("ОфициальноеНаименование");
			Если СвойствоОФНаим <> Неопределено Тогда
				Наименование = ЗнДанных.Получить(СвойствоОфНаим);
			КонецЕсли;	
            СвойствоРуководитель = ЗнДанных.Свойства().Получить("Руководитель");
			Если СвойствоРуководитель <> Неопределено Тогда
				ЗнРуководитель = ЗнДанных.Получить(СвойствоРуководитель);
				Если ЗнРуководитель <> Неопределено Тогда
    				СвойствоФизЛицо = ЗнРуководитель.Свойства().Получить("ФизЛицо");
					Если СвойствоФизЛицо <> Неопределено Тогда
						ЗнФизЛицо = ЗнРуководитель.Получить(СвойствоФизЛицо);
						Если ЗнФизЛицо <> Неопределено Тогда
							ДолжностьРуководителя = ЗнФизЛицо.Должность; 
							Руководитель = ЗнФизЛицо.ПолноеНаименование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			СвойствоЮрАдрес = ЗнДанных.Свойства().Получить("ЮридическийАдрес");
			Если СвойствоЮрАдрес <> Неопределено Тогда
				ЗнЮрАдрес = ЗнДанных.Получить(СвойствоЮрАдрес);
				Если ЗнЮрАдрес <> Неопределено Тогда
					ЮридическийАдрес = ЗнЮрАдрес.Представление;
					Для Каждого ТекСв Из ЗнЮрАдрес.АдресноеПоле Цикл
						Если ТекСв.Тип = "Почтовый индекс" Тогда
							ЗначенияПолейЮрАдрес = ЗначенияПолейФактАдрес + "Индекс"+"="+ТекСв.Значение+Символы.ПС;
						ИначеЕсли	ТекСв.Тип = "Населенный пункт" Тогда
							ЗначенияПолейЮрАдрес = ЗначенияПолейФактАдрес + "НаселенныйПункт"+"="+ТекСв.Значение+Символы.ПС;
						ИначеЕсли Найти(ДопустимыеТипы, ТекСв.Тип)>0 ТОгда
				    		ЗначенияПолейЮрАдрес = ЗначенияПолейФактАдрес + ТекСв.Тип+"="+ТекСв.Значение+Символы.ПС;
						КонецЕсли;	
					КонецЦикла;
             	КонецЕсли
			КонецЕсли;
		КонецЕсли
	КонецЕсли;
		
	СвойствоЭД = ЭД.Свойства().Получить("Контакты");
	Если СвойствоЭД <> Неопределено Тогда
		ЗнДанных =  ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			Для Каждого ТекКонтакт Из ЭД.Контакты.Контакт Цикл
				Если ТекКонтакт.Тип = "Телефон рабочий" Тогда
					Телефон = ТекКонтакт.Значение;
				КонецЕсли
			КонецЦикла	
		КонецЕсли;	
	КонецЕсли;
	
	СвойствоЭД = ЭД.Свойства().Получить("Адрес");
	Если СвойствоЭД <> Неопределено Тогда
		ЗнДанных = ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			ФактическийАдрес = ЗнДанных.Представление;
			Для Каждого ТекСв Из ЗнДанных.АдресноеПоле Цикл
				Если ТекСв.Тип = "Почтовый индекс" Тогда
					ЗначенияПолейФактАдрес = ЗначенияПолейФактАдрес + "Индекс"+"="+ТекСв.Значение+Символы.ПС;
				ИначеЕсли	ТекСв.Тип = "Населенный пункт" Тогда
					ЗначенияПолейФактАдрес = ЗначенияПолейФактАдрес + "НаселенныйПункт"+"="+ТекСв.Значение+Символы.ПС;
				ИначеЕсли Найти(ДопустимыеТипы, ТекСв.Тип)>0 ТОгда
				    ЗначенияПолейФактАдрес = ЗначенияПолейФактАдрес + ТекСв.Тип+"="+ТекСв.Значение+Символы.ПС;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	ИНН_КПП = ИНН+"/"+КПП;

	ОпределитьКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗаполненыОбязательныеРеквизиты() Тогда
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = Нстр("ru = ""Контрагент существует. Перезаполнить реквизиты?""");
			Ответ = Вопрос(Текст, Режим, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
	    		Возврат;
			КонецЕсли;
		КонецЕсли;	
		ЗаполнитьРеквизитыКонтрагента();
		ОткрытьЗначение(Контрагент);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЗаполненыОбязательныеРеквизиты()
	РеквизитыЗаполнены = Истина;
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Не заполнено наименование, загрузка не возможна'");
		РеквизитыЗаполнены = Ложь;
		Сообщение.Поле = "ОрганизацияНаименованиеПолное";
		Сообщение.Сообщить();
	КонецЕсли;
	                 	
	Возврат РеквизитыЗаполнены;	
		
КонецФункции

&НаКлиенте
Процедура ОчиститьФорму()
	Наименование = "";
	ИНН_КПП = "";
	ОКПО = "";
	ДолжностьРуководителя="";
	Руководитель="";
	ЮридическийАдрес="";
	ФактическийАдрес="";
	Телефон="";
	Банк="";
	РасчетныйСчет="";
	КорреспондентскийСчет="";
	БИК="";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыКонтрагента()
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Контрагент", 				Контрагент);
	СтруктураРеквизитов.Вставить("ИНН_КПП", 				ИНН_КПП);
	СтруктураРеквизитов.Вставить("ОКПО",				 	ОКПО);
	СтруктураРеквизитов.Вставить("Наименование", 			Наименование);
	СтруктураРеквизитов.Вставить("ЮрАдресПредставление", 	ЮридическийАдрес);
	СтруктураРеквизитов.Вставить("ЮрАдресЗначенияПолей", 	ЗначенияПолейЮрАдрес);
	СтруктураРеквизитов.Вставить("ФактАдресПредставление", 	ФактическийАдрес);
	СтруктураРеквизитов.Вставить("ФактАдресЗначенияПолей", 	ЗначенияПолейФактАдрес);
	СтруктураРеквизитов.Вставить("Телефон", 				Телефон);
	СтруктураРеквизитов.Вставить("БИК", 					БИК);
	СтруктураРеквизитов.Вставить("КорреспондентскийСчет", 	КорреспондентскийСчет);
	СтруктураРеквизитов.Вставить("Банк", 					Банк);
	СтруктураРеквизитов.Вставить("РасчетныйСчет", 			РасчетныйСчет);
	
	Контрагент = ЭлектронныеДокументыПереопределяемый.ЗаполнитьРеквизитыКонтрагента(СтруктураРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьКонтрагента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН", Сред(ИНН_КПП,1,Найти(ИНН_КПП,"/")-1));
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Контрагент = Результат.Ссылка;
	Иначе
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
КонецПроцедуры
 
&НаКлиенте
Процедура ФайлПриИзменении(Элемент)
	Если ЗначениеЗаполнено (Файл) ТОгда
		ПрочитатьФайл();
	Иначе
		ОчиститьФорму();
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Текст = "ru = ""XML файл""; en = ""XML файл""";
	Фильтр = НСтр(Текст)+"(*.xml)|*.xml";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
    	МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Если МассивФайлов.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
    	Файл = МассивФайлов[0];
		ФайлПриИзменении(Элемент);
	КонецЕсли;
КонецПроцедуры
