//+ Машута А. 12.10.2018 задача 720
Функция ДанныеДляСторноДвижений_абс_ГрафикПоставок_ОборотыБюджета(ДокументПТУ, Ссылка, ПериодПоставки) Экспорт
	
	ДанныеДляОбработки = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА КорректировкаПоступления.СуммаВключаетНДС
	|			ТОГДА ТоварыТЧ.Сумма - ТоварыТЧ.СуммаДоИзменения - (ТоварыТЧ.СуммаНДС - ТоварыТЧ.СуммаНДСДоИзменения)
	|		ИНАЧЕ ТоварыТЧ.Сумма - ТоварыТЧ.СуммаДоИзменения
	|	КОНЕЦ КАК СуммаКорректировки,
	|	ТоварыТЧ.абс_ЗакупочныйЗаказТЧ КАК ЗакупочныйЗаказ,
	|	ТоварыТЧ.абс_ЗакупочныйЗаказТЧ.ЦФО КАК ЦФО,
	|	ТоварыТЧ.абс_ЦФУ КАК ЦФУ,
	|	ТоварыТЧ.СтатьяОборотов,
	|	ТоварыТЧ.ttk_ОбъектБюджетирования,
	|	ТоварыТЧ.ttk_КВ,
	|	ТоварыТЧ.ttk_ТЭО,
	|	ТоварыТЧ.ttk_Город
	|ПОМЕСТИТЬ ВТ_ДанныеКорректировки_БезФиксСуммы
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК ТоварыТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО (КорректировкаПоступления.Ссылка = ТоварыТЧ.Ссылка)
	|			И (ТоварыТЧ.Ссылка = &Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КорректировкаПоступления.СуммаВключаетНДС
	|			ТОГДА УслугиТЧ.Сумма - УслугиТЧ.СуммаДоИзменения - (УслугиТЧ.СуммаНДС - УслугиТЧ.СуммаНДСДоИзменения)
	|		ИНАЧЕ УслугиТЧ.Сумма - УслугиТЧ.СуммаДоИзменения
	|	КОНЕЦ,
	|	УслугиТЧ.абс_ЗакупочныйЗаказТЧ,
	|	УслугиТЧ.абс_ЗакупочныйЗаказТЧ.ЦФО,
	|	УслугиТЧ.абс_ЦФУ,
	|	УслугиТЧ.СтатьяОборотов,
	|	УслугиТЧ.ttk_ОбъектБюджетирования,
	|	УслугиТЧ.ttk_КВ,
	|	УслугиТЧ.ttk_ТЭО,
	|	УслугиТЧ.ttk_Город
	|ИЗ
	|	Документ.КорректировкаПоступления.Услуги КАК УслугиТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО (КорректировкаПоступления.Ссылка = УслугиТЧ.Ссылка)
	|			И (УслугиТЧ.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.СуммаКорректировки,
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.ЗакупочныйЗаказ,
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.ЦФУ,
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.ЦФО,
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.СтатьяОборотов,
	|	абс_ЗакупочныйЗаказ.НефиксированнаяСумма,
	|	ВЫБОР
	|		КОГДА абс_ЗакупочныйЗаказ.ТипКонтрагента = ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ГоловнаяКомпания)
	|				ИЛИ абс_ЗакупочныйЗаказ.ТипКонтрагента В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ФилиалыТТК), ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ДЗОТТК))
	|			ТОГДА абс_ЗакупочныйЗаказ.ТипКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ТипКонтрагента,
	|	абс_ЗакупочныйЗаказ.ТипСети,
	|	абс_ЗакупочныйЗаказ.ТипРасхода,
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.ttk_ОбъектБюджетирования,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеКорректировки_БезФиксСуммы.СтатьяОборотов = &ЕдинаяСтатьяКВ
	|			ТОГДА ВТ_ДанныеКорректировки_БезФиксСуммы.ttk_КВ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.абс_КапитальныеВложения.ПустаяСсылка)
	|	КОНЕЦ КАК ttk_КВ,
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.ttk_ТЭО,
	|	ВТ_ДанныеКорректировки_БезФиксСуммы.ttk_Город
	|ПОМЕСТИТЬ ВТ_ДанныеКорректировки
	|ИЗ
	|	ВТ_ДанныеКорректировки_БезФиксСуммы КАК ВТ_ДанныеКорректировки_БезФиксСуммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ЗакупочныйЗаказ КАК абс_ЗакупочныйЗаказ
	|		ПО ВТ_ДанныеКорректировки_БезФиксСуммы.ЗакупочныйЗаказ = абс_ЗакупочныйЗаказ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Период КАК Период,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Активность КАК Активность,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.ВидДвижения КАК ВидДвижения,
	|	ЕСТЬNULL(абс_ГрафикПоставкиЗакупочногоЗаказа.ЗакупочныйЗаказ, ВТ_ДанныеКорректировки.ЗакупочныйЗаказ) КАК ЗакупочныйЗаказ,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.ПериодПоставки КАК ПериодПоставки,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Сценарий КАК Сценарий,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Проект КАК Проект,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Контрагент КАК Контрагент,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Номенклатура КАК Номенклатура,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Валюта КАК Валюта,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.абс_ТипКонтрагента КАК абс_ТипКонтрагента,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.абс_ТипСети КАК абс_ТипСети,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.абс_КВ КАК абс_КВ,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.абс_ТЭО КАК абс_ТЭО,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.абс_ТипРасхода КАК абс_ТипРасхода,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Организация КАК Организация,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.абс_СчетБУ КАК абс_СчетБУ,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.Сумма КАК Сумма,
	|	абс_ГрафикПоставкиЗакупочногоЗаказа.ЦФО КАК ЦФО,
	|	ВТ_ДанныеКорректировки.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_ДанныеКорректировки.НефиксированнаяСумма КАК НефиксированнаяСумма,
	|	ВТ_ДанныеКорректировки.СуммаКорректировки КАК СуммаКорректировки,
	|	ВТ_ДанныеКорректировки.ttk_ОбъектБюджетирования КАК ttk_ОбъектБюджетирования,
	|	ВТ_ДанныеКорректировки.ЦФУ КАК ЦФУ,
	|	ВТ_ДанныеКорректировки.ttk_ТЭО КАК ТЭО,
	|	ВТ_ДанныеКорректировки.ttk_Город КАК ttk_Город,
	|	ВТ_ДанныеКорректировки.ttk_КВ КАК КВ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_ДанныеКорректировки КАК ВТ_ДанныеКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.абс_ГрафикПоставкиЗакупочногоЗаказа КАК абс_ГрафикПоставкиЗакупочногоЗаказа
	|		ПО ВТ_ДанныеКорректировки.ЗакупочныйЗаказ = абс_ГрафикПоставкиЗакупочногоЗаказа.ЗакупочныйЗаказ
	|			И ВТ_ДанныеКорректировки.ttk_ОбъектБюджетирования = абс_ГрафикПоставкиЗакупочногоЗаказа.ttk_ОбъектБюджетирования
	|			И (абс_ГрафикПоставкиЗакупочногоЗаказа.Регистратор = ВТ_ДанныеКорректировки.ЗакупочныйЗаказ)
	|			И (абс_ГрафикПоставкиЗакупочногоЗаказа.ПериодПоставки = &ПериодПоставки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеКорректировки.СуммаКорректировки КАК СуммаПотрЛимитов,
	|	ВТ_ДанныеКорректировки.ЗакупочныйЗаказ КАК ЗакупочныйЗаказ,
	|	ВТ_ДанныеКорректировки.ЦФО КАК ЦФО,
	|	ВТ_ДанныеКорректировки.ЦФУ КАК ЦФУ,
	|	ВТ_ДанныеКорректировки.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_ДанныеКорректировки.НефиксированнаяСумма КАК НефиксированнаяСумма,
	|	ВТ_ДанныеКорректировки.ТипКонтрагента КАК ТипКонтрагента,
	|	ВТ_ДанныеКорректировки.ТипСети КАК ТипСети,
	|	ВТ_ДанныеКорректировки.ТипРасхода КАК ТипРасхода,
	|	ВТ_ДанныеКорректировки.ttk_ОбъектБюджетирования КАК ttk_ОбъектБюджетирования,
	|	ВТ_ДанныеКорректировки.ttk_КВ КАК КВ,
	|	ВТ_ДанныеКорректировки.ttk_ТЭО КАК ТЭО,
	|	ВТ.Сценарий КАК Сценарий
	|ИЗ
	|	ВТ_ДанныеКорректировки КАК ВТ_ДанныеКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО ВТ_ДанныеКорректировки.ЗакупочныйЗаказ = ВТ.ЗакупочныйЗаказ
	|			И ВТ_ДанныеКорректировки.СтатьяОборотов = ВТ.СтатьяОборотов
	|			И ВТ_ДанныеКорректировки.ЦФУ = ВТ.ЦФУ
	|			И ВТ_ДанныеКорректировки.ttk_ОбъектБюджетирования = ВТ.ttk_ОбъектБюджетирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Период,
	|	ВТ.Активность,
	|	ВТ.ВидДвижения,
	|	ВТ.ЗакупочныйЗаказ,
	|	ВТ.ПериодПоставки,
	|	ВТ.Сценарий,
	|	ВТ.Проект,
	|	ВТ.Валюта,
	|	ВТ.абс_ТипРасхода,
	|	ВТ.Организация,
	|	ВТ.ДоговорКонтрагента,
	|	ВТ.абс_СчетБУ,
	|	ВТ.ЦФО,
	|	ВТ.СтатьяОборотов,
	|	ВТ.НефиксированнаяСумма,
	|	ВТ.СуммаКорректировки,
	|	ВТ.ttk_ОбъектБюджетирования,
	|	ВТ.ЦФУ КАК абс_ЦФУ,
	|	ВТ.ТЭО КАК абс_ТЭО,
	|	ВТ.КВ КАК абс_КВ
	|ИЗ
	|	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("ДокументПТУ", ДокументПТУ);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЕдинаяСтатьяКВ", Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост"));
	Запрос.УстановитьПараметр("ПериодПоставки", ПериодПоставки);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляОбработки.Вставить("абс_ГрафикПлатежейПоЗакупочномуЗаказу", РезультатЗапроса[4].Выгрузить());
	ДанныеДляОбработки.Вставить("КонтролируемыеЗначенияБюджетов", РезультатЗапроса[3].Выгрузить());
	
	Возврат ДанныеДляОбработки;
	
КонецФункции
//- Машута А. 12.10.2018 задача 720