
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр абс_ВзаиморасчетыПоДокументам Приход
	Движения.абс_ВзаиморасчетыПоДокументам.Записывать = Истина;
	Движения.абс_ВзаиморасчетыПоДокументам.Очистить();
	Для Каждого ТекСтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаПлатежа.СуммаРегл) Тогда
		Движение = Движения.абс_ВзаиморасчетыПоДокументам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ТекСтрокаРасшифровкаПлатежа.ДоговорКонтрагента;
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаПлатежа.ДокументРасчетов) Тогда
			Движение.Документ = ТекСтрокаРасшифровкаПлатежа.ДокументРасчетов;
		Иначе
			Движение.Документ = ЭтотОбъект.Ссылка;
		КонецЕсли;
		Движение.СуммаВзаиморасчетов = ТекСтрокаРасшифровкаПлатежа.СуммаВзаиморасчетов;
		Движение.СуммаРегл = ТекСтрокаРасшифровкаПлатежа.СуммаРегл;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаРасшифровкаПлатежа Из РасшифровкаПлатежаПриемник Цикл
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаПлатежа.СуммаРегл) Тогда
			Движение = Движения.абс_ВзаиморасчетыПоДокументам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Контрагент = КонтрагентПриемник;
			Движение.ДоговорКонтрагента = ТекСтрокаРасшифровкаПлатежа.ДоговорКонтрагента;
			Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаПлатежа.ДокументРасчетов) Тогда
				Движение.Документ = ТекСтрокаРасшифровкаПлатежа.ДокументРасчетов;
			Иначе
				Движение.Документ = ЭтотОбъект.Ссылка;
			КонецЕсли;
			
			Движение.СуммаВзаиморасчетов = ТекСтрокаРасшифровкаПлатежа.СуммаВзаиморасчетов;
			Движение.СуммаРегл = ТекСтрокаРасшифровкаПлатежа.СуммаРегл;
		КонецЕсли;
	
	КонецЦикла;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
		
		Организация = ДанныеЗаполнения.Организация;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		РасшифровкаПлатежа.Очистить();
		Для каждого СтрокаРасшифровки Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРасшифровки);
			НоваяСтрока.СуммаРегл = СтрокаРасшифровки.СуммаПлатежа;
		КонецЦикла;
		
	КонецЕсли;
	
	КонецПроцедуры
