Перем мРегламентноеЗадание Экспорт;

Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания = "", Постфикс = "")
	
	Если ПараметрЗадания = Неопределено Тогда
		
		РеквизитЗадания = "";
		
	Иначе	
		
		РеквизитЗадания = Строка(ПараметрЗадания.УникальныйИдентификатор);
		
		ПараметрЗадания.Наименование = Наименование + Постфикс;
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ПустаяСтрока(ПараметрЗадания.Ключ) Тогда
			ПараметрЗадания.Ключ = РеквизитЗадания;
		КонецЕсли;
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(Ссылка);
		
		ПараметрЗадания.Параметры = МассивПараметров;
		
		ПараметрЗадания.ИмяПользователя 	= СокрЛП(Ответственный.Код);
		ПараметрЗадания.Ключ 				= РегламентноеЗадание;
		ПараметрЗадания.Использование 		= Использование;
		
		ПараметрЗадания.Записать();	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если мРегламентноеЗадание <> Неопределено Тогда
				
		УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, мРегламентноеЗадание);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РегламентноеЗадание = Неопределено;
	
КонецПроцедуры

