
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РольДоступна("ПолныеПрава") Тогда 
		Элементы.МодулиДляВыполнения.Видимость = Истина;
		Элементы.ГруппаПараметры.Видимость = Истина;
	Иначе	
		Элементы.ГруппаПараметры.Видимость = Ложь;
		Элементы.МодулиДляВыполнения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПроизвольныеПараметрыПриИзменении(Элемент)
	
	Если РольДоступна("ПолныеПрава") Тогда 
		Элементы.МодулиДляВыполнения.Видимость = Истина;
		Элементы.ГруппаПараметры.Видимость = Истина;
	Иначе	
		Элементы.ГруппаПараметры.Видимость = Ложь;
		Элементы.МодулиДляВыполнения.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура МодулиМодульПриИзменении(Элемент)
	
	Если Элементы.Модули.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	ПолучитьПараметрыЗапроса(Элементы.Модули.ТекущиеДанные.Модуль);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыЗапроса(Модуль)
	                               	
	ТЗ = ПолучитьЗапросомПараметры(Модуль).Выгрузить();
	Для каждого Строка Из ТЗ Цикл        		
		ЗаполнитьЗначенияСвойств(Объект.Параметры.Добавить(),Строка);  		
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапросомПараметры(Модуль) Экспорт
		
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("врМодуль",Модуль);
	Запрос.УстановитьПараметр("ИмяПараметра",Объект.Параметры.Выгрузить().ВыгрузитьКолонку("ИмяПараметра"));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Параметры.ИмяПараметра,
	               |	Параметры.ИмяПараметра КАК СинонимПараметра,
	               |	Параметры.ЗначениеПараметра
	               |ИЗ
	               |	Справочник.абс_МодулиДляВыполнения.Параметры КАК Параметры
	               |ГДЕ
	               |	Параметры.Ссылка В(&врМодуль)
	               |	И (НЕ Параметры.ИмяПараметра В (&ИмяПараметра))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Параметры.ИмяПараметра,
	               |	Параметры.ЗначениеПараметра,
	               |	Параметры.ИмяПараметра";
				   
	Возврат Запрос.Выполнить();	
	
КонецФункции
