//Перем мРолиПользователя Экспорт;

Процедура ПриВыполнении(Отказ)
	// {{ТТК Лапин А. Заявка № 04.08.2015 начало
	ДокОбъект = Ссылка.ПолучитьОбъект();
	Если НЕ ДокОбъект = Неопределено Тогда
		абс_БизнесПроцессыПривелегированный.ВыполнитьЗадачиПоТочкеМаршрута(БизнесПроцесс, ТочкаМаршрута, Ссылка);
	КонецЕсли;
	// }}ТТК Лапин А. Заявка № 04.08.2015 окончание
	// {{ТТК Лапин А. Старый код +
	//абс_БизнесПроцессыПривелегированный.ВыполнитьЗадачиПоТочкеМаршрута(БизнесПроцесс, ТочкаМаршрута, Ссылка);
	// }}ТТК Лапин А. Старый код -
КонецПроцедуры                              

Процедура ПередЗаписью(Отказ)
	
	// АБС ВСТАВКА Фролов 20120625
	// Запрещаем записывать задачи с незаполненным исполнителем
	////Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Исполнитель) Тогда
	////	ttk_ОбщегоНазначения.СообщитьОбОшибке("Не указан ответственный при формировании задачи.", Отказ);
	////	Возврат;
	////КонецЕсли;
	
	
	// АБС ВСТАВКА Фролов 20110912 Чтобы не было блокировок таблицы Бизнес-процессов.
	// Добавил условие на ЭтоНовый() для того чтобы избежать этих действий при выполнении задач.
	Если ЭтоНовый() Тогда
		Если НЕ ИнициаторБП = БизнесПроцесс.ПользовательИнициаторБП Тогда
			ИнициаторБП = БизнесПроцесс.ПользовательИнициаторБП;
		КонецЕсли;
		
	    //АБС ВСТАВКА
		Если  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ЗакупочныйЗаказ") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.ЗакупочныйЗаказ;
			Организация = ОбъектЗадачи.Организация;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_СчетНаОплату") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СчетНаОплату;
			//АБС ВСТАВКА №29763 НАЧАЛО «10 декабря 2014 г.», Пополитов
			//Иначе сотрудники КТТК не видят, из-за отбора по организации
			Если Не ЗначениеЗаполнено(Организация) Тогда
			//\\АБС ВСТАВКА №29763 КОНЕЦ
				Организация = ОбъектЗадачи.Организация;
			//АБС ВСТАВКА №29763 НАЧАЛО «10 декабря 2014 г.», Пополитов
			КонецЕсли;
			//\\АБС ВСТАВКА №29763 КОНЕЦ
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Контрагент;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Договор;
			//Сторчевой А.Н. 77125458 06.06.2017 {                                   
			Если не ЗначениеЗаполнено(Организация) Тогда 
			// } Сторчевой А.Н.	77125458 06.06.2017
				Организация = ОбъектЗадачи.Организация;
			//Сторчевой А.Н. 77125458 06.06.2017 {                                   
			КонецЕсли;
			// } Сторчевой А.Н.	77125458 06.06.2017
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_ДоговорПодряда;
			Организация = ОбъектЗадачи.Организация;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.Абс_АктПриёмкиВыполненныхРабот") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_АктПриёмкиВыполненныхРабот;
			Организация = ОбъектЗадачи.Организация;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.Номенклатура") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Номенклатура;
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ЗадачаВТехподдержку") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_ЗаявкаВПоддержку;
			
			
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеСтатейЗатрат;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеПрочихДоходовИРасходов; 	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеНоменклатурныхГрупп;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеОС;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ЗаявкаНаДобавлениеИзменениеПрав") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеЗаявкиНаДобавлениеПрав;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_РезервыПроизведенныхРасходов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеРезервовПроизведенныхРасходов;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ВводБюджета") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_ВводБюджета;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_РеклассификацияБюджета") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.РеклассиификацияБюджета;	
		КонецЕсли;	
		
		
		Если  ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.абсЗакрытиеДоговоров") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Договор;	
		ИначеЕсли ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.абсИзменениеРеквизитовКонтрагентов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Контрагент;	
		ИначеЕсли ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.абсПереутверждениеКонтрагентов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Контрагент;	
		КонецЕсли;	
			
		
		//АБС_Родин
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация	  = абс_БизнесПроцессыПривелегированный.ПолучитьОрганизациюБизнессПроцесса(БизнесПроцесс,Исполнитель);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Роль) Тогда
			Роль	     =  ТочкаМаршрута.Роль;
		КонецЕсли;
		//АБС_Родин
		
		////АБС 
		
		Если ЗначениеЗаполнено(ОбъектЗадачи) Тогда
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектЗадачи)) Тогда
				Комментарий = ОбъектЗадачи.Номер;
			ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектЗадачи)) Тогда
				Комментарий = ОбъектЗадачи.Код;
			Иначе
				
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

//мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));