
//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
//	
//	Если ЭтоНовый() Тогда
//		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
//		Ответственный = глЗначениеПеременной("глТекущийПользователь");
//	КонецЕсли;
//	
//	Если Не ЗначениеЗаполнено(Организация) Тогда
//		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ПриЗаписи(Отказ)
//	
//	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
//	
//	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовПервичныхДокументов.СоздатьНаборЗаписей();	
//	НаборЗаписей.Отбор.ПервичныйДокумент.Установить(Ссылка);
//	НаборЗаписей.Прочитать();
//	
//	Запись = НаборЗаписей.Добавить();
//	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
//	Запись.ПервичныйДокумент = Ссылка;
//	Запись.Пользователь = ТекПользователь;	
//	Запись.СтатусДокумента = Статус;	
//	Запись.Комментарий = Комментарий;
//	
//	НаборЗаписей.Записать();
//	
//КонецПроцедуры
