#Если Клиент Тогда

Функция УточнитьВводНаОсновании(КоманднаяПанель) Экспорт 

	// АБС ИЗМЕНЕНИЕ
	
	//ВводНаОсновании = КоманднаяПанель.Кнопки.Найти("ПодменюНаОсновании");
	//Если ВводНаОсновании <> Неопределено Тогда
	//	КоманднаяПанель.Кнопки.Удалить(ВводНаОсновании);
	//КонецЕсли;	
	//ВводНаОсновании = КоманднаяПанель.Кнопки.ПодменюДействия.Кнопки.Найти("ПодменюНаОсновании");
	//Если ВводНаОсновании <> Неопределено Тогда
	//	КоманднаяПанель.Кнопки.ПодменюДействия.Кнопки.Удалить(ВводНаОсновании);
	//КонецЕсли;
	
	// АБС ИЗМЕНЕНИЕ КОНЕЦ

КонецФункции // УточнитьВводНаОсновании()

#КонецЕсли
