Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Отбор.СтатьяОборотовПоБюджетам.Использование Тогда
		
		БезлимитнаяСтатья = ЭтотОбъект.Количество() > 0;
		
		Статья = ЭтотОБъект.Отбор.СтатьяОборотовПоБюджетам.Значение;
		
		Если ЗначениеЗаполнено(Статья) Тогда
			Если НЕ Статья.абс_БезКонтроляЛимита = БезлимитнаяСтатья Тогда
				
				СтатьяОб = Статья.ПолучитьОбъект();
				
				СтатьяОб.абс_БезКонтроляЛимита = БезлимитнаяСтатья;
				
				СтатьяОб.ОбменДанными.Загрузка = Истина;
				
				СтатьяОб.Записать();
			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
