// Возвращает структуру параметров, необходимых для инициализации
// конфигурации на клиенте.
// 
Функция ПараметрыРаботыКлиента() Экспорт
	
	Параметры = Новый Структура();
	
	ПользователюРазрешенЗапускКонфигурации = Пользователи.ПользователюРазрешенЗапускКонфигурации();
	Параметры.Вставить("ПользователюРазрешенЗапускКонфигурации", ПользователюРазрешенЗапускКонфигурации);
	
	Если НЕ ПользователюРазрешенЗапускКонфигурации Тогда
		// Дальше нет необходимости выполнения, т.к. могут быть ошибки нарушения прав
		Возврат Параметры;
	КонецЕсли; 
		
	// СтандартныеПодсистемы
	Параметры.Вставить("НеобходимоОбновлениеИнформационнойБазы", 
		НЕ ПустаяСтрока(Метаданные.Версия) 
		И Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия);
		
	Параметры.Вставить("ТекущийПользователь", Строка(ПараметрыСеанса.ТекущийПользователь));
	Параметры.Вставить("ЗаголовокПриложения", СокрЛП(Константы.ЗаголовокСистемы.Получить()));
		
	// Конец СтандартныеПодсистемы

	Возврат Параметры;
	
КонецФункции	

// Устанавливает текстовое описание предмета
//
// Параметры
//  СсылкаНаПредмет  – ЛюбаяСсылка – объект ссылочного типа.
//  Представление	 - Строка - сюда необходимо поместить текстовое описание.
Процедура УстановитьПредставлениеПредмета(СсылкаНаПредмет, Представление) Экспорт
	
	
КонецПроцедуры

// Возвращает список имен объектов метаданных, данные которых могут содержать ссылки на различные объекты метаданных,
// но при этом эти ссылки не должны учитываться в бизнес-логике приложения.
//
// Возвращаемое значение:
//  Массив       - массив строк, например, "РегистрСведений.ВерсииОбъектов".
//
Функция ИсключенияПоискаСсылок() Экспорт
	
	Массив = Новый Массив;
	
	// ВерсионированиеОбъектов
	Массив.Добавить(Метаданные.РегистрыСведений.ВерсииОбъектов.ПолноеИмя());
	// Конец ВерсионированиеОбъектов
	
	Возврат Массив;
	
КонецФункции

