////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы документа

#Если Клиент Тогда

Процедура ВыполнитьОформлениеСтрокиДополнительно(ОформлениеСтроки) Экспорт 
	
	Если ТипЗнч(ОформлениеСтроки.ДанныеСтроки.Ссылка) = Тип("ДокументСсылка.Опрос") Тогда
		ОформлениеСтроки.Ячейки.ВидДокумента.Картинка = БиблиотекаКартинок.СвойстваОбъектов;
		ОформлениеСтроки.Ячейки.ДатаКонтакта.Текст = ОформлениеСтроки.ДанныеСтроки.Дата;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗаголовокКнопкиРезюме(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ОбработкаОповещенияДополнительно(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнитьСтруктуруДляСпискаДополнительныхФайлов(Форма, СтруктураДляСпискаДополнительныхФайлов) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ОткрытьРезюмеНажатие(Форма) Экспорт
	
	ТиповаяАнкета = Неопределено;
	Ссылка = Форма.Ссылка;
	
	Опрос = ПроцедурыУправленияПерсоналомПереопределяемый.НайтиРезюмеКандидата(Ссылка, ТиповаяАнкета);
	
	Если ТиповаяАнкета = Неопределено Тогда
		Предупреждение("Не указана анкета, которая используется в качестве резюме. Необходимо указать анкету в ""Настройках параметров учета""!");
		Возврат;
	КонецЕсли;
	
	Если Опрос = Неопределено Тогда
		ФормаОпроса = Документы.Опрос.ПолучитьФормуНовогоДокумента();
		ФормаОпроса.ОпрашиваемоеЛицо	= Ссылка;
		ФормаОпроса.ТиповаяАнкета		= ТиповаяАнкета;
		ФормаОпроса.ЗаполнитьВопросыАнкеты(ТиповаяАнкета);
		
	Иначе
		ФормаОпроса = Опрос.ПолучитьФорму();
		
	КонецЕсли;
	
	ФормаОпроса.мФормаОткрытаИзЗаявкиКандидата = Истина;
	ФормаОпроса.Открыть();

КонецПроцедуры

#КонецЕсли
