

/////////////////////////////////////////////////////////////////////////////////
// Процедуры отражения движений по регистрам учета внеоборотных активов

// Управленческий учет


// Бухгалтерский учет


// Налоговый учет


// МСФО РЖД
Процедура Отразить_абс_ОсновныеСредстваРЖД(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если Отказ Или Не ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("Таблица_абс_ОсновныеСредстваРЖД") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРегистра = ДополнительныеСвойства.ТаблицыДляДвижений.Таблица_абс_ОсновныеСредстваРЖД;
	
	Если ТаблицаРегистра.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = Движения.абс_ОсновныеСредстваРЖД;
	НаборЗаписей.Загрузить(ТаблицаРегистра);
	НаборЗаписей.Записывать = Истина;
	
КонецПроцедуры

Процедура Отразить_абс_СтоимостьОСРЖД(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если Отказ Или Не ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("Таблица_абс_СтоимостьОСРЖД") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРегистра = ДополнительныеСвойства.ТаблицыДляДвижений.Таблица_абс_СтоимостьОСРЖД;
	
	Если ТаблицаРегистра.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = Движения.абс_СтоимостьОСРЖД;
	НаборЗаписей.Загрузить(ТаблицаРегистра);
	НаборЗаписей.Записывать = Истина;
	
КонецПроцедуры

// МСФО
Процедура Отразить_ОсновныеСредстваМеждународныйУчет(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура Отразить_абс_СтоимостьОСМеждународный(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
КонецПроцедуры




/////////////////////////////////////////////////////////////////////////////////
// Функции, формирующие тексты запросов по регистрам учета внеоборотных активов

Функция ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС(ТаблицаОС="СписокОС", ПараметрПериод="Период", ВременнаяТаблица=Неопределено, Индексы="ОсновноеСредство") Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	абс_ОсновныеСредстваРЖД.Организация,
	        |	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
	        |	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
	        |	абс_ОсновныеСредстваРЖД.МОЛ,
	        |	абс_ОсновныеСредстваРЖД.Состояние,
	        |	абс_ОсновныеСредстваРЖД.СчетУчета,
	        |	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
	        |	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
	        |	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СчетЗатрат,
	        |	абс_ОсновныеСредстваРЖД.Субконто1,
	        |	абс_ОсновныеСредстваРЖД.Субконто2,
	        |	абс_ОсновныеСредстваРЖД.Субконто3,
	        |	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
	        |	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
	        |	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости,
	        |	абс_ОсновныеСредстваРЖД.Период,
	        |	абс_ОсновныеСредстваРЖД.Регистратор
	        |"+?(ВременнаяТаблица=Неопределено, "", "ПОМЕСТИТЬ "+ВременнаяТаблица)+"
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(абс_ОсновныеСредстваРЖД.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ОсновныеСредстваДокумента.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(абс_ОсновныеСредстваРЖД.Период) КАК Период
	        |		ИЗ
	        |			"+ТаблицаОС+" КАК ОсновныеСредстваДокумента
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |				ПО ОсновныеСредстваДокумента.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
	        |					И (абс_ОсновныеСредстваРЖД.Период <= &"+ПараметрПериод+")
	        |					И (абс_ОсновныеСредстваРЖД.Активность)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ОсновныеСредстваДокумента.ОсновноеСредство) КАК ПериодыСреза
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |			ПО ПериодыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
	        |				И ПериодыСреза.Период = абс_ОсновныеСредстваРЖД.Период
	        |				И (абс_ОсновныеСредстваРЖД.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза,
	        |	РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |
	        |"+?(Индексы=Неопределено Или ВременнаяТаблица=Неопределено, "", "
	        |ИНДЕКСИРОВАТЬ ПО
	        |	"+Индексы)+"
			|;
			|";
	
КонецФункции



Функция ТекстЗапроса_МестонахождениеОСБухгалтерскийУчетПоТаблицеОС(ТаблицаОС="СписокОС", ПараметрОрганизация="Организация", ПараметрПериод="Период", ВременнаяТаблица=Неопределено, Индексы="ОсновноеСредство") Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	МестонахождениеОСБухгалтерскийУчет.Организация,
	        |	МестонахождениеОСБухгалтерскийУчет.МОЛ,
	        |	МестонахождениеОСБухгалтерскийУчет.Местонахождение,
	        |	МестонахождениеОСБухгалтерскийУчет.Обособленное,
	        |	МестонахождениеОСБухгалтерскийУчет.Проект,
	        |	МестонахождениеОСБухгалтерскийУчет.Период,
	        |	МестонахождениеОСБухгалтерскийУчет.Регистратор
	        |"+?(ВременнаяТаблица=Неопределено, "", "ПОМЕСТИТЬ "+ВременнаяТаблица)+"
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(МестонахождениеОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(МестонахождениеОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			"+ТаблицаОС+" КАК ТаблицаОС
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	        |				ПО ТаблицаОС.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (МестонахождениеОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |					И (МестонахождениеОСБухгалтерскийУчет.Период <= &"+ПараметрПериод+")
	        |					И (МестонахождениеОСБухгалтерскийУчет.Активность)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ТаблицаОС.ОсновноеСредство) КАК ПериодыСреза
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (МестонахождениеОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |				И ПериодыСреза.Период = МестонахождениеОСБухгалтерскийУчет.Период
	        |				И (МестонахождениеОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.Период = МестонахождениеОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = МестонахождениеОСБухгалтерскийУчет.Регистратор
	        |			И ПериодыРегистраторыСреза.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (МестонахождениеОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |
	        |"+?(Индексы=Неопределено Или ВременнаяТаблица=Неопределено, "", "
	        |ИНДЕКСИРОВАТЬ ПО
	        |	"+Индексы)+"
			|;
			|";
	
КонецФункции

Функция ТекстЗапроса_НачислениеАмортизацииОСБухгалтерскийУчетПоТаблицеОС(ТаблицаОС="СписокОС", ПараметрОрганизация="Организация", ПараметрПериод="Период", ВременнаяТаблица="ДанныеРегистра_НачислениеАмортизацииОСБухгалтерскийУчет", Индексы="ОсновноеСредство") Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.Период,
	        |	ВложенныйЗапрос.Регистратор,
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизацию,
	        |	НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизациюВТекущемМесяце
	        |"+?(ВременнаяТаблица=Неопределено, "", "ПОМЕСТИТЬ "+ВременнаяТаблица)+"
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |		ВложенныйЗапрос.Период КАК Период,
	        |		МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			"+ТаблицаОС+" КАК ТаблицаОС
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |				ПО ТаблицаОС.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Период <= &"+ПараметрПериод+")
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ТаблицаОС.ОсновноеСредство) КАК ВложенныйЗапрос
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |			ПО ВложенныйЗапрос.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |				И ВложенныйЗапрос.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВложенныйЗапрос.ОсновноеСредство,
	        |		ВложенныйЗапрос.Период) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ПО ВложенныйЗапрос.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |			И ВложенныйЗапрос.Регистратор = НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор
	        |			И ВложенныйЗапрос.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |
	        |"+?(Индексы=Неопределено Или ВременнаяТаблица=Неопределено, "", "
	        |ИНДЕКСИРОВАТЬ ПО
	        |	"+Индексы)+"
			|;
			|";
	
КонецФункции

Функция ТекстЗапроса_ПараметрыАмортизацииОСБухгалтерскийУчетПоТаблицеОС(ТаблицаОС="СписокОС", ПараметрОрганизация="Организация", ПараметрПериод="Период", ВременнаяТаблица="ДанныеРегистра_ПараметрыАмортизацииОСБухгалтерскийУчет", Индексы="ОсновноеСредство") Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.Период,
	        |	ВложенныйЗапрос.Регистратор,
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.СрокПолезногоИспользования,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.ОбъемПродукцииРабот,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.СрокИспользованияДляВычисленияАмортизации,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.СтоимостьДляВычисленияАмортизации,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.ОбъемПродукцииРаботДляВычисленияАмортизации,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.КоэффициентАмортизации,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.КоэффициентУскорения,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.ПрименитьВТекущемМесяце
	        |"+?(ВременнаяТаблица=Неопределено, "", "ПОМЕСТИТЬ "+ВременнаяТаблица)+"
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |		ВложенныйЗапрос.Период КАК Период,
	        |		МАКСИМУМ(ПараметрыАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(ПараметрыАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			"+ТаблицаОС+" КАК ТаблицаОС
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	        |				ПО ТаблицаОС.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Период <= &"+ПараметрПериод+")
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Активность)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ТаблицаОС.ОсновноеСредство) КАК ВложенныйЗапрос
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	        |			ПО ВложенныйЗапрос.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |				И ВложенныйЗапрос.Период = ПараметрыАмортизацииОСБухгалтерскийУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВложенныйЗапрос.ОсновноеСредство,
	        |		ВложенныйЗапрос.Период) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	        |		ПО ВложенныйЗапрос.Период = ПараметрыАмортизацииОСБухгалтерскийУчет.Период
	        |			И ВложенныйЗапрос.Регистратор = ПараметрыАмортизацииОСБухгалтерскийУчет.Регистратор
	        |			И ВложенныйЗапрос.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |
	        |"+?(Индексы=Неопределено Или ВременнаяТаблица=Неопределено, "", "
	        |ИНДЕКСИРОВАТЬ ПО
	        |	"+Индексы)+"
			|;
			|";
	
КонецФункции

Функция ТекстЗапроса_СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетПоТаблицеОС(ТаблицаОС="СписокОС", ПараметрОрганизация="Организация", ПараметрПериод="Период", ВременнаяТаблица=Неопределено, Индексы="ОсновноеСредство") Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.Период,
	        |	ВложенныйЗапрос.Регистратор,
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СпособыОтраженияРасходовПоАмортизации
	        |"+?(ВременнаяТаблица=Неопределено, "", "ПОМЕСТИТЬ "+ВременнаяТаблица)+"
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |		ВложенныйЗапрос.Период КАК Период,
	        |		МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			"+ТаблицаОС+" КАК ТаблицаОС
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	        |				ПО ТаблицаОС.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период <= &"+ПараметрПериод+")
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ТаблицаОС.ОсновноеСредство) КАК ВложенныйЗапрос
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	        |			ПО ВложенныйЗапрос.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |				И ВложенныйЗапрос.Период = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВложенныйЗапрос.ОсновноеСредство,
	        |		ВложенныйЗапрос.Период) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	        |		ПО ВложенныйЗапрос.Период = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период
	        |			И ВложенныйЗапрос.Регистратор = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Регистратор
	        |			И ВложенныйЗапрос.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &"+ПараметрОрганизация+")
	        |
	        |"+?(Индексы=Неопределено Или ВременнаяТаблица=Неопределено, "", "
	        |ИНДЕКСИРОВАТЬ ПО
	        |	"+Индексы)+"
			|;
			|";
	
КонецФункции

Функция ТекстЗапроса_СчетаБухгалтерскогоУчетаОСПоТаблицеОС(ТаблицаОС="СписокОС", ПараметрОрганизация="Организация", ПараметрПериод="Период", ВременнаяТаблица=Неопределено, Индексы="ОсновноеСредство") Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.Период,
	        |	СчетаНалоговогоУчетаОС.Регистратор,
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	СчетаНалоговогоУчетаОС.Организация,
	        |	СчетаНалоговогоУчетаОС.СчетУчета,
	        |	СчетаНалоговогоУчетаОС.СчетНачисленияАмортизации
	        |"+?(ВременнаяТаблица=Неопределено, "", "ПОМЕСТИТЬ "+ВременнаяТаблица)+"
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	        |		МАКСИМУМ(СчетаБухгалтерскогоУчетаОС.Период) КАК Период
	        |	ИЗ
	        |		"+ТаблицаОС+" КАК ТаблицаОС
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	        |			ПО ТаблицаОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	        |				И (СчетаБухгалтерскогоУчетаОС.Организация = &"+ПараметрОрганизация+")
	        |				И (СчетаБухгалтерскогоУчетаОС.Период <= &"+ПараметрПериод+")
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ТаблицаОС.ОсновноеСредство) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаНалоговогоУчетаОС КАК СчетаНалоговогоУчетаОС
	        |		ПО ВложенныйЗапрос.ОсновноеСредство = СчетаНалоговогоУчетаОС.ОсновноеСредство
	        |			И (СчетаНалоговогоУчетаОС.Организация = &"+ПараметрОрганизация+")
	        |			И ВложенныйЗапрос.Период = СчетаНалоговогоУчетаОС.Период
	        |
	        |"+?(Индексы=Неопределено Или ВременнаяТаблица=Неопределено, "", "
	        |ИНДЕКСИРОВАТЬ ПО
	        |	"+Индексы)+"
			|;
			|";
	
КонецФункции




Функция ПолучитьДатуПереходаКЛинейномуМетоду(ДатаРасчета, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаРасчета));
																						   
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Период
	|ПОМЕСТИТЬ НелинейныйМетод
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Период
	|ПОМЕСТИТЬ ЛинейныйМетод
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|	И УчетнаяПолитикаОрганизаций.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|	И УчетнаяПолитикаОрганизаций.Период МЕЖДУ ДАТАВРЕМЯ(2009, 1, 1) И &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(ЛинейныйМетод.Период), ДАТАВРЕМЯ(2009, 1, 1)) КАК ДатаПереходаКЛинейномуМетоду
	|ИЗ
	|	НелинейныйМетод КАК НелинейныйМетод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛинейныйМетод КАК ЛинейныйМетод
	|		ПО НелинейныйМетод.Период < ЛинейныйМетод.Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
																															   
	Возврат Выборка.ДатаПереходаКЛинейномуМетоду;
	
КонецФункции // ПолучитьДатуПереходаКЛинейномуМетоду()


/////////////////////////////////////////////////////////////////////////////////
// Начисление амортизации ОС

// Формирует движения документа Амортизация ОС по БУ и НУ
// Параметры:
//   Документ - ссылка на документ
//   Отказ - признак необходимости отмены транзакции
Процедура ВыполнитьНачислениеАмортизацииОС(Документ, Отказ) Экспорт
	
	Движения = СформироватьНаборыЗаписейПоАмортизацииОС(Документ);
	
	
	ОчиститьДвиженияРегистров(Движения);
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(Документ);
	СтруктураШапкиДокумента.Вставить("ПериодРегистрации", КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете ИЛИ СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		
		СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ПоддержкаПБУ18");
		ttk_ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Бух", СтруктураПолейУчетнойПолитикиНУ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СписокСформирован = СформироватьПредварительныйСписокОС(СтруктураШапкиДокумента, МенеджерВременныхТаблиц);
	ВариантВыбораОС = 3;
	Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.абс_ОС) И Не СписокСформирован Тогда
		ВариантВыбораОС = 1;
	ИначеЕсли ЗначениеЗаполнено(СтруктураШапкиДокумента.абс_ОС) Тогда
		ВариантВыбораОС = 2;
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("ВариантВыбораОС", ВариантВыбораОС);
	
	
	УстановитьБлокировкуРегистровОС(СтруктураШапкиДокумента, МенеджерВременныхТаблиц);
	
	СформироватьТаблицуНаправленийРаспределения(СтруктураШапкиДокумента.Организация, МенеджерВременныхТаблиц);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СформироватьТаблицуСпискаОСБУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц);
		
		СформироватьТаблицыРасчетаАмортизацииОСБУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц);
		
		АмортизацияОС_СформироватьДвиженияПоРегиструСтоимостьОСБухгалтерскийУчет(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц);
		АмортизацияОС_СформироватьДвиженияПоРегиструХозрасчетный(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц);
		АмортизацияОС_СформироватьДвиженияПоРегистрамЗатратБУ(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц);
		
		Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
			
			СформироватьТаблицуСпискаОСНУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц);
			
			СформироватьТаблицыРасчетаАмортизацииОСНУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц);
			СформироватьТаблицыАмортизационнойПремии(СтруктураШапкиДокумента, МенеджерВременныхТаблиц);
			
			АмортизацияОС_СформироватьДвиженияПоРегиструСтоимостьОСНалоговыйУчет(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц);
			АмортизацияОС_СформироватьДвиженияПоРегиструНалоговый(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц);
			АмортизацияОС_СформироватьДвиженияПоРегистрамЗатратНУ(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц);
			
			АмортизацияОС_СформироватьДвиженияПоКапитализацииПроцентов(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписатьРегистры(Движения, Отказ);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры формирования временных таблиц для заполнения движений регистов

// Формирует таблицу распределения по направлениям амортизации (способы отражения расходов)
Процедура СформироватьТаблицуНаправленийРаспределения(Организация, МенеджерВременныхТаблиц)
	
	//АБС ИЗМЕНЕНИЕ 47326  30.09.2014 9:49:09  Шамов
	//ТекстЗапроса = "ВЫБРАТЬ
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ	
	//АБС ИЗМЕНЕНИЕ 47326 КОНЕЦ 
	               |	ВложенныйЗапрос.НаправлениеАмортизации КАК НаправлениеАмортизации,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки,
	               |	ВложенныйЗапрос.КоличествоСтрок,
	               |	ВложенныйЗапрос.СуммаКоэффициентов,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.Подразделение,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.Организация = &Организация
	               |			ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
	               |		ИНАЧЕ ЕСТЬNULL(СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации, СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации)
	               |	КОНЕЦ КАК ПодразделениеОрганизации,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.Продукция,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СерияПродукции,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.ХарактеристикаПродукции,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СубконтоНУ1,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СубконтоНУ2,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СубконтоНУ3,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.Коэффициент,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.Проект,
	               |	СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства,
	               |	ВЫБОР
	               |		КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводствоНеОблагаемоеЕНВД)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводствоОблагаемоеЕНВД)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводстваНеОблагаемоеЕНВД)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводстваОблагаемоеЕНВД)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВПроизводстве)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_))
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВПроизводстве)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ПроизводственныеРасходы)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводстваНеОблагаемоеЕНВД)
	               |						ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводстваОблагаемоеЕНВД)
	               |						ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства))
	               |					ТОГДА ВЫБОР
	               |							КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	               |								ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ПроизводственныеРасходы)
	               |							ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат.ХарактерЗатрат
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводствеНеОблагаемоеЕНВД)
	               |								ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводствеОблагаемоеЕНВД)
	               |								ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве))
	               |							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.БракВПроизводстве)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходыНеОблагаемыеЕНВД)
	               |										ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходыОблагаемыеЕНВД)
	               |										ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходыРаспределяемые)
	               |										ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы))
	               |									ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщепроизводственныеРасходы)
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходыНеОблагаемыеЕНВД)
	               |												ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходыОблагаемыеЕНВД)
	               |												ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходыРаспределяемые)
	               |												ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы))
	               |											ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщехозяйственныеРасходы)
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращенияНеОблагаемыеЕНВД)
	               |														ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращенияРаспределяемые)
	               |														ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращенияОблагаемыеЕНВД)
	               |														ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращения))
	               |													ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ИздержкиОбращения)
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КоммерческиеРасходыНеОблагаемыеЕНВД)
	               |																ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КоммерческиеРасходыРаспределяемые)
	               |																ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КоммерческиеРасходыОблагаемыеЕНВД)
	               |																ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КоммерческиеРасходы))
	               |															ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.КоммерческиеРасходы)
	               |														ИНАЧЕ ВЫБОР
	               |																КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств))
	               |																	ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы)
	               |																ИНАЧЕ ВЫБОР
	               |																		КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ))
	               |																			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ЗаготовлениеИПриобретениеМЦ)
	               |																		ИНАЧЕ ВЫБОР
	               |																				КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	               |																					ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ПустаяСсылка)
	               |																				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |																			КОНЕЦ
	               |																	КОНЕЦ
	               |															КОНЕЦ
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ХарактерЗатрат,
	               |	ВЫБОР
	               |		КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрямыеРасходыОсновногоПроизводства)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеРасходыОсновногоПроизводства)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрямыеРасходыВспомогательныхПроизводств)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеРасходыВспомогательныхПроизводств)
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОсновноеПроизводство_))
	               |				ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВспомогательныеПроизводства))
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ПроизводственныеРасходы)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрямыеРасходыОбслуживающихПроизводств)
	               |						ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеРасходыОбслуживающихПроизводств)
	               |						ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбслуживающиеПроизводства))
	               |					ТОГДА ВЫБОР
	               |							КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	               |								ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ПроизводственныеРасходы)
	               |							ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат.ХарактерЗатрат
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрямыеРасходыПоВыявленномуБраку)
	               |								ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеРасходыПоВыявленномуБраку)
	               |								ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.БракВПроизводстве))
	               |							ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.БракВПроизводстве)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрямыеОбщепроизводственныеРасходы)
	               |										ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеОбщепроизводственныеРасходы)
	               |										ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеОбщепроизводственныеРасходыРаспределяемые)
	               |										ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщепроизводственныеРасходы))
	               |									ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщепроизводственныеРасходы)
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрямыеОбщехозяйственныеРасходы)
	               |												ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеОбщехозяйственныеРасходы)
	               |												ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КосвенныеОбщехозяйственныеРасходыРаспределяемые)
	               |												ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщехозяйственныеРасходы))
	               |											ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщехозяйственныеРасходы)
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИздержкиОбращенияНеОблагаемыеЕНВД)
	               |														ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИздержкиОбращенияРаспределяемые)
	               |														ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИздержкиОбращения))
	               |													ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ИздержкиОбращения)
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КоммерческиеРасходыНеОблагаемыеЕНВД)
	               |																ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КоммерческиеРасходыРаспределяемые)
	               |																ИЛИ СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КоммерческиеРасходы))
	               |															ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.КоммерческиеРасходы)
	               |														ИНАЧЕ ВЫБОР
	               |																КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.СтроительствоОбъектовОсновныхСредств))
	               |																	ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы)
	               |																ИНАЧЕ ВЫБОР
	               |																		КОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатратНУ = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
	               |																			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ПустаяСсылка)
	               |																		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |																	КОНЕЦ
	               |															КОНЕЦ
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ХарактерЗатратНУ
	               |ПОМЕСТИТЬ ТаблицаРаспределенияПоНаправлениям
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Ссылка КАК НаправлениеАмортизации,
	               |		ВложенныйЗапрос.Организация КАК Организация,
	               |		СУММА(СпособыОтраженияРасходовПоАмортизацииСпособы.Коэффициент) КАК СуммаКоэффициентов,
	               |		КОЛИЧЕСТВО(СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки) КАК КоличествоСтрок
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			СпособыОтраженияРасходовПоАмортизации.Ссылка КАК Ссылка,
	               |			СпособыОтраженияРасходовПоАмортизации.Организация КАК Организация
	               |		ИЗ
	               |			Справочник.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
	               |		ГДЕ
	               |			(СпособыОтраженияРасходовПоАмортизации.Организация = &Организация
	               |					ИЛИ СпособыОтраженияРасходовПоАмортизации.Организация = &ОрганизацияКТТК)) КАК ВложенныйЗапрос
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
	               |			ПО ВложенныйЗапрос.Ссылка = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.Ссылка,
	               |		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	               |			ПО СпособыОтраженияРасходовПоАмортизацииСпособы.Подразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
	               |				И (СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация)
	               |		ПО ВложенныйЗапрос.НаправлениеАмортизации = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРаспределенияПоНаправлениям.НаправлениеАмортизации КАК НаправлениеАмортизации,
	               |	ТаблицаРаспределенияПоНаправлениям.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаРаспределенияПоНаправлениям.КоличествоСтрок,
	               |	ТаблицаРаспределенияПоНаправлениям.СуммаКоэффициентов,
	               |	ТаблицаРаспределенияПоНаправлениям.Коэффициент,
	               |	ТаблицаРаспределенияПоНаправлениям.СчетЗатрат,
	               |	СчетаЗатратБУСВидамиСубконто.ВидСубконто1,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ТаблицаРаспределенияПоНаправлениям.Субконто1
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	               |					ТОГДА ТаблицаРаспределенияПоНаправлениям.СтатьяЗатрат
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	               |							ТОГДА ТаблицаРаспределенияПоНаправлениям.ПодразделениеОрганизации
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	               |									ТОГДА ТаблицаРаспределенияПоНаправлениям.НоменклатурнаяГруппа
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	               |											ТОГДА ТаблицаРаспределенияПоНаправлениям.ОбъектСтроительства
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	               |													ТОГДА ТаблицаРаспределенияПоНаправлениям.СпособСтроительства
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	               |															ТОГДА ТаблицаРаспределенияПоНаправлениям.Субконто3
	               |														ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Субконто1,
	               |	СчетаЗатратБУСВидамиСубконто.ВидСубконто2,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ТаблицаРаспределенияПоНаправлениям.Субконто2
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	               |					ТОГДА ТаблицаРаспределенияПоНаправлениям.СтатьяЗатрат
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	               |							ТОГДА ТаблицаРаспределенияПоНаправлениям.ПодразделениеОрганизации
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	               |									ТОГДА ТаблицаРаспределенияПоНаправлениям.НоменклатурнаяГруппа
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	               |											ТОГДА ТаблицаРаспределенияПоНаправлениям.ОбъектСтроительства
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	               |													ТОГДА ТаблицаРаспределенияПоНаправлениям.СпособСтроительства
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	               |															ТОГДА ТаблицаРаспределенияПоНаправлениям.Субконто3
	               |														ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Субконто2,
	               |	СчетаЗатратБУСВидамиСубконто.ВидСубконто3,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ТаблицаРаспределенияПоНаправлениям.Субконто3
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	               |					ТОГДА ТаблицаРаспределенияПоНаправлениям.СтатьяЗатрат
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	               |							ТОГДА ТаблицаРаспределенияПоНаправлениям.ПодразделениеОрганизации
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	               |									ТОГДА ТаблицаРаспределенияПоНаправлениям.НоменклатурнаяГруппа
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	               |											ТОГДА ТаблицаРаспределенияПоНаправлениям.ОбъектСтроительства
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	               |													ТОГДА ТаблицаРаспределенияПоНаправлениям.СпособСтроительства
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СчетаЗатратБУСВидамиСубконто.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	               |															ТОГДА ТаблицаРаспределенияПоНаправлениям.Субконто3
	               |														ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Субконто3,
	               |	ТаблицаРаспределенияПоНаправлениям.СчетЗатратНУ,
	               |	СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ1,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ТаблицаРаспределенияПоНаправлениям.СубконтоНУ1
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	               |					ТОГДА ТаблицаРаспределенияПоНаправлениям.СтатьяЗатрат
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	               |							ТОГДА ТаблицаРаспределенияПоНаправлениям.ПодразделениеОрганизации
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	               |									ТОГДА ТаблицаРаспределенияПоНаправлениям.НоменклатурнаяГруппа
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	               |											ТОГДА ТаблицаРаспределенияПоНаправлениям.ОбъектСтроительства
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	               |													ТОГДА ТаблицаРаспределенияПоНаправлениям.СпособСтроительства
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	               |															ТОГДА ТаблицаРаспределенияПоНаправлениям.СубконтоНУ3
	               |														ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СубконтоНУ1,
	               |	СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ2,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ТаблицаРаспределенияПоНаправлениям.СубконтоНУ2
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	               |					ТОГДА ТаблицаРаспределенияПоНаправлениям.СтатьяЗатрат
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	               |							ТОГДА ТаблицаРаспределенияПоНаправлениям.ПодразделениеОрганизации
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	               |									ТОГДА ТаблицаРаспределенияПоНаправлениям.НоменклатурнаяГруппа
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	               |											ТОГДА ТаблицаРаспределенияПоНаправлениям.ОбъектСтроительства
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	               |													ТОГДА ТаблицаРаспределенияПоНаправлениям.СпособСтроительства
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	               |															ТОГДА ТаблицаРаспределенияПоНаправлениям.СубконтоНУ3
	               |														ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СубконтоНУ2,
	               |	СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ3,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ТаблицаРаспределенияПоНаправлениям.СубконтоНУ3
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	               |					ТОГДА ТаблицаРаспределенияПоНаправлениям.СтатьяЗатрат
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	               |							ТОГДА ТаблицаРаспределенияПоНаправлениям.ПодразделениеОрганизации
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	               |									ТОГДА ТаблицаРаспределенияПоНаправлениям.НоменклатурнаяГруппа
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	               |											ТОГДА ТаблицаРаспределенияПоНаправлениям.ОбъектСтроительства
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	               |													ТОГДА ТаблицаРаспределенияПоНаправлениям.СпособСтроительства
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА СчетаЗатратНУСВидамиСубконто.ВидСубконтоНУ3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	               |															ТОГДА ТаблицаРаспределенияПоНаправлениям.СубконтоНУ3
	               |														ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СубконтоНУ3,
	               |	ТаблицаРаспределенияПоНаправлениям.Подразделение,
	               |	ТаблицаРаспределенияПоНаправлениям.ПодразделениеОрганизации,
	               |	ТаблицаРаспределенияПоНаправлениям.СтатьяЗатрат,
	               |	ТаблицаРаспределенияПоНаправлениям.НоменклатурнаяГруппа,
	               |	ТаблицаРаспределенияПоНаправлениям.Продукция,
	               |	ТаблицаРаспределенияПоНаправлениям.СерияПродукции,
	               |	ТаблицаРаспределенияПоНаправлениям.ХарактеристикаПродукции,
	               |	ТаблицаРаспределенияПоНаправлениям.ОбъектСтроительства,
	               |	ТаблицаРаспределенияПоНаправлениям.СпособСтроительства,
	               |	ТаблицаРаспределенияПоНаправлениям.Проект,
	               |	ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат,
	               |	ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЭтоПроизводственныеРасходы,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |				ИЛИ ТаблицаРаспределенияПоНаправлениям.ХарактерЗатратНУ = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.Прочие)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЭтоПроизводственныеРасходыНУ
	               |ПОМЕСТИТЬ РаспределениеЗатратПоНаправлениям
	               |ИЗ
	               |	ТаблицаРаспределенияПоНаправлениям КАК ТаблицаРаспределенияПоНаправлениям
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СчетаЗатратБУ.СчетЗатрат КАК СчетЗатрат,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 1
	               |						ТОГДА ХозрасчетныйВидыСубконто.ВидСубконто
	               |					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	               |				КОНЕЦ) КАК ВидСубконто1,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 2
	               |						ТОГДА ХозрасчетныйВидыСубконто.ВидСубконто
	               |					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	               |				КОНЕЦ) КАК ВидСубконто2,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 3
	               |						ТОГДА ХозрасчетныйВидыСубконто.ВидСубконто
	               |					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	               |				КОНЕЦ) КАК ВидСубконто3
	               |		ИЗ
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ТаблицаРаспределенияПоНаправлениям.СчетЗатрат КАК СчетЗатрат
	               |			ИЗ
	               |				ТаблицаРаспределенияПоНаправлениям КАК ТаблицаРаспределенияПоНаправлениям
	               |			ГДЕ
	               |				ТаблицаРаспределенияПоНаправлениям.СчетЗатрат <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетаЗатратБУ
	               |				ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	               |				ПО СчетаЗатратБУ.СчетЗатрат = ХозрасчетныйВидыСубконто.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СчетаЗатратБУ.СчетЗатрат) КАК СчетаЗатратБУСВидамиСубконто
	               |		ПО ТаблицаРаспределенияПоНаправлениям.СчетЗатрат = СчетаЗатратБУСВидамиСубконто.СчетЗатрат
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СчетаЗатратНУ.СчетЗатратНУ КАК СчетЗатратНУ,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НалоговыйВидыСубконто.НомерСтроки = 1
	               |						ТОГДА НалоговыйВидыСубконто.ВидСубконто
	               |					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	               |				КОНЕЦ) КАК ВидСубконтоНУ1,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НалоговыйВидыСубконто.НомерСтроки = 2
	               |						ТОГДА НалоговыйВидыСубконто.ВидСубконто
	               |					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	               |				КОНЕЦ) КАК ВидСубконтоНУ2,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НалоговыйВидыСубконто.НомерСтроки = 3
	               |						ТОГДА НалоговыйВидыСубконто.ВидСубконто
	               |					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	               |				КОНЕЦ) КАК ВидСубконтоНУ3
	               |		ИЗ
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ТаблицаРаспределенияПоНаправлениям.СчетЗатратНУ КАК СчетЗатратНУ
	               |			ИЗ
	               |				ТаблицаРаспределенияПоНаправлениям КАК ТаблицаРаспределенияПоНаправлениям
	               |			ГДЕ
	               |				ТаблицаРаспределенияПоНаправлениям.СчетЗатратНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)) КАК СчетаЗатратНУ
	               |				ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК НалоговыйВидыСубконто
	               |				ПО СчетаЗатратНУ.СчетЗатратНУ = НалоговыйВидыСубконто.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СчетаЗатратНУ.СчетЗатратНУ) КАК СчетаЗатратНУСВидамиСубконто
	               |		ПО ТаблицаРаспределенияПоНаправлениям.СчетЗатратНУ = СчетаЗатратНУСВидамиСубконто.СчетЗатратНУ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НаправлениеАмортизации,
	               |	НомерСтроки";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОрганизацияКТТК", ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СформироватьТаблицуНормАмортизации(МенеджерВременныхТаблиц)
	
	ТаблицаНорм = Новый ТаблицаЗначений;
	ТаблицаНорм.Колонки.Добавить("АмортизационнаяГруппа", Новый ОписаниеТипов("ПеречислениеСсылка.АмортизационныеГруппы"));
	ТаблицаНорм.Колонки.Добавить("НормаАмортизации", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,1)));
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПерваяГруппа;
	СтрокаНормы.НормаАмортизации = 14.3;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ВтораяГруппа;
	СтрокаНормы.НормаАмортизации = 8.8;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ТретьяГруппа;
	СтрокаНормы.НормаАмортизации = 5.6;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ЧетвертаяГруппа;
	СтрокаНормы.НормаАмортизации = 3.8;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПятаяГруппа;
	СтрокаНормы.НормаАмортизации = 2.7;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ШестаяГруппа;
	СтрокаНормы.НормаАмортизации = 1.8;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.СедьмаяГруппа;
	СтрокаНормы.НормаАмортизации = 1.3;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ВосьмаяГруппа;
	СтрокаНормы.НормаАмортизации = 1.0;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ДевятаяГруппа;
	СтрокаНормы.НормаАмортизации = 0.8;
	
	СтрокаНормы = ТаблицаНорм.Добавить();
	СтрокаНормы.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ДесятаяГруппа;
	СтрокаНормы.НормаАмортизации = 0.7;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(Нормы.АмортизационнаяГруппа КАК Перечисление.АмортизационныеГруппы) КАК АмортизационнаяГруппа,
	                      |	ВЫРАЗИТЬ(Нормы.НормаАмортизации КАК ЧИСЛО(5, 1)) КАК НормаАмортизации
	                      |ПОМЕСТИТЬ НормыАмортизации
	                      |ИЗ
	                      |	&ТаблицаНорм КАК Нормы");
	Запрос.УстановитьПараметр("ТаблицаНорм", ТаблицаНорм);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры


// Формирует временную таблицу ПредварительныйСписокОС в случае, если в документе заданы отборы
// Возвращает Истина, если временная таблица сформирована, и Ложь, если отборы не заданы
Функция СформироватьПредварительныйСписокОС(СтруктураШапкиДокумента, МенеджерВременныхТаблиц)
	
	Построитель = Новый ПостроительОтчета(
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство
	|ПОМЕСТИТЬ ПредварительныйСписокОС
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|{ГДЕ
	|	ОсновныеСредства.Ссылка.* КАК ОсновноеСредство}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство");
	
	Построитель.ЗаполнитьНастройки();	
	НастройкиПостроителя = СтруктураШапкиДокумента.абс_Построитель.Получить();
	
	Если ТипЗнч(НастройкиПостроителя) = Тип("НастройкиПостроителяОтчета") Тогда
		Построитель.УстановитьНастройки(НастройкиПостроителя, Истина, Ложь, Ложь, Ложь, Ложь);
	КонецЕсли;
	
	ЕстьОтбор = Ложь;
	
	Для Каждого ОтборПостроителя Из Построитель.Отбор Цикл
		
		ЕстьОтбор = ЕстьОтбор ИЛИ ОтборПостроителя.Использование;
		
	КонецЦикла;
	
	Если ЕстьОтбор Тогда
		Запрос = Построитель.ПолучитьЗапрос();
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
	КонецЕсли;
	
	Возврат ЕстьОтбор;
	
КонецФункции

Процедура СформироватьТаблицуСпискаОСБУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц)
	
	Если СтруктураШапкиДокумента.ВариантВыбораОС=1 Тогда
			
		ТекстЗапроса = АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОрганизацииБУ();
		
	ИначеЕсли СтруктураШапкиДокумента.ВариантВыбораОС=2 Тогда
		
		ТекстЗапроса = АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОдномуБУ();
		
	Иначе
		
		ТекстЗапроса = АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОтборуБУ();
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", СтруктураШапкиДокумента.абс_ОС);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СформироватьТаблицыРасчетаАмортизацииОСБУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц)
	
	ТекстЗапроса = АмортизацияОС_ПолучитьТекстЗапросаРасчетаАмортизацииБУ();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Коэффициент12", "Коэффициент"+Месяц(СтруктураШапкиДокумента.ПериодРегистрации));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации), ВидГраницы.Исключая));
	Запрос.Выполнить();
	
КонецПроцедуры


Процедура СформироватьТаблицуСпискаОСНУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц)
	
	СформироватьТаблицуНормАмортизации(МенеджерВременныхТаблиц);
	
	Если СтруктураШапкиДокумента.ВариантВыбораОС=1 Тогда
			
		ТекстЗапроса = АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОрганизацииНУ();
		
	ИначеЕсли СтруктураШапкиДокумента.ВариантВыбораОС=2 Тогда
		
		ТекстЗапроса = АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОдномуНУ();
		
	Иначе
		
		ТекстЗапроса = АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОтборуНУ();
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", СтруктураШапкиДокумента.абс_ОС);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СформироватьТаблицыРасчетаАмортизацииОСНУ(СтруктураШапкиДокумента, МенеджерВременныхТаблиц)
	
	ДатаПереходаКЛинейномуМетоду = ПолучитьДатуПереходаКЛинейномуМетоду(СтруктураШапкиДокумента.ПериодРегистрации, СтруктураШапкиДокумента.Организация);

	Запрос = Новый Запрос(АмортизацияОС_ПолучитьТекстЗапросаНачисленияАмортизацииНУ());
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", СтруктураШапкиДокумента.абс_ОС);
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоГода", Новый Граница(НачалоГода(СтруктураШапкиДокумента.ПериодРегистрации), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериодаУчетнойПолитики", КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаПереходаКЛинейномуМетоду", ДатаПереходаКЛинейномуМетоду);
	Запрос.УстановитьПараметр("ГодПереходаКЛинейномуМетоду", Год(ДатаПереходаКЛинейномуМетоду));
	Запрос.УстановитьПараметр("МесяцПереходаКЛинейномуМетоду", Месяц(ДатаПереходаКЛинейномуМетоду));
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Запрос = Новый Запрос(АмортизацияОС_ПолучитьТекстЗапросаРаспределенияЗатратНУ());
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(СтруктураШапкиДокумента.ПериодРегистрации));
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура СформироватьТаблицыАмортизационнойПремии(СтруктураШапкиДокумента, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос(АмортизацияОС_ПолучитьТекстЗапросаАмортизационнойПремии());
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоМесяца(СтруктураШапкиДокумента.ПериодРегистрации), ВидГраницы.Исключая));
	
	Запрос.Выполнить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// Функции, возвращающие тексты запросов

Функция АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОрганизацииБУ()
	
	Возврат "ВЫБРАТЬ
	        |	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
	        |ПОМЕСТИТЬ ОССнятыеСУчета
	        |ИЗ
	        |	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	        |ГДЕ
	        |	СостоянияОСОрганизаций.Организация = &Организация
	        |	И СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	        |	И СостоянияОСОрганизаций.ДатаСостояния <= &ПериодРегистрации
	        |	И СостоянияОСОрганизаций.Активность
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство,
	        |	НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизациюВТекущемМесяце КАК НачислятьВТекущемМесяце
	        |ПОМЕСТИТЬ СписокОСНачислятьАмортизациюБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ГДЕ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.Период < &НачалоМесяца
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Активность
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Период)
	        |		ИЗ
	        |			РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ГДЕ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.Период >= &НачалоМесяца
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Период <= &КонецМесяца
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Активность
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |				И (НачислениеАмортизацииОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор
	        |ГДЕ
	        |	(ПериодыРегистраторыСреза.Период >= &НачалоМесяца
	        |				И НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизациюВТекущемМесяце
	        |			ИЛИ ПериодыРегистраторыСреза.Период < &НачалоМесяца
	        |				И НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизацию)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокОСНачислятьАмортизациюБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	СписокОСНачислятьАмортизациюБУ.НачислятьВТекущемМесяце КАК НачислятьВТекущемМесяце
	        |ПОМЕСТИТЬ СписокОСБУ
	        |ИЗ
	        |	СписокОСНачислятьАмортизациюБУ КАК СписокОСНачислятьАмортизациюБУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОССнятыеСУчета КАК ОССнятыеСУчета
	        |		ПО СписокОСНачислятьАмортизациюБУ.ОсновноеСредство = ОССнятыеСУчета.ОсновноеСредство
	        |ГДЕ
	        |	ОССнятыеСУчета.ОсновноеСредство ЕСТЬ NULL 
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НачислятьВТекущемМесяце";
	
КонецФункции

Функция АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОтборуБУ()
	
	Возврат "ВЫБРАТЬ
	        |	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
	        |ПОМЕСТИТЬ ОССнятыеСУчета
	        |ИЗ
	        |	ПредварительныйСписокОС КАК ПредварительныйСписокОС
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	        |		ПО ПредварительныйСписокОС.ОсновноеСредство = СостоянияОСОрганизаций.ОсновноеСредство
	        |			И (СостоянияОСОрганизаций.Организация = &Организация)
	        |			И (СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета))
	        |			И (СостоянияОСОрганизаций.ДатаСостояния <= &ПериодРегистрации)
	        |			И (СостоянияОСОрганизаций.Активность)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство,
	        |	НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизациюВТекущемМесяце КАК НачислятьВТекущемМесяце
	        |ПОМЕСТИТЬ СписокОСНачислятьАмортизациюБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			ПредварительныйСписокОС КАК ПредварительныйСписокОС
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |				ПО ПредварительныйСписокОС.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Период < &НачалоМесяца)
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Активность)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Период)
	        |		ИЗ
	        |			ПредварительныйСписокОС КАК ПредварительныйСписокОС
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |				ПО ПредварительныйСписокОС.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Период >= &НачалоМесяца)
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Период <= &КонецМесяца)
	        |					И (НачислениеАмортизацииОСБухгалтерскийУчет.Активность)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |				И (НачислениеАмортизацииОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор
	        |ГДЕ
	        |	(ПериодыРегистраторыСреза.Период >= &НачалоМесяца
	        |				И НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизациюВТекущемМесяце
	        |			ИЛИ ПериодыРегистраторыСреза.Период < &НачалоМесяца
	        |				И НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизацию)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокОСНачислятьАмортизациюБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	СписокОСНачислятьАмортизациюБУ.НачислятьВТекущемМесяце КАК НачислятьВТекущемМесяце
	        |ПОМЕСТИТЬ СписокОСБУ
	        |ИЗ
	        |	СписокОСНачислятьАмортизациюБУ КАК СписокОСНачислятьАмортизациюБУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОССнятыеСУчета КАК ОССнятыеСУчета
	        |		ПО СписокОСНачислятьАмортизациюБУ.ОсновноеСредство = ОССнятыеСУчета.ОсновноеСредство
	        |ГДЕ
	        |	ОССнятыеСУчета.ОсновноеСредство ЕСТЬ NULL 
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НачислятьВТекущемМесяце";
	
КонецФункции

Функция АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОдномуБУ()
	
	Возврат "ВЫБРАТЬ
	        |	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
	        |ПОМЕСТИТЬ ОССнятыеСУчета
	        |ИЗ
	        |	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	        |ГДЕ
	        |	СостоянияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
	        |	И СостоянияОСОрганизаций.Организация = &Организация
	        |	И СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	        |	И СостоянияОСОрганизаций.ДатаСостояния <= &ПериодРегистрации
	        |	И СостоянияОСОрганизаций.Активность
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство,
	        |	НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизациюВТекущемМесяце КАК НачислятьВТекущемМесяце
	        |ПОМЕСТИТЬ СписокОСНачислятьАмортизациюБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ГДЕ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Период < &НачалоМесяца
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Активность
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСБухгалтерскийУчет.Период)
	        |		ИЗ
	        |			РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ГДЕ
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Период >= &НачалоМесяца
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Период <= &КонецМесяца
	        |			И НачислениеАмортизацииОСБухгалтерскийУчет.Активность
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |				И (НачислениеАмортизацииОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор
	        |ГДЕ
	        |	(ПериодыРегистраторыСреза.Период >= &НачалоМесяца
	        |				И НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизациюВТекущемМесяце
	        |			ИЛИ ПериодыРегистраторыСреза.Период < &НачалоМесяца
	        |				И НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизацию)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокОСНачислятьАмортизациюБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	СписокОСНачислятьАмортизациюБУ.НачислятьВТекущемМесяце КАК НачислятьВТекущемМесяце
	        |ПОМЕСТИТЬ СписокОСБУ
	        |ИЗ
	        |	СписокОСНачислятьАмортизациюБУ КАК СписокОСНачислятьАмортизациюБУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОССнятыеСУчета КАК ОССнятыеСУчета
	        |		ПО СписокОСНачислятьАмортизациюБУ.ОсновноеСредство = ОССнятыеСУчета.ОсновноеСредство
	        |ГДЕ
	        |	ОССнятыеСУчета.ОсновноеСредство ЕСТЬ NULL 
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НачислятьВТекущемМесяце";
	
КонецФункции

Функция АмортизацияОС_ПолучитьТекстЗапросаРасчетаАмортизацииБУ()
	
	Возврат "ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	ПервоначальныеСведенияОСБухгалтерскийУчет.ИнвентарныйНомер,
	        |	ПервоначальныеСведенияОСБухгалтерскийУчет.СпособНачисленияАмортизации,
	        |	ПервоначальныеСведенияОСБухгалтерскийУчет.ПервоначальнаяСтоимость,
	        |	ПервоначальныеСведенияОСБухгалтерскийУчет.Организация
	        |ПОМЕСТИТЬ ПервоначальныеСведенияБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(ПервоначальныеСведенияОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(ПервоначальныеСведенияОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	        |				ПО СписокОСБУ.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (ПервоначальныеСведенияОСБухгалтерскийУчет.Период < &НачалоМесяца)
	        |					И (ПервоначальныеСведенияОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (ПервоначальныеСведенияОСБухгалтерскийУчет.Активность)
	        |					И (НЕ СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство,
	        |			МАКСИМУМ(ПервоначальныеСведенияОСБухгалтерскийУчет.Период)
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	        |				ПО СписокОСБУ.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (ПервоначальныеСведенияОСБухгалтерскийУчет.Период >= &НачалоМесяца)
	        |					И (ПервоначальныеСведенияОСБухгалтерскийУчет.Период <= &КонецМесяца)
	        |					И (ПервоначальныеСведенияОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (ПервоначальныеСведенияОСБухгалтерскийУчет.Активность)
	        |					И (СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	        |				И ПериодыСреза.Период = ПервоначальныеСведенияОСБухгалтерскийУчет.Период
	        |				И (ПервоначальныеСведенияОСБухгалтерскийУчет.Организация = &Организация)
	        |				И (ПервоначальныеСведенияОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	        |			И ПериодыРегистраторыСреза.Период = ПервоначальныеСведенияОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = ПервоначальныеСведенияОСБухгалтерскийУчет.Регистратор
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.СтоимостьДляВычисленияАмортизации,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.КоэффициентАмортизации КАК КоэффициентАмортизации,
	        |	ПараметрыАмортизацииОСБухгалтерскийУчет.КоэффициентУскорения КАК КоэффициентУскорения,
	        |	ПериодыРегистраторыСреза.Период
	        |ПОМЕСТИТЬ ПараметрыАмортизацииБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(ПараметрыАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(ПараметрыАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	        |				ПО СписокОСБУ.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Период < &НачалоМесяца)
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Активность)
	        |					И (НЕ СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство,
	        |			МАКСИМУМ(ПараметрыАмортизацииОСБухгалтерскийУчет.Период)
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	        |				ПО СписокОСБУ.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Период >= &НачалоМесяца)
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Период <= &КонецМесяца)
	        |					И (ПараметрыАмортизацииОСБухгалтерскийУчет.Активность)
	        |					И (СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = ПараметрыАмортизацииОСБухгалтерскийУчет.Период
	        |				И (ПараметрыАмортизацииОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = ПараметрыАмортизацииОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = ПараметрыАмортизацииОСБухгалтерскийУчет.Регистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство,
	        |	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СпособыОтраженияРасходовПоАмортизации КАК НаправлениеАмортизации
	        |ПОМЕСТИТЬ НаправленияАмортизацииБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	        |				ПО СписокОСБУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период < &НачалоМесяца)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Активность)
	        |					И (НЕ СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство,
	        |			МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период)
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	        |				ПО СписокОСБУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период >= &НачалоМесяца)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период <= &КонецМесяца)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Активность)
	        |					И (СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период
	        |				И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Регистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство,
	        |	ГрафикиАмортизацииОСБухгалтерскийУчет.ГрафикАмортизации,
	        |	ГрафикиАмортизацииОСБухгалтерскийУчет.ГрафикАмортизации.Коэффициент12 КАК КоэффициентГрафика
	        |ПОМЕСТИТЬ ГрафикиАмортизацииБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(ГрафикиАмортизацииОСБухгалтерскийУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(ГрафикиАмортизацииОСБухгалтерскийУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет КАК ГрафикиАмортизацииОСБухгалтерскийУчет
	        |				ПО (ГрафикиАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И СписокОСБУ.ОсновноеСредство = ГрафикиАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (ГрафикиАмортизацииОСБухгалтерскийУчет.Период < &НачалоМесяца)
	        |					И (ГрафикиАмортизацииОСБухгалтерскийУчет.Активность)
	        |					И (НЕ СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство,
	        |			МАКСИМУМ(ГрафикиАмортизацииОСБухгалтерскийУчет.Период)
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет КАК ГрафикиАмортизацииОСБухгалтерскийУчет
	        |				ПО (ГрафикиАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |					И СписокОСБУ.ОсновноеСредство = ГрафикиАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |					И (ГрафикиАмортизацииОСБухгалтерскийУчет.Период >= &НачалоМесяца)
	        |					И (ГрафикиАмортизацииОСБухгалтерскийУчет.Период <= &КонецМесяца)
	        |					И (ГрафикиАмортизацииОСБухгалтерскийУчет.Активность)
	        |					И (СписокОСБУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет КАК ГрафикиАмортизацииОСБухгалтерскийУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = ГрафикиАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |				И (ГрафикиАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = ГрафикиАмортизацииОСБухгалтерскийУчет.Период
	        |				И (ГрафикиАмортизацииОСБухгалтерскийУчет.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет КАК ГрафикиАмортизацииОСБухгалтерскийУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = ГрафикиАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	        |			И (ГрафикиАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = ГрафикиАмортизацииОСБухгалтерскийУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = ГрафикиАмортизацииОСБухгалтерскийУчет.Регистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	ВЫБОР
	        |		КОГДА СписокОСБУ.НачислятьВТекущемМесяце
	        |			ТОГДА ЕСТЬNULL(СтоимостьОСОбороты.СтоимостьОборот, 0)
	        |		ИНАЧЕ ЕСТЬNULL(СтоимостьОСБухгалтерскийУчетОстатки.СтоимостьОстаток, 0)
	        |	КОНЕЦ КАК СтоимостьНачальныйОстаток,
	        |	ВЫБОР
	        |		КОГДА СписокОСБУ.НачислятьВТекущемМесяце
	        |			ТОГДА ЕСТЬNULL(СтоимостьОСОбороты.АмортизацияОборот, 0)
	        |		ИНАЧЕ ЕСТЬNULL(СтоимостьОСБухгалтерскийУчетОстатки.АмортизацияОстаток, 0)
	        |	КОНЕЦ КАК АмортизацияНачальныйОстаток,
	        |	ЕСТЬNULL(СтоимостьОСБухгалтерскийУчетОстатки.АмортизацияОстаток, 0) + ЕСТЬNULL(СтоимостьОСОбороты.АмортизацияОборот, 0) КАК АмортизацияКонечныйОстаток,
	        |	ЕСТЬNULL(СтоимостьОСОбороты.АмортизацияОборот, 0) КАК АмортизацияОборот,
	        |	ЕСТЬNULL(СтоимостьОСБухгалтерскийУчетОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(СтоимостьОСОбороты.СтоимостьОборот, 0) КАК БалансоваяСтоимость
	        |ПОМЕСТИТЬ АмортизацияБУ
	        |ИЗ
	        |	СписокОСБУ КАК СписокОСБУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОСБухгалтерскийУчет.Остатки(&НачалоПериода, Организация = &Организация) КАК СтоимостьОСБухгалтерскийУчетОстатки
	        |		ПО СписокОСБУ.ОсновноеСредство = СтоимостьОСБухгалтерскийУчетОстатки.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			СписокОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			СУММА(ВЫБОР
	        |					КОГДА СтоимостьОСБухгалтерскийУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |						ТОГДА СтоимостьОСБухгалтерскийУчет.Стоимость
	        |					ИНАЧЕ -СтоимостьОСБухгалтерскийУчет.Стоимость
	        |				КОНЕЦ) КАК СтоимостьОборот,
	        |			СУММА(ВЫБОР
	        |					КОГДА СтоимостьОСБухгалтерскийУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |						ТОГДА СтоимостьОСБухгалтерскийУчет.Амортизация
	        |					ИНАЧЕ -СтоимостьОСБухгалтерскийУчет.Амортизация
	        |				КОНЕЦ) КАК АмортизацияОборот
	        |		ИЗ
	        |			СписокОСБУ КАК СписокОСБУ
	        |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОСБухгалтерскийУчет КАК СтоимостьОСБухгалтерскийУчет
	        |				ПО (СтоимостьОСБухгалтерскийУчет.Организация = &Организация)
	        |					И (СтоимостьОСБухгалтерскийУчет.Период >= &НачалоМесяца)
	        |					И (СтоимостьОСБухгалтерскийУчет.Период <= &КонецМесяца)
	        |					И (СтоимостьОСБухгалтерскийУчет.Активность)
	        |					И СписокОСБУ.ОсновноеСредство = СтоимостьОСБухгалтерскийУчет.ОсновноеСредство
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокОСБУ.ОсновноеСредство) КАК СтоимостьОСОбороты
	        |		ПО СписокОСБУ.ОсновноеСредство = СтоимостьОСОбороты.ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыСреза.ОсновноеСредство,
	        |	СчетаБухгалтерскогоУчетаОС.СчетУчета,
	        |	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации
	        |ПОМЕСТИТЬ СчетаУчетаБУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		СписокОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |		МАКСИМУМ(СчетаБухгалтерскогоУчетаОС.Период) КАК Период
	        |	ИЗ
	        |		СписокОСБУ КАК СписокОСБУ
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	        |			ПО СписокОСБУ.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	        |				И (СчетаБухгалтерскогоУчетаОС.Организация = &Организация)
	        |				И (СчетаБухгалтерскогоУчетаОС.Период <= &КонецМесяца)
	        |				И (СчетаБухгалтерскогоУчетаОС.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		СписокОСБУ.ОсновноеСредство) КАК ПериодыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	        |		ПО ПериодыСреза.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	        |			И (СчетаБухгалтерскогоУчетаОС.Организация = &Организация)
	        |			И ПериодыСреза.Период = СчетаБухгалтерскогоУчетаОС.Период
	        |			И (СчетаБухгалтерскогоУчетаОС.Активность)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокОСБУ.ОсновноеСредство,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ОССписанныеНаЗатратыОрганизацийОстатки.СтоимостьОстаток, 0) = 0
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК Списано
	        |ПОМЕСТИТЬ СписанныеОСБУ
	        |ИЗ
	        |	СписокОСБУ КАК СписокОСБУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОССписанныеНаЗатратыОрганизаций.Остатки КАК ОССписанныеНаЗатратыОрганизацийОстатки
	        |		ПО СписокОСБУ.ОсновноеСредство = ОССписанныеНаЗатратыОрганизацийОстатки.ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокОСБУ.ОсновноеСредство,
	        |	СписокОСБУ.НачислятьВТекущемМесяце,
	        |	СчетаУчетаБУ.СчетУчета,
	        |	СчетаУчетаБУ.СчетНачисленияАмортизации,
	        |	ПервоначальныеСведенияБУ.ИнвентарныйНомер,
	        |	НаправленияАмортизацииБУ.НаправлениеАмортизации,
	        |	ПараметрыАмортизацииБУ.Период,
	        |	ВЫБОР
	        |		КОГДА ПервоначальныеСведенияБУ.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ЕСТЬNULL(ГрафикиАмортизацииБУ.КоэффициентГрафика, 0) <> 0
	        |						ТОГДА ПараметрыАмортизацииБУ.СтоимостьДляВычисленияАмортизации / ПараметрыАмортизацииБУ.СрокИспользованияДляВычисленияАмортизации * 12 * ГрафикиАмортизацииБУ.КоэффициентГрафика
	        |					ИНАЧЕ ПараметрыАмортизацииБУ.СтоимостьДляВычисленияАмортизации / ПараметрыАмортизацииБУ.СрокИспользованияДляВычисленияАмортизации
	        |				КОНЕЦ
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК РасчетнаяАмортизация,
	        |	АмортизацияБУ.БалансоваяСтоимость - АмортизацияБУ.АмортизацияКонечныйОстаток КАК ДоступноДляСписания
	        |ПОМЕСТИТЬ РасчетАмортизацииБУ
	        |ИЗ
	        |	СписокОСБУ КАК СписокОСБУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписанныеОСБУ КАК СписанныеОСБУ
	        |		ПО СписокОСБУ.ОсновноеСредство = СписанныеОСБУ.ОсновноеСредство
	        |			И (НЕ СписанныеОСБУ.Списано)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АмортизацияБУ КАК АмортизацияБУ
	        |		ПО СписокОСБУ.ОсновноеСредство = АмортизацияБУ.ОсновноеСредство
	        |			И (АмортизацияБУ.АмортизацияОборот = 0)
	        |			И (АмортизацияБУ.СтоимостьНачальныйОстаток > АмортизацияБУ.АмортизацияНачальныйОстаток)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияБУ КАК ПервоначальныеСведенияБУ
	        |		ПО СписокОСБУ.ОсновноеСредство = ПервоначальныеСведенияБУ.ОсновноеСредство
	        |			И (ПервоначальныеСведенияБУ.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПустаяСсылка))
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыАмортизацииБУ КАК ПараметрыАмортизацииБУ
	        |		ПО СписокОСБУ.ОсновноеСредство = ПараметрыАмортизацииБУ.ОсновноеСредство
	        |			И (ПараметрыАмортизацииБУ.СрокИспользованияДляВычисленияАмортизации <> 0)
	        |			И (ПараметрыАмортизацииБУ.СтоимостьДляВычисленияАмортизации <> 0)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиАмортизацииБУ КАК ГрафикиАмортизацииБУ
	        |		ПО СписокОСБУ.ОсновноеСредство = ГрафикиАмортизацииБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НаправленияАмортизацииБУ КАК НаправленияАмортизацииБУ
	        |		ПО СписокОСБУ.ОсновноеСредство = НаправленияАмортизацииБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаУчетаБУ КАК СчетаУчетаБУ
	        |		ПО СписокОСБУ.ОсновноеСредство = СчетаУчетаБУ.ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	РасчетАмортизацииБУ.ОсновноеСредство,
	        |	РасчетАмортизацииБУ.СчетУчета,
	        |	РасчетАмортизацииБУ.СчетНачисленияАмортизации,
	        |	РасчетАмортизацииБУ.НаправлениеАмортизации,
	        |	ВЫРАЗИТЬ(ВЫБОР
	        |			КОГДА РасчетАмортизацииБУ.ДоступноДляСписания < 0
	        |				ТОГДА 0
	        |			ИНАЧЕ ВЫБОР
	        |					КОГДА РасчетАмортизацииБУ.РасчетнаяАмортизация < 0
	        |						ТОГДА 0
	        |					ИНАЧЕ ВЫБОР
	        |							КОГДА РасчетАмортизацииБУ.РасчетнаяАмортизация > РасчетАмортизацииБУ.ДоступноДляСписания
	        |								ТОГДА РасчетАмортизацииБУ.ДоступноДляСписания
	        |							ИНАЧЕ РасчетАмортизацииБУ.РасчетнаяАмортизация
	        |						КОНЕЦ
	        |				КОНЕЦ
	        |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаБУ,
	        |	РаспределениеЗатратПоНаправлениям.НомерСтроки,
	        |	РаспределениеЗатратПоНаправлениям.КоличествоСтрок,
	        |	РаспределениеЗатратПоНаправлениям.СуммаКоэффициентов,
	        |	РаспределениеЗатратПоНаправлениям.Коэффициент,
	        |	РаспределениеЗатратПоНаправлениям.СчетЗатрат,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконто1,
	        |	РаспределениеЗатратПоНаправлениям.Субконто1,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконто2,
	        |	РаспределениеЗатратПоНаправлениям.Субконто2,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконто3,
	        |	РаспределениеЗатратПоНаправлениям.Субконто3,
	        |	РаспределениеЗатратПоНаправлениям.СчетЗатратНУ,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ1,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ1,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ2,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ2,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ3,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ3,
	        |	РаспределениеЗатратПоНаправлениям.Подразделение,
	        |	РаспределениеЗатратПоНаправлениям.ПодразделениеОрганизации,
	        |	РаспределениеЗатратПоНаправлениям.СтатьяЗатрат,
	        |	РаспределениеЗатратПоНаправлениям.НоменклатурнаяГруппа,
	        |	РаспределениеЗатратПоНаправлениям.Продукция,
	        |	РаспределениеЗатратПоНаправлениям.СерияПродукции,
	        |	РаспределениеЗатратПоНаправлениям.ХарактеристикаПродукции,
	        |	РаспределениеЗатратПоНаправлениям.ОбъектСтроительства,
	        |	РаспределениеЗатратПоНаправлениям.СпособСтроительства,
	        |	РаспределениеЗатратПоНаправлениям.Проект,
	        |	РаспределениеЗатратПоНаправлениям.ХарактерЗатрат,
	        |	РаспределениеЗатратПоНаправлениям.ХарактерЗатратНУ,
	        |	РаспределениеЗатратПоНаправлениям.ЭтоПроизводственныеРасходы,
	        |	РаспределениеЗатратПоНаправлениям.ЭтоПроизводственныеРасходыНУ
	        |ПОМЕСТИТЬ ДанныеДляРаспределенияБУ
	        |ИЗ
	        |	РасчетАмортизацииБУ КАК РасчетАмортизацииБУ,
	        |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределениеЗатратПоНаправлениям КАК РаспределениеЗатратПоНаправлениям
			|	ПО РасчетАмортизацииБУ.НаправлениеАмортизации=РаспределениеЗатратПоНаправлениям.НаправлениеАмортизации
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляРаспределенияБУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	ДанныеДляРаспределенияБУ.НаправлениеАмортизации,
	        |	ДанныеДляРаспределенияБУ.НомерСтроки КАК НомерСтроки,
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияБУ.СуммаБУ * ДанныеДляРаспределенияБУ.Коэффициент / ДанныеДляРаспределенияБУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)) КАК СуммаБУ,
	        |	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ДанныеДляРаспределенияБУРаспределенная.СуммаБУ * ДанныеДляРаспределенияБУРаспределенная.Коэффициент / ДанныеДляРаспределенияБУРаспределенная.СуммаКоэффициентов КАК ЧИСЛО(15, 2))), 0) КАК СуммаБУРаспределенная
	        |ПОМЕСТИТЬ РаспределениеБУНарастающая
	        |ИЗ
	        |	ДанныеДляРаспределенияБУ КАК ДанныеДляРаспределенияБУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДляРаспределенияБУ КАК ДанныеДляРаспределенияБУРаспределенная
	        |		ПО ДанныеДляРаспределенияБУ.ОсновноеСредство = ДанныеДляРаспределенияБУРаспределенная.ОсновноеСредство
	        |			И ДанныеДляРаспределенияБУ.НомерСтроки > ДанныеДляРаспределенияБУРаспределенная.НомерСтроки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеДляРаспределенияБУ.ОсновноеСредство,
	        |	ДанныеДляРаспределенияБУ.НаправлениеАмортизации,
	        |	ДанныеДляРаспределенияБУ.НомерСтроки,
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияБУ.СуммаБУ * ДанныеДляРаспределенияБУ.Коэффициент / ДанныеДляРаспределенияБУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2))
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НомерСтроки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляРаспределенияБУ.ОсновноеСредство,
	        |	ДанныеДляРаспределенияБУ.СчетУчета,
	        |	ДанныеДляРаспределенияБУ.СчетНачисленияАмортизации,
	        |	ДанныеДляРаспределенияБУ.НаправлениеАмортизации,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляРаспределенияБУ.КоличествоСтрок = 1
	        |			ТОГДА ДанныеДляРаспределенияБУ.СуммаБУ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ДанныеДляРаспределенияБУ.НомерСтроки = ДанныеДляРаспределенияБУ.КоличествоСтрок
	        |					ТОГДА ДанныеДляРаспределенияБУ.СуммаБУ - РаспределениеБУНарастающая.СуммаБУРаспределенная
	        |				ИНАЧЕ РаспределениеБУНарастающая.СуммаБУ
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаБУ,
	        |	ДанныеДляРаспределенияБУ.СчетЗатрат,
	        |	ДанныеДляРаспределенияБУ.ВидСубконто1,
	        |	ДанныеДляРаспределенияБУ.Субконто1,
	        |	ДанныеДляРаспределенияБУ.ВидСубконто2,
	        |	ДанныеДляРаспределенияБУ.Субконто2,
	        |	ДанныеДляРаспределенияБУ.ВидСубконто3,
	        |	ДанныеДляРаспределенияБУ.Субконто3,
	        |	ДанныеДляРаспределенияБУ.СчетЗатратНУ,
	        |	ДанныеДляРаспределенияБУ.ВидСубконтоНУ1,
	        |	ДанныеДляРаспределенияБУ.СубконтоНУ1,
	        |	ДанныеДляРаспределенияБУ.ВидСубконтоНУ2,
	        |	ДанныеДляРаспределенияБУ.СубконтоНУ2,
	        |	ДанныеДляРаспределенияБУ.ВидСубконтоНУ3,
	        |	ДанныеДляРаспределенияБУ.СубконтоНУ3,
	        |	ДанныеДляРаспределенияБУ.Подразделение,
	        |	ДанныеДляРаспределенияБУ.ПодразделениеОрганизации,
	        |	ДанныеДляРаспределенияБУ.СтатьяЗатрат,
	        |	ДанныеДляРаспределенияБУ.НоменклатурнаяГруппа,
	        |	ДанныеДляРаспределенияБУ.Продукция,
	        |	ДанныеДляРаспределенияБУ.СерияПродукции,
	        |	ДанныеДляРаспределенияБУ.ХарактеристикаПродукции,
	        |	ДанныеДляРаспределенияБУ.ОбъектСтроительства,
	        |	ДанныеДляРаспределенияБУ.СпособСтроительства,
	        |	ДанныеДляРаспределенияБУ.Проект,
	        |	ДанныеДляРаспределенияБУ.ХарактерЗатрат,
	        |	ДанныеДляРаспределенияБУ.ХарактерЗатратНУ,
	        |	ДанныеДляРаспределенияБУ.ЭтоПроизводственныеРасходы,
	        |	ДанныеДляРаспределенияБУ.ЭтоПроизводственныеРасходыНУ
	        |ПОМЕСТИТЬ ТаблицаАмортизацииБУ
	        |ИЗ
	        |	ДанныеДляРаспределенияБУ КАК ДанныеДляРаспределенияБУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеБУНарастающая КАК РаспределениеБУНарастающая
	        |		ПО ДанныеДляРаспределенияБУ.ОсновноеСредство = РаспределениеБУНарастающая.ОсновноеСредство
	        |			И ДанныеДляРаспределенияБУ.НомерСтроки = РаспределениеБУНарастающая.НомерСтроки";
	
КонецФункции


Функция АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОрганизацииНУ()
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	ВложенныйЗапрос.НачислятьВТекущемМесяце КАК НачислятьВТекущемМесяце,
	        |	ВложенныйЗапрос.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
	        |	ВложенныйЗапрос.ОсновноеСредство.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	        |	ЕСТЬNULL(НормыАмортизации.НормаАмортизации, 0) КАК НормаАмортизации
	        |ПОМЕСТИТЬ СписокНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ЕСТЬNULL(НачислятьАмортизацию.ОсновноеСредство, НачислятьАмортизациюВТекущемМесяце.ОсновноеСредство) КАК ОсновноеСредство,
	        |		ВЫБОР
	        |			КОГДА НачислятьАмортизацию.ОсновноеСредство ЕСТЬ NULL 
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ КАК НачислятьВТекущемМесяце
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство
	        |		ИЗ
	        |			(ВЫБРАТЬ
	        |				ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |				ПериодыСреза.Период КАК Период,
	        |				МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |			ИЗ
	        |				(ВЫБРАТЬ
	        |					НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |					МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |				ИЗ
	        |					РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |				ГДЕ
	        |					НачислениеАмортизацииОСНалоговыйУчет.Период < &НачалоМесяца
	        |					И НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация
	        |					И НачислениеАмортизацииОСНалоговыйУчет.Активность
	        |				
	        |				СГРУППИРОВАТЬ ПО
	        |					НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство) КАК ПериодыСреза
	        |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |						И ПериодыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |			
	        |			СГРУППИРОВАТЬ ПО
	        |				ПериодыСреза.ОсновноеСредство,
	        |				ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |				ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |					И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |					И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСНалоговыйУчет.Регистратор
	        |					И (НачислениеАмортизацииОСНалоговыйУчет.НачислятьАмортизацию)) КАК НачислятьАмортизацию
	        |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |				ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство
	        |			ИЗ
	        |				(ВЫБРАТЬ
	        |					ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |					ПериодыСреза.Период КАК Период,
	        |					МИНИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |				ИЗ
	        |					(ВЫБРАТЬ
	        |						НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |						МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |					ИЗ
	        |						РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ГДЕ
	        |						НачислениеАмортизацииОСНалоговыйУчет.Период >= &НачалоМесяца
	        |						И НачислениеАмортизацииОСНалоговыйУчет.Период <= &КонецМесяца
	        |						И НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация
	        |						И НачислениеАмортизацииОСНалоговыйУчет.Активность
	        |					
	        |					СГРУППИРОВАТЬ ПО
	        |						НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство) КАК ПериодыСреза
	        |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |						ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |							И ПериодыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |				
	        |				СГРУППИРОВАТЬ ПО
	        |					ПериодыСреза.ОсновноеСредство,
	        |					ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |						И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |						И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСНалоговыйУчет.Регистратор
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.НачислятьАмортизациюВТекущемМесяце)) КАК НачислятьАмортизациюВТекущемМесяце
	        |			ПО НачислятьАмортизацию.ОсновноеСредство = НачислятьАмортизациюВТекущемМесяце.ОсновноеСредство) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НормыАмортизации КАК НормыАмортизации
	        |		ПО ВложенныйЗапрос.ОсновноеСредство.АмортизационнаяГруппа = НормыАмортизации.АмортизационнаяГруппа
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НачислятьВТекущемМесяце";
	
КонецФункции

Функция АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОдномуНУ()
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	ВложенныйЗапрос.НачислятьВТекущемМесяце КАК НачислятьВТекущемМесяце,
	        |	ВложенныйЗапрос.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
	        |	ВложенныйЗапрос.ОсновноеСредство.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	        |	ЕСТЬNULL(НормыАмортизации.НормаАмортизации, 0) КАК НормаАмортизации
	        |ПОМЕСТИТЬ СписокНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ЕСТЬNULL(НачислятьАмортизацию.ОсновноеСредство, НачислятьАмортизациюВТекущемМесяце.ОсновноеСредство) КАК ОсновноеСредство,
	        |		ВЫБОР
	        |			КОГДА НачислятьАмортизацию.ОсновноеСредство ЕСТЬ NULL 
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ КАК НачислятьВТекущемМесяце
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство
	        |		ИЗ
	        |			(ВЫБРАТЬ
	        |				ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |				ПериодыСреза.Период КАК Период,
	        |				МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |			ИЗ
	        |				(ВЫБРАТЬ
	        |					НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |					МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |				ИЗ
	        |					РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |				ГДЕ
	        |					НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство = &ОсновноеСредство
	        |					И НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация
	        |					И НачислениеАмортизацииОСНалоговыйУчет.Период < &НачалоМесяца
	        |					И НачислениеАмортизацииОСНалоговыйУчет.Активность
	        |				
	        |				СГРУППИРОВАТЬ ПО
	        |					НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство) КАК ПериодыСреза
	        |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |						И ПериодыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |			
	        |			СГРУППИРОВАТЬ ПО
	        |				ПериодыСреза.ОсновноеСредство,
	        |				ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |				ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |					И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |					И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСНалоговыйУчет.Регистратор
	        |					И (НачислениеАмортизацииОСНалоговыйУчет.НачислятьАмортизацию)) КАК НачислятьАмортизацию
	        |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |				ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство
	        |			ИЗ
	        |				(ВЫБРАТЬ
	        |					ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |					ПериодыСреза.Период КАК Период,
	        |					МИНИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |				ИЗ
	        |					(ВЫБРАТЬ
	        |						НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |						МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |					ИЗ
	        |						РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ГДЕ
	        |						НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство = &ОсновноеСредство
	        |						И НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация
	        |						И НачислениеАмортизацииОСНалоговыйУчет.Период >= &НачалоМесяца
	        |						И НачислениеАмортизацииОСНалоговыйУчет.Период <= &КонецМесяца
	        |						И НачислениеАмортизацииОСНалоговыйУчет.Активность
	        |					
	        |					СГРУППИРОВАТЬ ПО
	        |						НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство) КАК ПериодыСреза
	        |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |						ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |							И ПериодыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |				
	        |				СГРУППИРОВАТЬ ПО
	        |					ПериодыСреза.ОсновноеСредство,
	        |					ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |						И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |						И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСНалоговыйУчет.Регистратор
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.НачислятьАмортизациюВТекущемМесяце)) КАК НачислятьАмортизациюВТекущемМесяце
	        |			ПО НачислятьАмортизацию.ОсновноеСредство = НачислятьАмортизациюВТекущемМесяце.ОсновноеСредство) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НормыАмортизации КАК НормыАмортизации
	        |		ПО ВложенныйЗапрос.ОсновноеСредство.АмортизационнаяГруппа = НормыАмортизации.АмортизационнаяГруппа
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НачислятьВТекущемМесяце";
	
КонецФункции

Функция АмортизацияОС_ПолучитьТекстЗапросаСписокОСПоОтборуНУ()
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	ВложенныйЗапрос.НачислятьВТекущемМесяце КАК НачислятьВТекущемМесяце,
	        |	ВложенныйЗапрос.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
	        |	ВложенныйЗапрос.ОсновноеСредство.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	        |	ЕСТЬNULL(НормыАмортизации.НормаАмортизации, 0) КАК НормаАмортизации
	        |ПОМЕСТИТЬ СписокНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ЕСТЬNULL(НачислятьАмортизацию.ОсновноеСредство, НачислятьАмортизациюВТекущемМесяце.ОсновноеСредство) КАК ОсновноеСредство,
	        |		ВЫБОР
	        |			КОГДА НачислятьАмортизацию.ОсновноеСредство ЕСТЬ NULL 
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ КАК НачислятьВТекущемМесяце
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство
	        |		ИЗ
	        |			(ВЫБРАТЬ
	        |				ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |				ПериодыСреза.Период КАК Период,
	        |				МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |			ИЗ
	        |				(ВЫБРАТЬ
	        |					НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |					МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |				ИЗ
	        |					ПредварительныйСписокОС КАК ПредварительныйСписокОС
	        |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |						ПО ПредварительныйСписокОС.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Период < &НачалоМесяца)
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |				
	        |				СГРУППИРОВАТЬ ПО
	        |					НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство) КАК ПериодыСреза
	        |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |						И ПериодыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |			
	        |			СГРУППИРОВАТЬ ПО
	        |				ПериодыСреза.ОсновноеСредство,
	        |				ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |				ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |					И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |					И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСНалоговыйУчет.Регистратор
	        |					И (НачислениеАмортизацииОСНалоговыйУчет.НачислятьАмортизацию)) КАК НачислятьАмортизацию
	        |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |				ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство
	        |			ИЗ
	        |				(ВЫБРАТЬ
	        |					ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |					ПериодыСреза.Период КАК Период,
	        |					МИНИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |				ИЗ
	        |					(ВЫБРАТЬ
	        |						НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |						МАКСИМУМ(НачислениеАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |					ИЗ
	        |						ПредварительныйСписокОС КАК ПредварительныйСписокОС
	        |							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |							ПО ПредварительныйСписокОС.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |								И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |								И (НачислениеАмортизацииОСНалоговыйУчет.Период >= &НачалоМесяца)
	        |								И (НачислениеАмортизацииОСНалоговыйУчет.Период <= &КонецМесяца)
	        |								И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |					
	        |					СГРУППИРОВАТЬ ПО
	        |						НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство) КАК ПериодыСреза
	        |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |						ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |							И ПериодыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |							И (НачислениеАмортизацииОСНалоговыйУчет.Активность)
	        |				
	        |				СГРУППИРОВАТЬ ПО
	        |					ПериодыСреза.ОсновноеСредство,
	        |					ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет КАК НачислениеАмортизацииОСНалоговыйУчет
	        |					ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |						И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСНалоговыйУчет.Период
	        |						И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСНалоговыйУчет.Регистратор
	        |						И (НачислениеАмортизацииОСНалоговыйУчет.НачислятьАмортизациюВТекущемМесяце)) КАК НачислятьАмортизациюВТекущемМесяце
	        |			ПО НачислятьАмортизацию.ОсновноеСредство = НачислятьАмортизациюВТекущемМесяце.ОсновноеСредство) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НормыАмортизации КАК НормыАмортизации
	        |		ПО ВложенныйЗапрос.ОсновноеСредство.АмортизационнаяГруппа = НормыАмортизации.АмортизационнаяГруппа
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НачислятьВТекущемМесяце";
	
КонецФункции
		
Функция АмортизацияОС_ПолучитьТекстЗапросаНачисленияАмортизацииНУ()
	
	Возврат "ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	ПервоначальныеСведенияОСНалоговыйУчет.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	        |	ПервоначальныеСведенияОСНалоговыйУчет.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	        |	ПервоначальныеСведенияОСНалоговыйУчет.СтоимостьДо2002 КАК СтоимостьДо2002,
	        |	ПервоначальныеСведенияОСНалоговыйУчет.АмортизацияДо2002 КАК АмортизацияДо2002,
	        |	ПервоначальныеСведенияОСНалоговыйУчет.ПорядокВключенияСтоимостиВСоставРасходов КАК ПорядокВключенияСтоимостиВСоставРасходов,
	        |	ПериодыРегистраторыСреза.Период КАК ДатаПринятияКУчету
	        |ПОМЕСТИТЬ ПервоначальныеСведенияНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(ПервоначальныеСведенияОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(ПервоначальныеСведенияОСНалоговыйУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведенияОСНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство
	        |					И (ПервоначальныеСведенияОСНалоговыйУчет.Организация = &Организация)
	        |					И (ПервоначальныеСведенияОСНалоговыйУчет.Период < &НачалоМесяца)
	        |					И (НЕ СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство,
	        |			МАКСИМУМ(ПервоначальныеСведенияОСНалоговыйУчет.Период)
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведенияОСНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство
	        |					И (ПервоначальныеСведенияОСНалоговыйУчет.Организация = &Организация)
	        |					И (ПервоначальныеСведенияОСНалоговыйУчет.Период >= &НачалоМесяца)
	        |					И (ПервоначальныеСведенияОСНалоговыйУчет.Период <= &КонецМесяца)
	        |					И (СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведенияОСНалоговыйУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство
	        |				И (ПервоначальныеСведенияОСНалоговыйУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = ПервоначальныеСведенияОСНалоговыйУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведенияОСНалоговыйУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство
	        |			И (ПервоначальныеСведенияОСНалоговыйУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = ПервоначальныеСведенияОСНалоговыйУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = ПервоначальныеСведенияОСНалоговыйУчет.Регистратор
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	ПараметрыАмортизацииОСНалоговыйУчет.СрокПолезногоИспользования,
	        |	ПараметрыАмортизацииОСНалоговыйУчет.СрокИспользованияДляВычисленияАмортизации,
	        |	ПараметрыАмортизацииОСНалоговыйУчет.СтоимостьДляВычисленияАмортизации,
	        |	ПараметрыАмортизацииОСНалоговыйУчет.ПРДляВычисленияАмортизации
	        |ПОМЕСТИТЬ ПараметрыАмортизацииНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(ПараметрыАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(ПараметрыАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет КАК ПараметрыАмортизацииОСНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = ПараметрыАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |					И (ПараметрыАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |					И (ПараметрыАмортизацииОСНалоговыйУчет.Период < &НачалоМесяца)
	        |					И (НЕ СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство,
	        |			МАКСИМУМ(ПараметрыАмортизацииОСНалоговыйУчет.Период)
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет КАК ПараметрыАмортизацииОСНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = ПараметрыАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |					И (ПараметрыАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |					И (ПараметрыАмортизацииОСНалоговыйУчет.Период >= &НачалоМесяца)
	        |					И (ПараметрыАмортизацииОСНалоговыйУчет.Период <= &КонецМесяца)
	        |					И (СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет КАК ПараметрыАмортизацииОСНалоговыйУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = ПараметрыАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |				И (ПараметрыАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = ПараметрыАмортизацииОСНалоговыйУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет КАК ПараметрыАмортизацииОСНалоговыйУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = ПараметрыАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |			И (ПараметрыАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = ПараметрыАмортизацииОСНалоговыйУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = ПараметрыАмортизацииОСНалоговыйУчет.Регистратор
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	ИСТИНА КАК ЧастичнаяПродажа
	        |ПОМЕСТИТЬ ЧастичнаяПродажаНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |		ВЫРАЗИТЬ(ПараметрыАмортизацииОСНалоговыйУчет.Регистратор КАК Документ.ПередачаОС) КАК ДокументПередачи
	        |	ИЗ
	        |		СписокНУ КАК СписокНУ
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет КАК ПараметрыАмортизацииОСНалоговыйУчет
	        |			ПО СписокНУ.ОсновноеСредство = ПараметрыАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |				И (ПараметрыАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |				И (ПараметрыАмортизацииОСНалоговыйУчет.Период >= &НачалоМесяца)
	        |				И (ПараметрыАмортизацииОСНалоговыйУчет.Период <= &КонецМесяца)
	        |				И (ПараметрыАмортизацииОСНалоговыйУчет.Регистратор ССЫЛКА Документ.ПередачаОС)) КАК ВложенныйЗапрос
	        |ГДЕ
	        |	ВложенныйЗапрос.ДокументПередачи.абс_ЧастичнаяПродажа
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтоимостьОСНалоговыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтоимостьОСНалоговыйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |				ТОГДА СтоимостьОСНалоговыйУчет.Стоимость
	        |			ИНАЧЕ -СтоимостьОСНалоговыйУчет.Стоимость
	        |		КОНЕЦ) КАК СтоимостьОборот,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтоимостьОСНалоговыйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |				ТОГДА СтоимостьОСНалоговыйУчет.Амортизация
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК АмортизацияПриход,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтоимостьОСНалоговыйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	        |				ТОГДА СтоимостьОСНалоговыйУчет.Амортизация
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК АмортизацияРасход,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтоимостьОСНалоговыйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |				ТОГДА СтоимостьОСНалоговыйУчет.СтоимостьПР
	        |			ИНАЧЕ -СтоимостьОСНалоговыйУчет.СтоимостьПР
	        |		КОНЕЦ) КАК СтоимостьПРОборот,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтоимостьОСНалоговыйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |				ТОГДА СтоимостьОСНалоговыйУчет.СтоимостьВР
	        |			ИНАЧЕ -СтоимостьОСНалоговыйУчет.СтоимостьВР
	        |		КОНЕЦ) КАК СтоимостьВРОборот,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтоимостьОСНалоговыйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |				ТОГДА СтоимостьОСНалоговыйУчет.АмортизацияПР
	        |			ИНАЧЕ -СтоимостьОСНалоговыйУчет.АмортизацияПР
	        |		КОНЕЦ) КАК АмортизацияПРОборот,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтоимостьОСНалоговыйУчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |				ТОГДА СтоимостьОСНалоговыйУчет.АмортизацияВР
	        |			ИНАЧЕ -СтоимостьОСНалоговыйУчет.АмортизацияВР
	        |		КОНЕЦ) КАК АмортизацияВРОборот
	        |ПОМЕСТИТЬ СтоимостьОСНУОборот
	        |ИЗ
	        |	РегистрНакопления.СтоимостьОСНалоговыйУчет КАК СтоимостьОСНалоговыйУчет
	        |ГДЕ
	        |	СтоимостьОСНалоговыйУчет.Организация = &Организация
	        |	И СтоимостьОСНалоговыйУчет.Период >= &НачалоМесяца
	        |	И СтоимостьОСНалоговыйУчет.Период <= &КонецМесяца
	        |	И СтоимостьОСНалоговыйУчет.Активность
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтоимостьОСНалоговыйУчет.ОсновноеСредство
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	ЕСТЬNULL(СтоимостьОСНУОборот.АмортизацияПриход, 0) - ЕСТЬNULL(СтоимостьОСНУОборот.АмортизацияРасход, 0) КАК АмортизацияВМесяце,
	        |	ВЫБОР
	        |		КОГДА СписокНУ.НачислятьВТекущемМесяце
	        |			ТОГДА ЕСТЬNULL(СтоимостьОСНУОборот.СтоимостьОборот, 0)
	        |		ИНАЧЕ ЕСТЬNULL(СтоимостьОСНалоговыйУчетОстатки.СтоимостьОстаток, 0)
	        |	КОНЕЦ КАК СтоимостьНаНачалоМесяца,
	        |	ЕСТЬNULL(СтоимостьОСНалоговыйУчетОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(СтоимостьОСНУОборот.СтоимостьОборот, 0) КАК СтоимостьНаКонецМесяца,
	        |	ВЫБОР
	        |		КОГДА СписокНУ.НачислятьВТекущемМесяце
	        |			ТОГДА ЕСТЬNULL(СтоимостьОСНУОборот.АмортизацияПриход, 0) - ЕСТЬNULL(СтоимостьОСНУОборот.АмортизацияРасход, 0)
	        |		ИНАЧЕ ЕСТЬNULL(СтоимостьОСНалоговыйУчетОстатки.АмортизацияОстаток, 0)
	        |	КОНЕЦ КАК АмортизацияНачальныйОстаток,
	        |	ЕСТЬNULL(СтоимостьОСНалоговыйУчетОстатки.АмортизацияОстаток, 0) + ЕСТЬNULL(СтоимостьОСНУОборот.АмортизацияПриход, 0) - ЕСТЬNULL(СтоимостьОСНУОборот.АмортизацияРасход, 0) КАК АмортизацияКонечныйОстаток
	        |ПОМЕСТИТЬ АмортизацияНУ
	        |ИЗ
	        |	СписокНУ КАК СписокНУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОСНалоговыйУчет.Остатки(&НачалоПериода, Организация = &Организация) КАК СтоимостьОСНалоговыйУчетОстатки
	        |		ПО СписокНУ.ОсновноеСредство = СтоимостьОСНалоговыйУчетОстатки.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОСНУОборот КАК СтоимостьОСНУОборот
	        |		ПО СписокНУ.ОсновноеСредство = СтоимостьОСНУОборот.ОсновноеСредство
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	СчетаНалоговогоУчетаОС.СчетУчета,
	        |	СчетаНалоговогоУчетаОС.СчетНачисленияАмортизации
	        |ПОМЕСТИТЬ СчетаУчетаНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |		МАКСИМУМ(СчетаНалоговогоУчетаОС.Период) КАК Период
	        |	ИЗ
	        |		СписокНУ КАК СписокНУ
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаНалоговогоУчетаОС КАК СчетаНалоговогоУчетаОС
	        |			ПО СписокНУ.ОсновноеСредство = СчетаНалоговогоУчетаОС.ОсновноеСредство
	        |				И (СчетаНалоговогоУчетаОС.Организация = &Организация)
	        |				И (СчетаНалоговогоУчетаОС.Период <= &КонецМесяца)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		СписокНУ.ОсновноеСредство) КАК ПериодыСреза
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаНалоговогоУчетаОС КАК СчетаНалоговогоУчетаОС
	        |		ПО ПериодыСреза.ОсновноеСредство = СчетаНалоговогоУчетаОС.ОсновноеСредство
	        |			И (СчетаНалоговогоУчетаОС.Организация = &Организация)
	        |			И ПериодыСреза.Период = СчетаНалоговогоУчетаОС.Период
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.СпециальныйКоэффициент
	        |ПОМЕСТИТЬ СпециальныйКоэффициентНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет КАК НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Организация = &Организация)
	        |					И (НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Период < &НачалоМесяца)
	        |					И (НЕ СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Период)
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет КАК НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Организация = &Организация)
	        |					И (НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Период >= &НачалоМесяца)
	        |					И (НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Период <= &КонецМесяца)
	        |					И (СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет КАК НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.ОсновноеСредство
	        |				И (НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет КАК НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.ОсновноеСредство
	        |			И (НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Регистратор
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.ПризнакНачисленияПоБазовойСтоимости,
	        |	НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.СуммаНакопленнойАмортизации,
	        |	НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.ФактическийСрокполезногоИспользования
	        |ПОМЕСТИТЬ НачислениеПоБазовойСтоимостиНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет КАК НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Организация = &Организация)
	        |					И (НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Период < &НачалоМесяца)
	        |					И (НЕ СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство,
	        |			МАКСИМУМ(НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Период)
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет КАК НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.ОсновноеСредство
	        |					И (НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Организация = &Организация)
	        |					И (НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Период >= &НачалоМесяца)
	        |					И (НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Период <= &КонецМесяца)
	        |					И (СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет КАК НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.ОсновноеСредство
	        |				И (НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет КАК НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.ОсновноеСредство
	        |			И (НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = НачислениеАмортизацииОСПоБазовойСтоимостиНалоговыйУчет.Регистратор
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.СпособыОтраженияРасходовПоАмортизации
	        |ПОМЕСТИТЬ СпособыОтраженияНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Период) КАК Период
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет КАК СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Период < &НачалоМесяца)
	        |					И (НЕ СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			СписокНУ.ОсновноеСредство,
	        |			МАКСИМУМ(СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Период)
	        |		ИЗ
	        |			СписокНУ КАК СписокНУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет КАК СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет
	        |				ПО СписокНУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Период >= &НачалоМесяца)
	        |					И (СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Период <= &КонецМесяца)
	        |					И (СписокНУ.НачислятьВТекущемМесяце)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			СписокНУ.ОсновноеСредство) КАК ПериодыСреза
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет КАК СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет
	        |			ПО ПериодыСреза.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |				И (СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |				И ПериодыСреза.Период = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет КАК СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет
	        |		ПО ПериодыРегистраторыСреза.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.ОсновноеСредство
	        |			И (СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Организация = &Организация)
	        |			И ПериодыРегистраторыСреза.Период = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Период
	        |			И ПериодыРегистраторыСреза.Регистратор = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.Регистратор
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	ЕСТЬNULL(НалоговыйОстатки.СуммаОстатокДт, 0) КАК СуммаКапитальныхВложенийВключаемыхВРасходы
	        |ПОМЕСТИТЬ КапитальныеВложенияНУ
	        |ИЗ
	        |	СписокНУ КАК СписокНУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Налоговый.Остатки(&НачалоПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.РасходыНаКапитальныеВложения), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), Организация = &Организация) КАК НалоговыйОстатки
	        |		ПО СписокНУ.ОсновноеСредство = НалоговыйОстатки.Субконто1
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	УчетнаяПолитикаОрганизацийСрезПоследних.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ
	        |ПОМЕСТИТЬ УчетнаяПолитикаОрганизацийСрезПоследних
	        |ИЗ
	        |	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&НачалоПериодаУчетнойПолитики, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	СостоянияОСОрганизаций.ДатаСостояния
	        |ПОМЕСТИТЬ ВводВЭксплуатациюНУ
	        |ИЗ
	        |	СписокНУ КАК СписокНУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	        |		ПО СписокНУ.ОсновноеСредство = СостоянияОСОрганизаций.ОсновноеСредство
	        |			И (СостоянияОСОрганизаций.Организация = &Организация)
	        |			И (СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию))
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокНУ.ОсновноеСредство КАК ОсновноеСредство
	        |ПОМЕСТИТЬ ОССНачальнойСтоимостьюНУ
	        |ИЗ
	        |	СписокНУ КАК СписокНУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНУ КАК ПервоначальныеСведенияНУ
	        |		ПО СписокНУ.ОсновноеСредство = ПервоначальныеСведенияНУ.ОсновноеСредство
	        |ГДЕ
	        |	НЕ(СписокНУ.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	        |					И СписокНУ.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	        |				ИЛИ СписокНУ.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа))
	        |	И ВЫБОР
	        |			КОГДА &ГодПереходаКЛинейномуМетоду = 2009
	        |				ТОГДА ПервоначальныеСведенияНУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОССНачальнойСтоимостьюНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	СтоимостьОСНалоговыйУчетОстатки.АмортизацияОстаток КАК АмортизацияНачальныйОстаток
	        |ПОМЕСТИТЬ АмортизацияОСПриПереходеКЛинейномуМетоду
	        |ИЗ
	        |	ОССНачальнойСтоимостьюНУ КАК ОССНачальнойСтоимостьюНУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОСНалоговыйУчет.Остатки(&ДатаПереходаКЛинейномуМетоду, Организация = &Организация) КАК СтоимостьОСНалоговыйУчетОстатки
	        |		ПО ОССНачальнойСтоимостьюНУ.ОсновноеСредство = СтоимостьОСНалоговыйУчетОстатки.ОсновноеСредство
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	СписокНУ.АмортизационнаяГруппа,
	        |	СчетаУчетаНУ.СчетУчета,
	        |	СчетаУчетаНУ.СчетНачисленияАмортизации,
	        |	ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокПолезногоИспользования, 0) КАК СрокПолезногоИспользования,
	        |	ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокИспользованияДляВычисленияАмортизации, 0) КАК СрокИспользованияДляВычисленияАмортизации,
	        |	ЕСТЬNULL(ПараметрыАмортизацииНУ.СтоимостьДляВычисленияАмортизации, 0) КАК СтоимостьДляВычисленияАмортизации,
	        |	ЕСТЬNULL(ПараметрыАмортизацииНУ.ПРДляВычисленияАмортизации, 0) КАК ПРДляВычисленияАмортизации,
	        |	ЕСТЬNULL(АмортизацияОСПриПереходеКЛинейномуМетоду.АмортизацияНачальныйОстаток, 0) КАК АмортизацияПриПереходеКЛинейномуМетоду,
	        |	ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокПолезногоИспользования, 0) - ((&ГодПереходаКЛинейномуМетоду - ГОД(ВводВЭксплуатациюНУ.ДатаСостояния)) * 12 + (&МесяцПереходаКЛинейномуМетоду - МЕСЯЦ(ВводВЭксплуатациюНУ.ДатаСостояния))) + 1 КАК ОстатокСрокаПриПереходеКЛинейномуМетоду,
	        |	ВЫБОР
	        |		КОГДА ОССНачальнойСтоимостьюНУ.ОсновноеСредство ЕСТЬ NULL 
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ПереходКЛинейномуМетоду,
	        |	ВЫБОР
	        |		КОГДА СписокНУ.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	        |					И СписокНУ.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	        |				ИЛИ СписокНУ.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	        |		ИНАЧЕ УчетнаяПолитикаОрганизацийСрезПоследних.МетодНачисленияАмортизацииНУ
	        |	КОНЕЦ КАК МетодНачисленияАмортизации,
	        |	ПервоначальныеСведенияНУ.ДатаПринятияКУчету,
	        |	АмортизацияНУ.АмортизацияВМесяце КАК АмортизацияВМесяце,
	        |	АмортизацияНУ.СтоимостьНаНачалоМесяца КАК СтоимостьНаНачалоМесяца,
	        |	АмортизацияНУ.СтоимостьНаКонецМесяца КАК СтоимостьНаКонецМесяца,
	        |	АмортизацияНУ.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	        |	АмортизацияНУ.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	        |	НачислениеПоБазовойСтоимостиНУ.ПризнакНачисленияПоБазовойСтоимости,
	        |	ЕСТЬNULL(НачислениеПоБазовойСтоимостиНУ.СуммаНакопленнойАмортизации, 0) КАК СуммаНакопленнойАмортизации,
	        |	ЕСТЬNULL(НачислениеПоБазовойСтоимостиНУ.ФактическийСрокполезногоИспользования, 0) КАК ФактическийСрокПолезногоИспользования,
	        |	СпособыОтраженияНУ.СпособыОтраженияРасходовПоАмортизации КАК НаправлениеАмортизации,
	        |	ЕСТЬNULL(КапитальныеВложенияНУ.СуммаКапитальныхВложенийВключаемыхВРасходы, 0) КАК СуммаКапитальныхВложенийВключаемыхВРасходы,
	        |	ЕСТЬNULL(СпециальныйКоэффициентНУ.СпециальныйКоэффициент, 0) КАК СпециальныйКоэффициент,
	        |	СписокНУ.НормаАмортизации,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ПараметрыАмортизацииНУ.СтоимостьДляВычисленияАмортизации, 0) = 0
	        |			ТОГДА АмортизацияНУ.СтоимостьНаНачалоМесяца - ЕСТЬNULL(КапитальныеВложенияНУ.СуммаКапитальныхВложенийВключаемыхВРасходы, 0) - ВЫБОР
	        |					КОГДА ОССНачальнойСтоимостьюНУ.ОсновноеСредство ЕСТЬ NULL 
	        |						ТОГДА 0
	        |					ИНАЧЕ ЕСТЬNULL(АмортизацияОСПриПереходеКЛинейномуМетоду.АмортизацияНачальныйОстаток, 0)
	        |				КОНЕЦ
	        |		ИНАЧЕ ПараметрыАмортизацииНУ.СтоимостьДляВычисленияАмортизации
	        |	КОНЕЦ КАК СтоимостьДляНачисления,
	        |	ВЫБОР
	        |		КОГДА ОССНачальнойСтоимостьюНУ.ОсновноеСредство ЕСТЬ NULL 
	        |			ТОГДА ВЫБОР
	        |					КОГДА ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокПолезногоИспользования, 1) = 0
	        |						ТОГДА 1
	        |					ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокПолезногоИспользования, 1)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокПолезногоИспользования, 0) - ((&ГодПереходаКЛинейномуМетоду - ГОД(ВводВЭксплуатациюНУ.ДатаСостояния)) * 12 + (&МесяцПереходаКЛинейномуМетоду - МЕСЯЦ(ВводВЭксплуатациюНУ.ДатаСостояния))) + 1 > 0
	        |					ТОГДА ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокПолезногоИспользования, 0) - ((&ГодПереходаКЛинейномуМетоду - ГОД(ВводВЭксплуатациюНУ.ДатаСостояния)) * 12 + (&МесяцПереходаКЛинейномуМетоду - МЕСЯЦ(ВводВЭксплуатациюНУ.ДатаСостояния))) + 1
	        |				ИНАЧЕ 1
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СрокИспользованияДляНачисления
	        |ПОМЕСТИТЬ ДанныеДляНачисленияНУ
	        |ИЗ
	        |	СписокНУ КАК СписокНУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНУ КАК ПервоначальныеСведенияНУ
	        |		ПО СписокНУ.ОсновноеСредство = ПервоначальныеСведенияНУ.ОсновноеСредство
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаУчетаНУ КАК СчетаУчетаНУ
	        |		ПО СписокНУ.ОсновноеСредство = СчетаУчетаНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНУ КАК ПараметрыАмортизацииНУ
	        |		ПО СписокНУ.ОсновноеСредство = ПараметрыАмортизацииНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОСПриПереходеКЛинейномуМетоду КАК АмортизацияОСПриПереходеКЛинейномуМетоду
	        |		ПО СписокНУ.ОсновноеСредство = АмортизацияОСПриПереходеКЛинейномуМетоду.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВводВЭксплуатациюНУ КАК ВводВЭксплуатациюНУ
	        |		ПО СписокНУ.ОсновноеСредство = ВводВЭксплуатациюНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОССНачальнойСтоимостьюНУ КАК ОССНачальнойСтоимостьюНУ
	        |		ПО СписокНУ.ОсновноеСредство = ОССНачальнойСтоимостьюНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаОрганизацийСрезПоследних КАК УчетнаяПолитикаОрганизацийСрезПоследних
	        |		ПО (ИСТИНА)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НачислениеПоБазовойСтоимостиНУ КАК НачислениеПоБазовойСтоимостиНУ
	        |		ПО СписокНУ.ОсновноеСредство = НачислениеПоБазовойСтоимостиНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияНУ КАК СпособыОтраженияНУ
	        |		ПО СписокНУ.ОсновноеСредство = СпособыОтраженияНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ КапитальныеВложенияНУ КАК КапитальныеВложенияНУ
	        |		ПО СписокНУ.ОсновноеСредство = КапитальныеВложенияНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЧастичнаяПродажаНУ КАК ЧестичнаяПродажаНУ
	        |		ПО СписокНУ.ОсновноеСредство = ЧестичнаяПродажаНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СпециальныйКоэффициентНУ КАК СпециальныйКоэффициентНУ
	        |		ПО СписокНУ.ОсновноеСредство = СпециальныйКоэффициентНУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНУ КАК АмортизацияНУ
	        |		ПО СписокНУ.ОсновноеСредство = АмортизацияНУ.ОсновноеСредство
	        |ГДЕ
	        |	ЧестичнаяПродажаНУ.ОсновноеСредство ЕСТЬ NULL 
	        |	И АмортизацияНУ.АмортизацияВМесяце <= 0
	        |	И АмортизацияНУ.СтоимостьНаНачалоМесяца > 0
	        |	И АмортизацияНУ.СтоимостьНаНачалоМесяца > АмортизацияНУ.АмортизацияНачальныйОстаток
	        |	И (ПервоначальныеСведенияНУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	        |				И ЕСТЬNULL(ПараметрыАмортизацииНУ.СрокПолезногоИспользования, 0) > 0
	        |			ИЛИ СписокНУ.АмортизационнаяГруппа <> ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляНачисленияНУ.ОсновноеСредство,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляНачисленияНУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	        |			ТОГДА ДанныеДляНачисленияНУ.СтоимостьДляНачисления / ДанныеДляНачисленияНУ.СрокИспользованияДляНачисления * ВЫБОР
	        |					КОГДА ДанныеДляНачисленияНУ.СпециальныйКоэффициент = 0
	        |						ТОГДА 1
	        |					ИНАЧЕ ДанныеДляНачисленияНУ.СпециальныйКоэффициент
	        |				КОНЕЦ
	        |		ИНАЧЕ (ДанныеДляНачисленияНУ.СтоимостьНаНачалоМесяца - ДанныеДляНачисленияНУ.АмортизацияНачальныйОстаток - ДанныеДляНачисленияНУ.СуммаКапитальныхВложенийВключаемыхВРасходы) * ДанныеДляНачисленияНУ.НормаАмортизации / 100 * ВЫБОР
	        |				КОГДА ДанныеДляНачисленияНУ.СпециальныйКоэффициент = 0
	        |					ТОГДА 1
	        |				ИНАЧЕ ДанныеДляНачисленияНУ.СпециальныйКоэффициент
	        |			КОНЕЦ
	        |	КОНЕЦ КАК Начисление,
	        |	ДанныеДляНачисленияНУ.СтоимостьНаКонецМесяца - ДанныеДляНачисленияНУ.АмортизацияКонечныйОстаток КАК ДоступноДляСписания,
	        |	ДанныеДляНачисленияНУ.СчетУчета,
	        |	ДанныеДляНачисленияНУ.СчетНачисленияАмортизации,
	        |	ДанныеДляНачисленияНУ.НаправлениеАмортизации,
	        |	ДанныеДляНачисленияНУ.СуммаКапитальныхВложенийВключаемыхВРасходы,
	        |	ДанныеДляНачисленияНУ.СтоимостьДляНачисления,
	        |	ДанныеДляНачисленияНУ.СрокИспользованияДляНачисления
	        |ПОМЕСТИТЬ РасчетАмортизацииНУ
	        |ИЗ
	        |	ДанныеДляНачисленияНУ КАК ДанныеДляНачисленияНУ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	РасчетАмортизацииНУ.ОсновноеСредство,
	        |	РасчетАмортизацииНУ.СчетУчета,
	        |	РасчетАмортизацииНУ.СчетНачисленияАмортизации,
	        |	РасчетАмортизацииНУ.НаправлениеАмортизации,
	        |	РасчетАмортизацииНУ.СуммаКапитальныхВложенийВключаемыхВРасходы,
	        |	ВЫРАЗИТЬ(ВЫБОР
	        |			КОГДА РасчетАмортизацииНУ.ДоступноДляСписания > 0
	        |				ТОГДА ВЫБОР
	        |						КОГДА РасчетАмортизацииНУ.ДоступноДляСписания > РасчетАмортизацииНУ.Начисление
	        |							ТОГДА ВЫБОР
	        |									КОГДА РасчетАмортизацииНУ.Начисление > 0
	        |										ТОГДА РасчетАмортизацииНУ.Начисление
	        |									ИНАЧЕ 0
	        |								КОНЕЦ
	        |						ИНАЧЕ РасчетАмортизацииНУ.ДоступноДляСписания
	        |					КОНЕЦ
	        |			ИНАЧЕ 0
	        |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	        |	РасчетАмортизацииНУ.СтоимостьДляНачисления,
	        |	РасчетАмортизацииНУ.СрокИспользованияДляНачисления
	        |ПОМЕСТИТЬ ТаблицаАмортизацииНУВрем
	        |ИЗ
	        |	РасчетАмортизацииНУ КАК РасчетАмортизацииНУ";
	
КонецФункции

Функция АмортизацияОС_ПолучитьТекстЗапросаРаспределенияЗатратНУ()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СчетаУчетаБУ.СчетНачисленияАмортизации
	        |ПОМЕСТИТЬ ИспользуемыеСчетаАмортизацииБУ
	        |ИЗ
	        |	СчетаУчетаБУ КАК СчетаУчетаБУ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыСреза.СчетНачисленияАмортизации КАК СчетБУ,
	        |	МАКСИМУМ(СоответствиеСчетовБУиНУ.СчетНУ) КАК СчетНУ
	        |ПОМЕСТИТЬ СоответствиеСчетовАмортизацииБУНУ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ИспользуемыеСчетаАмортизацииБУ.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	        |		МАКСИМУМ(СоответствиеСчетовБУиНУ.Период) КАК Период
	        |	ИЗ
	        |		ИспользуемыеСчетаАмортизацииБУ КАК ИспользуемыеСчетаАмортизацииБУ
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовБУиНУ КАК СоответствиеСчетовБУиНУ
	        |			ПО ИспользуемыеСчетаАмортизацииБУ.СчетНачисленияАмортизации = СоответствиеСчетовБУиНУ.СчетБУ
	        |				И (СоответствиеСчетовБУиНУ.Период <= &КонецМесяца)
	        |				И (СоответствиеСчетовБУиНУ.Учитывается)
	        |				И (СоответствиеСчетовБУиНУ.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ИспользуемыеСчетаАмортизацииБУ.СчетНачисленияАмортизации) КАК ПериодыСреза
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовБУиНУ КАК СоответствиеСчетовБУиНУ
	        |		ПО ПериодыСреза.СчетНачисленияАмортизации = СоответствиеСчетовБУиНУ.СчетБУ
	        |			И ПериодыСреза.Период = СоответствиеСчетовБУиНУ.Период
	        |			И (СоответствиеСчетовБУиНУ.Активность)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПериодыСреза.СчетНачисленияАмортизации
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЕСТЬNULL(ДанныеДляРаспределенияБУ.ОсновноеСредство, ТаблицаАмортизацииНУВрем.ОсновноеСредство) КАК ОсновноеСредство,
	        |	ЕСТЬNULL(ТаблицаАмортизацииНУВрем.СчетНачисленияАмортизации, ЕСТЬNULL(СоответствиеСчетовАмортизацииБУНУ.СчетНУ, ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))) КАК СчетНУ,
	        |	ЕСТЬNULL(ТаблицаАмортизацииНУВрем.НаправлениеАмортизации, ДанныеДляРаспределенияБУ.НаправлениеАмортизации) КАК НаправлениеАмортизации,
	        |	СУММА(ЕСТЬNULL(ДанныеДляРаспределенияБУ.СуммаБУ, 0)) КАК Сумма,
	        |	ЕСТЬNULL(ТаблицаАмортизацииНУВрем.Сумма, 0) КАК СуммаНУ,
	        |	0 КАК СуммаПР,
	        |	ВЫБОР
	        |		КОГДА ТаблицаАмортизацииНУВрем.Сумма ЕСТЬ NULL 
	        |			ТОГДА -ДанныеДляРаспределенияБУ.СуммаБУ
	        |		ИНАЧЕ ТаблицаАмортизацииНУВрем.Сумма
	        |	КОНЕЦ КАК СуммаВР
	        |ПОМЕСТИТЬ ТаблицаАмортизацииОбъединенная
	        |ИЗ
	        |	ТаблицаАмортизацииБУ КАК ДанныеДляРаспределенияБУ
	        |		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаАмортизацииНУВрем КАК ТаблицаАмортизацииНУВрем
	        |		ПО ДанныеДляРаспределенияБУ.ОсновноеСредство = ТаблицаАмортизацииНУВрем.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовАмортизацииБУНУ КАК СоответствиеСчетовАмортизацииБУНУ
	        |		ПО ДанныеДляРаспределенияБУ.СчетНачисленияАмортизации = СоответствиеСчетовАмортизацииБУНУ.СчетБУ
	        |ГДЕ
	        |	(ЕСТЬNULL(ТаблицаАмортизацииНУВрем.Сумма, 0) <> 0
	        |			ИЛИ ЕСТЬNULL(ДанныеДляРаспределенияБУ.СуммаБУ, 0) <> 0)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЕСТЬNULL(ДанныеДляРаспределенияБУ.ОсновноеСредство, ТаблицаАмортизацииНУВрем.ОсновноеСредство),
	        |	ЕСТЬNULL(ТаблицаАмортизацииНУВрем.СчетНачисленияАмортизации, ЕСТЬNULL(СоответствиеСчетовАмортизацииБУНУ.СчетНУ, ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))),
	        |	ЕСТЬNULL(ТаблицаАмортизацииНУВрем.НаправлениеАмортизации, ДанныеДляРаспределенияБУ.НаправлениеАмортизации),
	        |	ВЫБОР
	        |		КОГДА ТаблицаАмортизацииНУВрем.Сумма ЕСТЬ NULL 
	        |			ТОГДА -ДанныеДляРаспределенияБУ.СуммаБУ
	        |		ИНАЧЕ ТаблицаАмортизацииНУВрем.Сумма
	        |	КОНЕЦ,
	        |	ЕСТЬNULL(ТаблицаАмортизацииНУВрем.Сумма, 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВложенныйЗапрос.Субконто1 КАК ОсновноеСредство,
	        |	СУММА(ВложенныйЗапрос.Сумма01БУ) КАК Сумма01БУ,
	        |	СУММА(ВложенныйЗапрос.Сумма01НУ) КАК Сумма01НУ,
	        |	СУММА(ВложенныйЗапрос.Сумма01ПР) КАК Сумма01ПР,
	        |	СУММА(ВложенныйЗапрос.Сумма02) КАК Сумма02,
	        |	СУММА(ВложенныйЗапрос.Сумма01ПРпоРБ) КАК Сумма01ПРпоРБ
	        |ПОМЕСТИТЬ ДанныеДляНачисленияПР
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ВЫРАЗИТЬ(НалоговыйОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК Субконто1,
	        |		0 КАК Сумма01БУ,
	        |		СУММА(НалоговыйОстатки.СуммаОстатокДт) КАК Сумма01НУ,
	        |		0 КАК Сумма01ПР,
	        |		0 КАК Сумма02,
	        |		0 КАК Сумма01ПРпоРБ
	        |	ИЗ
	        |		РегистрБухгалтерии.Налоговый.Остатки(
	        |				&КонецПериода,
	        |				(Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОсновныеСредства))
	        |					ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ДоходныеВложенияВ_МЦ)))
	        |					И НЕ Счет = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВыбытиеОС),
	        |				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |				Организация = &Организация
	        |					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаПоПБУ18.НУ)) КАК НалоговыйОстатки
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВЫРАЗИТЬ(НалоговыйОстатки.Субконто1 КАК Справочник.ОсновныеСредства)
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство,
	        |		ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СтоимостьДляВычисленияАмортизации,
	        |		0,
	        |		0,
	        |		0,
	        |		0
	        |	ИЗ
	        |		РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ПараметрыАмортизацииОСНалоговыйУчетСрезПоследних.ОсновноеСредство,
	        |		0,
	        |		0,
	        |		ПараметрыАмортизацииОСНалоговыйУчетСрезПоследних.ПРДляВычисленияАмортизации,
	        |		0,
	        |		0
	        |	ИЗ
	        |		РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК ПараметрыАмортизацииОСНалоговыйУчетСрезПоследних
	        |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |				ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	        |				ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних.АмортизацияДо2002 КАК АмортизацияДо2002
	        |			ИЗ
	        |				РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних) КАК ПРдо2002года
	        |			ПО ПараметрыАмортизацииОСНалоговыйУчетСрезПоследних.ОсновноеСредство = ПРдо2002года.ОсновноеСредство
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ВЫРАЗИТЬ(НалоговыйОбороты.Субконто1 КАК Справочник.ОсновныеСредства),
	        |		0,
	        |		0,
	        |		0,
	        |		СУММА(НалоговыйОбороты.СуммаОборотКт),
	        |		0
	        |	ИЗ
	        |		РегистрБухгалтерии.Налоговый.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.АмортизацияОсновныхСредств)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), Организация = &Организация, , ) КАК НалоговыйОбороты
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВЫРАЗИТЬ(НалоговыйОбороты.Субконто1 КАК Справочник.ОсновныеСредства)
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ВЫРАЗИТЬ(НалоговыйОстатки.Субконто1 КАК Справочник.ОсновныеСредства),
	        |		0,
	        |		0,
	        |		0,
	        |		0,
	        |		СУММА(НалоговыйОстатки.СуммаОстатокДт - ПРдо2002года.АмортизацияДо2002)
	        |	ИЗ
	        |		РегистрБухгалтерии.Налоговый.Остатки(
	        |				&КонецПериода,
	        |				(Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОсновныеСредства))
	        |					ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ДоходныеВложенияВ_МЦ)))
	        |					И НЕ Счет = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВыбытиеОС),
	        |				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |				Организация = &Организация
	        |					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаПоПБУ18.ПР)) КАК НалоговыйОстатки
	        |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |				ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	        |				ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних.АмортизацияДо2002 КАК АмортизацияДо2002
	        |			ИЗ
	        |				РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних) КАК ПРдо2002года
	        |			ПО НалоговыйОстатки.Субконто1 = ПРдо2002года.ОсновноеСредство
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ВЫРАЗИТЬ(НалоговыйОстатки.Субконто1 КАК Справочник.ОсновныеСредства)) КАК ВложенныйЗапрос
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВложенныйЗапрос.Субконто1
	        |
	        |ИМЕЮЩИЕ
	        |	(СУММА(ВложенныйЗапрос.Сумма01ПР) <> 0
	        |		ИЛИ СУММА(ВложенныйЗапрос.Сумма01ПРпоРБ) <> 0)
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	РаспределеннаяАмортизацияБУ.ОсновноеСредство,
	        |	ВЫРАЗИТЬ(ВЫБОР
	        |			КОГДА РаспределеннаяАмортизацияБУ.Сумма = 0
	        |					И РаспределеннаяАмортизацияБУ.СуммаНУ <> 0
	        |				ТОГДА 0
	        |			ИНАЧЕ ВЫБОР
	        |					КОГДА ДанныеДляНачисленияПР.Сумма01БУ <> 0
	        |						ТОГДА РаспределеннаяАмортизацияБУ.Сумма / ДанныеДляНачисленияПР.Сумма01БУ * ВЫБОР
	        |								КОГДА ДанныеДляНачисленияПР.Сумма01ПР = 0
	        |									ТОГДА ДанныеДляНачисленияПР.Сумма01ПРпоРБ
	        |								ИНАЧЕ ДанныеДляНачисленияПР.Сумма01ПР
	        |							КОНЕЦ
	        |					ИНАЧЕ 0
	        |				КОНЕЦ
	        |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПР,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляНачисленияПР.Сумма01ПР = 0
	        |			ТОГДА ДанныеДляНачисленияПР.Сумма01ПРпоРБ
	        |		ИНАЧЕ ДанныеДляНачисленияПР.Сумма01ПР
	        |	КОНЕЦ КАК Сумма01ПР,
	        |	ДанныеДляНачисленияПР.Сумма01БУ,
	        |	ДанныеДляНачисленияПР.Сумма01НУ
	        |ПОМЕСТИТЬ РасчетПР
	        |ИЗ
	        |	ТаблицаАмортизацииОбъединенная КАК РаспределеннаяАмортизацияБУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляНачисленияПР КАК ДанныеДляНачисленияПР
	        |		ПО РаспределеннаяАмортизацияБУ.ОсновноеСредство = ДанныеДляНачисленияПР.ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаАмортизацииОбъединенная.ОсновноеСредство КАК ОсновноеСредство,
	        |	ТаблицаАмортизацииОбъединенная.СчетНУ,
	        |	ТаблицаАмортизацииОбъединенная.НаправлениеАмортизации,
	        |	ТаблицаАмортизацииОбъединенная.Сумма КАК СуммаБУ,
	        |	ТаблицаАмортизацииОбъединенная.СуммаНУ,
	        |	ВЫБОР
	        |		КОГДА РасчетПР.ОсновноеСредство ЕСТЬ NULL 
	        |			ТОГДА ТаблицаАмортизацииОбъединенная.СуммаПР
	        |		ИНАЧЕ РасчетПР.СуммаПР
	        |	КОНЕЦ КАК СуммаПР,
	        |	ТаблицаАмортизацииОбъединенная.СуммаВР,
	        |	РаспределениеЗатратПоНаправлениям.НомерСтроки КАК НомерСтроки,
	        |	РаспределениеЗатратПоНаправлениям.КоличествоСтрок,
	        |	РаспределениеЗатратПоНаправлениям.СуммаКоэффициентов,
	        |	РаспределениеЗатратПоНаправлениям.Коэффициент,
	        |	РаспределениеЗатратПоНаправлениям.СчетЗатратНУ,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ1,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ1,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ2,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ2,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ3,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ3,
	        |	РаспределениеЗатратПоНаправлениям.Подразделение,
	        |	РаспределениеЗатратПоНаправлениям.ПодразделениеОрганизации,
	        |	РаспределениеЗатратПоНаправлениям.СтатьяЗатрат,
	        |	РаспределениеЗатратПоНаправлениям.НоменклатурнаяГруппа,
	        |	РаспределениеЗатратПоНаправлениям.Продукция,
	        |	РаспределениеЗатратПоНаправлениям.СерияПродукции,
	        |	РаспределениеЗатратПоНаправлениям.ХарактеристикаПродукции,
	        |	РаспределениеЗатратПоНаправлениям.ОбъектСтроительства,
	        |	РаспределениеЗатратПоНаправлениям.СпособСтроительства,
	        |	РаспределениеЗатратПоНаправлениям.Проект,
	        |	РаспределениеЗатратПоНаправлениям.ХарактерЗатратНУ,
	        |	РаспределениеЗатратПоНаправлениям.ЭтоПроизводственныеРасходыНУ
	        |ПОМЕСТИТЬ ДанныеДляРаспределенияНУ
	        |ИЗ
	        |	ТаблицаАмортизацииОбъединенная КАК ТаблицаАмортизацииОбъединенная
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РасчетПР КАК РасчетПР
	        |		ПО ТаблицаАмортизацииОбъединенная.ОсновноеСредство = РасчетПР.ОсновноеСредство
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределениеЗатратПоНаправлениям КАК РаспределениеЗатратПоНаправлениям
	        |		ПО ТаблицаАмортизацииОбъединенная.НаправлениеАмортизации = РаспределениеЗатратПоНаправлениям.НаправлениеАмортизации
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НомерСтроки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляРаспределенияНУ.ОсновноеСредство КАК ОсновноеСредство,
	        |	ДанныеДляРаспределенияНУ.НомерСтроки КАК НомерСтроки,
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаБУ * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)) КАК СуммаБУ,
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаНУ * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)) КАК СуммаНУ,
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаПР * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)) КАК СуммаПР,
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаВР * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)) КАК СуммаВР,
	        |	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ДанныеДляРаспределенияНУРаспределенная.СуммаНУ * ДанныеДляРаспределенияНУРаспределенная.Коэффициент / ДанныеДляРаспределенияНУРаспределенная.СуммаКоэффициентов КАК ЧИСЛО(15, 2))), 0) КАК СуммаНУРаспределенная,
	        |	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ДанныеДляРаспределенияНУРаспределенная.СуммаПР * ДанныеДляРаспределенияНУРаспределенная.Коэффициент / ДанныеДляРаспределенияНУРаспределенная.СуммаКоэффициентов КАК ЧИСЛО(15, 2))), 0) КАК СуммаПРРаспределенная,
	        |	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ДанныеДляРаспределенияНУРаспределенная.СуммаВР * ДанныеДляРаспределенияНУРаспределенная.Коэффициент / ДанныеДляРаспределенияНУРаспределенная.СуммаКоэффициентов КАК ЧИСЛО(15, 2))), 0) КАК СуммаВРРаспределенная,
	        |	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ДанныеДляРаспределенияНУРаспределенная.СуммаБУ * ДанныеДляРаспределенияНУРаспределенная.Коэффициент / ДанныеДляРаспределенияНУРаспределенная.СуммаКоэффициентов КАК ЧИСЛО(15, 2))), 0) КАК СуммаБУРаспределенная
	        |ПОМЕСТИТЬ РаспределениеНУНарастающая
	        |ИЗ
	        |	ДанныеДляРаспределенияНУ КАК ДанныеДляРаспределенияНУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДляРаспределенияНУ КАК ДанныеДляРаспределенияНУРаспределенная
	        |		ПО ДанныеДляРаспределенияНУ.ОсновноеСредство = ДанныеДляРаспределенияНУРаспределенная.ОсновноеСредство
	        |			И ДанныеДляРаспределенияНУ.НомерСтроки > ДанныеДляРаспределенияНУРаспределенная.НомерСтроки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеДляРаспределенияНУ.ОсновноеСредство,
	        |	ДанныеДляРаспределенияНУ.НомерСтроки,
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаБУ * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)),
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаНУ * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)),
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаПР * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2)),
	        |	ВЫРАЗИТЬ(ДанныеДляРаспределенияНУ.СуммаВР * ДанныеДляРаспределенияНУ.Коэффициент / ДанныеДляРаспределенияНУ.СуммаКоэффициентов КАК ЧИСЛО(15, 2))
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство,
	        |	НомерСтроки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляРаспределенияНУ.ОсновноеСредство,
	        |	ДанныеДляРаспределенияНУ.СчетНУ,
	        |	ДанныеДляРаспределенияНУ.НаправлениеАмортизации,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляРаспределенияНУ.КоличествоСтрок = 1
	        |			ТОГДА ДанныеДляРаспределенияНУ.СуммаБУ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ДанныеДляРаспределенияНУ.НомерСтроки = ДанныеДляРаспределенияНУ.КоличествоСтрок
	        |					ТОГДА ДанныеДляРаспределенияНУ.СуммаБУ - РаспределениеНУНарастающая.СуммаБУРаспределенная
	        |				ИНАЧЕ РаспределениеНУНарастающая.СуммаБУ
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаБУ,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляРаспределенияНУ.КоличествоСтрок = 1
	        |			ТОГДА ДанныеДляРаспределенияНУ.СуммаНУ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ДанныеДляРаспределенияНУ.НомерСтроки = ДанныеДляРаспределенияНУ.КоличествоСтрок
	        |					ТОГДА ДанныеДляРаспределенияНУ.СуммаНУ - РаспределениеНУНарастающая.СуммаНУРаспределенная
	        |				ИНАЧЕ РаспределениеНУНарастающая.СуммаНУ
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаНУ,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляРаспределенияНУ.КоличествоСтрок = 1
	        |			ТОГДА ДанныеДляРаспределенияНУ.СуммаПР
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ДанныеДляРаспределенияНУ.НомерСтроки = ДанныеДляРаспределенияНУ.КоличествоСтрок
	        |					ТОГДА ДанныеДляРаспределенияНУ.СуммаПР - РаспределениеНУНарастающая.СуммаПРРаспределенная
	        |				ИНАЧЕ РаспределениеНУНарастающая.СуммаПР
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаПР,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляРаспределенияНУ.КоличествоСтрок = 1
	        |			ТОГДА ДанныеДляРаспределенияНУ.СуммаБУ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ДанныеДляРаспределенияНУ.НомерСтроки = ДанныеДляРаспределенияНУ.КоличествоСтрок
	        |					ТОГДА ДанныеДляРаспределенияНУ.СуммаБУ - РаспределениеНУНарастающая.СуммаБУРаспределенная
	        |				ИНАЧЕ РаспределениеНУНарастающая.СуммаБУ
	        |			КОНЕЦ
	        |	КОНЕЦ - ВЫБОР
	        |		КОГДА ДанныеДляРаспределенияНУ.КоличествоСтрок = 1
	        |			ТОГДА ДанныеДляРаспределенияНУ.СуммаНУ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ДанныеДляРаспределенияНУ.НомерСтроки = ДанныеДляРаспределенияНУ.КоличествоСтрок
	        |					ТОГДА ДанныеДляРаспределенияНУ.СуммаНУ - РаспределениеНУНарастающая.СуммаНУРаспределенная
	        |				ИНАЧЕ РаспределениеНУНарастающая.СуммаНУ
	        |			КОНЕЦ
	        |	КОНЕЦ - ВЫБОР
	        |		КОГДА ДанныеДляРаспределенияНУ.КоличествоСтрок = 1
	        |			ТОГДА ДанныеДляРаспределенияНУ.СуммаПР
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ДанныеДляРаспределенияНУ.НомерСтроки = ДанныеДляРаспределенияНУ.КоличествоСтрок
	        |					ТОГДА ДанныеДляРаспределенияНУ.СуммаПР - РаспределениеНУНарастающая.СуммаПРРаспределенная
	        |				ИНАЧЕ РаспределениеНУНарастающая.СуммаПР
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаВР,
	        |	ДанныеДляРаспределенияНУ.СчетЗатратНУ,
	        |	ДанныеДляРаспределенияНУ.ВидСубконтоНУ1,
	        |	ДанныеДляРаспределенияНУ.СубконтоНУ1,
	        |	ДанныеДляРаспределенияНУ.ВидСубконтоНУ2,
	        |	ДанныеДляРаспределенияНУ.СубконтоНУ2,
	        |	ДанныеДляРаспределенияНУ.ВидСубконтоНУ3,
	        |	ДанныеДляРаспределенияНУ.СубконтоНУ3,
	        |	ДанныеДляРаспределенияНУ.Подразделение,
	        |	ДанныеДляРаспределенияНУ.ПодразделениеОрганизации,
	        |	ДанныеДляРаспределенияНУ.СтатьяЗатрат,
	        |	ДанныеДляРаспределенияНУ.НоменклатурнаяГруппа,
	        |	ДанныеДляРаспределенияНУ.Продукция,
	        |	ДанныеДляРаспределенияНУ.СерияПродукции,
	        |	ДанныеДляРаспределенияНУ.ХарактеристикаПродукции,
	        |	ДанныеДляРаспределенияНУ.ОбъектСтроительства,
	        |	ДанныеДляРаспределенияНУ.СпособСтроительства,
	        |	ДанныеДляРаспределенияНУ.Проект,
	        |	ДанныеДляРаспределенияНУ.ХарактерЗатратНУ,
	        |	ДанныеДляРаспределенияНУ.ЭтоПроизводственныеРасходыНУ
	        |ПОМЕСТИТЬ ТаблицаАмортизацииНУ
	        |ИЗ
	        |	ДанныеДляРаспределенияНУ КАК ДанныеДляРаспределенияНУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеНУНарастающая КАК РаспределениеНУНарастающая
	        |		ПО ДанныеДляРаспределенияНУ.ОсновноеСредство = РаспределениеНУНарастающая.ОсновноеСредство
	        |			И ДанныеДляРаспределенияНУ.НомерСтроки = РаспределениеНУНарастающая.НомерСтроки";
	
КонецФункции
		
Функция АмортизацияОС_ПолучитьТекстЗапросаАмортизационнойПремии()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаАмортизацииНУВрем.ОсновноеСредство,
	        |	ТаблицаАмортизацииНУВрем.СчетУчета,
	        |	ТаблицаАмортизацииНУВрем.СчетНачисленияАмортизации,
	        |	ТаблицаАмортизацииНУВрем.НаправлениеАмортизации,
	        |	ТаблицаАмортизацииНУВрем.СуммаКапитальныхВложенийВключаемыхВРасходы,
	        |	ТаблицаАмортизацииНУВрем.Сумма
	        |ПОМЕСТИТЬ ОСДляРасчетаАмортизационнойПремии
	        |ИЗ
	        |	ТаблицаАмортизацииНУВрем КАК ТаблицаАмортизацииНУВрем
	        |ГДЕ
	        |	ТаблицаАмортизацииНУВрем.СуммаКапитальныхВложенийВключаемыхВРасходы > 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(НалоговыйОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	        |	СчетаУчетаНУ.СчетУчета,
	        |	НалоговыйОстатки.Субконто2 КАК ДокументАмортизационнойПремии,
	        |	НалоговыйОстатки.Субконто2.СчетУчетаЗатратПоАмортизационнойПремии КАК СчетУчетаЗатратПоАмортизационнойПремии,
	        |	НалоговыйОстатки.Субконто2.СубконтоПоАмортизационнойПремии1 КАК СубконтоПоАмортизационнойПремии1,
	        |	НалоговыйОстатки.Субконто2.СубконтоПоАмортизационнойПремии2 КАК СубконтоПоАмортизационнойПремии2,
	        |	НалоговыйОстатки.Субконто2.СубконтоПоАмортизационнойПремии3 КАК СубконтоПоАмортизационнойПремии3,
	        |	НалоговыйОстатки.СуммаОстатокДт КАК Сумма
	        |ПОМЕСТИТЬ АмортизационнаяПремияПоДокументам
	        |ИЗ
	        |	РегистрБухгалтерии.Налоговый.Остатки(
	        |			&НачалоПериода,
	        |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.РасходыНаКапитальныеВложения),
	        |			,
	        |			Организация = &Организация
	        |				И Субконто1 В
	        |					(ВЫБРАТЬ
	        |						вт.ОсновноеСредство
	        |					ИЗ
	        |						ОСДляРасчетаАмортизационнойПремии КАК вт)
	        |				И (Субконто2 ССЫЛКА Документ.ПринятиеКУчетуОС
	        |					ИЛИ Субконто2 ССЫЛКА Документ.ВводНачальныхОстатковОС
	        |					ИЛИ Субконто2 ССЫЛКА Документ.МодернизацияОС)) КАК НалоговыйОстатки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаУчетаНУ КАК СчетаУчетаНУ
	        |		ПО НалоговыйОстатки.Субконто1 = СчетаУчетаНУ.ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(НалоговыйОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	        |	ОСДляРасчетаАмортизационнойПремии.СчетУчета,
	        |	ОСДляРасчетаАмортизационнойПремии.НаправлениеАмортизации,
	        |	НалоговыйОстатки.СуммаОстатокДт КАК Сумма,
	        |	РаспределениеЗатратПоНаправлениям.СчетЗатратНУ,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ1,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ1,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ2,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ2,
	        |	РаспределениеЗатратПоНаправлениям.ВидСубконтоНУ3,
	        |	РаспределениеЗатратПоНаправлениям.СубконтоНУ3,
	        |	РаспределениеЗатратПоНаправлениям.Подразделение,
	        |	РаспределениеЗатратПоНаправлениям.ПодразделениеОрганизации,
	        |	РаспределениеЗатратПоНаправлениям.СтатьяЗатрат,
	        |	РаспределениеЗатратПоНаправлениям.НоменклатурнаяГруппа,
	        |	РаспределениеЗатратПоНаправлениям.Продукция,
	        |	РаспределениеЗатратПоНаправлениям.СерияПродукции,
	        |	РаспределениеЗатратПоНаправлениям.ХарактеристикаПродукции,
	        |	РаспределениеЗатратПоНаправлениям.ОбъектСтроительства,
	        |	РаспределениеЗатратПоНаправлениям.СпособСтроительства,
	        |	РаспределениеЗатратПоНаправлениям.Проект,
	        |	РаспределениеЗатратПоНаправлениям.ХарактерЗатратНУ,
	        |	РаспределениеЗатратПоНаправлениям.ЭтоПроизводственныеРасходыНУ
	        |ПОМЕСТИТЬ ДанныеДляСписанияКВ
	        |ИЗ
	        |	РегистрБухгалтерии.Налоговый.Остатки(
	        |			&НачалоПериода,
	        |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Налоговый.РасходыНаКапитальныеВложения),
	        |			,
	        |			Организация = &Организация
	        |				И Субконто1 В
	        |					(ВЫБРАТЬ
	        |						вт.ОсновноеСредство
	        |					ИЗ
	        |						ОСДляРасчетаАмортизационнойПремии КАК вт)
	        |				И Субконто2 = НЕОПРЕДЕЛЕНО) КАК НалоговыйОстатки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОСДляРасчетаАмортизационнойПремии КАК ОСДляРасчетаАмортизационнойПремии
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗатратПоНаправлениям КАК РаспределениеЗатратПоНаправлениям
	        |			ПО ОСДляРасчетаАмортизационнойПремии.НаправлениеАмортизации = РаспределениеЗатратПоНаправлениям.НаправлениеАмортизации
	        |		ПО НалоговыйОстатки.Субконто1 = ОСДляРасчетаАмортизационнойПремии.ОсновноеСредство";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры работы с наборами записей регистров документов

// Формирует структуру, содержащую наборы записей регистров, по которым формируются движения
// при начислении амортизации ОС
Функция СформироватьНаборыЗаписейПоАмортизацииОС(Документ)
	
	СтруктураДвижений = Новый Структура;
	
	нзБракБУ = РегистрыНакопления.БракВПроизводствеБухгалтерскийУчет.СоздатьНаборЗаписей();
	нзБракБУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзБракБУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("БракВПроизводствеБухгалтерскийУчет", нзБракБУ);
	
	нзБракНУ = РегистрыНакопления.БракВПроизводствеНалоговыйУчет.СоздатьНаборЗаписей();
	нзБракНУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзБракНУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("БракВПроизводствеНалоговыйУчет", нзБракНУ);
	
	нзЗатратыБУ = РегистрыНакопления.ЗатратыБухгалтерскийУчет.СоздатьНаборЗаписей();
	нзЗатратыБУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзЗатратыБУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("ЗатратыБухгалтерскийУчет", нзЗатратыБУ);
	
	нзЗатратыНУ = РегистрыНакопления.ЗатратыНалоговыйУчет.СоздатьНаборЗаписей();
	нзЗатратыНУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзЗатратыНУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("ЗатратыНалоговыйУчет", нзЗатратыНУ);
	
	нзНЗПБУ = РегистрыНакопления.НезавершенноеПроизводствоБухгалтерскийУчет.СоздатьНаборЗаписей();
	нзНЗПБУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзНЗПБУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("НезавершенноеПроизводствоБухгалтерскийУчет", нзНЗПБУ);
	
	нзНЗПНУ = РегистрыНакопления.НезавершенноеПроизводствоНалоговыйУчет.СоздатьНаборЗаписей();
	нзНЗПНУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзНЗПНУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("НезавершенноеПроизводствоНалоговыйУчет", нзНЗПНУ);
	
	нзСтоимостьОСБУ = РегистрыНакопления.СтоимостьОСБухгалтерскийУчет.СоздатьНаборЗаписей();
	нзСтоимостьОСБУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзСтоимостьОСБУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("СтоимостьОСБухгалтерскийУчет", нзСтоимостьОСБУ);
	
	нзСтоимостьОСНУ = РегистрыНакопления.СтоимостьОСНалоговыйУчет.СоздатьНаборЗаписей();
	нзСтоимостьОСНУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзСтоимостьОСНУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("СтоимостьОСНалоговыйУчет", нзСтоимостьОСНУ);
	
	нзабсНЗПБУ = РегистрыНакопления.абс_НезавершенноеПроизводствоБУ.СоздатьНаборЗаписей();
	нзабсНЗПБУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзабсНЗПБУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("абс_НезавершенноеПроизводствоБУ", нзабсНЗПБУ);
	
	нзабсНЗПНУ = РегистрыНакопления.абс_НезавершенноеПроизводствоНУ.СоздатьНаборЗаписей();
	нзабсНЗПНУ.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзабсНЗПНУ.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("абс_НезавершенноеПроизводствоНУ", нзабсНЗПНУ);
	
	нзПроценты = РегистрыНакопления.абс_КапитализацияПроцентовПоОС.СоздатьНаборЗаписей();
	нзПроценты.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзПроценты.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("абс_КапитализацияПроцентовПоОС", нзПроценты);
	
	нзХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	нзХозрасчетный.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзХозрасчетный.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("Хозрасчетный", нзХозрасчетный);
	
	нзНалоговый = РегистрыБухгалтерии.Налоговый.СоздатьНаборЗаписей();
	нзНалоговый.Отбор.Регистратор.Значение = Документ.Ссылка;
	нзНалоговый.Отбор.Регистратор.Использование = Истина;
	СтруктураДвижений.Вставить("Налоговый", нзНалоговый);
	
	Возврат СтруктураДвижений;
	
КонецФункции

// Очищает старые движения документа и блокирует их
Процедура ОчиститьДвиженияРегистров(Движения)
	
	Для Каждого ЭлементСтруктуры Из Движения Цикл
		
		НаборЗаписей = ЭлементСтруктуры.Значение;
		НаборЗаписей.БлокироватьДляИзменения = Истина;
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		НаборЗаписей.БлокироватьДляИзменения = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает блокировки на регистры накопления в зависимости от настроек отражения в учете и отборов
// при начислении амортизации ОС
Процедура УстановитьБлокировкуРегистровОС(СтруктураШапкиДокумента, МенеджерВременныхТаблиц)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировкиБУ = Блокировка.Добавить("РегистрНакопления.СтоимостьОСБухгалтерскийУчет");
	ЭлементБлокировкиБУ.Режим = РежимБлокировкиДанных.Исключительный;
	
	Если СтруктураШапкиДокумента.ВариантВыбораОС=1 Тогда
		// отбор только по организации	
		ЭлементБлокировкиБУ.УстановитьЗначение("Организация", СтруктураШапкиДокумента.Организация);
		Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
			ЭлементБлокировкиНУ = Блокировка.Добавить("РегистрНакопления.СтоимостьОСНалоговыйУчет");
			ЭлементБлокировкиНУ.УстановитьЗначение("Организация", СтруктураШапкиДокумента.Организация);
			ЭлементБлокировкиНУ.Режим = РежимБлокировкиДанных.Исключительный;
		КонецЕсли;
		
	ИначеЕсли СтруктураШапкиДокумента.ВариантВыбораОС=2 Тогда
		// отбор по одному ОС
		ЭлементБлокировкиБУ.УстановитьЗначение("ОсновноеСредство", СтруктураШапкиДокумента.абс_ОС);
		Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
			ЭлементБлокировкиНУ = Блокировка.Добавить("РегистрНакопления.СтоимостьОСНалоговыйУчет");
			ЭлементБлокировкиНУ.УстановитьЗначение("ОсновноеСредство", СтруктураШапкиДокумента.абс_ОС);
			ЭлементБлокировкиНУ.Режим = РежимБлокировкиДанных.Исключительный;
		КонецЕсли;
		
	Иначе // сформирована временая таблица ПредварительныйСписокОС
		// отбор по предварительному списку ОС
		ЗапросИсточникДанных = Новый Запрос("ВЫБРАТЬ ОсновноеСредство ИЗ ПредварительныйСписокОС");
		ЗапросИсточникДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		РезультатИсточникДанных = ЗапросИсточникДанных.Выполнить();
		
		ЭлементБлокировкиБУ.ИсточникДанных = РезультатИсточникДанных;
		ЭлементБлокировкиБУ.ИспользоватьИзИсточникаДанных("ОсновноеСредство", "ОсновноеСредство");
		ЭлементБлокировкиБУ.УстановитьЗначение("Организация", СтруктураШапкиДокумента.Организация);
		
		Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
			ЭлементБлокировкиНУ = Блокировка.Добавить("РегистрНакопления.СтоимостьОСНалоговыйУчет");
			ЭлементБлокировкиНУ.ИсточникДанных = РезультатИсточникДанных;
			ЭлементБлокировкиНУ.ИспользоватьИзИсточникаДанных("ОсновноеСредство", "ОсновноеСредство");
			ЭлементБлокировкиНУ.УстановитьЗначение("Организация", СтруктураШапкиДокумента.Организация);
			ЭлементБлокировкиНУ.Режим = РежимБлокировкиДанных.Исключительный;
		КонецЕсли;
		
	КонецЕсли;
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ЗаписатьРегистры(НаборДвижений, Отказ)
	
	Для Каждого НаборЗаписей Из НаборДвижений Цикл
		
		Попытка
			НаборЗаписей.Значение.БлокироватьДляИзменения = Ложь;
			НаборЗаписей.Значение.Записать();
		Исключение
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать движения по регистру """+НаборЗаписей.Значение.Метаданные().Синоним+""" по причине: "+ОписаниеОшибки();
			Сообщение.Сообщить(); 
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры формирования временных таблиц для заполнения движений регистов

Процедура АмортизацияОС_СформироватьДвиженияПоРегиструСтоимостьОСБухгалтерскийУчет(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц)
	
	НаборЗаписей = Движения.СтоимостьОСБухгалтерскийУчет;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаАмортизацииБУ.ОсновноеСредство КАК ОсновноеСредство,
	                      |	ТаблицаАмортизацииБУ.СуммаБУ КАК Амортизация
	                      |ИЗ
	                      |	ТаблицаАмортизацииБУ КАК ТаблицаАмортизацииБУ
	                      |ГДЕ
	                      |	ТаблицаАмортизацииБУ.СуммаБУ > 0
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОсновноеСредство");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период           = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.ВидДвижения      = ВидДвиженияНакопления.Приход;
		Запись.Организация      = СтруктураШапкиДокумента.Организация;
		Запись.ОсновноеСредство = Выборка.ОсновноеСредство;
		Запись.Амортизация      = Выборка.Амортизация;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АмортизацияОС_СформироватьДвиженияПоРегиструХозрасчетный(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц)
	
	НаборЗаписей = Движения.Хозрасчетный;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаАмортизацииБУ.ОсновноеСредство КАК ОсновноеСредство,
	                      |	ТаблицаАмортизацииБУ.СчетНачисленияАмортизации,
	                      |	ТаблицаАмортизацииБУ.СчетЗатрат,
	                      |	ТаблицаАмортизацииБУ.ВидСубконто1,
	                      |	ТаблицаАмортизацииБУ.Субконто1,
	                      |	ТаблицаАмортизацииБУ.ВидСубконто2,
	                      |	ТаблицаАмортизацииБУ.Субконто2,
	                      |	ТаблицаАмортизацииБУ.ВидСубконто3,
	                      |	ТаблицаАмортизацииБУ.Субконто3,
	                      |	ТаблицаАмортизацииБУ.СуммаБУ КАК Сумма
	                      |ИЗ
	                      |	ТаблицаАмортизацииБУ КАК ТаблицаАмортизацииБУ
	                      |ГДЕ
	                      |	ТаблицаАмортизацииБУ.СуммаБУ > 0
	                      |	И НЕ ТаблицаАмортизацииБУ.СчетЗатрат ЕСТЬ NULL 
	                      |	И ТаблицаАмортизацииБУ.СчетЗатрат <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОсновноеСредство");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Сумма = Выборка.Сумма;
		Запись.НомерЖурнала = "ОС";
		Запись.Содержание = "Амортизация";
		
		Запись.СчетДт = Выборка.СчетЗатрат;
		Для Сч = 1 По 3 Цикл
			Если Выборка["Субконто"+Сч]<>Неопределено Тогда
				Запись.СубконтоДт[Выборка["ВидСубконто"+Сч]] = Выборка["Субконто"+Сч];
			КонецЕсли;
		КонецЦикла;
		
		Запись.СчетКт = Выборка.СчетНачисленияАмортизации;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АмортизацияОС_СформироватьДвиженияПоРегистрамЗатратБУ(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаАмортизацииБУ.СчетЗатрат КАК СчетУчета,
	                      |	ТаблицаАмортизацииБУ.ПодразделениеОрганизации КАК Подразделение,
	                      |	ТаблицаАмортизацииБУ.СтатьяЗатрат,
	                      |	ТаблицаАмортизацииБУ.НоменклатурнаяГруппа,
	                      |	ТаблицаАмортизацииБУ.ХарактерЗатрат,
	                      |	СУММА(ТаблицаАмортизацииБУ.СуммаБУ) КАК Сумма
	                      |ИЗ
	                      |	ТаблицаАмортизацииБУ КАК ТаблицаАмортизацииБУ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаАмортизацииБУ.СчетЗатрат,
	                      |	ТаблицаАмортизацииБУ.ПодразделениеОрганизации,
	                      |	ТаблицаАмортизацииБУ.СтатьяЗатрат,
	                      |	ТаблицаАмортизацииБУ.НоменклатурнаяГруппа,
	                      |	ТаблицаАмортизацииБУ.ХарактерЗатрат");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ХарактерЗатрат=Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			
			ЗаписьНЗП = Движения.НезавершенноеПроизводствоБухгалтерскийУчет.Добавить();
			ЗаписьНЗП.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			ЗаписьНЗП.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаписьНЗП.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(ЗаписьНЗП, Выборка);
			ЗаписьНЗП.Стоимость = Выборка.Сумма;
			
			Запись = Движения.абс_НезавершенноеПроизводствоБУ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписьНЗП);
			
		ИначеЕсли Выборка.ХарактерЗатрат=Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			
			Запись = Движения.БракВПроизводствеБухгалтерскийУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		Иначе
			
			Запись = Движения.ЗатратыБухгалтерскийУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АмортизацияОС_СформироватьДвиженияПоРегиструСтоимостьОСНалоговыйУчет(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц)

	НаборЗаписей = Движения.СтоимостьОСНалоговыйУчет;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                      |	ТаблицаАмортизацииНУВрем.ОсновноеСредство,
	                      |	0 КАК Стоимость,
	                      |	ТаблицаАмортизацииНУВрем.Сумма КАК Амортизация
	                      |ИЗ
	                      |	ТаблицаАмортизацииНУВрем КАК ТаблицаАмортизацииНУВрем
	                      |ГДЕ
	                      |	ТаблицаАмортизацииНУВрем.Сумма <> 0
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	                      |	АмортизационнаяПремияПоДокументам.ОсновноеСредство,
	                      |	АмортизационнаяПремияПоДокументам.Сумма,
	                      |	0
	                      |ИЗ
	                      |	АмортизационнаяПремияПоДокументам КАК АмортизационнаяПремияПоДокументам
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	                      |	ДанныеДляСписанияКВ.ОсновноеСредство,
	                      |	ДанныеДляСписанияКВ.Сумма,
	                      |	0
	                      |ИЗ
	                      |	ДанныеДляСписанияКВ КАК ДанныеДляСписанияКВ");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;					  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Start КТТК Ермолов Е.Л.  10.06.2016 7736285 
		Принимать = НепринимаемыеКНалоговому(Выборка.ОсновноеСредство,СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.ПериодРегистрации);
		Если  Не Принимать Тогда
			Продолжить;	
		КонецЕсли;
		// Stop КТТК Ермолов Е.Л.  10.06.2016
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АмортизацияОС_СформироватьДвиженияПоРегиструНалоговый(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц)
	
	НаборЗаписей = Движения.Налоговый;
	
	// проводки по амортизации
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаАмортизацииНУ.СчетНУ,
	                      |	ТаблицаАмортизацииНУ.ОсновноеСредство,
	                      |	ТаблицаАмортизацииНУ.СуммаНУ,
	                      |	ТаблицаАмортизацииНУ.СуммаПР,
	                      |	ТаблицаАмортизацииНУ.СуммаБУ - ТаблицаАмортизацииНУ.СуммаНУ - ТаблицаАмортизацииНУ.СуммаПР КАК СуммаВР,
	                      |	ТаблицаАмортизацииНУ.СчетЗатратНУ,
	                      |	ТаблицаАмортизацииНУ.ВидСубконтоНУ1,
	                      |	ТаблицаАмортизацииНУ.СубконтоНУ1,
	                      |	ТаблицаАмортизацииНУ.ВидСубконтоНУ2,
	                      |	ТаблицаАмортизацииНУ.СубконтоНУ2,
	                      |	ТаблицаАмортизацииНУ.ВидСубконтоНУ3,
	                      |	ТаблицаАмортизацииНУ.СубконтоНУ3
	                      |ИЗ
	                      |	ТаблицаАмортизацииНУ КАК ТаблицаАмортизацииНУ
	                      |ГДЕ
	                      |	(ТаблицаАмортизацииНУ.СуммаНУ <> 0
	                      |			ИЛИ ТаблицаАмортизацииНУ.СуммаПР <> 0
	                      |			ИЛИ ТаблицаАмортизацииНУ.СуммаБУ <> ТаблицаАмортизацииНУ.СуммаНУ + ТаблицаАмортизацииНУ.СуммаПР)");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Start КТТК Ермолов Е.Л.  04.05.2016 7731317
		Принимать = НепринимаемыеКНалоговому(Выборка.ОсновноеСредство,СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.ПериодРегистрации);
		Если  Не Принимать Тогда
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			Запись.Сумма = Выборка.СуммаНУ + Выборка.СуммаВР + Выборка.СуммаПР ;
			Запись.НомерЖурнала = "ОС";
			Запись.Содержание = "Амортизация";
			
			Запись.СчетДт = Выборка.СчетЗатратНУ;
			Запись.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.ПР;
			Если Выборка.ВидСубконтоНУ1<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ1) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ1] = Выборка.СубконтоНУ1;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ2<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ2) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ2] = Выборка.СубконтоНУ2;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ3<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ3) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ3] = Выборка.СубконтоНУ3;
			КонецЕсли;
			
			Запись.СчетКт = Выборка.СчетНУ;
			Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.ПР;
			Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
			
		КонецЕсли;

		
		// Stop КТТК Ермолов Е.Л.  04.05.2016

		Если Выборка.СуммаНУ<>0 И Принимать Тогда
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			Запись.Сумма = Выборка.СуммаНУ;
			Запись.НомерЖурнала = "ОС";
			Запись.Содержание = "Амортизация";
			
			Запись.СчетДт = Выборка.СчетЗатратНУ;
			Запись.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.НУ;
			Если Выборка.ВидСубконтоНУ1<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ1) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ1] = Выборка.СубконтоНУ1;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ2<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ2) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ2] = Выборка.СубконтоНУ2;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ3<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ3) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ3] = Выборка.СубконтоНУ3;
			КонецЕсли;
			
			Запись.СчетКт = Выборка.СчетНУ;
			Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.НУ;
			Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
			
		КонецЕсли;
		
		Если Выборка.СуммаПР<>0 И Принимать Тогда
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			Запись.Сумма = Выборка.СуммаПР;
			Запись.НомерЖурнала = "ОС";
			Запись.Содержание = "Амортизация";
			
			Запись.СчетДт = Выборка.СчетЗатратНУ;
			Запись.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.ПР;
			Если Выборка.ВидСубконтоНУ1<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ1) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ1] = Выборка.СубконтоНУ1;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ2<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ2) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ2] = Выборка.СубконтоНУ2;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ3<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ3) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ3] = Выборка.СубконтоНУ3;
			КонецЕсли;
			
			Запись.СчетКт = Выборка.СчетНУ;
			Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.ПР;
			Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
			
		КонецЕсли;
		
		Если Выборка.СуммаВР<>0 И Принимать Тогда
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			Запись.Сумма = Выборка.СуммаВР;
			Запись.НомерЖурнала = "ОС";
			Запись.Содержание = "Амортизация";
			
			Запись.СчетДт = Выборка.СчетЗатратНУ;
			Запись.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.ВР;
			Если Выборка.ВидСубконтоНУ1<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ1) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ1] = Выборка.СубконтоНУ1;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ2<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ2) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ2] = Выборка.СубконтоНУ2;
			КонецЕсли;
			Если Выборка.ВидСубконтоНУ3<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ3) Тогда
				Запись.СубконтоДт[Выборка.ВидСубконтоНУ3] = Выборка.СубконтоНУ3;
			КонецЕсли;
			
			Запись.СчетКт = Выборка.СчетНУ;
			Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.ВР;
			Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// проводки по амортизационной премии без документов
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеДляСписанияКВ.СчетУчета,
	                      |	ДанныеДляСписанияКВ.ОсновноеСредство,
	                      |	ДанныеДляСписанияКВ.Сумма,
	                      |	ДанныеДляСписанияКВ.СчетЗатратНУ,
	                      |	ДанныеДляСписанияКВ.ВидСубконтоНУ1,
	                      |	ДанныеДляСписанияКВ.СубконтоНУ1,
	                      |	ДанныеДляСписанияКВ.ВидСубконтоНУ2,
	                      |	ДанныеДляСписанияКВ.СубконтоНУ2,
	                      |	ДанныеДляСписанияКВ.ВидСубконтоНУ3,
	                      |	ДанныеДляСписанияКВ.СубконтоНУ3
	                      |ИЗ
	                      |	ДанныеДляСписанияКВ КАК ДанныеДляСписанияКВ
	                      |ГДЕ
	                      |	ДанныеДляСписанияКВ.Сумма <> 0");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Сумма = Выборка.Сумма;
		Запись.НомерЖурнала = "ОС";
		Запись.Содержание = "Амортизационная премия";
		
		Запись.СчетКт = ПланыСчетов.Налоговый.РасходыНаКапитальныеВложения;
		Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.НУ;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Сумма = Выборка.Сумма;
		Запись.НомерЖурнала = "ОС";
		Запись.Содержание = "Амортизационная премия";
		
		Запись.СчетКт = Выборка.СчетУчета;
		Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.НУ;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		
		Запись.СчетДт = Выборка.СчетЗатратНУ;
		Запись.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.НУ;
		Если Выборка.ВидСубконтоНУ1<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ1) Тогда
			Запись.СубконтоДт[Выборка.ВидСубконтоНУ1] = Выборка.СубконтоНУ1;
		КонецЕсли;
		Если Выборка.ВидСубконтоНУ2<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ2) Тогда
			Запись.СубконтоДт[Выборка.ВидСубконтоНУ2] = Выборка.СубконтоНУ2;
		КонецЕсли;
		Если Выборка.ВидСубконтоНУ3<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ3) Тогда
			Запись.СубконтоДт[Выборка.ВидСубконтоНУ3] = Выборка.СубконтоНУ3;
		КонецЕсли;
		
		ЭтоНепринимаемые = НалоговыйУчет.ОпределитьНеПринимаемыеДоходыРасходы(Запись);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Сумма = -Выборка.Сумма;
		Запись.НомерЖурнала = "ОС";
		Запись.Содержание = "Амортизационная премия";
		
		Запись.СчетКт = Выборка.СчетУчета;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		
		Запись.СчетДт = Выборка.СчетЗатратНУ;
		Если Выборка.ВидСубконтоНУ1<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ1) Тогда
			Запись.СубконтоДт[Выборка.ВидСубконтоНУ1] = Выборка.СубконтоНУ1;
		КонецЕсли;
		Если Выборка.ВидСубконтоНУ2<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ2) Тогда
			Запись.СубконтоДт[Выборка.ВидСубконтоНУ2] = Выборка.СубконтоНУ2;
		КонецЕсли;
		Если Выборка.ВидСубконтоНУ3<>Неопределено И ЗначениеЗаполнено(Выборка.ВидСубконтоНУ3) Тогда
			Запись.СубконтоДт[Выборка.ВидСубконтоНУ3] = Выборка.СубконтоНУ3;
		КонецЕсли;
		
		Если ЭтоНепринимаемые Тогда
			Запись.ВидУчетаКт   = Перечисления.ВидыУчетаПоПБУ18.ПР;
			Запись.ВидУчетаДт   = Перечисления.ВидыУчетаПоПБУ18.ПР;
		Иначе
			Запись.ВидУчетаКт   = Перечисления.ВидыУчетаПоПБУ18.ВР;
			Запись.ВидУчетаДт   = Перечисления.ВидыУчетаПоПБУ18.ВР;
		КонецЕсли;
		
	КонецЦикла;
	
	// проводки по амортизационной премии с документами
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АмортизационнаяПремияПоДокументам.ОсновноеСредство,
	                      |	АмортизационнаяПремияПоДокументам.СчетУчета,
	                      |	АмортизационнаяПремияПоДокументам.ДокументАмортизационнойПремии,
	                      |	АмортизационнаяПремияПоДокументам.СчетУчетаЗатратПоАмортизационнойПремии КАК СчетЗатратНУ,
	                      |	АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии1 КАК Субконто1,
	                      |	АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии2 КАК Субконто2,
	                      |	АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии3 КАК Субконто3,
	                      |	АмортизационнаяПремияПоДокументам.Сумма
	                      |ИЗ
	                      |	АмортизационнаяПремияПоДокументам КАК АмортизационнаяПремияПоДокументам");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Сумма = Выборка.Сумма;
		Запись.НомерЖурнала = "ОС";
		Запись.Содержание = "Амортизационная премия";
		
		Запись.СчетКт = ПланыСчетов.Налоговый.РасходыНаКапитальныеВложения;
		Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.НУ;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыАмортизационнойПремии] = Выборка.ДокументАмортизационнойПремии;
		
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Сумма = Выборка.Сумма;
		Запись.НомерЖурнала = "ОС";
		Запись.Содержание = "Амортизационная премия";
		
		Запись.СчетКт = Выборка.СчетУчета;
		Запись.ВидУчетаКт = Перечисления.ВидыУчетаПоПБУ18.НУ;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		
		Запись.СчетДт = Выборка.СчетЗатратНУ;
		Запись.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.НУ;
		Если Выборка.Субконто1<>Неопределено И ЗначениеЗаполнено(Выборка.Субконто1) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, 1, Выборка.Субконто1);
		КонецЕсли;
		Если Выборка.Субконто2<>Неопределено И ЗначениеЗаполнено(Выборка.Субконто2) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, 2, Выборка.Субконто2);
		КонецЕсли;
		Если Выборка.Субконто3<>Неопределено И ЗначениеЗаполнено(Выборка.Субконто3) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, 3, Выборка.Субконто3);
		КонецЕсли;
		
		ЭтоНепринимаемые = НалоговыйУчет.ОпределитьНеПринимаемыеДоходыРасходы(Запись);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		Запись.Сумма = -Выборка.Сумма;
		Запись.НомерЖурнала = "ОС";
		Запись.Содержание = "Амортизационная премия";
		
		Запись.СчетКт = Выборка.СчетУчета;
		Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		
		Запись.СчетДт = Выборка.СчетЗатратНУ;
		Если Выборка.Субконто1<>Неопределено И ЗначениеЗаполнено(Выборка.Субконто1) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, 1, Выборка.Субконто1);
		КонецЕсли;
		Если Выборка.Субконто2<>Неопределено И ЗначениеЗаполнено(Выборка.Субконто2) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, 2, Выборка.Субконто2);
		КонецЕсли;
		Если Выборка.Субконто3<>Неопределено И ЗначениеЗаполнено(Выборка.Субконто3) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, 3, Выборка.Субконто3);
		КонецЕсли;
		
		Если ЭтоНепринимаемые Тогда
			Запись.ВидУчетаКт   = Перечисления.ВидыУчетаПоПБУ18.ПР;
			Запись.ВидУчетаДт   = Перечисления.ВидыУчетаПоПБУ18.ПР;
		Иначе
			Запись.ВидУчетаКт   = Перечисления.ВидыУчетаПоПБУ18.ВР;
			Запись.ВидУчетаДт   = Перечисления.ВидыУчетаПоПБУ18.ВР;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

// Start КТТК Ермолов Е.Л.  04.05.2016 7731317
Функция НепринимаемыеКНалоговому(ОсновноеСредство,Организация, Дата)
	Принимать = Истина;
	
	Запрос = Новый ЗАпрос("ВЫБРАТЬ
	                      |	СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчетСрезПоследних.СпособыОтраженияРасходовПоАмортизации
	                      |ИЗ
	                      |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.СрезПоследних(
	                      |			,
	                      |			ОсновноеСредство = &ОС
	                      |				И Организация = &Организация) КАК СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчетСрезПоследних");
	Запрос.УстановитьПараметр("ОС",ОсновноеСредство);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата",Дата);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда 
		Попытка
		Если Выб.СпособыОтраженияРасходовПоАмортизации.Способы[0].СтатьяЗатрат.ВидРасходовНУ =  Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения  Тогда 
			Принимать =  Ложь;		
		КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат принимать		
КонецФункции
// Stop КТТК Ермолов Е.Л.  04.05.2016

Процедура АмортизацияОС_СформироватьДвиженияПоРегистрамЗатратНУ(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц)
	
	//затраты по амортизации
	// Start КТТК Ермолов Е.Л.  10.06.2016 7736285  
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ТаблицаАмортизацииНУ.СчетЗатратНУ КАК СчетУчета,
	//                      |	ТаблицаАмортизацииНУ.ПодразделениеОрганизации,
	//                      |	ТаблицаАмортизацииНУ.СтатьяЗатрат,
	//                      |	ТаблицаАмортизацииНУ.НоменклатурнаяГруппа,
	//                      |	ТаблицаАмортизацииНУ.ХарактерЗатратНУ КАК ХарактерЗатрат,
	//                      |	СУММА(ТаблицаАмортизацииНУ.СуммаНУ) КАК Сумма
	//                      |ИЗ
	//                      |	ТаблицаАмортизацииНУ КАК ТаблицаАмортизацииНУ
	//                      |ГДЕ
	//                      |	ТаблицаАмортизацииНУ.СуммаНУ <> 0
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ТаблицаАмортизацииНУ.СчетЗатратНУ,
	//                      |	ТаблицаАмортизацииНУ.ПодразделениеОрганизации,
	//                      |	ТаблицаАмортизацииНУ.СтатьяЗатрат,
	//                      |	ТаблицаАмортизацииНУ.НоменклатурнаяГруппа,
	//                      |	ТаблицаАмортизацииНУ.ХарактерЗатратНУ");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаАмортизацииНУ.СчетЗатратНУ КАК СчетУчета,
	                      |	ТаблицаАмортизацииНУ.ПодразделениеОрганизации,
	                      |	ТаблицаАмортизацииНУ.СтатьяЗатрат,
	                      |	ТаблицаАмортизацииНУ.НоменклатурнаяГруппа,
	                      |	ТаблицаАмортизацииНУ.ХарактерЗатратНУ КАК ХарактерЗатрат,
	                      |	СУММА(ТаблицаАмортизацииНУ.СуммаНУ) КАК Сумма
	                      |ИЗ
	                      |	ТаблицаАмортизацииНУ КАК ТаблицаАмортизацииНУ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.СрезПоследних(&Период, Организация = &Организация) КАК СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчетСрезПоследних
	                      |		ПО ТаблицаАмортизацииНУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчетСрезПоследних.ОсновноеСредство
	                      |ГДЕ
	                      |	ТаблицаАмортизацииНУ.СуммаНУ <> 0
	                      |	И СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчетСрезПоследних.СпособыОтраженияРасходовПоАмортизации.Способы.СтатьяЗатрат.ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаАмортизацииНУ.СчетЗатратНУ,
	                      |	ТаблицаАмортизацииНУ.ПодразделениеОрганизации,
	                      |	ТаблицаАмортизацииНУ.СтатьяЗатрат,
	                      |	ТаблицаАмортизацииНУ.НоменклатурнаяГруппа,
	                      |	ТаблицаАмортизацииНУ.ХарактерЗатратНУ");

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("Период",СтруктураШапкиДокумента.ПериодРегистрации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ХарактерЗатрат=Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			
			ЗаписьНЗП = Движения.НезавершенноеПроизводствоНалоговыйУчет.Добавить();
			ЗаписьНЗП.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			ЗаписьНЗП.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаписьНЗП.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(ЗаписьНЗП, Выборка);
			ЗаписьНЗП.Стоимость = Выборка.Сумма;
			
			Запись = Движения.абс_НезавершенноеПроизводствоНУ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписьНЗП);
			
		ИначеЕсли Выборка.ХарактерЗатрат=Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			
			Запись = Движения.БракВПроизводствеНалоговыйУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		Иначе
			
			Запись = Движения.ЗатратыНалоговыйУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// затраты по амортизационной премии без документов
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеДляСписанияКВ.СчетЗатратНУ КАК СчетУчета,
	                      |	ДанныеДляСписанияКВ.ПодразделениеОрганизации,
	                      |	ДанныеДляСписанияКВ.СтатьяЗатрат,
	                      |	ДанныеДляСписанияКВ.НоменклатурнаяГруппа,
	                      |	ДанныеДляСписанияКВ.ХарактерЗатратНУ КАК ХарактерЗатрат,
	                      |	СУММА(ДанныеДляСписанияКВ.Сумма) КАК Сумма
	                      |ИЗ
	                      |	ДанныеДляСписанияКВ КАК ДанныеДляСписанияКВ
	                      |ГДЕ
	                      |	ДанныеДляСписанияКВ.Сумма <> 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеДляСписанияКВ.СчетЗатратНУ,
	                      |	ДанныеДляСписанияКВ.ПодразделениеОрганизации,
	                      |	ДанныеДляСписанияКВ.СтатьяЗатрат,
	                      |	ДанныеДляСписанияКВ.НоменклатурнаяГруппа,
	                      |	ДанныеДляСписанияКВ.ХарактерЗатратНУ");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ХарактерЗатрат=Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			
			ЗаписьНЗП = Движения.НезавершенноеПроизводствоНалоговыйУчет.Добавить();
			ЗаписьНЗП.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			ЗаписьНЗП.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаписьНЗП.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(ЗаписьНЗП, Выборка);
			ЗаписьНЗП.Стоимость = Выборка.Сумма;
			
			Запись = Движения.абс_НезавершенноеПроизводствоНУ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписьНЗП);
			
		ИначеЕсли Выборка.ХарактерЗатрат=Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			
			Запись = Движения.БракВПроизводствеНалоговыйУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		Иначе
			
			Запись = Движения.ЗатратыНалоговыйУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// затраты по амортизационной премии с документами
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВложенныйЗапрос.СчетУчета,
	                      |	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	                      |	ВложенныйЗапрос.ПодразделениеОрганизации,
	                      |	ВложенныйЗапрос.НоменклатурнаяГруппа,
	                      |	ВложенныйЗапрос.СтатьяЗатрат
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		АмортизационнаяПремияПоДокументам.СчетУчетаЗатратПоАмортизационнойПремии КАК СчетУчета,
	                      |		АмортизационнаяПремияПоДокументам.Сумма КАК Сумма,
	                      |		ВЫБОР
	                      |			КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии1 ССЫЛКА Справочник.ПодразделенияОрганизаций
	                      |				ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии1
	                      |			ИНАЧЕ ВЫБОР
	                      |					КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии2 ССЫЛКА Справочник.ПодразделенияОрганизаций
	                      |						ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии2
	                      |					ИНАЧЕ ВЫБОР
	                      |							КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии3 ССЫЛКА Справочник.ПодразделенияОрганизаций
	                      |								ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии3
	                      |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	                      |						КОНЕЦ
	                      |				КОНЕЦ
	                      |		КОНЕЦ КАК ПодразделениеОрганизации,
	                      |		ВЫБОР
	                      |			КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии1 ССЫЛКА Справочник.НоменклатурныеГруппы
	                      |				ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии1
	                      |			ИНАЧЕ ВЫБОР
	                      |					КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии2 ССЫЛКА Справочник.НоменклатурныеГруппы
	                      |						ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии2
	                      |					ИНАЧЕ ВЫБОР
	                      |							КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии3 ССЫЛКА Справочник.НоменклатурныеГруппы
	                      |								ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии3
	                      |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	                      |						КОНЕЦ
	                      |				КОНЕЦ
	                      |		КОНЕЦ КАК НоменклатурнаяГруппа,
	                      |		ВЫБОР
	                      |			КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии1 ССЫЛКА Справочник.СтатьиЗатрат
	                      |				ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии1
	                      |			ИНАЧЕ ВЫБОР
	                      |					КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии2 ССЫЛКА Справочник.СтатьиЗатрат
	                      |						ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии2
	                      |					ИНАЧЕ ВЫБОР
	                      |							КОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии3 ССЫЛКА Справочник.СтатьиЗатрат
	                      |								ТОГДА АмортизационнаяПремияПоДокументам.СубконтоПоАмортизационнойПремии3
	                      |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	                      |						КОНЕЦ
	                      |				КОНЕЦ
	                      |		КОНЕЦ КАК СтатьяЗатрат
	                      |	ИЗ
	                      |		АмортизационнаяПремияПоДокументам КАК АмортизационнаяПремияПоДокументам) КАК ВложенныйЗапрос
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.СчетУчета,
	                      |	ВложенныйЗапрос.ПодразделениеОрганизации,
	                      |	ВложенныйЗапрос.НоменклатурнаяГруппа,
	                      |	ВложенныйЗапрос.СтатьяЗатрат");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ХарактерЗатрат = УправлениеЗатратами.ПолучитьХарактерЗатратПоСчетуЗатрат(Выборка.СчетУчета, Выборка.СтатьяЗатрат, "Налоговый");
		
		Если ХарактерЗатрат=Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			
			ЗаписьНЗП = Движения.НезавершенноеПроизводствоНалоговыйУчет.Добавить();
			ЗаписьНЗП.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			ЗаписьНЗП.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаписьНЗП.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(ЗаписьНЗП, Выборка);
			ЗаписьНЗП.Стоимость = Выборка.Сумма;
			
			Запись = Движения.абс_НезавершенноеПроизводствоНУ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписьНЗП);
			
		ИначеЕсли ХарактерЗатрат=Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			
			Запись = Движения.БракВПроизводствеНалоговыйУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		Иначе
			
			Запись = Движения.ЗатратыНалоговыйУчет.Добавить();
			Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Организация = СтруктураШапкиДокумента.Организация;
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АмортизацияОС_СформироватьДвиженияПоКапитализацииПроцентов(СтруктураШапкиДокумента, Движения, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	абс_КапитализацияПроцентовПоОСОстатки.ОсновноеСредство,
	                      |	абс_КапитализацияПроцентовПоОСОстатки.СтатьяДоходовРасходов,
	                      |	абс_КапитализацияПроцентовПоОСОстатки.СуммаОстаток
	                      |ПОМЕСТИТЬ КапитализацияПроцентовОстатки
	                      |ИЗ
	                      |	РегистрНакопления.абс_КапитализацияПроцентовПоОС.Остатки(&МоментВремени, Организация = &Организация) КАК абс_КапитализацияПроцентовПоОСОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КапитализацияПроцентовОстатки.ОсновноеСредство,
	                      |	КапитализацияПроцентовОстатки.СтатьяДоходовРасходов,
	                      |	ВЫРАЗИТЬ(КапитализацияПроцентовОстатки.СуммаОстаток * ТаблицаАмортизацииНУВрем.Сумма / ТаблицаАмортизацииНУВрем.СтоимостьДляНачисления КАК ЧИСЛО(15, 2)) КАК Сумма
	                      |ИЗ
	                      |	КапитализацияПроцентовОстатки КАК КапитализацияПроцентовОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАмортизацииНУВрем КАК ТаблицаАмортизацииНУВрем
	                      |		ПО КапитализацияПроцентовОстатки.ОсновноеСредство = ТаблицаАмортизацииНУВрем.ОсновноеСредство");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("МоментВремени", СтруктураШапкиДокумента.ПериодРегистрации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Счет9102С = ПланыСчетов.Налоговый.НайтиПоКоду("91.02.С");
	
	Пока Выборка.Следующий() Цикл
		
		Запись = Движения.абс_КапитализацияПроцентовПоОС.Добавить();
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
		Запись.Период = СтруктураШапкиДокумента.ПериодРегистрации;
		Запись.Организация = СтруктураШапкиДокумента.Организация;
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Проводка = Движения.Налоговый.Добавить();
		Проводка.Период 		= СтруктураШапкиДокумента.ПериодРегистрации;
		Проводка.Организация 	= СтруктураШапкиДокумента.Организация;
		Проводка.Сумма       	= Выборка.Сумма;
		Проводка.Содержание  	= "Принят к учету объект ОС";
			
		Проводка.СчетДт      	= Счет9102С;
		Проводка.ВидУчетаДт 	= Перечисления.ВидыУчетаПоПБУ18.ВР;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства] = Выборка.ОсновноеСредство;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы] = Выборка.СтатьяДоходовРасходов;
		
		Проводка.СчетКт			= ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав;
		Проводка.ВидУчетаКт		= Перечисления.ВидыУчетаПоПБУ18.ВР;
		
	КонецЦикла;
	
КонецПроцедуры
