&НаСервере
Функция ПолучитьСписокПользователей(Всем,Пользователь)
	Если Всем Тогда
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|//ГДЕ
		|//	Пользователи.ПрофильПолномочийПользователя <> &ПустойПрофиль";
		Запрос.УстановитьПараметр("ПустойПрофиль",Справочники.ПрофилиПолномочийПользователей.ПустаяСсылка());
		возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		Мас = Новый Массив;
		Мас.Добавить(Пользователь);
		возврат Мас;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	СписокПользователей = ПолучитьСписокПользователей(объект.ВсемПользователям,Объект.Пользователь);
	Если СписокПользователей.количество()>0 Тогда
		Для каждого Пользов из СписокПользователей Цикл
			Запись = РегистрыСведений.абс_СообщенияПользователю.СоздатьМенеджерЗаписи();
			Запись.Активность=Истина;
			Запись.ДатаСообщения = ТекущаяДата();
			Запись.Отправитель = объект.ТекущийПользователь;
			Запись.Объект = объект.Объект;
			Запись.Отправлено=Ложь;
			Запись.Пользователь = Пользов;
			Запись.ТекстСообщения = Объект.ТекстСообщения;
			Запись.Записать();
		КонецЦикла;
		
	КонецЕсли;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Сообщение отправлено";
	Сообщение.Сообщить();
	
КонецПроцедуры
   
&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	// Вставить содержимое обработчика. 	
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Объект.ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
КонецПроцедуры

&НаКлиенте
Процедура абс_КолПользователя()
	
	ОснРеквизит = Объект;
	КолПользователей = КолПользователяСервер(ОснРеквизит);
	                 
КонецПроцедуры

&НаСервере
Функция КолПользователяСервер(ОснРеквизит)
	
	ТекстСообщения = РеквизитФормыВЗначение("Объект").ТекстСообщения;
	Объект.ТекстСообщения = ТекстСообщения;
	//ТекстСообщения = ДанныеФормыВЗначение(ОснРеквизит,Тип("Строка"));
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ абс_СообщенияПользователю.Пользователь) КАК Пользователь
	                      |ИЗ
	                      |	РегистрСведений.абс_СообщенияПользователю КАК абс_СообщенияПользователю
	                      |ГДЕ
	                      |	абс_СообщенияПользователю.Отправлено
	                      |	И абс_СообщенияПользователю.ТекстСообщения ПОДОБНО &ТекстСообщения");
	Запрос.УстановитьПараметр("ТекстСообщения",ТекстСообщения);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Возврат ?(Результат.Пользователь = Null,0,Результат.Пользователь);  
	
КонецФункции

&НаКлиенте
Процедура Шаблон(Команда)
	
	ШаблонСервер();
	
КонецПроцедуры

&НаСервере
Процедура ШаблонСервер()
	Дата = Формат(абс_СерверныеФункции.ПолучитьДатуСервера(),"ДЛФ=DD");
	Объект.ТекстСообщения = "Внимание! 
							|"+Дата+" (с 00:00 по 00:00 ""МСК"")
							|будет производиться обновление системы ЕИСУП ТТК.
							|Система будет недоступна.";
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеСообщения(Команда)
	
	УдалитьВсеСообщенияНаСервере();

КонецПроцедуры

&НаСервере
Процедура УдалитьВсеСообщенияНаСервере()
	РС = РегистрыСведений.абс_СообщенияПользователю.СоздатьНаборЗаписей();
	РС.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("абс_КолПользователя",60);
КонецПроцедуры




