Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстЗаказов.Номенклатура,
	               |	ОстЗаказов.Склад,
	               |	ОстЗаказов.СерияНоменклатуры,
	               |	ОстЗаказов.Заказ,
	               |	ОстЗаказов.Организация,
	               |	ОстЗаказов.Проект,
	               |	ОстЗаказов.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.абс_ЗаявкиНаОбеспечение.Остатки(&ДатаДок, Заказ В (&Заявка)) КАК ОстЗаказов";
	
	Запрос.УстановитьПараметр("ДатаДок", 	Дата);
	Запрос.УстановитьПараметр("Заявка", 	Заявки.ВыгрузитьКолонку("Заявка"));
	
	РезультатЗапроса 	= Запрос.Выполнить().Выгрузить();
	Если Найти(Комментарий, "Приход") <> 0 Тогда
		Для каждого СтрЗап Из РезультатЗапроса Цикл
			Движение 				= Движения.абс_ЗаявкиНаОбеспечение.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			ЗаполнитьЗначенияСвойств(Движение, СтрЗап);
		КонецЦикла;
	Иначе
		Для каждого СтрЗап Из РезультатЗапроса Цикл
			Движение 				= Движения.абс_ЗаявкиНаОбеспечение.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			ЗаполнитьЗначенияСвойств(Движение, СтрЗап);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");