 Функция ПолучитьСтруктуруСогласованияФилиализация(СуммаСчета)  Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	абс_ПределыСуммУтвержденияСрезПоследних.Роль
	 |ИЗ
	 |	РегистрСведений.абс_ПределыСуммУтверждения.СрезПоследних КАК абс_ПределыСуммУтвержденияСрезПоследних
	 |ГДЕ
	 |	абс_ПределыСуммУтвержденияСрезПоследних.ПределСумма <= &СуммаСчета
	 |	И абс_ПределыСуммУтвержденияСрезПоследних.ВидБП = &ВидБП";
	 
	 Запрос.УстановитьПараметр("ВидБП", Перечисления.абсВидыБизнесПроцессовТТК.СогласованиеСчетовНаОплатуФилиализация);
	 Запрос.УстановитьПараметр("СуммаСчета", СуммаСчета);
	 
	 Возврат Запрос.Выполнить().Выгрузить();
	 
 КонецФункции 
 