Функция ПользовательЯвляетсяРуководителемБлока(ЦФО,Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК РуководительБлока
	|ИЗ
	|	РегистрСведений.абс_РуководителиБлока КАК абс_РуководителиБлока
	|ГДЕ
	|	абс_РуководителиБлока.ЦФО = &ЦФО
	|	И абс_РуководителиБлока.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Следующий();
	
КонецФункции 
