// Определяет текущую (системную) дату на компьютере сервера 1С:Предприятия.
//
// Возвращаемое значение:
//   Дата   - текущая (системная) дата
//
Функция ТекущаяДатаСервера() Экспорт

	Возврат ТекущаяДата();

КонецФункции 
 
// Установить начальное значение константы при обновлении версии ИБ.
//
Процедура ИнициализироватьПроверкуРазницыВремениССервером() Экспорт
    // {{KM WARE Акулов А.И. 04.10.2015 начало
	// 
	// {{Старый код:
	//Константы.ПроверятьРазницуВоВремениССервером.Установить(Ложь);
	// }}Новый код:
	Попытка
		Константы.ПроверятьРазницуВоВремениССервером.Установить(Ложь);
	Исключение
	КонецПопытки;
	// }}KM WARE Акулов А.И. 04.10.2015 окончание 

КонецПроцедуры

