
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ПараметрКоманды Цикл 	
		ТабДок = Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьВедомостьПоРаспределяемымРасходамПоБлокам(Строка.ПолучитьОбъект());
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Ведомость по распределяемымрасходам по блокам");  
	КонецЦикла;

КонецПроцедуры
