
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПолучитьИтогПоЦФО(ЦФО)

	мЦФО = Объект.РаспределениеПоПроектам.НайтиСтроки(Новый Структура("ЦФО",ЦФО));
	СуммаПоЦФО = 0;
	Если мЦФО.Количество() > 0 Тогда
		Для каждого Стр Из мЦФО Цикл
			СуммаПоЦФО = СуммаПоЦФО + Стр.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	Возврат  СуммаПоЦФО;
	
КонецФункции 

&НаСервере
Процедура ОбновитьСуммыДляРаспределения()
	ТЗ = Объект.РаспределениеПоПроектам.Выгрузить();	
	ТЗ.Свернуть("ЦФО","Сумма");
	ЗначениеВРеквизитФормы(ТЗ,"СуммыДляРаспределения");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ   

&НаСервере
Процедура ИзменитьРаспределение(ЦФО,Удалить)
	
	мЦФО = Объект.РаспределениеПоПроектам.НайтиСтроки(Новый Структура("ЦФО",ЦФО));
	
	Если мЦФО.Количество() = 0 Тогда
		НС =  Объект.РаспределениеПоПроектам.Добавить();
		НС.ЦФО = ЦФО;
		
		Если  Объект.СуммаПоДокументу > 0 Тогда
			СуммаВСтроку = Объект.СуммаПоДокументу - Объект.РаспределениеПоПроектам.Итог("Сумма");
			НС.Сумма = ?(СуммаВСтроку < 0,0,СуммаВСтроку);
		КонецЕсли;
		
	ИначеЕсли мЦФО.Количество() > 0  И Удалить Тогда
		Для каждого Стр Из мЦФО Цикл
			Объект.РаспределениеПоПроектам.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                       
Процедура ИзменитьСуммыДляРаспределения(ЦФО,Удалить)
	
	мЦФО = СуммыДляРаспределения.НайтиСтроки(Новый Структура("ЦФО",ЦФО));
	
	Если мЦФО.Количество() = 0 Тогда
		НС =  СуммыДляРаспределения.Добавить();
		НС.ЦФО = ЦФО;
	ИначеЕсли мЦФО.Количество() > 0  И Удалить Тогда
		Для каждого Стр Из мЦФО Цикл
			СуммыДляРаспределения.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммыДляРаспределенияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элементы.СуммыДляРаспределения.ТекущиеДанные <> Неопределено Тогда	
		ИзменитьРаспределение(Элементы.СуммыДляРаспределения.ТекущиеДанные.ЦФО,Ложь);
	КонецЕсли;	
	
	ОбновитьСуммыДляРаспределения();

КонецПроцедуры

&НаКлиенте
Процедура СуммыДляРаспределенияПередУдалением(Элемент, Отказ)
	Если Элементы.СуммыДляРаспределения.ТекущиеДанные <> Неопределено Тогда	
		ИзменитьРаспределение(Элементы.СуммыДляРаспределения.ТекущиеДанные.ЦФО,Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоПроектамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЦФО = Элементы.РаспределениеПоПроектам.ТекущиеДанные.ЦФО;
	
	Если  НоваяСтрока Тогда
		СуммаВСтроку = Объект.СуммаПоДокументу - (Объект.РаспределениеПоПроектам.Итог("Сумма") - Элементы.РаспределениеПоПроектам.ТекущиеДанные.Сумма);
		Элементы.РаспределениеПоПроектам.ТекущиеДанные.Сумма = ?(СуммаВСтроку < 0, 0,СуммаВСтроку);
	КонецЕсли;
	
	ОбновитьСуммыДляРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоПроектамПослеУдаления(Элемент)
	ОбновитьСуммыДляРаспределения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСуммыДляРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура СуммыДляРаспределенияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	//Если Элементы.СуммыДляРаспределения.ТекущиеДанные <> Неопределено Тогда
	//	мЦФО = Объект.РаспределениеПоПроектам.НайтиСтроки(Новый Структура("ЦФО",Элементы.СуммыДляРаспределения.ТекущиеДанные.ЦФО));
	//	
	//	Если мЦФО.Количество() > 0 Тогда
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Выбранное ЦФО уже есть в списке!";
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
