
Процедура СформироватьЗадачуНаСогласование(Роль,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи)
	
	ФормируемыеЗадачи.Очистить();
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абс_СогласованиеЗначенийПоказателейДляРасчетаКПЭ.ТочкиМаршрута.Подготовка ИЛИ ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абс_СогласованиеЗначенийПоказателейДляРасчетаКПЭ.ТочкиМаршрута.Отказ Тогда
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
		НоваяЗадача.Дата 				= ТекущаяДата();
		НоваяЗадача.Наименование 		= Строка(ЭтотОбъект.Ссылка.ВводЗначений) + " " + ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
		НоваяЗадача.Исполнитель 		= ВводЗначений.Ответственный;
		НоваяЗадача.Роль 			    = Роль;
		НоваяЗадача.Организация 		= ВводЗначений.Организация;
		НоваяЗадача.ОбъектЗадачи 		= ВводЗначений.Ссылка;
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИИсполнители.Исполнитель КАК  Исполнитель
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Роль = &Роль";
		
		Запрос.УстановитьПараметр("Роль", Роль);
		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
			НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
			НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
			НоваяЗадача.Дата 				= ТекущаяДата();
			НоваяЗадача.Наименование 		= Строка(ЭтотОбъект.Ссылка.ВводЗначений) + " " + ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
			НоваяЗадача.Роль 			    = Роль;
			НоваяЗадача.Организация 		= ВводЗначений.Организация;
			НоваяЗадача.ОбъектЗадачи 		= ВводЗначений.Ссылка;
			
			НоваяЗадача.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
			ФормируемыеЗадачи.Добавить(НоваяЗадача);
		КонецЦикла;
	КонецЕсли;
	
	// Добавим задачи для суперпользователей
	//абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ЗаявкаНаДобавлениеПрав.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	//абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ЗаявкаНаДобавлениеПрав.Статус);	
 КонецПроцедуры
 
Процедура ПодготовкаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Неопределено,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ДокументСогласованПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Если ВводЗначений.Статус = Перечисления.абс_СтатусыЗагрузкиКПЭ.Согласован Тогда
		Результат	= Истина;
	Иначе
		Результат	= Ложь;
	КонецЕсли;		
КонецПроцедуры

Процедура ОтказПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Неопределено,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры
