// Процедура заполняет реквизиты формы по данным первой строки ТЧ "РасшифровкаПлатежа"
//
&НаСервере
Процедура ЗаполнитьДанныеФормы()

	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРасшифровки = Объект.РасшифровкаПлатежа.Получить(0);
	
	Сделка                        = СтрокаРасшифровки.Сделка;
	ДоговорКонтрагента            = СтрокаРасшифровки.ДоговорКонтрагента;
	СтатьяДвиженияДенежныхСредств = СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств;
	
КонецПроцедуры //
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику Тогда
		Элементы.ВыдачаПодотчетнику.Видимость = Истина;
		Элементы.РасчетыСКонтрагентами.Видимость = Ложь;
	Иначе
		Элементы.ВыдачаПодотчетнику.Видимость = Ложь;
		Элементы.РасчетыСКонтрагентами.Видимость = Истина;
	КонецЕсли; 
	
	ЗаполнитьДанныеФормы();
	
	// Установим заголовок основной страницы
	ВидОперацииСтрока = Строка(Объект.ВидОперации);
	Элементы.ОсновныеСведения.Заголовок = ВРег(Лев(ВидОперацииСтрока,1)) + Сред(ВидОперацииСтрока,2);
	УстановитьОтборСчетов();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСчетов()
	
	ОтборОбъект = СписокПП.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборОбъект.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборОбъект.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДокументОснование");
	ОтборОбъект.ПравоеЗначение 	= Объект.Ссылка;
	ОтборОбъект.Использование	= Истина;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьППНаСервере()
	
	ДокументОбъект = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
	ДокументОбъект.Заполнить(Объект.Ссылка);
	ДокументОбъект.Оплачено=Ложь;
	ДокументОбъект.ОтражатьВБухгалтерскомУчете = Истина;
	ДокументОбъект.ОтражатьВНалоговомУчете = Истина;
	ДокументОбъект.ОтраженоВОперУчете = Истина;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПРоцедуры


&НаКлиенте
Процедура СоздатьПлатежноеПоручение(Команда)
	// Вставить содержимое обработчика.
	Ответ = Вопрос("Будет записан текущий документ и создано платежное поручение исходящее.
	|Продолжить?",РежимДиалогаВопрос.ДаНет);
	Если Ответ=КодВозвратаДиалога.Нет Тогда
		возврат;
	КонецЕсли;
	Записать();
	СоздатьППНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКодКонтрагента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодКонтрагента()
	
	абс_КодКонтрагента = " "+Объект.Контрагент.Код;
		
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьКодКонтрагента();
	
КонецПроцедуры
