// Функция определяет возможность отразить документ в бух. учете
Функция МожноОтражатьВБухгалтерскомУчете(Организация, Дата, СообщениеОбОшибке = "")
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		СообщениеОбОшибке = Нстр("ru = 'Не указана организация'");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Организация.ОтражатьВРегламентированномУчете Тогда
		СообщениеОбОшибке = Нстр("ru = 'Не ведется регламентированный учет по организации ""%Организация""'");
		СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%Организация", "" + Организация);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Контроль и заполнение признаков отражения в учете для управляемого режима
Процедура ПередЗаписьюУправлениеОтражениемВУчете(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		
		СообщениеОбОшибкеБУ = "";
		СообщениеОбОшибкеНУ = "";
		
		ОтражатьВБухгалтерскомУчете = МожноОтражатьВБухгалтерскомУчете(Источник.Организация, Источник.Дата, СообщениеОбОшибкеБУ);
		ОтражатьВНалоговомУчете     = ОтражатьВБухгалтерскомУчете;
		
		Если РольДоступна("ОтражениеВРегламентированномУчете")
		  ИЛИ РольДоступна("ПолныеПрава") Тогда
	    	//Для ответственных за отражение в учете сообщим об ошибках
			Если Источник.ОтражатьВБухгалтерскомУчете И НЕ ОтражатьВБухгалтерскомУчете Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке(Нстр("ru = 'Не удалось отразить документ в бухгалтерском учете.'") + Символы.ПС + СообщениеОбОшибкеБУ,Отказ);
			Иначе
				Источник.ОтражатьВНалоговомУчете = Источник.ОтражатьВБухгалтерскомУчете И ОтражатьВНалоговомУчете;
			КонецЕсли;	
		Иначе	
			//Для обычных ползьователей, установим флаги в соответствии с выбранной организацией
			// АБС ИЗМЕНЕНО ФРОЛОВ 20110315
			Источник.ОтражатьВУправленческомУчете 	= Истина;
			//Источник.ОтражатьВБухгалтерскомУчете = ОтражатьВБухгалтерскомУчете;
			//Источник.ОтражатьВНалоговомУчете = ОтражатьВНалоговомУчете;
			
			Источник.ОтражатьВБухгалтерскомУчете 	= Ложь;
			Источник.ОтражатьВНалоговомУчете 		= Ложь;			
			// АБС ИЗМЕНЕНО ФРОЛОВ 20110315
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

// <Описание функции>
// Возвращаемое значение:
//   ОТКАз - булево
//
// {{KM WARE Лазаревский К.В. Заявка № 27.07.2015 начало
Функция КонтрольОСНаПравильностьЗаполнения(МассивОС) Экспорт
	СтруктураОтказ = Новый Структура("Отказ, ПричинаОтказа", Ложь, "");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОсновныеСредства.Код,
	                      |	ОсновныеСредства.Наименование,
	                      |	ОсновныеСредства.НаименованиеПолное,
	                      |	ОсновныеСредства.Изготовитель,
	                      |	ОсновныеСредства.НомерПаспорта,
	                      |	ОсновныеСредства.ЗаводскойНомер,
	                      |	ОсновныеСредства.ДатаВыпуска,
	                      |	ОсновныеСредства.ГруппаОС,
	                      |	ОсновныеСредства.КодПоОКОФ,
	                      |	ОсновныеСредства.АмортизационнаяГруппа,
	                      |	ОсновныеСредства.Комментарий,
	                      |	ОсновныеСредства.Автотранспорт,
	                      |	ОсновныеСредства.АдресМестонахождения,
	                      |	ОсновныеСредства.КодРегиона,
	                      |	ОсновныеСредства.НепроизводственноеОС,
	                      |	ОсновныеСредства.КапитальныеЗатраты,
	                      |	ОсновныеСредства.СтарыйИнвентарныйНомер,
	                      |	ОсновныеСредства.Недвижимость,
	                      |	ОсновныеСредства.НомерПриказа,
	                      |	ОсновныеСредства.ТиповойПеречень,
	                      |	ОсновныеСредства.ИнициаторВводаВЭксплуатацию,
	                      |	ОсновныеСредства.ЦельИспользования,
	                      |	ОсновныеСредства.ПризнакСобственности,
	                      |	ОсновныеСредства.абс_Префикс,
	                      |	ОсновныеСредства.МестоЭксплуатацииПоСооружению,
	                      |	ОсновныеСредства.абс_ПоследнийИзменивший,
	                      |	ОсновныеСредства.абс_КодПоОКОФ_504,
	                      |	ОсновныеСредства.абс_УчаствуетВРасчетеНалогаНаИмущество,
	                      |	ОсновныеСредства.асб_КодЛьготыНалогаНаИмущество,
	                      |	ОсновныеСредства.абс_КлассОС,
	                      |	ОсновныеСредства.абс_ХарактерЭксплуатацииОС,
	                      |	ОсновныеСредства.абс_АмортизационнаяГруппаОС,
	                      |	ОсновныеСредства.абс_КодСобственностиОС,
	                      |	ОсновныеСредства.абс_ИсточникиПриобретенияОС,
	                      |	ОсновныеСредства.абс_Субсчет2гоПорядка,
	                      |	ОсновныеСредства.абс_ВидОбъектаНедвижимости,
	                      |	ОсновныеСредства.абс_СтатусОС,
	                      |	ОсновныеСредства.абс_ИнициаторВводаНового,
	                      |	ОсновныеСредства.абс_КодОперацииВыбытия,
	                      |	ОсновныеСредства.абс_СоответствовалоКритериямОС_До_01_01_2013,
	                      |	ОсновныеСредства.абс_ГруппаОСРЖД,
	                      |	ОсновныеСредства.Помещение,
	                      |	ОсновныеСредства.КадастровыйНомер,
	                      |	ОсновныеСредства.УсловныйНомер,
	                      |	ОсновныеСредства.НазначениеПомещения,
	                      |	ОсновныеСредства.ТипОС,
	                      |	ОсновныеСредства.абс_ОсновноеСредствоИсточник,
	                      |	ОсновныеСредства.абс_ОбособленноеПодразделение,
	                      |	ОсновныеСредства.абс_КодДляПоиска,
	                      |	ОсновныеСредства.абс_НаименованиеДляПоиска
	                      |ИЗ
	                      |	Справочник.ОсновныеСредства КАК ОсновныеСредства
	                      |ГДЕ
	                      |	ОсновныеСредства.Ссылка В(&МассивОС)");
	Запрос.УстановитьПараметр("МассивОС", МассивОС);
	Рез = запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		ПричинаОтказа = "";
		Если Рез.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПерваяГруппа 
			или Рез.АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ВтораяГруппа Тогда
			//1-2 амортизационные группы
			//Эти ОС не являются объектом налогообложения по налогу на имущество -  пп.8 п.4 ст. 374 НК РФ.
			// {{KM WARE Агапов Н.А. Заявка №33016 07.09.2015 начало
			//Сотрудник заказчика Борисова Людмила Валерьевна просил оставить только 2 проверки.
			Если Рез.абс_УчаствуетВРасчетеНалогаНаИмущество Тогда
				СтруктураОтказ.Отказ = Истина;
				ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Участвует В Расчете Налога На Имущество";
			КонецЕсли;	
			Если ЗначениеЗаполнено(Рез.асб_КодЛьготыНалогаНаИмущество) Тогда
				СтруктураОтказ.Отказ = Истина;
				ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Код Льготы Налога На Имущество";
			КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.ТиповойПеречень) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Типовой Перечень";
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.ИнициаторВводаВЭксплуатацию) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Инициатор Ввода В Эксплуатацию";
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.абс_КодПоОКОФ_504) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле КодПоОКОФ_504";
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.асб_КодЛьготыНалогаНаИмущество) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Код Льготы Налога На Имущество";
			//КонецЕсли;	
			//Если Рез.НепроизводственноеОС Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Непроизводственное ОС";
			//КонецЕсли;	
			//Если Рез.КапитальныеЗатраты Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Капитальные Затраты";
			//КонецЕсли;	
			//Если Рез.Недвижимость Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Недвижимость";
			//КонецЕсли;	
			//Если Рез.абс_СоответствовалоКритериямОС_До_01_01_2013 Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Соответствовало КритериямОС До 01.01.2013";
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.КадастровыйНомер) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Кадастровый Номер";
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.УсловныйНомер) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Условный Номер";
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.НазначениеПомещения) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	СтруктураОтказ.ПричинаОтказа = СтруктураОтказ.ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Назначение Помещения";
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Рез.ТипОС) Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Тип ОС";
			//КонецЕсли;	
			//Если Рез.Помещение Тогда
			//	СтруктураОтказ.Отказ = Истина;
			//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "Ошибочно заполнено поле Помещение";
			//КонецЕсли;
			// }}KM WARE Агапов Н.А. Заявка №33016 07.09.2015 окончание
		Иначе
			//НЕ 1-2 амортизационные группы
			Если НЕ Рез.абс_УчаствуетВРасчетеНалогаНаИмущество Тогда
				СтруктураОтказ.Отказ = Истина;
				ПричинаОтказа = ПричинаОтказа + Символы.ПС + "НЕ заполнено поле Участвует В Расчете Налога На Имущество";
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Рез.ИнициаторВводаВЭксплуатацию) Тогда
				СтруктураОтказ.Отказ = Истина;
				ПричинаОтказа = ПричинаОтказа + Символы.ПС + "НЕ заполнено поле Инициатор Ввода В Эксплуатацию";
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Рез.ПризнакСобственности) Тогда
				СтруктураОтказ.Отказ = Истина;
				ПричинаОтказа = ПричинаОтказа + Символы.ПС + "НЕ заполнено поле Признак Собственности";
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Рез.асб_КодЛьготыНалогаНаИмущество) Тогда
				Если Рез.абс_УчаствуетВРасчетеНалогаНаИмущество Тогда
					
// {{KM WARE Лазаревский К.В. Заявка № 04.08.2015 начало
// Ошибка при выполнении
// {{Старый код:
					//Если Вопрос("Вы подтверждаете, что вводимое в эксплуатацию имущество приобретено у взаимозависимого лица?" , РежимДиалогаВопрос.ДаНет, 45, КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
					//	СтруктураОтказ.Отказ = Истина;
					//	ПричинаОтказа = ПричинаОтказа + Символы.ПС + "НЕ заполнено поле Код Льготы Налога На Имущество";
					//Иначе
					////ошибки нет. основание - п. 25 ст. 381 НК РФ	
					//КонецЕсли;
// }}Новый код:
                    #Если НаКлиенте тогда
					Если Вопрос("Вы подтверждаете, что вводимое в эксплуатацию имущество приобретено у взаимозависимого лица?" , РежимДиалогаВопрос.ДаНет, 45, КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
						СтруктураОтказ.Отказ = Истина;
						ПричинаОтказа = ПричинаОтказа + Символы.ПС + "НЕ заполнено поле Код Льготы Налога На Имущество";
					Иначе
					//ошибки нет. основание - п. 25 ст. 381 НК РФ	
					КонецЕсли;
				    #КонецЕсли
// }}KM WARE Лазаревский К.В. Заявка № 04.08.2015 окончание 					#Если НаКлиенте Тогда
			    КонецЕсли;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Рез.ТипОС) Тогда
				СтруктураОтказ.Отказ = Истина;
				ПричинаОтказа = ПричинаОтказа + Символы.ПС + "НЕ заполнено поле Тип ОС";
			КонецЕсли;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ПричинаОтказа) Тогда 
			СтруктураОтказ.ПричинаОтказа = СтруктураОтказ.ПричинаОтказа + Рез.Наименование + Символы.ПС + ПричинаОтказа + Символы.ПС;
		КонецЕсли;
	КонецЦикла;	
	Возврат СтруктураОтказ;
КонецФункции 
// Контроль ОС на правильность заполнения() }}KM WARE Лазаревский К.В. Заявка № 27.07.2015 окончание