
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//АБС ВСТАВКА №7315 НАЧАЛО
	Контроль = Константы.абс_ПросмотрКонфиденциальныхПлатежейКонтроль.Получить();
	Если Контроль 
		И Объект.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП 
		и ПараметрыСеанса.абс_ПользовательДЗО Тогда
		
			//Запрещаем открывать документ пользователя ДЗО без роли "ПросмотрКонфиденциальныхПлатежей"
			НеОткрыватьДокумент = Истина;
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	РолиИИсполнители.Исполнитель
			|ИЗ
			|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
			|ГДЕ
			|	РолиИИсполнители.Исполнитель = &Исполнитель
			|	И РолиИИсполнители.Роль = &Роль");
			Запрос.УстановитьПараметр("Роль",Справочники.РолиИсполнителей.ПросмотрКонфиденциальныхПлатежей);	
			Запрос.УстановитьПараметр("Исполнитель",ПараметрыСеанса.ТекущийПользователь);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				НеОткрыватьДокумент = Ложь;
			КонецЕсли;	
			
			Отказ = НеОткрыватьДокумент;
			
			Если Отказ Тогда
				Сообщить("Доступ запрещен к документу с данным видом операции!",СтатусСообщения.Информация);
			КонецЕсли;	
		
	КонецЕсли;
	//\\АБС ВСТАВКА №7315 КОНЕЦ
	
КонецПроцедуры
