
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьПараметрыФормы(ПараметрКоманды);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыФормы) Тогда
		Возврат;
	КонецЕсли;
	 
	ОткрытьФорму("Документ.абс_ЗакупочныйЗаказ.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	 
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормы(Ссылка) Экспорт
	
	Если Ссылка.Технический Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("Ключ", Ссылка.ЗакупочныйЗаказ);
	
КонецФункции


