
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ

//Закрытие 20-го счета
Процедура ЗакрытиеСчета20БУ()
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Хозрасчетный.ОсновноеПроизводство, );
КонецПроцедуры

Процедура ЗакрытиеСчета20НУ()
	
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Налоговый.ПрямыеРасходыОсновногоПроизводства,"Налоговый");
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Налоговый.КосвенныеРасходыОсновногоПроизводства,"Налоговый");
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Налоговый.ОсновноеПроизводство,"Налоговый");
КонецПроцедуры	
//\\Закрытие 20-го счета

//Закрытие 25-го счета
Процедура ЗакрытиеСчета25БУ()
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект, Движения, ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы, );
КонецПроцедуры

Процедура ЗакрытиеСчета25НУ()
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект, Движения, ПланыСчетов.Налоговый.ОбщепроизводственныеРасходы, "Налоговый");
КонецПроцедуры	
//\\Закрытие 25-го счета

//Закрытие 26-го счета
Процедура ЗакрытиеСчета26БУ()
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы, );
КонецПроцедуры

Процедура ЗакрытиеСчета26НУ() 
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Налоговый.ПрямыеОбщехозяйственныеРасходы,"Налоговый");
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Налоговый.КосвенныеОбщехозяйственныеРасходы,"Налоговый");
КонецПроцедуры	
//\\Закрытие 26-го счета


Процедура ЗакрытиеСчета44БУ()
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Хозрасчетный.РасходыНаПродажу, );
КонецПроцедуры

Процедура ЗакрытиеСчета44НУ()
	абс_ЗакрытиеМесяца.ЗакрытиеСчетовИРегистров(ЭтотОбъект,Движения,ПланыСчетов.Налоговый.РасходыНаПродажу,"Налоговый");
КонецПроцедуры
//\\Закрытие счета 44-го


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения" документа.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	Если ЗакрытиеСчета26БУ Тогда
		ЗакрытиеСчета26БУ();
	КонецЕсли;	
	
	Если ЗакрытиеСчета26НУ Тогда
		ЗакрытиеСчета26НУ();
	КонецЕсли;	
	
	Если ЗакрытиеСчета25БУ Тогда
		ЗакрытиеСчета25БУ();
	КонецЕсли;	
	
	Если ЗакрытиеСчета25НУ Тогда
		ЗакрытиеСчета25НУ();
	КонецЕсли;	
	
	Если ЗакрытиеСчета20БУ Тогда
		ЗакрытиеСчета20БУ();
	КонецЕсли;	
	
	Если ЗакрытиеСчета20НУ Тогда
		ЗакрытиеСчета20НУ();
	КонецЕсли;			
		
	Если ЗакрытиеСчета44БУ Тогда
		ЗакрытиеСчета44БУ();
	КонецЕсли;	
	
	Если ЗакрытиеСчета44НУ Тогда
		ЗакрытиеСчета44НУ();
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" документа.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	
	мУдалятьДвижения = НЕ ЭтоНовый();
КонецПроцедуры
