////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем КонтролироватьПорядок Экспорт;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура, обработчик события "ПередЗаписью" объекта
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//АБС ВСТАВКА №000019899 НАЧАЛО
	ТекРодитель = Ссылка; 	
	Пока ЗначениеЗаполнено(ТекРодитель.Родитель) Цикл
		ТекРодитель = ТекРодитель.Родитель;
		Если не ТекРодитель.абс_ТипПодразделенияОрганизации = абс_ТипПодразделенияОрганизации Тогда
			Отказ = Истина;
			Сообщить("Элемент с типом «"+абс_ТипПодразделенияОрганизации+"» нельзя размещать в ветке, где родитель имеет тип «"+ТекРодитель.абс_ТипПодразделенияОрганизации+"», код родителя «"+СокрЛП(ТекРодитель.Код)+"»!");	
		КонецЕсли;
	КонецЦикла;	 		
	
	Если Ссылка.абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.ПодразделениеОрганизации Тогда
		Отказ = Истина;
		Сообщить("Изменение элементов с типа «подразделение организации» не доступно!") 
	КонецЕсли;

	Если НЕ ((РольДоступна("ПолныеПрава") 
			 	и (абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.ЦФО
			   		или абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.МестоположениеОС))
		      или (РольДоступна("абс_УчетОСиНМА") 
				и абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.МестоположениеОС)) Тогда
				
		Отказ = Истина;
		Сообщить("Ввод новых и изменение элементов не доступен! Тип - "+абс_ТипПодразделенияОрганизации);	
		
	КонецЕсли; 	
	//\\АБС ВСТАВКА №000019899 КОНЕЦ
	
	Если НЕ Отказ Тогда
		ОбщегоНазначения.ПередЗаписьюОбъектаПорядка(Отказ, ЭтотОбъект, КонтролироватьПорядок);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

КонтролироватьПорядок = Истина;
