 
 Процедура Аутентификация() Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст ="ВЫБРАТЬ
	 |	Пользователи.Ссылка
	 |ИЗ
	 |	Справочник.Пользователи КАК Пользователи
	 |ГДЕ
	 |	Пользователи.ЭтоГруппа = ЛОЖЬ
	 |	И Пользователи.ПометкаУдаления = ЛОЖЬ" ;
	 
	 ВыборкаПользователей = Запрос.Выполнить().Выбрать();
	 Пока ВыборкаПользователей.Следующий() Цикл
		 ПользовательВСправочнике = ВыборкаПользователей.Ссылка.ПолучитьОбъект();
		 УИД = ПользовательВСправочнике.ИдентификаторПользователяИБ;
		 Попытка
			 Если ЗначениеЗаполнено(УИД) Тогда 
				 ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИД);
				 Если ПользовательИБ.АутентификацияСтандартная И Не ПользовательВСправочнике.абс_НеСниматьРегламентно Тогда
					 ПользовательИБ.АутентификацияСтандартная = Ложь;
					 ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
					 ПользовательИБ.Записать();
					 //Сообщить(ПользовательИБ);
				 КонецЕсли;
			 КонецЕсли;
		 Исключение //ttk_ОбщегоНазначения.СообщитьОбОшибке("Неверный уникальный идентификатор! Пользователь:"+ПользовательИБ.ПолноеИмя);
		 КонецПопытки;  		 
	 КонецЦикла;
	 
 КонецПроцедуры