// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Агапов Н.А. Заявка №34379 21.09.2015 начало
Функция ПроверкаДаты(ДатаСФ,Организация) экспорт
	   Значение = ложь;
	
	   Запрос = Новый запрос;
	   Запрос.Текст =
	   "ВЫБРАТЬ
	   |	kwr_УстановкаДатыСФСрезПоследних.ДатаНачала
	   |ИЗ
	   |	РегистрСведений.kwr_УстановкаДатыСФ.СрезПоследних КАК kwr_УстановкаДатыСФСрезПоследних
	   |ГДЕ
	   |	kwr_УстановкаДатыСФСрезПоследних.БратьИзПоляДатаСФ = ИСТИНА
	   |	И kwr_УстановкаДатыСФСрезПоследних.Организация = &Организация";
	   запрос.УстановитьПараметр("Организация",Организация);
	   выборка = запрос.Выполнить().Выбрать();
	   
	   Пока выборка.Следующий() цикл
		   // {{KM WARE Малыгин П.К. Заявка 7717417 № 01.02.2016 начало
		   // Доработка алгоритма по заявке
		   // {{Старый код:
		   //		 Если выборка.ДатаНачала > ДатаСФ тогда
		   // }}Новый код:
		   Если ДатаСФ > выборка.ДатаНачала   тогда
			   // }}KM WARE Малыгин П.К. Заявка 7717417 № 01.02.2016 окончание   //
			   Значение = истина;	   
		   КонецЕсли;
	   КонецЦикла;
	   
	   возврат Значение;
	   
КонецФункции // ПроверкаДаты() }}KM WARE Агапов Н.А. Заявка №34379 21.09.2015 окончание
