// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки)
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области в которой был выведен объект)
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ведомость") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Ведомость", "Перемещение товаров", ПечатьПеремещениеТоваров(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ13") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ13", "ТОРГ-13 (Накладная на внутреннее перемещение)", ПечатьТОРГ13(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М4") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М4", "М-4 (Приходный ордер)", ПечатьМ4(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М11") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М11", "M-11 (Требование-накладная)", ПечатьМ11(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М15_Перемещение") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М15_Перемещение", "М-15 (Накладная на отпуск материалов)", ПечатьМ15Перемещение(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьПеремещениеТоваров(МассивОбъектов, ОбъектыПечати)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Организация,
	|	СкладОтправитель,
	|	СкладОтправитель.Представление КАК Поставщик,
	|	СкладПолучатель,
	|	СкладПолучатель.Представление  КАК Покупатель,
	|	Товары.(
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Код                КАК Код,
	|		Номенклатура.Артикул            Как Артикул,
	|		КоличествоМест,
	|		Количество,
	|		ЕдиницаИзмерения.Представление     КАК ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияМест.Представление КАК ЕдиницаИзмеренияМест,
	|		Цена,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		СерияНоменклатуры КАК Серия
	|	),
	|	ВозвратнаяТара.(
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Код                КАК Код,
	|		Номенклатура.Артикул            КАК Артикул,
	|		0 КАК КоличествоМест,
	|		Количество,
	|		0 КАК Цена,
	|		Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаИзмерения,
	|		NULL                                               КАК ЕдиницаИзмеренияМест
	|	)
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки,
	|	ВозвратнаяТара.НомерСтроки
	|";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_Накладная";
	Макет       = ПолучитьМакет("Накладная");

	// Вывести табличную часть
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;

	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		//Макет необходимо получать для каждого следующего документа,
		//	т.к. в процессе печати меняется ширина колонок исходного макета
		Макет       = ПолучитьМакет("Накладная");

		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

		Запрос.Текст = ТекстЗапроса;

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		ВыборкаСтрокТара   = Шапка.ВозвратнаяТара.Выбрать();

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Накладная на перемещение");
		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.Поставщик;
		ОбластьМакета.Параметры.Поставщик = Шапка.СкладОтправитель;
		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.Покупатель;
		ОбластьМакета.Параметры.Получатель = Шапка.СкладПолучатель;
		ТабДокумент.Вывести(ОбластьМакета);


		Если Шапка.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ
		 ИЛИ Шапка.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			ВыводитьЦены = Истина;
			ИмяШапки  = "ШапкаТаблицыСЦенами";
			ИмяСтроки = "СтрокаСЦенами";
		Иначе
			ИмяШапки  = "ШапкаТаблицы";
			ИмяСтроки = "Строка";
		КонецЕсли;

		ОбластьНомера = Макет.ПолучитьОбласть(ИмяШапки + "|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть(ИмяШапки + "|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть(ИмяШапки + "|Данные");

		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		ОбластьКолонкаТовар = Макет.Область("Товар");
		Если Не ВыводитьКоды Тогда
			ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
												Макет.Область("КолонкаКодов").ШиринаКолонки;
		КонецЕсли;

		ОбластьНомера = Макет.ПолучитьОбласть(ИмяСтроки + "|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть(ИмяСтроки + "|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть(ИмяСтроки + "|Данные");

		Ном = 0;
	    ФлЕстьКоличествоМест = ложь;
		// Выборка товаров
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;

			Ном = Ном + 1;
			Если ВыборкаСтрокТовары.КоличествоМест<>0 Тогда 
				ФлЕстьКоличествоМест = истина;
			КонецЕсли;
			
			//ОбластьНомера.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьНомера.Параметры.НомерСтроки = Ном;
			ТабДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;

			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьДанных.Параметры.Товар = ВыборкаСтрокТовары.Товар + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьДанных);

		КонецЦикла;

		// Выборка возвратная тара
		Пока ВыборкаСтрокТара.Следующий() Цикл

			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТара.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			Ном = Ном + 1;

			//ОбластьНомера.Параметры.Заполнить(ВыборкаСтрокТара);
			ОбластьНомера.Параметры.НомерСтроки = Ном;
			ТабДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТара.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТара.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;

			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТара);
			ОбластьДанных.Параметры.Товар = ВыборкаСтрокТара.Товар;
			ТабДокумент.Присоединить(ОбластьДанных);

		КонецЦикла;

		// Вывести подвал
		ОбластьНомера = Макет.ПолучитьОбласть("Подвал|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("Подвал|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("Подвал|Данные");

		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);

		// Вывести подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		//АБС ВСТАВКА 000021575  05.11.2013 11:12:48
		Отпустил = Ссылка.абс_Отпустил;
		
		ФизЛицо   = Отпустил.ФизЛицо;
		Должность = Отпустил.ТекущаяДолжностьОрганизации;
		
		ОбластьМакета.Параметры.ОтветственныйПредставление 	= ""+Должность+" /"+ОбщегоНазначения.ФамилияИнициалыФизЛица(ФизЛицо)+"/";
		
		Получил = Ссылка.абс_Получил;
		Если ТипЗнч(Получил) = Тип("СправочникСсылка.Пользователи") Тогда			
			ФизЛицо   = Получил.ФизЛицо;
			Должность = Получил.абс_Сотрудник.ТекущаяДолжностьОрганизации;
		ИначеЕсли ТипЗнч(Получил) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда	
			ФизЛицо   = Получил.ФизЛицо;
			Должность = Получил.ТекущаяДолжностьОрганизации;
		ИначеЕсли ТипЗнч(Получил) = Тип("СправочникСсылка.ФизическиеЛица") Тогда	
			ФизЛицо = Получил;
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			                      |	СотрудникиОрганизаций.ТекущаяДолжностьОрганизации КАК Должность
			                      |ИЗ
			                      |	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			                      |ГДЕ
			                      |	СотрудникиОрганизаций.Физлицо = &Ссылка
			                      |	И СотрудникиОрганизаций.Актуальность
			                      |	И СотрудникиОрганизаций.Организация = &Организация");
			Запрос.УстановитьПараметр("Ссылка",Получил);
			Запрос.УстановитьПараметр("Организация",Ссылка.Организация);
			Рез = Запрос.Выполнить().Выбрать();
			Рез.Следующий();
			Должность = ?(Рез.Должность=Null,"",Рез.Должность);
		Иначе	
			ФизЛицо = ""; // = ?(Получил = Неопределено,Справочники.ФизическиеЛица.ПустаяСсылка(),Получил);
			Должность = "";
		КонецЕсли;
		
		ОбластьМакета.Параметры.Получил 	= ""+Должность+" /"+ОбщегоНазначения.ФамилияИнициалыФизЛица(ФизЛицо)+"/";
		//АБС ВСТАВКА 000021575 КОНЕЦ
		//АБС ИЗМЕНЕНИЕ 000021575  05.11.2013 11:27:37  ОбластьМакета.Параметры.Заполнить(Шапка); //АБС ИЗМЕНЕНИЕ 000021575 КОНЕЦ
		ТабДокумент.Вывести(ОбластьМакета);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);

    КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьПеремещениеТоваров()

// Формирует табличный документ по унифицированной форме ТОРГ-13
// 
// Возвращаемое значение
//  Табличный документ - унифицированная форма ТОРГ-13
//
Функция ПечатьТОРГ13(МассивОбъектов, ОбъектыПечати)

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;
	
	ТекстЗапроса = 	"ВЫБРАТЬ
	|	Номер КАК НомерДокумента,
	|	Дата  КАК ДатаДокумента,
	|	Организация,
	|	СкладОтправитель КАК ОтправительПодразделение,
	|	СкладПолучатель  КАК ПолучательПодразделение,
	|	СкладОтправитель.ВидСклада КАК ОтправительВидСклада,
	|	СкладПолучатель.ВидСклада  КАК ПолучательВидСклада,
	|	ОтветственныеЛицаОтправитель.ФизическоеЛицо КАК ФизЛицоОтправитель,
	|	ОтветственныеЛицаПолучатель.ФизическоеЛицо  КАК ФизЛицоПолучатель,
	|	Товары.(
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|		Номенклатура." + ТоварКод + " КАК ТоварКод,
	|		Цена,
	|		Количество,
	|		КоличествоМест,
	|		Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ЕдиницаХраненияОстатковКоэффициент,
	|		ЕдиницаИзмерения.Коэффициент КАК ДокЕдиницаКоэффициент,
	|		ЕдиницаИзмерения.Представление               КАК ЕдиницаИзмеренияНаименование,
	|		ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|		ЕдиницаИзмеренияМест.Представление           КАК ЕдиницаИзмеренияМестНаименование,
	|		ВЫБОР
	|			КОГДА КоличествоМест > 0 ТОГДА ЕдиницаИзмеренияМест.Коэффициент / Коэффициент
	|			ИНАЧЕ NULL
	|		КОНЕЦ                                        КАК КоличествоВОдномМесте,
	|		ХарактеристикаНоменклатуры                   КАК Характеристика,
	|		СерияНоменклатуры                            КАК Серия,
	|		Номенклатура.ВестиПартионныйУчетПоСериям     КАК ПартионныйУчетПоСериям
	|	),
	|	ВозвратнаяТара.(
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|		Номенклатура." + ТоварКод + " КАК ТоварКод,
	|		0 КАК Цена,
	|		0 КАК Сумма,
	|		0 КАК КоличествоВОдномМесте,
	|		Количество,
	|		Номенклатура.ЕдиницаХраненияОстатков.Представление               КАК ЕдиницаИзмеренияНаименование,
	|		Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодПоОКЕИ
	|	)
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СкладОтправитель) КАК ОтветственныеЛицаОтправитель
	|ПО
	|	ИСТИНА
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СкладПолучатель)  КАК ОтветственныеЛицаПолучатель
	|ПО
	|	ИСТИНА
	|
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки,
	|	ВозвратнаяТара.НомерСтроки
	|";
	
	Макет = ПолучитьОбщийМакет("ТОРГ13");

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_ТОРГ13";

 	ВалютаПечати = глЗначениеПеременной("ВалютаРегламентированногоУчета");

   	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос       = Новый Запрос;
		Запрос.УстановитьПараметр("Дата",             Ссылка.Дата);
		Запрос.УстановитьПараметр("ТекущийДокумент",  Ссылка);
		Запрос.УстановитьПараметр("СкладОтправитель", Ссылка.СкладОтправитель);
		Запрос.УстановитьПараметр("СкладПолучатель",  Ссылка.СкладПолучатель);
	    Запрос.Текст = ТекстЗапроса;


		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();

		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		ВыборкаСтрокТара   = Шапка.ВозвратнаяТара.Выбрать();

		ЭтоСкладНТТ = (Шапка.ОтправительВидСклада = Перечисления.ВидыСкладов.НТТ
		              ИЛИ Шапка.ПолучательВидСклада = Перечисления.ВидыСкладов.НТТ);

		Если НЕ ЭтоСкладНТТ Тогда
			ТаблицаСтоимости        = ПолучитьТаблицуСтоимостиТоваров(Ссылка);
			Если ТаблицаСтоимости = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			ВалютаУпрУчета          = глЗначениеПеременной("ВалютаУправленческогоУчета");
			Параметры               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУпрУчета, Ссылка.Дата);
			КурсВалютыУпрУчета      = Параметры.Курс;
			КратностьВалютыУпрУчета = Параметры.Кратность;
		КонецЕсли;


		// Выводим общие реквизиты шапки
		СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
		ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента));
		ОбластьМакета.Параметры.НомерДокумента           = ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка);
		ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
		ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
		ТабДокумент.Вывести(ОбластьМакета);

		СтрокНаСтранице = 23;
		СтрокШапки      = 10;
		СтрокПодвала    = 9;
		НомерСтраницы   = 1;

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		КоличествоСтрок = ВыборкаСтрокТовары.Количество();

		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;

		// инициализация итогов по странице
		ИтогКоличествоМестПоСтранице = 0;
		ИтогМассаБруттоПоСтранице    = 0;
		ИтогМассыНеттоПоСтранице     = 0;
		ИтогСуммыПоСтранице          = 0;

		// инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоМассаБрутто = 0;
		ИтогоМассаНетто  = 0;
		ИтогоСумма       = 0;

		Ном = 0;

		// Выводим многострочную часть докмента
		ВыборкаСтрокТовары      = Шапка.Товары.Выбрать();
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьМакета           = Макет.ПолучитьОбласть("Строка");

		// Выборка товаров
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;

			Ном = Ном + 1;
			//Начинаем новую страницу, если предыдущая строка была последней на странице
			//или пора переносить последнюю строку на последнюю страницу с подвалом.
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;

			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
			 или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда

				ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;

				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

				// инициализация итогов по странице
				ИтогКоличествоМестПоСтранице = 0;
				ИтогМассаБруттоПоСтранице    = 0;
				ИтогМассаНеттоПоСтранице     = 0;
				ИтогСуммыПоСтранице          = 0;

				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;

			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);

			КоличествоМест = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");

			Если ВыборкаСтрокТовары.КоличествоМест <> 0 И ЗначениеЗаполнено(ВыборкаСтрокТовары.ЕдиницаИзмеренияМестНаименование) Тогда
				КоличествоМест = КоличествоМест 
				                 + Символы.ПС
				                 + " (" + Формат(ВыборкаСтрокТовары.КоличествоМест,"ЧЦ=15; ЧДЦ=0")
				                 + " "
				                 + ВыборкаСтрокТовары.ЕдиницаИзмеренияМестНаименование
				                 + ")";
			КонецЕсли;

			ОбластьМакета.Параметры.КоличествоМест    = КоличествоМест;
			ОбластьМакета.Параметры.ТоварНаименование = ВыборкаСтрокТовары.ТоварНаименование + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);

			Если ЭтоСкладНТТ Тогда
				Сумма = ВыборкаСтрокТовары.Количество * ВыборкаСтрокТовары.Цена;
			Иначе
				Если ВыборкаСтрокТовары.Количество = 0 Тогда
					Сумма = 0;
					Цена  = 0;
				Иначе
					Количество = 0;
					Сумма = ПолучитьСтоимостьТовара(ТаблицаСтоимости,
					                                ВыборкаСтрокТовары.Номенклатура,
					                                ВыборкаСтрокТовары.Характеристика,
					                                ВыборкаСтрокТовары.Серия,
					                                ВыборкаСтрокТовары.ПартионныйУчетПоСериям,
					                                Количество);
					Цена  = ?(Количество = 0, 0, Сумма / Количество);
				КонецЕсли;

				Если ВыборкаСтрокТовары.ДокЕдиницаКоэффициент <> 0 Тогда
					Количество = Количество * ВыборкаСтрокТовары.ЕдиницаХраненияОстатковКоэффициент / ВыборкаСтрокТовары.ДокЕдиницаКоэффициент;
				КонецЕсли;
					
				Цена = Окр(?(Количество > 0, Сумма / Количество, 0), 2);
				Сумма = Цена * ВыборкаСтрокТовары.Количество;
				ОбластьМакета.Параметры.Цена = Цена;
			КонецЕсли;

			ОбластьМакета.Параметры.Сумма = Сумма;

			ТабДокумент.Вывести(ОбластьМакета);

			// Обновим итоги по странице
			ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТовары.Количество;
			ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;

			// Обновим итогов по документу
			ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТовары.Количество;
			ИтогоСумма       = ИтогоСумма       + Сумма;

		КонецЦикла;

		// Выборка возвратная тара
		Пока ВыборкаСтрокТара.Следующий() Цикл

			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТара.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;

			Ном = Ном + 1;
			//Начинаем новую страницу, если предыдущая строка была последней на странице
			//или пора переносить последнюю строку на последнюю страницу с подвалом.
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;

			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
			 или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда

				ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;

				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

				// инициализация итогов по странице
				ИтогКоличествоМестПоСтранице = 0;
				ИтогМассаБруттоПоСтранице    = 0;
				ИтогМассаНеттоПоСтранице     = 0;
				ИтогСуммыПоСтранице          = 0;

				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;

			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТара);

			ОбластьМакета.Параметры.КоличествоМест    = Формат(ВыборкаСтрокТара.Количество, "ЧЦ=15; ЧДЦ=3");
			ОбластьМакета.Параметры.ТоварНаименование = ВыборкаСтрокТара.ТоварНаименование + " (возвратная тара)";

			ТабДокумент.Вывести(ОбластьМакета);

			// Обновим итоги по странице
			ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТара.Количество;

			// Обновим итогов по документу
			ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТара.Количество;

		КонецЦикла;

		ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;

		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
		ОбластьМакета.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
		ОбластьМакета.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
		ОбластьМакета.Параметры.ИтогоСумма          = ИтогоСумма;

		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим подвал документа
		ФИООтправителя = ФормированиеПечатныхФормСервер.ФамилияИмяОтчество(Шапка.ФизЛицоОтправитель, Шапка.ДатаДокумента);
		ФИОПолучателя  = ФормированиеПечатныхФормСервер.ФамилияИмяОтчество(Шапка.ФизЛицоПолучатель,  Шапка.ДатаДокумента);
		ОбластьМакета  = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ДолжностьОтправителя = ФормированиеПечатныхФормСервер.СведенияОСотруднике(Шапка.ФизЛицоОтправитель, Шапка.ДатаДокумента, Шапка.Организация).Должность;
		ОбластьМакета.Параметры.ФИООтправителя       = ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИООтправителя.Фамилия + " " + ФИООтправителя.Имя + " " + ФИООтправителя.Отчество);
		ОбластьМакета.Параметры.ДолжностьПолучателя  = ФормированиеПечатныхФормСервер.СведенияОСотруднике(Шапка.ФизЛицоПолучатель,  Шапка.ДатаДокумента, Шапка.Организация).Должность;
		ОбластьМакета.Параметры.ФИОПолучателя        = ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИОПолучателя.Фамилия  + " " + ФИОПолучателя.Имя  + " " + ФИОПолучателя.Отчество);
		ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописиНаРусском;
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
		ОбластьМакета.Параметры.ИтогоСуммаПрописью = ЧислоПрописью(Цел(ИтогоСумма), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
		ОбластьМакета.Параметры.ИтогоСуммаКоп      = Формат(Цел((ИтогоСумма-Цел(ИтогоСумма))*100), "ЧЦ=2; ЧН=00");
		ТабДокумент.Вывести(ОбластьМакета);

		// Зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
    КонецЦикла;

	Возврат ТабДокумент;

КонецФункции // ПечатьТОРГ13()

// Возвращает таблицу стоимости по товарам
//
Функция ПолучитьТаблицуСтоимостиТоваров(Ссылка)

	СтруктраПараметров = Новый Структура();
	
	СтруктраПараметров.Вставить("Регистратор", Ссылка);

	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СписаниеТоваров.Номенклатура,
	               |	СписаниеТоваров.ХарактеристикаНоменклатуры,
	               |	СписаниеТоваров.СерияНоменклатуры,
	               |	СписаниеТоваров.СчетУчетаБУ КАК СчетУчета,
	               |	СписаниеТоваров.Качество,
	               |	СписаниеТоваров.Количество,
	               |	СписаниеТоваров.Количество * ЕСТЬNULL(ТаблицаСебестоимостиОбороты.Стоимость, 0) / ЕСТЬNULL(ВЫБОР
	               |			КОГДА ТаблицаСебестоимостиОбороты.Количество = 0
	               |				ТОГДА 1
	               |			ИНАЧЕ ТаблицаСебестоимостиОбороты.Количество
	               |		КОНЕЦ, 1) КАК Стоимость,
	               |	СписаниеТоваров.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	СписаниеТоваров.СерияНоменклатуры КАК Серия,
	               |	СписаниеТоваров.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК СписаниеТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСебестоимостиОбороты КАК ТаблицаСебестоимостиОбороты
	               |		ПО СписаниеТоваров.Номенклатура = ТаблицаСебестоимостиОбороты.Номенклатура
	               |			И СписаниеТоваров.Ссылка = ТаблицаСебестоимостиОбороты.Регистратор
	               |			И (СписаниеТоваров.ХарактеристикаНоменклатуры = ТаблицаСебестоимостиОбороты.ХарактеристикаНоменклатуры
	               |				ИЛИ ТаблицаСебестоимостиОбороты.ХарактеристикаНоменклатуры = ""Не используется"")
	               |			И (СписаниеТоваров.СерияНоменклатуры = ТаблицаСебестоимостиОбороты.СерияНоменклатуры
	               |				ИЛИ ТаблицаСебестоимостиОбороты.СерияНоменклатуры = ""Не используется"")
				   |			И ((СписаниеТоваров.СчетУчетаБУ = ТаблицаСебестоимостиОбороты.СчетУчета) 
				   |				ИЛИ (ТаблицаСебестоимостиОбороты.СчетУчета = ""Не используется""))"+
				   ?(Ссылка.ВидОперации=Перечисления.ВидыОперацийСписаниеТоваров.ТоварыПродукция,"
				   |			И ((СписаниеТоваров.Качество = ТаблицаСебестоимостиОбороты.Качество)
				   |				ИЛИ (ТаблицаСебестоимостиОбороты.Качество = ""Не используется""))","")+"
	               |ГДЕ
	               |	СписаниеТоваров.Ссылка = &Регистратор";
										
										
	Возврат УправлениеЗапасами.ПолучитьТаблицуЗатратДляПечатиИЗаполненияДокументов(Ссылка, ТекстЗапроса, СтруктраПараметров);

КонецФункции // ПолучитьТаблицуСтоимостиТоваров()

// Возвращает стоимость товара
//
Функция ПолучитьСтоимостьТовара(Таблица, Номенклатура, Характеристика = Неопределено, Серия = Неопределено, ПартионныйУчетПоСериям = Ложь, Количество)

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура",                   Номенклатура);
	Если ЗначениеЗаполнено(Характеристика) Тогда
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", Характеристика);
	КонецЕсли;

	Если ПартионныйУчетПоСериям
	   И ЗначениеЗаполнено(Серия) Тогда
		СтруктураПоиска.Вставить("СерияНоменклатуры",          Серия);
	КонецЕсли;

	Строки = Таблица.НайтиСтроки(СтруктураПоиска);

	Если Строки.Количество() > 0 Тогда
		Стоимость  = Строки[0].Стоимость;
		Количество = Строки[0].Количество;
	Иначе
		Стоимость  = 0;
		Количество = 0;
	КонецЕсли;

	Возврат Стоимость;

КонецФункции // ПолучитьСтоимостьПоПартиямТоваров()

// Функция формирует табличный документ унифицированной формы М-4
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ по форме М-4 (приходный ордер).
//
Функция ПечатьМ4(МассивОбъектов, ОбъектыПечати)
    ТекстЗапросаШапка = "
	|ВЫБРАТЬ
	|	Ссылка.Номер КАК Номер,
	|	Ссылка.Дата  КАК ДатаСоставления,
	|	Ссылка.Организация,
	|	Ссылка.Организация             КАК ЮрФизЛицо,
	|	Ссылка.СкладПолучатель         КАК МестоПриемки,
	|	Ссылка.СкладПолучатель.Представление КАК СкладНаименование,
	|	Ссылка.//Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(Ссылка.//Подразделение)  КАК ПредставлениеПодразделения
	|	//ПОЛЕ_КорСчет ,ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НовыйСчетУчетаБУ) = 1 ТОГДА
	|	//ПОЛЕ_КорСчет	МИНИМУМ(НовыйСчетУчетаБУ) 
	|	//ПОЛЕ_КорСчет ИНАЧЕ """" КОНЕЦ КАК СубСчет
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|//ПОЛЕ_КорСчет СГРУППИРОВАТЬ ПО Ссылка";

	ТекстЗапросаТовары = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура.Код                КАК ТоварКод,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмеренияНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ВложенныйЗапрос.КоличествоПринято,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.Метка       КАК Метка
	|
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		СУММА(Количество)                    КАК КоличествоПринято,
	|		ХарактеристикаНоменклатуры           КАК Характеристика,
	|		СерияНоменклатуры                    КАК Серия,
	|		МИНИМУМ(НомерСтроки)                 КАК НомерСтроки,
	|		0                                    КАК Метка
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
	|	ГДЕ
	|		ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|
	|	СГРУППИРОВАТЬ ПО 
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры
	|	) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК Строка(1000)),
	|	Номенклатура.Код,
	|	Номенклатура.ЕдиницаХраненияОстатков.Представление  КАК ЕдиницаИзмеренияНаименование,
	|	Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	Количество,
	|	NULL,
	|	NULL,
	|	НомерСтроки КАК НомерСтроки,
	|	2           КАК Метка
	|ИЗ
	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО Метка ВОЗР, НомерСтроки ВОЗР
	|
	|";

	Макет = ПолучитьОбщийМакет("М4");

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_М4";

	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент",     Ссылка);
		Запрос.УстановитьПараметр("ВидПоступленияОрдер", Перечисления.ВидыПоступленияТоваров.ПоОрдеру);

		Запрос.Текст = ТекстЗапросаШапка;
		Если Ссылка.ОтражатьВБухгалтерскомУчете Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПеремещениеТоваров", "Документ.ПеремещениеТоваров.Товары");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_КорСчет", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Подразделение", "ПодразделениеОрганизации");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"Ссылка.", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Подразделение", "Подразделение");
		КонецЕсли;

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();

		ЗапросПоТоварам = Новый Запрос();
		ЗапросПоТоварам.УстановитьПараметр("ТекущийДокумент", Ссылка);
		ЗапросПоТоварам.Текст = ТекстЗапросаТовары;	
		ВыборкаСтрокТовары = ЗапросПоТоварам.Выполнить().Выбрать();

		// Выводим общие реквизиты шапки
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ЮрФизЛицо, Шапка.ДатаСоставления);

		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе);
		ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОПокупателе.КодПоОКПО;
		ОбластьМакета.Параметры.НомерДокумента           = ОбщегоНазначения.ПолучитьНомерНаПечать(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок докмента
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДокумента");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ДатаСоставления = Шапка.ДатаСоставления;
		ПредставлениеКонтрагента = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаСоставления), "ПолноеНаименование,");
		ОбластьМакета.Параметры.ПоставщикНаименование = ПредставлениеКонтрагента;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		НомерСтраницы   = 1;

		КоличествоСтрок = ВыборкаСтрокТовары.Количество();

		// Инициализация итогов в документе
		ИтогоКоличествоПринято = 0;
		Ном = 0;

		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;	

		// Выводим многострочную часть докмента
		ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтрок");
		ОбластьПодвала          = Макет.ПолучитьОбласть("Подвал");
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;

			Ном = Ном + 1;

			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);

			КоличествоПринято = ВыборкаСтрокТовары.КоличествоПринято;

			ОбластьМакета.Параметры.КоличествоПринято = КоличествоПринято;
			ОбластьМакета.Параметры.ТоварНаименование = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование)
			                                          + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары)
			                                          + ?(ВыборкаСтрокТовары.Метка = 2, " (возвратная тара)", "");
													  
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьМакета);
			МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
			Если Ном = КоличествоСтрок Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
			КонецЕсли;

			Если НЕ ФормированиеПечатныхФормСервер.ПроверитьВыводТабличногоДокумента(ТабДокумент, МассивВыводимыхОбластей) Тогда

				НомерСтраницы = НомерСтраницы + 1;
				ПодвалСтрок   = Макет.ПолучитьОбласть("ПодвалСтрок");
				ТабДокумент.Вывести(ПодвалСтрок);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);
				
			КонецЕсли;												  
													  
			ТабДокумент.Вывести(ОбластьМакета);

			ИтогоКоличествоПринято = ИтогоКоличествоПринято + КоличествоПринято;

		КонецЦикла;

		// Выводим итоги по документу
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");

		ОбластьМакета.Параметры.ИтогоКоличествоПринято = ИтогоКоличествоПринято;
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим итоги по документу
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);

		// Зададим параметры макета
		ТабДокумент.ПолеСверху         = 0;
		ТабДокумент.ПолеСлева          = 0;
		ТабДокумент.ПолеСнизу          = 0;
		ТабДокумент.ПолеСправа         = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла; 

	Возврат ТабДокумент;

КонецФункции // ПечатьМ4()

// Функция формирует печатную форму М-11
//
Функция ПечатьМ11(МассивОбъектов, ОбъектыПечати)
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;
	
	ТекстЗапросаШапка = 
	"ВЫБРАТЬ
	|	Ссылка.Номер 	КАК НомерДокумента,
	|	Ссылка.Дата	КАК ДатаДокумента,
	|	Ссылка.Дата	КАК ДатаСоставления,
	|	Ссылка.Организация,
	|	Ссылка.СкладОтправитель КАК Склад,
	|	Ссылка.СкладПолучатель КАК Подразделение
	|	//ПОЛЕ_КорСчет ,ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НовыйСчетУчетаБУ) = 1 ТОГДА
	|	//ПОЛЕ_КорСчет	МИНИМУМ(НовыйСчетУчетаБУ) 
	|	//ПОЛЕ_КорСчет ИНАЧЕ """" КОНЕЦ КАК КоррСчет
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|//ПОЛЕ_КорСчет СГРУППИРОВАТЬ ПО Ссылка";
	
	ТекстЗапросаТовары = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура                                  КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК МатериалНаименование,
	|	ВложенныйЗапрос.Номенклатура." + ТоварКод + "                 КАК НоменклатурныйНомер,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление                КАК ЕдиницаИзмеренияНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код  КАК ЕдиницаИзмеренияКод,
	|	ВложенныйЗапрос.Характеристика       КАК Характеристика,
	|	ВложенныйЗапрос.Серия                КАК Серия,
	|	ВложенныйЗапрос.Количество           КАК Количество,
	|	ВложенныйЗапрос.Счет           		 КАК Счет,
	|	ВложенныйЗапрос.НомерСтроки          КАК НомерСтроки
	|ИЗ 
	|	(
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		СчетУчетаБУ КАК Счет,
	|		ХарактеристикаНоменклатуры	КАК Характеристика,
	|		СерияНоменклатуры           КАК Серия,
	|		СУММА(Количество)           КАК Количество,
	|		МИНИМУМ(НомерСтроки) 		КАК НомерСтроки
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
	|	ГДЕ
	|		ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	|
	|	СГРУППИРОВАТЬ ПО
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		ХарактеристикаНоменклатуры,
	|		СерияНоменклатуры,
	|		СчетУчетаБУ
	|
	|	) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО НомерСтроки ВОЗР
	|";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_М11";
	
	// Вывод заголовка
	Макет = ПолучитьОбщийМакет("М11");

	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		Запрос.Текст = ТекстЗапросаШапка;
		Если Ссылка.ОтражатьВБухгалтерскомУчете Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПеремещениеТоваров", "Документ.ПеремещениеТоваров.Товары");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_КорСчет", "");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"Ссылка.", "");
		КонецЕсли;

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

		Запрос.Текст = ТекстЗапросаТовары;

		ЗапросПоНоменклатуре = Запрос.Выполнить();
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заголовок     = "ТРЕБОВАНИЕ-НАКЛАДНАЯ № " + Строка(Шапка.НомерДокумента);
		Область.Параметры.Заполнить(Шапка);
		
		СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);

		Область.Параметры.ПредставлениеОрганизации   = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации);
		Область.Параметры.ПредставлениеПодразделения = Шапка.Подразделение;
		Область.Параметры.КодОКПО                    = СведенияОбОрганизации.КодПоОКПО;
		
		ТабДокумент.Вывести(Область);
		
		ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСтрокам.Следующий() Цикл

			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаПоСтрокам);
			Область.Параметры.МатериалНаименование = СокрЛП(ВыборкаПоСтрокам.МатериалНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаПоСтрокам);
			
			ТабДокумент.Вывести(Область);

		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Область);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
	КонецЦикла; 

	Возврат ТабДокумент;
	
КонецФункции // ПечатьМ11()

// В функции описано, какие данные следует сохранять в шаблоне
Функция СтруктураДополнительныхДанныхФормы() Экспорт
	
	Возврат ХранилищаНастроек.ДанныеФорм.СформироватьСтруктуруДополнительныхДанных("Товары,ВозвратнаяТара");
	
КонецФункции

// АБС ВСТАВКА Печать М-11 из перемещения 
Функция ПечатьМ15Перемещение(МассивОбъектов, ОбъектыПечати)
		
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;
	
	ТекстЗапросаШапка = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Номер КАК НомерДокумента,
	|	ПеремещениеТоваров.Дата КАК ДатаДокумента,
	|	ПеремещениеТоваров.Дата КАК ДатаСоставления,
	|	ПеремещениеТоваров.Организация,
	|	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
	|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
	|	ПеремещениеТоваров.СкладОтправитель.Код КАК КодСкладаОтправителя,
	|	ПеремещениеТоваров.СкладПолучатель.Код КАК КодСкладаПолучателя,
	|	ПеремещениеТоваров.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	ПеремещениеТоваров.Комментарий КАК Основание
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ТекущийДокумент";
	
	
	// " + ТоварКод + "
	ТекстЗапросаТовары = "ВЫБРАТЬ
	                     |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                     |	ВложенныйЗапрос.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	                     |	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварНаименование,
	                     |	ВложенныйЗапрос.Номенклатура.Код КАК ТоварКод,
	                     |	ВложенныйЗапрос.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	                     |	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	                     |	ВложенныйЗапрос.Характеристика КАК Характеристика,
	                     |	ВложенныйЗапрос.Серия КАК Серия,
	                     |	ВложенныйЗапрос.Количество КАК Количество,
	                     |	ВложенныйЗапрос.Счет КАК Счет,
	                     |	ВложенныйЗапрос.НовыйСчет,
	                     |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	                     |	ВЫБОР
	                     |		КОГДА (НЕ ВложенныйЗапрос.ДвиженияКоличество = 0)
	                     |			ТОГДА ВложенныйЗапрос.ДвиженияСтоимость / ВложенныйЗапрос.ДвиженияКоличество * ВложенныйЗапрос.Количество
	                     |		ИНАЧЕ 0
	                     |	КОНЕЦ КАК ЦенаСНДС,
	                     |	ВЫБОР
	                     |		КОГДА (НЕ ВложенныйЗапрос.ДвиженияКоличество = 0)
	                     |			ТОГДА ВложенныйЗапрос.ДвиженияСтоимость / ВложенныйЗапрос.ДвиженияКоличество
	                     |		ИНАЧЕ 0
	                     |	КОНЕЦ КАК СуммаСНДС
	                     |ИЗ
	                     |	(ВЫБРАТЬ
	                     |		ПеремещениеТоваров.Номенклатура КАК Номенклатура,
	                     |		ПеремещениеТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                     |		ПеремещениеТоваров.СчетУчетаБУ КАК Счет,
	                     |		ПеремещениеТоваров.НовыйСчетУчетаБУ КАК НовыйСчет,
	                     |		ПеремещениеТоваров.ХарактеристикаНоменклатуры КАК Характеристика,
	                     |		ПеремещениеТоваров.СерияНоменклатуры КАК Серия,
	                     |		СУММА(ПеремещениеТоваров.Количество) КАК Количество,
	                     |		МИНИМУМ(ПеремещениеТоваров.НомерСтроки) КАК НомерСтроки,
	                     |		ПеремещениеТоваров.абс_ЦенаБезНДС КАК абс_ЦенаБезНДС,
	                     |		СУММА(ПеремещениеТоваров.абс_СуммаБезНДС) КАК абс_СуммаБезНДС,
	                     |		СУММА(ПеремещениеТоваров.абс_СуммаНДС) КАК абс_СуммаНДС,
	                     |		СУММА(ПеремещениеТоваров.абс_СуммаСНДС) КАК абс_СуммаСНДС,
	                     |		ЕСТЬNULL(ДвиженияБУ.Количество, 0) КАК ДвиженияКоличество,
	                     |		ЕСТЬNULL(ДвиженияБУ.Стоимость, 0) КАК ДвиженияСтоимость
	                     |	ИЗ
	                     |		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
	                     |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.Организация КАК Организация,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.Номенклатура КАК Номенклатура,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.Склад КАК Склад,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.СерияНоменклатуры КАК СерияНоменклатуры,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.СчетУчета КАК СчетУчета,
	                     |				СУММА(ПартииТоваровНаСкладахБухгалтерскийУчет.Количество) КАК Количество,
	                     |				СУММА(ПартииТоваровНаСкладахБухгалтерскийУчет.Стоимость) КАК Стоимость
	                     |			ИЗ
	                     |				РегистрНакопления.ПартииТоваровНаСкладахБухгалтерскийУчет КАК ПартииТоваровНаСкладахБухгалтерскийУчет
	                     |			ГДЕ
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.Регистратор = &ТекущийДокумент
	                     |				И ПартииТоваровНаСкладахБухгалтерскийУчет.ВидДвижения = &ВидДвижения
	                     |			
	                     |			СГРУППИРОВАТЬ ПО
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.СерияНоменклатуры,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.ХарактеристикаНоменклатуры,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.Склад,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.Организация,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.Номенклатура,
	                     |				ПартииТоваровНаСкладахБухгалтерскийУчет.СчетУчета) КАК ДвиженияБУ
	                     |			ПО ПеремещениеТоваров.Номенклатура = ДвиженияБУ.Номенклатура
	                     |				И ПеремещениеТоваров.СерияНоменклатуры = ДвиженияБУ.СерияНоменклатуры
	                     |				И ПеремещениеТоваров.ХарактеристикаНоменклатуры = ДвиженияБУ.ХарактеристикаНоменклатуры
	                     |				И ПеремещениеТоваров.СчетУчетаБУ = ДвиженияБУ.СчетУчета
	                     |	ГДЕ
	                     |		ПеремещениеТоваров.Ссылка = &ТекущийДокумент
	                     |	
	                     |	СГРУППИРОВАТЬ ПО
	                     |		ПеремещениеТоваров.Номенклатура,
	                     |		ПеремещениеТоваров.ЕдиницаИзмерения,
	                     |		ПеремещениеТоваров.ХарактеристикаНоменклатуры,
	                     |		ПеремещениеТоваров.СерияНоменклатуры,
	                     |		ПеремещениеТоваров.СчетУчетаБУ,
	                     |		ПеремещениеТоваров.абс_ЦенаБезНДС,
	                     |		ПеремещениеТоваров.НовыйСчетУчетаБУ,
	                     |		ЕСТЬNULL(ДвиженияБУ.Количество, 0),
	                     |		ЕСТЬNULL(ДвиженияБУ.Стоимость, 0)) КАК ВложенныйЗапрос
	                     |
	                     |УПОРЯДОЧИТЬ ПО
	                     |	НомерСтроки";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_М15_Перемещение";
	
	// Вывод заголовка
	Макет = ПолучитьОбщийМакет("абс_М15_Перемещение");

	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		Запрос.Текст = ТекстЗапросаШапка;
		//Если Ссылка.ОтражатьВБухгалтерскомУчете Тогда
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПеремещениеТоваров", "Документ.ПеремещениеТоваров.Товары");
		//Иначе
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Ссылка.", "");
		//КонецЕсли;

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);

		Запрос.Текст = ТекстЗапросаТовары;

		ЗапросПоНоменклатуре = Запрос.Выполнить();
		
		Область = Макет.ПолучитьОбласть("Шапка");
		//Область.Параметры.Заголовок     = "ТРЕБОВАНИЕ-НАКЛАДНАЯ № " + Строка(Шапка.НомерДокумента);
		Область.Параметры.Заполнить(Шапка);
		
		СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);

		//Область.Параметры.ПредставлениеОрганизации   = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации);
		//Область.Параметры.ПредставлениеПодразделения = Шапка.Подразделение;
		Область.Параметры.КодОКПО                    = СведенияОбОрганизации.КодПоОКПО;
		
		ТабДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		
		ТабДокумент.Вывести(Область);
		
		ИтогоВсегоСНДС = 0;
		
		ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСтрокам.Следующий() Цикл

			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаПоСтрокам);
			
			СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(ВыборкаПоСтрокам.СтавкаНДС);
			
			ЦенаБезНДС 	= Окр(ВыборкаПоСтрокам.ЦенаСНДС / (100 + СтавкаНДС) * 100, 2);
			ЦенаНДС 	= ВыборкаПоСтрокам.ЦенаСНДС - ЦенаБезНДС;
			СуммаБезНДС = Окр(ВыборкаПоСтрокам.СуммаСНДС / (100 + СтавкаНДС) * 100, 2);
			СуммаНДС	= ВыборкаПоСтрокам.СуммаСНДС - СуммаБезНДС;
			
			
			Область.Параметры.Цена 			= ВыборкаПоСтрокам.ЦенаСНДС;
			Область.Параметры.СуммаБезНДС	= СуммаБезНДС;
			Область.Параметры.СуммаНДС		= СуммаНДС;
			Область.Параметры.СуммаСНДС 	= ВыборкаПоСтрокам.СуммаСНДС;
			//Область.Параметры.МатериалНаименование = СокрЛП(ВыборкаПоСтрокам.МатериалНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаПоСтрокам);
			
			ТабДокумент.Вывести(Область);

		КонецЦикла;
		
		ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
						
		Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Ссылка.Организация, Ссылка.Дата,);
		Бухгалтер    = Руководители.ГлавныйБухгалтер;
		
		//АБС ВСТАВКА №000020967 НАЧАЛО
		Если ТипЗнч(Ссылка.абс_ОтпускРазрешил) = Тип("СправочникСсылка.Пользователи") Тогда			
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                      |	Пользователи.ФизЛицо,
			                      |	Пользователи.абс_Сотрудник.ТекущаяДолжностьОрганизации КАК Должность
			                      |ИЗ
			                      |	Справочник.Пользователи КАК Пользователи
			                      |ГДЕ
			                      |	Пользователи.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка.абс_ОтпускРазрешил);					  
			Рез = Запрос.Выполнить().Выбрать();
			Рез.Следующий();
			ФизЛицо   = ?(Рез.ФизЛицо=Null,Справочники.ФизическиеЛица.ПустаяСсылка(),Рез.ФизЛицо);
			Должность = ?(Рез.Должность=Null,"",Рез.Должность);
		ИначеЕсли ТипЗнч(Ссылка.абс_ОтпускРазрешил) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда	
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			                      |	СотрудникиОрганизаций.Физлицо,
			                      |	СотрудникиОрганизаций.ТекущаяДолжностьОрганизации КАК Должность
			                      |ИЗ
			                      |	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			                      |ГДЕ
			                      |	СотрудникиОрганизаций.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка.абс_ОтпускРазрешил);
			Рез = Запрос.Выполнить().Выбрать();
			Рез.Следующий();
			ФизЛицо   = ?(Рез.ФизЛицо=Null,Справочники.ФизическиеЛица.ПустаяСсылка(),Рез.ФизЛицо);
			Должность = ?(Рез.Должность=Null,"",Рез.Должность);
		ИначеЕсли ТипЗнч(Ссылка.абс_ОтпускРазрешил) = Тип("СправочникСсылка.ФизическиеЛица") Тогда	
			ФизЛицо = Ссылка.абс_ОтпускРазрешил;
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			                      |	СотрудникиОрганизаций.ТекущаяДолжностьОрганизации КАК Должность
			                      |ИЗ
			                      |	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			                      |ГДЕ
			                      |	СотрудникиОрганизаций.Физлицо = &Ссылка
			                      |	И СотрудникиОрганизаций.Актуальность
			                      |	И СотрудникиОрганизаций.Организация = &Организация");
			Запрос.УстановитьПараметр("Ссылка",Ссылка.абс_ОтпускРазрешил);
			Запрос.УстановитьПараметр("Организация",Ссылка.Организация);
			Рез = Запрос.Выполнить().Выбрать();
			Рез.Следующий();
			Должность = ?(Рез.Должность=Null,"",Рез.Должность);
		Иначе	
			ФизЛицо   = ?(Ссылка.абс_ОтпускРазрешил = Неопределено,Справочники.ФизическиеЛица.ПустаяСсылка(),Ссылка.абс_ОтпускРазрешил);
			Должность = "";
		КонецЕсли;
		//\\АБС ВСТАВКА №000020967 КОНЕЦ
		
		ОбластьПодвала.Параметры.ФИОГлавБухгалтера 		= Бухгалтер;
		ОбластьПодвала.Параметры.ФИОРуководителя 		= ОбщегоНазначения.ФамилияИнициалыФизЛица(ФизЛицо);
		ОбластьПодвала.Параметры.ДолжностьРуководителя 	= Должность;
		
		ОбластьПодвала.Параметры.ФИОКладовщика 			= ОбщегоНазначения.ФамилияИнициалыФизЛица(ФизЛицо);
		ОбластьПодвала.Параметры.ДолжностьКладовщика 	= Должность;
				
		ОбластьПодвала.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(Ссылка.Товары.Количество(), ,",,,,,,,,0");
		ОбластьПодвала.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(ИтогоВсегоСНДС, мВалютаРегламентированногоУчета);
		
		ТабДокумент.Вывести(ОбластьПодвала);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
	КонецЦикла; 

	Возврат ТабДокумент;	
	
КонецФункции
// АБС ВСТАВКА Печать М-11 из перемещения КОНЕЦ

