
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОрганизаций = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации";
	СписокОрганизаций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Если СписокОрганизаций.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Нет данных по организациям.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	ИначеЕсли СписокОрганизаций.Количество() = 1 Тогда
		Организация = СписокОрганизаций[0].Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		Закрыть(Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьОВыборе(Организация);
	
КонецПроцедуры
