
Перем мТекущийПользователь;
Перем мРолиПользователя; 

Процедура ПередЗаписью(Отказ)
	
	СуперПользователь = НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено;
	РуководительБухгалтерскойГруппы = НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительБухгалтерскойГруппы) = Неопределено;
	
	Если не РуководительБухгалтерскойГруппы и не СуперПользователь Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Записать элемент может только руководитель бухгалтерской группы головной организации!",Отказ);	
	КонецЕсли;	
	
КонецПроцедуры

мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"),Справочники.Организации.НайтиПоНаименованию("КТТК",Истина));
