Функция ПолучитьПеречисление(ЗначениеСтрока,Вид)
	Если ПустаяСтрока(ЗначениеСтрока) Тогда
		возврат Перечисления[Вид].ПустаяСсылка()
	КонецЕсли;	
	Для каждого ТекЗнач из Перечисления[Вид] Цикл
		ТекЗначСтр = ""+ТекЗнач;
		Если СокрЛП(ТекЗначСтр) = СокрЛП(ЗначениеСтрока) Тогда
			возврат ТекЗнач;
		КонецЕсли;	
	КонецЦикла;	
КонецФункции	

Процедура ВыполнитьОбновление(Дата) Экспорт
	ТЗ = Новый таблицаЗначений;
	ТЗ.Колонки.Добавить("СтрКлассификация");
	ТЗ.Колонки.Добавить("Классификация");
	ТЗ.Колонки.Добавить("Срок");
	Макет = ПолучитьМакет("Сроки");
	
	Для Сч = 1 по 100000 Цикл
		
		Имя = СокрЛП(Макет.Область(Сч,2,Сч,2).Текст);
		Если ПустаяСтрока(Имя) Тогда
			прервать;
		КонецЕсли;
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.СтрКлассификация = Имя;
		НоваяСтрока.Классификация = ПолучитьПеречисление(Имя,"КлассификацияМСФО");
		Попытка
			НоваяСтрока.Срок =  Число(Макет.Область(Сч,1,Сч,1).Текст);
		исключение
			сообщить("Ошибка! В макете ""Сроки"" в строке "+Сч+" неккоректно указан срок!");
			возврат;
		КонецПопытки;
		НоваяСтрока.Срок = НоваяСтрока.Срок*12;
	КонецЦикла;	
	
	Макет = ПолучитьМакет("Макет");
	НаборЗаписей = РегистрыСведений.КлассификацияМСФО.СоздатьНаборЗаписей();
	
	Для Сч = 2 по 100000 Цикл
		состояние("Загрузка регистра сведений ""Классификация МСФО"". Обработано "+Сч+" элементов");
		Имя = СокрЛП(Макет.Область(Сч,2,Сч,2).Текст);
		Если ПустаяСтрока(Имя) Тогда
			прервать;
		КонецЕсли;
		Попытка
			ОС = Справочники.ОсновныеСредства[Имя];
		Исключение
			сообщить("Ошибка в макете! Не найдено ОС "+Имя);
			возврат;			
		КонецПопытки;	
		Для СчКолонок = 3 по 100 Цикл
			СтрКлассификация = СокрЛП(Макет.Область(Сч,СчКолонок,Сч,СчКолонок).Текст);
			Если ПустаяСтрока(СтрКлассификация) Тогда
				прервать;
			КонецЕсли;
			Цель = СокрЛП(Макет.Область(1,СчКолонок,1,СчКолонок).Текст);
			Попытка
				Цель = Справочники.ЦелиИспользования[Цель];
			исключение
				сообщить("Ошибка в макете! Не найдена цель использования "+Цель);
				возврат;
			КонецПопытки;
			СтрокаТЗ = ТЗ.Найти(Макет.Область(Сч,СчКолонок,Сч,СчКолонок).Текст,"СтрКлассификация");
			Если СтрокаТЗ = Неопределено Тогда
				сообщить("Не задан срок для "+Макет.Область(Сч,СчКолонок,Сч,СчКолонок).Текст);
				возврат;
			КонецЕсли;
			
			Запись = НаборЗаписей.Добавить();
			Запись.Активность=Истина;
			Запись.Период = Дата;
			Запись.ГруппаОС=ОС;
			Запись.ЗначениеКлассификации=СтрокаТЗ.Классификация;
			Запись.СрокПолезногоИспользования=СтрокаТЗ.Срок;
			Запись.ЦельИспользования=Цель;
		КонецЦикла;
	КонецЦикла;	
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		сообщить("Не удалось записать набор записей");
	КонецПопытки;
	
КонецПроцедуры	