
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	абс_Статус 		= Перечисления.абс_СтатусыАСБ.Подготовка;
	Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	Организация	 	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	абс_Статус 		= Перечисления.абс_СтатусыАСБ.Подготовка;
	Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	Организация 	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	ДанныеФакта.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.абс_ИсторияСтатусовАСБ.ЗаписатьСтатус(Ссылка, абс_Статус, ДополнительныеСвойства);
		
КонецПроцедуры


