
&НаКлиенте
Процедура ОтборОтображение(Команда)
	Флаг = Не Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.УправлениеВидимостью.ПодчиненныеЭлементы.ОтборОтображение.Пометка;
	УстановитьВидимостьПоляОтбора(Флаг);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоляОтбора(Флаг)
	Элементы.ГруппаОтборы.Видимость = Флаг;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.УправлениеВидимостью.ПодчиненныеЭлементы.ОтборОтображение.Пометка = Флаг;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьПоляОтбора(Ложь);
КонецПроцедуры
