
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Итого = 0;
	Для Каждого ТекСтрокаСегментыСети Из СегментыСети Цикл
		Итого = Итого + ТекСтрокаСегментыСети.Процент;
	КонецЦикла;
	
	Если Итого <> 100 Тогда
		Отказ = Истина;
		сообщить("Общий процент не равен 100%");
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрокаСегментыСети Из СегментыСети Цикл
		// регистр РаспределениеВыручкиЗаказаПоРегионам 
		Движение = Движения.РаспределениеВыручкиЗаказаПоРегионам.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = Заказ;
		Движение.СегментСети = ТекСтрокаСегментыСети.СегментСети;
		Движение.Процент = ТекСтрокаСегментыСети.Процент;
	КонецЦикла;
	// записываем движения регистров
	Движения.РаспределениеВыручкиЗаказаПоРегионам.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
