
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДобавитьНесколько.Пометка = Объект.ВыводитьСписком;
	Элементы.Группа2.Видимость = Не Объект.ВыводитьСписком;
	Элементы.Группа1.Видимость = Объект.ВыводитьСписком;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНесколько(Команда)
	
	Если Объект.Подписки.Количество() > 1 Тогда
		Ответ = Вопрос("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПерваяСтрока = Новый Структура;
			ПерваяСтрока.Вставить("Пользователь", Объект.Подписки[0].Пользователь);
			ПерваяСтрока.Вставить("Подразделение", Объект.Подписки[0].ПодразделениеОрганизации);
			Объект.Подписки.Очистить();
			НоваяСтрока = Объект.Подписки.Добавить();
			НоваяСтрока.Пользователь = ПерваяСтрока.Пользователь;			
			НоваяСтрока.ПодразделениеОрганизации = ПерваяСтрока.Подразделение;
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	Элементы.ДобавитьНесколько.Пометка = Не Элементы.ДобавитьНесколько.Пометка;
	Объект.ВыводитьСписком = Элементы.ДобавитьНесколько.Пометка;
	Элементы.Группа2.Видимость = Не Объект.ВыводитьСписком;
	Элементы.Группа1.Видимость = Объект.ВыводитьСписком;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПодразделениямНаСервере(Организация)
	
	Выборка = Документы.ttk_НастройкаПользовательскихПодписок.ЗаполнитьПоПодразделению(Организация);
	Объект.Подписки.Загрузить(Выборка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПодразделениям(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Предупреждение("Не указана организация для которой выполнять заполнение.");
		Возврат;
	КонецЕсли;
	
	Если Объект.Подписки.Количество() > 0 Тогда
		Ответ = Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПоПодразделениямНаСервере(Объект.Организация);
	
КонецПроцедуры
