
// Процедуры обработчики ИнтерактивнойАктивации
Процедура УтверждениеЗакрытияОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ОткрытьФормуДоговора(ДоговорКонтрагента,Задача) Экспорт
	//Если НЕ ДоговорКонтрагента.Пустая() Тогда
	//	ФормаДоговора=ДоговорКонтрагента.ПолучитьФорму("ФормаЭлемента",,Неопределено);
	//	ФормаДоговора.КлючУникальности=Задача;
	//	Если НЕ ФормаДоговора.Открыта() Тогда
	//		ФормаДоговора.Открыть();
	//	КонецЕсли;
	//КонецЕсли;
	Если НЕ ДоговорКонтрагента.Пустая() Тогда
			
		КонтрагентОбъект = ДоговорКонтрагента.ПолучитьОбъект();
		
		ФормаКонтрагента = ДоговорКонтрагента.ПолучитьФорму("ФормаЭлемента",,ДоговорКонтрагента);
		//ФормаКонтрагента.КлючУникальности = Задача;
		
		Если ФормаКонтрагента.Открыта() Тогда
			ФормаКонтрагента.Активизировать();
		Иначе
			ФормаКонтрагента.Открыть();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедуры проверки условий
Процедура УсловиеСогласованоБухгалтериейПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Закрыт;
			
КонецПроцедуры

// Процедуры используемые для создания групповых задач
Процедура УтверждениеЗакрытияБухгалтериейПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи)
	
	ФормируемыеЗадачи.Очистить();
	
	ЗапросИсполнителей = Новый Запрос("ВЫБРАТЬ
	                                  |	РолиИИсполнители.Исполнитель
	                                  |ИЗ
	                                  |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	                                  |ГДЕ
	                                  |	РолиИИсполнители.Роль = &РольИсполнителей");
									  
	РольИсполнителей = Неопределено;									  
	Если ТочкаМаршрута = БизнесПроцессы.абсЗакрытиеДоговоров.ТочкиМаршрута.УтверждениеЗакрытияБухгалтерией Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.СогласованиеБухгалтером;
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.абсЗакрытиеДоговоров.ТочкиМаршрута.УтверждениеЗакрытияПД Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.СогласованиеПД;
	КонецЕсли;
	
	Если РольИсполнителей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросИсполнителей.УстановитьПараметр("РольИсполнителей", РольИсполнителей);
	
	ВыборкаИсполнителей = ЗапросИсполнителей.Выполнить().Выбрать();
	
	//абс изменение Урал 28.01.2014: Формирование одной задачи 
	Если ВыборкаИсполнителей.Количество() Тогда
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрута;
		НоваяЗадача.Дата 				= ТекущаяДата();
		//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи 
		//	+ " ("+СокрЛП(Контрагент.Наименование) + " :" + СокрЛП(ДоговорКонтрагента.Наименование) + ")";
		НоваяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + ": " + СокрЛП(ДоговорКонтрагента.Наименование) + " " 
			+ ТочкаМаршрута.НаименованиеЗадачи + ".";
		
		НоваяЗадача.Роль			    = РольИсполнителей;
		
		НоваяЗадача.ОбъектЗадачи 		= ДоговорКонтрагента;
		
		НоваяЗадача.Записать();
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	КонецЕсли;
	//\\абс Урал 28.01.2014
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

Процедура Завершение2ПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ЗавершитьБП(СтатусЗавершения)
	
	абс_БизнесПроцессыПривелегированный.ЗавершитьБПСогласованияДоговора(ДоговорКонтрагента, СтатусЗавершения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Организация = ДоговорКонтрагента.Организация;
		
	КонецЕсли;
	
КонецПроцедуры



