
&НаКлиенте
Процедура ВывестиСообщениеПользователю() Экспорт
	абс_УправлениеСеансомТонкогоКлиентаСервер.ВывестиСообщениеПользователю();
КонецПроцедуры
&НаКлиенте
Процедура ПолучитьИнтервалПроверки(ИнтервалПроверка) Экспорт
	
	ИнтервалПроверка=абс_УправлениеСеансомТонкогоКлиентаСервер.ПолучитьИнтервалПроверкиНаСервере();
	
КонецПроцедуры
 //&НаКлиенте
//Процедура ПрочитатьСообщения() Экспорт
//ПолучитьСообщенияПользователю(Истина);	
//КонецПроцедуры

//АБС ВСТАВКА 37725  17.01.2014 20:10:28  Шамов
&НаКлиенте
Функция абс_ОбновитьПараметрыКонтроляЗавершенияРаботы(СтруктураПараметров) Экспорт
	
	Возврат абс_УправлениеСеансомТонкогоКлиентаСервер.абс_ОбновитьПараметрыКонтроляЗавершенияРаботыСервер(СтруктураПараметров);
	
КонецФункции

&НаКлиенте
Функция абс_УстановитьПараметрыКонтроляЗавершенияРаботы() Экспорт
		
	Возврат абс_УправлениеСеансомТонкогоКлиентаСервер.ПолучитьТекущиеЗначенияПараметрыКонтроляЗавершенияРаботы();
	
КонецФункции

&НаКлиенте
Функция абс_ЗавершениеРаботыКлиент(абс_ИнтервалПроверкиЗавершенияРаботы) Экспорт
	
	Возврат абс_УправлениеСеансомТонкогоКлиентаСервер.абс_ЗавершениеРаботыСервер(абс_ИнтервалПроверкиЗавершенияРаботы);	
		
КонецФункции
//АБС ВСТАВКА 37725 КОНЕЦ
