////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

Функция ПолучитьСписокВстречПоЗаявке(ЗаявкаКандидата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЗаявкаКандидата",	ЗаявкаКандидата);
	Запрос.УстановитьПараметр("ТекущаяДата",		ОбщегоНазначенияЗК.ПолучитьРабочуюДату());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Встречи.Комментарий,
	|	Встречи.Ссылка,
	|	Встречи.ДатаНачала КАК ДатаНачала,
	|	Встречи.ДатаОкончания
	|ИЗ
	|	Документ.Встречи КАК Встречи
	|ГДЕ
	|	Встречи.ЗаявкаКандидата = &ЗаявкаКандидата
	|	И Встречи.Проведен
	|	И Встречи.ДатаОкончания >= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ИзменитьСостояниеЗаявкиКандидата(ЗаявкаКандидата, СостояниеЗаявки) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТекущаяРаботаПоЗаявкамКандидатов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ОбщегоНазначенияЗК.ПолучитьРабочуюДату());
	НаборЗаписей.Отбор.ЗаявкаКандидата.Установить(ЗаявкаКандидата);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Строка = НаборЗаписей.Добавить();
		Строка.Период			= ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
		Строка.ЗаявкаКандидата	= ЗаявкаКандидата;
	Иначе
		Строка = НаборЗаписей[0];
	КонецЕсли;
	
	Строка.Состояние			= СостояниеЗаявки;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура НазначитьВстречу(ЭлементыФормы, ЭтаФорма, ЭтотОбъект) Экспорт
	
	ДанныеСтроки = ЭлементыФормы.ТабличноеПолеЗаявкиКандидатов.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено ИЛИ ДанныеСтроки.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиКандидатов.ФизЛицо,
	|	ЗаявкиКандидатов.Ответственный.ФизЛицо
	|ИЗ
	|	Справочник.ЗаявкиКандидатов КАК ЗаявкиКандидатов
	|ГДЕ
	|	ЗаявкиКандидатов.Ссылка = &ЗаявкаКандидата";
	Запрос.УстановитьПараметр("ЗаявкаКандидата",	ДанныеСтроки.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Форма = Документы.Встречи.ПолучитьФормуНовогоДокумента(, ЭтаФорма, ЭтотОбъект);
	
	Форма.ВстречаСКандидатом	= Истина;
	Форма.ЗаявкаКандидата		= ДанныеСтроки.Ссылка;
	
	Если Выборка.Следующий() Тогда
		Если Не Выборка.Физлицо.Пустая() Тогда
			Форма.Участники.Добавить().Физлицо = Выборка.Физлицо;
		КонецЕсли;
		Если Выборка.ОтветственныйФизлицо <> NULL И Не Выборка.ОтветственныйФизлицо.Пустая() Тогда
			Форма.Участники.Добавить().Физлицо = Выборка.ОтветственныйФизлицо;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы документа
