
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТекстСообщения.Заголовок = Параметры.ТекстСообщения;
	Если Параметры.ЗавершитьРаботу Тогда
		Элементы.ФормаЗавершитьРаботу.КнопкаПоУмолчанию = Истина;
		Элементы.ФормаДа.Видимость = Ложь;
		Элементы.ФормаНет.Видимость = Ложь;
	Иначе
		Элементы.ФормаЗавершитьРаботу.Видимость = Ложь;
		Элементы.ФормаДа.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	
	Закрыть(КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСсылкиНажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение("http://users.v8.1c.ru/");
КонецПроцедуры
