
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПорядокВывода.Добавить("ЦФУ","ЦФУ");
	ПорядокВывода.Добавить("ЦФО","ЦФО");
	ПорядокВывода.Добавить("БС","БС");
	
	ЗначенияОтбора.Очистить();
	НовСтрока = ЗначенияОтбора.Добавить(); НовСтрока.Показатель = "ЦФУ"; НовСтрока.Значение = "";	
	НовСтрока = ЗначенияОтбора.Добавить(); НовСтрока.Показатель = "ЦФО"; НовСтрока.Значение = "";	
	НовСтрока = ЗначенияОтбора.Добавить(); НовСтрока.Показатель = "БС"; НовСтрока.Значение 	= "";	
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗ()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЦФУ",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(5, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("ЦФО",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(5, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("БС",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(5, ДопустимаяДлина.Переменная)));
	ТЗ.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(18, 2)));
	
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ1"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ1"; НовСтрока.ЦФО = "ЦФО2"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ1"; НовСтрока.ЦФО = "ЦФО3"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ1"; НовСтрока.ЦФО = "ЦФО3"; НовСтрока.БС = "БС2"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ1"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС2"; НовСтрока.Сумма = 2000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ2"; НовСтрока.ЦФО = ""; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ3"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ3"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ4"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ5"; НовСтрока.ЦФО = "ЦФО3"; НовСтрока.БС = "БС5"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ2"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС6"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ3"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	НовСтрока = ТЗ.Добавить(); НовСтрока.ЦФУ = "ЦФУ3"; НовСтрока.ЦФО = "ЦФО1"; НовСтрока.БС = "БС1"; НовСтрока.Сумма = 1000;
	
	Возврат ТЗ;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	ТЗ = ПолучитьТЗ();
	
	ОтборЦФУ = ЗначенияОтбора[0].Значение;
	ОтборЦФО = ЗначенияОтбора[1].Значение;
	ОтборБС  = ЗначенияОтбора[2].Значение;
	
	Таблица.Очистить();
	ТабДок 					= Новый ТабличныйДокумент();
	Макет 					= Отчеты.кттк_ОСВ_УПР1.ПолучитьМакет("ОСВ_Упр");
	ОбластьШапки 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаУровень1 	= Макет.ПолучитьОбласть("СтрокаУровень1");
	ОбластьСтрокаУровень2 	= Макет.ПолучитьОбласть("СтрокаУровень2");
	ОбластьСтрокаУровень3 	= Макет.ПолучитьОбласть("СтрокаУровень3");
	ОбластьИтог 			= Макет.ПолучитьОбласть("Итог");
	
	//выведем шапку
	ОбластьШапки.Параметры.Инфо 	= "Информация";
	ТабДок.Вывести(ОбластьШапки);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЗ.ЦФУ,
	                      |	ТЗ.ЦФО,
	                      |	ТЗ.БС,
	                      |	ТЗ.Сумма
	                      |ПОМЕСТИТЬ ТЗ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЗ.ЦФУ КАК ЦФУ,
	                      |	ТЗ.ЦФО КАК ЦФО,
	                      |	ТЗ.БС КАК БС,
	                      |	ТЗ.Сумма КАК Сумма
	                      |ИЗ
	                      |	ТЗ КАК ТЗ
	                      |УСЛОВИЯОТБОРА
	                      |ИТОГИ
	                      |	СУММА(Сумма)
	                      |ПО
	                      |	ЦФУ,
	                      |	ЦФО,
	                      |	БС");
	
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.УстановитьПараметр("ЦФУ",ОтборЦФУ);
	Запрос.УстановитьПараметр("ЦФО",ОтборЦФО);
	Запрос.УстановитьПараметр("БС",ОтборБС);
	
	Если      ОтборЦФУ = "" и ОтборЦФО = "" и ОтборБС = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","");
	ИначеЕсли ОтборЦФУ = "" и ОтборЦФО = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","ГДЕ ТЗ.БС = &БС");
	ИначеЕсли ОтборЦФУ = "" и ОтборБС = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","ГДЕ ТЗ.ЦФО = &ЦФО");
	ИначеЕсли ОтборЦФО = "" и ОтборБС = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","ГДЕ ТЗ.ЦФУ = &ЦФУ");
		
	ИначеЕсли ОтборЦФУ = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","ГДЕ ТЗ.ЦФО = &ЦФО И ТЗ.БС = &БС");
	ИначеЕсли ОтборЦФО = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","ГДЕ ТЗ.ЦФУ = &ЦФУ И ТЗ.БС = &БС");
	ИначеЕсли ОтборБС = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","ГДЕ ТЗ.ЦФУ = &ЦФУ И ТЗ.ЦФО = &ЦФО");
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УСЛОВИЯОТБОРА","ГДЕ ТЗ.ЦФУ = &ЦФУ И ТЗ.ЦФО = &ЦФО И ТЗ.БС = &БС");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();					
	
	
	ВыборкаПо1Уровню = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,ПорядокВывода[0].Значение);					
	Пока ВыборкаПо1Уровню.Следующий() Цикл					
		ОбластьСтрокаУровень1.Параметры.Уровень1  		= ВыборкаПо1Уровню[ПорядокВывода[0].Значение];
		ОбластьСтрокаУровень1.Параметры.Дебет1  		= ВыборкаПо1Уровню.Сумма;
		ОбластьСтрокаУровень1.Параметры.Кредит1  		= ВыборкаПо1Уровню.Сумма;
		ТабДок.Вывести(ОбластьСтрокаУровень1);
		
		ВыборкаПо2Уровню = ВыборкаПо1Уровню.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,ПорядокВывода[1].Значение);					
		ТабДок.НачатьГруппуСтрок("Уровень2",Истина);
		Пока ВыборкаПо2Уровню.Следующий() Цикл					
			ОбластьСтрокаУровень2.Параметры.Уровень2  		= ВыборкаПо2Уровню[ПорядокВывода[1].Значение];
			ОбластьСтрокаУровень2.Параметры.Дебет2  		= ВыборкаПо2Уровню.Сумма;
			ОбластьСтрокаУровень2.Параметры.Кредит2  		= ВыборкаПо2Уровню.Сумма;
			ТабДок.Вывести(ОбластьСтрокаУровень2);
			
			ВыборкаПо3Уровню = ВыборкаПо2Уровню.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,ПорядокВывода[2].Значение);					
			ТабДок.НачатьГруппуСтрок("Уровень3",Истина);
			Пока ВыборкаПо3Уровню.Следующий() Цикл					
				ОбластьСтрокаУровень3.Параметры.Уровень3  		= ВыборкаПо3Уровню[ПорядокВывода[2].Значение];
				ОбластьСтрокаУровень3.Параметры.Дебет3  		= ВыборкаПо3Уровню.Сумма;
				ОбластьСтрокаУровень3.Параметры.Кредит3  		= ВыборкаПо3Уровню.Сумма;
				ТабДок.Вывести(ОбластьСтрокаУровень3);
			КонецЦикла;
			ТабДок.ЗакончитьГруппуСтрок();
			
			
			
		КонецЦикла;
		ТабДок.ЗакончитьГруппуСтрок();
		
		
		
		
	КонецЦикла;
	
	
	ОбластьИтог.Параметры.Дебет 	= ТЗ.Итог("Сумма");
	ОбластьИтог.Параметры.Кредит 	= ТЗ.Итог("Сумма");
	ТабДок.Вывести(ОбластьИтог);
	
	Таблица = ТабДок;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
