
Функция ПолучитьСтатусВводаБюджета() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	МАКСИМУМ(абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.NUM_LOAD) КАК NUM_LOAD,
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.Организация,
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.ПериодГод
	                      |ИЗ
	                      |	РегистрСведений.абс_ИнтеграцияCognos_ЛогЗагрузкиБюджета.СрезПоследних КАК абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.Организация,
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.ПериодГод");
						  
	Возврат Запрос.Выполнить().Выгрузить();						  
						  
КонецФункции

Функция ПолучитьДокументыВводаБюджета() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВводБюджета.Ссылка КАК Документ,
	                      |	ВводБюджета.Организация,
	                      |	ВводБюджета.Год КАК ПериодГод,
	                      |	ВводБюджета.Сценарий
	                      |ИЗ
	                      |	Документ.абс_ВводБюджета КАК ВводБюджета
	                      |ГДЕ
	                      |	ВводБюджета.Групповой");
						  
	Возврат Запрос.Выполнить().Выгрузить();						  
						  
КонецФункции