
&НаКлиенте
Процедура ЗаполнитьДляПодчиненных(Команда)

	Если НЕ Объект.ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Ответ = Вопрос("Записать?", РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
		Записать();
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("ГруппаОС");
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Объект);
	
	ЗаполнитьДляПодчиненныхСервер(Объект.Ссылка, СтруктураРеквизитов);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДляПодчиненныхСервер(Ссылка, СтруктураРеквизитов)
	
	ПланыВидовХарактеристик.абс_СвойстваОС.ЗаполнитьГруппуОСДляПодчиненных(Ссылка, СтруктураРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ТаблЧасть.Видимость = Объект.РедактируетсяВТаблице;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура РедактируетсяВТаблицеПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабЧасти = Справочники.ОсновныеСредства.ПустаяСсылка().Метаданные().ТабличныеЧасти;	
	Для Каждого строка Из ТабЧасти Цикл
		Элементы.ТаблЧасть.СписокВыбора.Добавить(строка.Имя, строка.Синоним);	
	КонецЦикла;
	
КонецПроцедуры
