
&НаКлиенте
Процедура СписокЗначенийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(СписокЗначений);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Список") Тогда
		СписокЗначений.ЗагрузитьЗначения(Параметры.Список.ВыгрузитьЗначения());		
	КонецЕсли;
	
	Если Параметры.Свойство("ОписаниеТиповЗначений") Тогда
		СписокЗначений.ТипЗначения = Параметры.ОписаниеТиповЗначений;		
	КонецЕсли;
	
КонецПроцедуры
