&НаКлиенте
Процедура ВидПоказателяПриИзменении(Элемент)
	Элементы.АлгоритмРасчета.Видимость = Объект.ТипПоказателя = Перечисления.абс_ВидыПоказателей.Алгоритмом;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоПросмотр = Истина;
	
	Элементы.АлгоритмРасчета.Видимость = Объект.ТипПоказателя = Перечисления.абс_ВидыПоказателей.Алгоритмом;
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмРасчетаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбщаяФорма = ПолучитьОбщуюФорму("ВводТекста", ЭтаФорма);
	ОбщаяФорма.Текст = Объект.ТекстМодуля;
	ОбщаяФорма.ОткрытьМодально();
	Если Объект.ТекстМодуля <> ОбщаяФорма.Текст Тогда 
		Объект.ТекстМодуля = ОбщаяФорма.Текст;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПолучитьИдентификатор(Элемент.ТекстРедактирования, Объект.Идентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписанНовыйПоказатель");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификатор(СтрНаименование, Идентификатор)
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Разделители	=  " .,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";
		
		Идентификатор = "";
		БылСпецСимвол = Ложь;
		Для НомСимвола = 1 По СтрДлина(СтрНаименование) Цикл
			Символ = Сред(СтрНаименование,НомСимвола,1);
			Если Найти(Разделители, Символ) <> 0 Тогда
				БылСпецСимвол = Истина;
			ИначеЕсли БылСпецСимвол Тогда
				БылСпецСимвол = Ложь;
				Идентификатор = Идентификатор + ВРег(Символ);
			Иначе
				Идентификатор = Идентификатор + Символ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ПолучитьИдентификатор

&НаКлиенте
Процедура ПроверитьАлгоритм(Команда)
	Если Модифицированность Тогда 
		Ответ = Вопрос("Перед проверкой элемент необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Записать();
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Работает = ПроверитьАлгоритмНаСервере();
	Если Работает Тогда 
		Элементы.ПроверитьАлгоритм.Картинка = БиблиотекаКартинок.ЗеленаяГалка;
	Иначе 
		Элементы.ПроверитьАлгоритм.Картинка = БиблиотекаКартинок.ПротоколСОшибкой;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьАлгоритмНаСервере()
	Возврат Справочники.абс_ПоказателиДляПремий.ПроверитьАлгоритм(Объект.Ссылка);
КонецФункции
