//////////////////ОБЩИЕ ФУНКЦИИ////////////////////////////////

&НаКлиенте
Процедура ПерейтиКРазделу(ИмяСсылки)

	Имя = СтрЗаменить(ИмяСсылки, "Ссылка", "");
	
	//отсекем номер ссылки
	Длина = СтрДлина(Имя);
	Пока Истина Цикл
		Символ = Сред(Имя,Длина,1);
		Если Символ > "0" И Символ < "9" Тогда
			Длина = Длина - 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Имя = Сред(Имя, 1, Длина);
	//\\
	
	Элементы.Страницы.ТекущаяСтраница   = Элементы.Страницы.ПодчиненныеЭлементы["Страница"+Имя];
	Элементы.ЗаголовокРаздела.Заголовок = Имя;
	
КонецПроцедуры         

&НаСервере
Процедура УстановитьВидимостьОтборСогласованияНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СсылкаСогласование.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.СсылкаСогласование.Доступность = Истина;
	
	СписокСогласование.Параметры.УстановитьЗначениеПараметра("ИТР", Объект.Ссылка);
	
КонецПроцедуры


//////////////////ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ФОРМЫ///////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТолькоПросмотр = НЕ (РольДоступна("абс_РедактированиеИТР")ИЛИ РольДоступна("ПолныеПрава"));
		
	КонецЕсли;
	
	УстановитьВидимостьОтборСогласованияНаСервере();   
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьОтборСогласованияНаСервере();	
	
КонецПроцедуры


&НаКлиенте
Процедура СсылкаОбщаяИнформацияНажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаЗапросНажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаЗаказыОМНажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаХТТКНажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаУзлыНажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаСогласованиеНажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаРазделы1Нажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаРазделы2Нажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаРазделы3Нажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаРазделы4Нажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаРазделы5Нажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаРазделы6Нажатие(Элемент)
	ПерейтиКРазделу(Элемент.Имя);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьЗаказПокупателяОМИзExcel(Команда)
	абс_СлужебныеФункции.ПолучитьОбработку("абс_ЗагрузкаЗаказовПокупателейОМ").ПолучитьФорму().Открыть();
КонецПроцедуры

