Процедура ЗаполнитьСписокДоступныхСтатусов(Список, Ссылка,мРолиПользователя,мТекущийПользователь) Экспорт	
	
	Список.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Список.Добавить(Перечисления.абс_СтатусыПроектов.Подготовка);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка.абс_Статус) Тогда
		Список.Добавить(Перечисления.абс_СтатусыПроектов.Подготовка);
		Возврат;
	Иначе
		Список.Добавить(Ссылка.абс_Статус);
	КонецЕсли;
	
	Если Ссылка.абс_Статус = Перечисления.абс_СтатусыПроектов.Действует Тогда
		
		ПользовательРуководитель = Справочники.Пользователи.НайтиПоРеквизиту("абс_Сотрудник",Ссылка.абс_РуководительПроекта);
		
		Если ПользовательРуководитель = мТекущийПользователь Тогда 	
			Список.Добавить(Перечисления.абс_СтатусыПроектов.Исполнение);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
