
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	абс_ИнтеграцияАСБКлиент.ЗаполнитьПричинуИзмененияСтатуса(Объект, ПричинаИзмененияСтатуса);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПричинаИзмененияСтатуса", ПричинаИзмененияСтатуса);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусов(Команда)
	
	абс_ИнтеграцияАСБКлиент.ОткрытьИсториюСтатусов(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ ВЫБОРА ПЕРИОДА

&НаКлиенте
Процедура ПериодСтрокаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтруктураПараметров = Новый Структура("Значение");
	РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(СтруктураПараметров, СтандартнаяОбработка, Объект.Период, ЭтаФорма);
	Если СтруктураПараметров.Значение <> Неопределено Тогда 
		ПериодСтрока = СтруктураПараметров.Значение;
	Иначе
		ПериодСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.Период);		
	КонецЕсли;
	
	Объект.Период = КонецМесяца(Объект.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокаПриИзменении(Элемент)
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(ПериодСтрока, Объект.Период);
	ПериодСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.Период);
	
	Объект.Период = КонецМесяца(Объект.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	//РаботаСДиалогами.ДатаКакМесяцОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда 
		Объект.Период = ТекущаяДата();
	КонецЕсли;
	
	ЗаполнитьСписокДоступныхСтатусов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.Период);
	абс_ИнтеграцияАСБКлиент.УстановитьВидимостьПоСтатусам(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекущийСтатус", Объект.абс_Статус);
	
	МассивСтатусов = РегистрыСведений.абс_ИсторияСтатусовАСБ.ПолучитьСписокДоступныхСтатусов_ВыгрузкаАСБ(СтруктураПараметров);
																											
	Элементы.абс_Статус.СписокВыбора.ЗагрузитьЗначения(МассивСтатусов);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСписокДоступныхСтатусов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	абс_ИнтеграцияАСБКлиент.УстановитьВидимостьПоСтатусам(ЭтаФорма, Объект);
	
КонецПроцедуры



