
&НаКлиенте
Процедура ГруппировкаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ИмяПоля = Элементы.Список.ТекущийЭлемент.Имя; 
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для каждого ТекЭлем Из Список.Группировка.Элементы Цикл
		Если ТекЭлем.Поле=Поле Тогда
			ТекЭлем.Использование = Истина;
			Возврат;
		КонецЕсли; 
	КонецЦикла; 
	НовГруппировка = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовГруппировка.Поле = Поле;
КонецПроцедуры


&НаКлиенте
Процедура ОтборПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ИмяПоля = Элементы.Список.ТекущийЭлемент.Имя;
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для каждого ТекЭлем Из Список.Группировка.Элементы Цикл
		Если ТипЗнч(ТекЭлем)<>Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
		ИначеЕсли ТекЭлем.Поле=Поле Тогда
			ТекЭлем.Использование = Истина;
			Возврат;
		КонецЕсли; 
	КонецЦикла; 
	
	НовОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовОтбор.ЛевоеЗначение = Поле;
	НовОтбор.ПравоеЗначение = ПараметрыПеретаскивания.Значение[0][ИмяПоля];
	НовОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
КонецПроцедуры

