
&НаКлиенте
Процедура СписокОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущиеДанные = Элементы.СписокОрганизаций.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Оповестить("ПодборФилиалаРаспределяемыеДоходыРасходы",ТекущиеДанные.Ссылка,ЭтаФорма);
	КонецЕсли;
	
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
	
	Если ОрганизацияКТТК <> Параметры.Организация Тогда
		СписокОрганизаций.Параметры.УстановитьЗначениеПараметра("ЭтоКТТК",Ложь);
	Иначе
		СписокОрганизаций.Параметры.УстановитьЗначениеПараметра("ЭтоКТТК",Истина);
	КонецЕсли;
	
КонецПроцедуры
