
&НаСервере
Процедура ЗаполнитьСоответствиеНаСервере()
	
	СписокСоответствия = Документы.ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО.ЗаполнитьСоответствиеКонтрагентовЕИСУПиВГО(Объект.Организация);
	СписокСоответствия.Свернуть("КонтрагентЕИСУП, ДоговорЕИСУП, КонтрагентВГО");
	Объект.СоответствиеКонтрагентов.Загрузить(СписокСоответствия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовПоРолямПользователя()
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
	
	Если мСтатус = ПредопределенноеЗначение("Перечисление.абсСтатусыКонтрагентов.Подготовка") Тогда
		УстановитьТолькоПросмотрВсемЭлементам(Ложь);
	Иначе
		Если мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеБухгалтером) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено Тогда
			УстановитьТолькоПросмотрВсемЭлементам(Ложь);
		Иначе 
			УстановитьТолькоПросмотрВсемЭлементам(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьТолькоПросмотрВсемЭлементам(мТолькоПросмотр = Истина)

	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Элемент.ТолькоПросмотр = мТолькоПросмотр;
		Исключение
			Элемент.Доступность = Не мТолькоПросмотр;						
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыДокументаНаСервере()

	Документы.ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО.ЗаполнитьСписокДоступныхСтатусов(Элементы.мСтатус.СписокВыбора, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыНаСервере()
	
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("Дт", ТекущаяДата());
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("СсылкаНаДокумент", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = (Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая());
	ТолькоПросмотрЭлемента = Ложь;
	УстановитьПараметрыНаСервере();	
	Объект.Ответственный = ?(Не ЗначениеЗаполнено(Объект.Ответственный), глЗначениеПеременной("глТекущийПользователь"), Объект.Ответственный);
	Объект.Статус = ?(Не ЗначениеЗаполнено(Объект.Статус), Перечисления.абс_СтатусыПервичныхДокументов.Подготовка, Объект.Статус);
	
	Если Не (РольДоступна("АБС_Бухгалтер") Или РольДоступна("ПолныеПрава")) Тогда
		ТолькоПросмотрЭлемента = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтатусыДокументаНаСервере();
	мСтатус = Объект.Статус;	
	УстановитьТолькоПросмотрВсемЭлементам(ТолькоПросмотрЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мСтатус = Объект.Статус;
	ОбновитьВидимостьЭлементовПоРолямПользователя();
	УстановитьПараметрыНаСервере();
	Элементы.ИсторияСогласования.Обновить();
	ЗаполнитьСтатусыДокументаНаСервере();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КонтрагентВГО", ПредопределенноеЗначение("Справочник.ttk_КонтрагентыВГО.ПустаяСсылка"));
	НайденныеСтроки = Объект.СоответствиеКонтрагентов.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Ответ = Вопрос("В таблице соответствия найдены строки с пустыми значениями 'Контрагент ВГО'. Продолжить запись документа?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если мСтатус <> Объект.Статус Тогда
		ПричинаИзмененияСтатуса = "";
		Если ВвестиСтроку(ПричинаИзмененияСтатуса, "Причина изменения статуса.", , Истина) Тогда
			Объект.ПричинаИзмененияСтатуса = ПричинаИзмененияСтатуса;
			Объект.Статус = мСтатус;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.СоответствиеКонтрагентов.Количество() > 0 Тогда
		Ответ = Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СоответствиеКонтрагентов.Очистить();
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСоответствиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеКонтрагентовКонтрагентВГОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущийЭлемент.ТекущиеДанные.КонтрагентВГО) Тогда
		СтандартнаяОбработка = Ложь;	    	
    	ЗначениеОтбора = Новый Структура("ИНН", Элементы.СоответствиеКонтрагентов.ТекущиеДанные.КонтрагентЕИСУП.ИНН);
   		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
    	ОткрытьФорму("Справочник.ttk_КонтрагентыВГО.ФормаВыбора", ПараметрыВыбора, Элемент);
   	КонецЕсли;
	
КонецПроцедуры
