
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаПлатежи Из Платежи Цикл
		// регистр zsttk_ОплатыПС_Биллинг 
		Движение = Движения.zsttk_ОплатыПС_Биллинг.Добавить();
		Движение.Период = Дата;
		Движение.Получатель = ТекСтрокаПлатежи.Получатель;
		Движение.ПлатежныеСистемы = ТекСтрокаПлатежи.ПлатежнаяСистема;
		Движение.Сумма = ТекСтрокаПлатежи.Сумма;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Платежи.Итог("Сумма");

КонецПроцедуры

 
Функция ВыполнитьПодключение() Экспорт
	
	РезультатПодключения = Неопределено;
	
	Попытка
		
		#Если Клиент Тогда
		Состояние("Идет процесс соединения ...");
		#КонецЕсли
	
		СтрокаПодключения = "Provider=SQLOLEDB.1; Password=sql_user; User ID=sa; Initial Catalog=INSIDE; Data Source=BETA" ;
		
		Connection = Новый COMОбъект("ADODB.Connection");
		Connection.Open(СтрокаПодключения);
		
		#Если Клиент Тогда
		Состояние("Соединение установлено");
		#КонецЕсли		
			
	Исключение
		
		СтрокаСообщенияОбОшибке = "При попытке соединения с COM-сервером произошла следующая ошибка:" + Символы.ПС 
						+ ОписаниеОшибки();
		#Если Клиент Тогда
			Сообщить(СтрокаСообщенияОбОшибке, СтатусСообщения.Важное);
		    Состояние("Соединение установить не удалось");
			Состояние();
		#КонецЕсли
							
		Возврат Неопределено; 
		
	КонецПопытки;
	
	Возврат Connection;
	
КонецФункции
