
Функция ЗаполнитьПоПодразделению(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПодразделенияОрганизаций.Ссылка КАК ПодразделениеОрганизации,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Дт, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = Пользователи.ФизЛицо
		|		ПО ПодразделенияОрганизаций.Ссылка = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	ПодразделенияОрганизаций.Владелец = &Организация
		|	И ПодразделенияОрганизаций.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыНСИ.Согласовано)
		|	И ПодразделенияОрганизаций.абс_КатегорияПодразделения = ЗНАЧЕНИЕ(Перечисление.абс_КатегорияПодразделения.Департамент)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дт", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции