&НаКлиенте
Процедура ОбновитьДинамическийСписокИсторииПереименованияОП()
	
	СписокИсторияПереименования.Параметры.УстановитьЗначениеПараметра("Ссылка", ОбособленноеПодразделение);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбособленноеПодразделение") Тогда 
		ОбособленноеПодразделение = Параметры.ОбособленноеПодразделение;
	КонецЕсли;
	
	Заголовок = "История переименования: " + ОбособленноеПодразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДинамическийСписокИсторииПереименованияОП();
	
КонецПроцедуры
