
//////////////////////////////////////////////////////////////////////////////////
// Обработчики событий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПередачаОС") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьВыбытиеОСРЖДПоПередачеОС(ДанныеЗаполнения);
	ИначеЕсли  ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПодготовкаКПередачеОС") Тогда 
		СтандартнаяОбработка = Ложь;
		ЗаполнитьВыбытиеОСРЖДПоПодготовкеКПередачеОС(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.СписаниеОС") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьВыбытиеОСРЖДПоСписаниюОС(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьВыбытиеОСРЖДПоЧастичнойЛиквидацииОС(ДанныеЗаполнения);
	КонецЕсли;	
	
	//Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС")
	//		Или ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.СписаниеОС")
	//		Или ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПередачаОС")
	//		Или ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПодготовкаКПередачеОС")
	//		Или ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда
	//	
	//	СтандартнаяОбработка = Ложь;
	//	ЗаполнитьПоДокументуОснования(ДанныеЗаполнения);
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если Не ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Номер) Тогда
		УстановитьНовыйНомер(Организация.Префикс);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;	
		
	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		абс_ПроведениеДокументов.УдалитьДвиженияРегистратора(Ссылка);
	КонецЕсли;
	
	Движения.абс_МеждународныйОСРЖД.Записывать = Истина;
	Движения.абс_ОсновныеСредстваРЖД.Записывать = Истина;
	Движения.абс_СтоимостьОСРЖД.Записывать = Истина;
	
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецМесяца(Дата);
	ТипДокументаОснования = ТипЗнч(ДокументОснование);
	СтруктураЗапросов = Документы.абс_ВыбытиеОСРЖД.ПолучитьСтруктуруЗапросовПроведения(ТипДокументаОснования);
	
	ПустыеСубконто = ПолучитьПустыеСубконто();
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", НачалоПериода);
	Запрос.УстановитьПараметр("ПустыеСубконто", ПустыеСубконто);
	
	ТекстыЗапросов = Новый СписокЗначений;
	ТекстыЗапросов.Добавить(СтруктураЗапросов.абс_МеждународныйУчетОСРЖД_ТекстЗапросаВидыСубконтоСчетов, "");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.абс_МеждународныйУчетОСРЖД_ТекстЗапросаСоответствиеСчетовХозрасчетныйРЖД, "");
	
	Запрос.Текст = "";
	Для Каждого ЭлементСписка Из ТекстыЗапросов Цикл
		Запрос.Текст = Запрос.Текст+ЭлементСписка.Значение;
	КонецЦикла;
	
	Запрос.ВыполнитьПакет();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	Запрос.УстановитьПараметр("МоментДокументаДляРН", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТекстыЗапросов = Новый СписокЗначений;

	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("МоментОснования", ДокументОснование.МоментВремени());
	
	Если ТипДокументаОснования=Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
		
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаТабличнаяЧастьОсновныеСредства , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаСтоимостьОсновныхСредств , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаСтоимостьОсновныхСредствБУ , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаСписаниеБУ , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаДанныеДляФормированияДвижений , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.абс_ВнеоборотныеАктивы_ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаТаблица_абс_СтоимостьОСРЖД , "Таблица_абс_СтоимостьОСРЖД");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД , "Таблица_абс_ОсновныеСредстваРЖД");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД , "Таблица_абс_МеждународныйОСРЖД");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Ликвидация_УдалениеВременныхТаблиц, "");
		
	Иначе 
		Если ТипДокументаОснования=Тип("ДокументСсылка.СписаниеОС") И ДокументОснование.ВидОперации=Перечисления.абс_ВидыОперацийСписанияОС.ПеремещениеМеждуФилиалами Тогда
			ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Передача_ТекстЗапросаТабличнаяЧастьОсновныеСредства , "");
		Иначе
			ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Списание_ТекстЗапросаТабличнаяЧастьОсновныеСредства , "");
		КонецЕсли;
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Списание_ТекстЗапросаСтоимостьОсновныхСредств , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.абс_ВнеоборотныеАктивы_ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Списание_ТекстЗапросаТаблица_абс_СтоимостьОСРЖД , "Таблица_абс_СтоимостьОСРЖД");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Списание_ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД , "Таблица_абс_ОсновныеСредстваРЖД");
		Если ТипДокументаОснования=Тип("ДокументСсылка.СписаниеОС") И ДокументОснование.ВидОперации=Перечисления.абс_ВидыОперацийСписанияОС.ПеремещениеМеждуФилиалами Тогда
			ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Передача_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД , "Таблица_абс_МеждународныйОСРЖД");
		Иначе
			ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Списание_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД , "Таблица_абс_МеждународныйОСРЖД");
		КонецЕсли;
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Выбытие_Списание_УдалениеВременныхТаблиц, "");
		
	КонецЕсли;
	
	
	Запрос.Текст = "";
	Для Каждого ТекстЗапроса Из ТекстыЗапросов Цикл
		Запрос.Текст = Запрос.Текст+ТекстЗапроса.Значение;
	КонецЦикла;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДанных = Новый Структура;
	
	Для Каждого ТекстЗапроса Из ТекстыЗапросов Цикл
		
		ИмяТаблицы = ТекстЗапроса.Представление;
		
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			Индекс = ТекстыЗапросов.Индекс(ТекстЗапроса);
			ТаблицыДанных.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицыДанных.Свойство("Таблица_абс_ОсновныеСредстваРЖД") Тогда
		
		ТаблицаРегистра = ТаблицыДанных.Таблица_абс_ОсновныеСредстваРЖД;
		Если ТаблицаРегистра.Количество()>0 Тогда
			
			НаборЗаписей = Движения.абс_ОсновныеСредстваРЖД;
			НаборЗаписей.Загрузить(ТаблицаРегистра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицыДанных.Свойство("Таблица_абс_СтоимостьОСРЖД") Тогда
		
		ТаблицаРегистра = ТаблицыДанных.Таблица_абс_СтоимостьОСРЖД;
		Если ТаблицаРегистра.Количество()>0 Тогда
			
			НаборЗаписей = Движения.абс_СтоимостьОСРЖД;
			НаборЗаписей.Загрузить(ТаблицаРегистра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицыДанных.Свойство("Таблица_абс_МеждународныйОСРЖД") Тогда
		
		ТаблицаРегистра = ТаблицыДанных.Таблица_абс_МеждународныйОСРЖД;
		Если ТаблицаРегистра.Количество()>0 Тогда
			
			НаборЗаписей = Движения.абс_МеждународныйОСРЖД;
			НаборЗаписей.Загрузить(ТаблицаРегистра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	//абс_ПроведениеДокументов.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	//Документы.абс_ВыбытиеОСРЖД.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//абс_ПроведениеДокументов.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект, ДополнительныеСвойства.ЭтоНовый);
	//
	//абс_ВнеоборотныеАктивы.Отразить_абс_ОсновныеСредстваРЖД(ДополнительныеСвойства, Движения, Отказ);
	//абс_ВнеоборотныеАктивы.Отразить_абс_СтоимостьОСРЖД(ДополнительныеСвойства, Движения, Отказ);
	//абс_МеждународныйУчетОСРЖД.Отразить_абс_МеждународныйОСРЖД(ДополнительныеСвойства, Движения, Отказ);
	//
	//абс_ПроведениеДокументов.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	//	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////
// Процедуры заполнения по документам-основаниям

Процедура ЗаполнитьВыбытиеОСРЖДПоСписаниюОС(ДанныеЗаполнения)
	
	ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();
	ЗаполнитьШапкуИОчиститьТЧ(ДокОснование);
		
	Для Каждого СтрокаОС Из ДокОснование.ОС Цикл
		
		СтрокаТЧ = ОсновныеСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВыбытиеОСРЖДПоПередачеОС(ДанныеЗаполнения)
	
	ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();
	ЗаполнитьШапкуИОчиститьТЧ(ДокОснование);
	
	Для Каждого СтрокаОС Из ДокОснование.ОС Цикл
		
		СтрокаТЧ = ОсновныеСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВыбытиеОСРЖДПоПодготовкеКПередачеОС(ДанныеЗаполнения)
	
	ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();
	ЗаполнитьШапкуИОчиститьТЧ(ДокОснование);
		
	Для Каждого СтрокаОС Из ДокОснование.ОС Цикл
		
		СтрокаТЧ = ОсновныеСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВыбытиеОСРЖДПоЧастичнойЛиквидацииОС(ДанныеЗаполнения)
	
	ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();
	ЗаполнитьШапкуИОчиститьТЧ(ДокОснование);
		
	Для Каждого СтрокаОС Из ДокОснование.ОС Цикл
		
		СтрокаТЧ = ОсновныеСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		СтрокаТЧ.ЧастичнаяЛиквидация = Истина;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьШапкуИОчиститьТЧ(ДокОснование)
	
	Дата = ДокОснование.Дата;
	Организация = ДокОснование.Организация;
	ДокументОснование = ДокОснование.Ссылка;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Если Номер = "" Тогда
		УстановитьНовыйНомер(Организация.Префикс);
	КонецЕсли;
	
	ОсновныеСредства.Очистить();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции

Функция ПолучитьПустыеСубконто()

	ПустыеСубконто = Новый СписокЗначений;
	ВыборкаСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Выбрать();
	Пока ВыборкаСубконто.Следующий() Цикл
		ПустыеСубконто.Добавить(ВыборкаСубконто.ТипЗначения.ПривестиЗначение());
	КонецЦикла;
	ПустыеСубконто.Добавить(Неопределено);
	
	Возврат ПустыеСубконто;

КонецФункции // ПолучитьПустыеСубконто()














//////////////////////////////////////////////////////////////////////////////////
// Функции текстов запросов для процедур заполнения

Функция ТекстЗапросаСписанныеОсновныеСредстваОснования()
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	        |	СУММА(ВложенныйЗапрос.СуммаНачисленнойАмортизации) КАК Амортизация,
	        |	ВложенныйЗапрос.КоррСчет КАК СчетСписания,
	        |	ВложенныйЗапрос.КоррСубконто1 КАК СубконтоСписания1,
	        |	ВложенныйЗапрос.КоррСубконто2 КАК СубконтоСписания2,
	        |	ВложенныйЗапрос.КоррСубконто3 КАК СубконтоСписания3
	        |ПОМЕСТИТЬ СписанныеОсновныеСредстваОснования
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	        |		ХозрасчетныйДвиженияССубконто.Сумма КАК Стоимость,
	        |		0 КАК СуммаНачисленнойАмортизации,
	        |		ХозрасчетныйДвиженияССубконто.СчетДт КАК КоррСчет,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК КоррСубконто1,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК КоррСубконто2,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК КоррСубконто3
	        |	ИЗ
	        |		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	        |				,
	        |				,
	        |				Период = &ПериодОснования
	        |					И Регистратор = &ДокументОснование
	        |					И СчетКт В ИЕРАРХИИ (&СчетаУчетаБУ),
	        |				,
	        |				) КАК ХозрасчетныйДвиженияССубконто
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства),
	        |		0,
	        |		ХозрасчетныйДвиженияССубконто.Сумма,
	        |		ХозрасчетныйДвиженияССубконто.СчетКт,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоКт1,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоКт2,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоКт3
	        |	ИЗ
	        |		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	        |				,
	        |				,
	        |				Период = &ПериодОснования
	        |					И Регистратор = &ДокументОснование
	        |					И СчетДт В ИЕРАРХИИ (&СчетаАмортизацииБУ),
	        |				,
	        |				) КАК ХозрасчетныйДвиженияССубконто) КАК ВложенныйЗапрос
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВложенныйЗапрос.ОсновноеСредство,
	        |	ВложенныйЗапрос.КоррСчет,
	        |	ВложенныйЗапрос.КоррСубконто1,
	        |	ВложенныйЗапрос.КоррСубконто2,
	        |	ВложенныйЗапрос.КоррСубконто3
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблицаШапка()
	
	Возврат "ВЫБРАТЬ
	        |	ШапкаОснования.ДокументОснование,
	        |	ШапкаОснования.Дата,
	        |	ШапкаОснования.Организация
	        |ИЗ
	        |	ШапкаОснования КАК ШапкаОснования
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблицаОсновныеСредства()
	
	Возврат "ВЫБРАТЬ
	        |	ПоступившиеОсновныеСредстваОснования.ОсновноеСредство КАК ОсновноеСредство,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.ДатаПринятияКУчету, ЕСТЬNULL(СостоянияОСОрганизаций.ДатаСостояния, &ПериодОснования)) КАК ДатаПринятияКУчету,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.МестонахождениеОбъекта, ЕСТЬNULL(МестонахождениеОСБУ.Местонахождение, ШапкаОснования.Местонахождение)) КАК Местонахождение,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.МОЛ, ЕСТЬNULL(МестонахождениеОСБУ.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))) КАК МОЛ,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СрокПолезногоИспользования, ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.СрокПолезногоИспользования, 0)) КАК СрокПолезногоИспользования,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.КоэффициентУскорения, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентУскорения, 1)) КАК КоэффициентУскорения,
	        |	ПоступившиеОсновныеСредстваОснования.Стоимость,
	        |	ПоступившиеОсновныеСредстваОснования.СуммаНачисленнойАмортизации,
	        |	ПоступившиеОсновныеСредстваОснования.Стоимость КАК СправедливаяСтоимость,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.ЛиквидационнаяСтоимость ЕСТЬ NULL 
	        |			ТОГДА ВЫРАЗИТЬ(ПоступившиеОсновныеСредстваОснования.Стоимость * ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.ПроцентЛиквидационнойСтоимости, 0) / 100 КАК ЧИСЛО(15, 2))
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ЛиквидационнаяСтоимость,
	        |	0 КАК УбытокОтОбесценения,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетУчета, ЕСТЬNULL(СчетаУчета.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации))) КАК СчетУчета,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетНачисленияАмортизации, ЕСТЬNULL(СчетаАмортизации.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01))) КАК СчетНачисленияАмортизации,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетЗатрат, ЕСТЬNULL(СчетаЗатрат.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка))) КАК СчетЗатрат,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.Субконто1 ЕСТЬ NULL 
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 ЕСТЬ NULL 
	        |							ИЛИ ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	        |						ТОГДА НЕОПРЕДЕЛЕНО
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Продукция
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |					ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1
	        |				КОНЕЦ
	        |		ИНАЧЕ ПараметрыОсновныхСредств.Субконто1
	        |	КОНЕЦ КАК Субконто1,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.Субконто2 ЕСТЬ NULL 
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 ЕСТЬ NULL 
	        |							ИЛИ ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	        |						ТОГДА НЕОПРЕДЕЛЕНО
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Продукция
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |					ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2
	        |				КОНЕЦ
	        |		ИНАЧЕ ПараметрыОсновныхСредств.Субконто2
	        |	КОНЕЦ КАК Субконто2,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.Субконто3 ЕСТЬ NULL 
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 ЕСТЬ NULL 
	        |							ИЛИ ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	        |						ТОГДА НЕОПРЕДЕЛЕНО
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Продукция
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |					ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |				КОНЕЦ
	        |		ИНАЧЕ ПараметрыОсновныхСредств.Субконто3
	        |	КОНЕЦ КАК Субконто3,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетСниженияСтоимости, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный)) КАК СчетСниженияСтоимости,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.НачислятьАмортизацию, ЕСТЬNULL(НачислениеАмортизацииБУ.НачислятьАмортизацию, ИСТИНА)) КАК НачислятьАмортизацию,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.МетодНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.Линейный)) КАК МетодНачисленияАмортизации,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)) КАК ПредполагаемыйОбъемПродукции,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)) КАК Состояние,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСчет,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСубконто1,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСубконто2,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСубконто3
	        |ИЗ
	        |	ПоступившиеОсновныеСредстваОснования КАК ПоступившиеОсновныеСредстваОснования
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБУ КАК МестонахождениеОСБУ
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = МестонахождениеОСБУ.Местонахождение
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходовПоАмортизацииБУ КАК СпособыОтраженияРасходовПоАмортизацииБУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
	        |				ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК СчетаЗатрат
	        |					ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетовЗатрат
	        |					ПО СчетаЗатрат.СчетМеждународный = ВидыСубконтоСчетовЗатрат.Счет
	        |				ПО СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = СчетаЗатрат.СчетХозрасчетный
	        |					И (СчетаЗатрат.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
	        |			ПО СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
	        |				И (СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки = 1)
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК КоррСчета
	        |		ПО ПоступившиеОсновныеСредстваОснования.КоррСчет = КоррСчета.СчетХозрасчетный
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НачислениеАмортизацииБУ КАК НачислениеАмортизацииБУ
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = НачислениеАмортизацииБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = СостоянияОСОрганизаций.ОсновноеСредство
	        |			И (СостоянияОСОрганизаций.Организация = &Организация)
	        |			И (СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаУчетаБУ КАК СчетаУчетаБУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК СчетаУчета
	        |			ПО СчетаУчетаБУ.СчетУчета = СчетаУчета.СчетХозрасчетный
	        |				И (СчетаУчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
	        |			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК СчетаАмортизации
	        |			ПО СчетаУчетаБУ.СчетНачисленияАмортизации = СчетаАмортизации.СчетХозрасчетный
	        |				И (СчетаАмортизации.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = СчетаУчетаБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеОКОФГруппОСРЖД КАК абс_СоответствиеОКОФГруппОСРЖД
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство.КодПоОКОФ = абс_СоответствиеОКОФГруппОСРЖД.ОКОФ
	        |			И ПоступившиеОсновныеСредстваОснования.ОсновноеСредство.абс_ГруппаОСРЖД = абс_СоответствиеОКОФГруппОСРЖД.ГруппаОСРЖД,
	        |	ШапкаОснования КАК ШапкаОснования
			|;
			|";
	
КонецФункции

Процедура ЗаполнитьПоДокументуОснования(ДанныеЗаполнения)
	
	ТаблицыДанных = Новый Структура;
	
	СчетаУчетаБУ = Новый Массив;
	СчетаУчетаБУ.Добавить(ПланыСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации);
	
	СчетаАмортизацииБУ = Новый Массив;
	СчетаАмортизацииБУ.Добавить(ПланыСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ПериодОснования", ДанныеЗаполнения.Дата);
	Запрос.УстановитьПараметр("Организация", ДанныеЗаполнения.Организация);
	Запрос.УстановитьПараметр("СчетаУчетаБУ", СчетаУчетаБУ);
	Запрос.УстановитьПараметр("СчетаАмортизацииБУ", СчетаАмортизацииБУ);
	Запрос.УстановитьПараметр("ПустыеСубконто", абс_МеждународныйУчетОСРЖД.ПолучитьСписокПустыхСубконто(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные));
	Запрос.УстановитьПараметр("МоментОснованияВключая", Новый Граница(ДанныеЗаполнения.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МоментОснованияИсключая", Новый Граница(ДанныеЗаполнения.МоментВремени(), ВидГраницы.Исключая));
	
	ТекстыЗапросов = Новый СписокЗначений;
	ТекстыЗапросов.Добавить(абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("ПериодОснования", "ПустыеСубконто", "СоответствиеСчетовХозрасчетныйМеждународный"), "");
	ТекстыЗапросов.Добавить(абс_МеждународныйУчетОСРЖД.ТекстЗапросаВидыСубконтоСчетов("ВидыСубконтоСчетов"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаСписанныеОсновныеСредстваОснования(), "");
	//ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "ПериодОснования", "ПараметрыОсновныхСредств"), "");
	//ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_МестонахождениеОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "МестонахождениеОСБУ"), "");
	//ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_НачислениеАмортизацииОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "НачислениеАмортизацииБУ"), "");
	//ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ПараметрыАмортизацииОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "ПараметрыАмортизацииОСБУ"), "");
	//ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "СпособыОтраженияРасходовПоАмортизацииБУ"), "");
	//ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_СчетаБухгалтерскогоУчетаОСПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "СчетаУчетаБУ"), "");
	//ТекстыЗапросов.Добавить(ТекстЗапросаТаблицаОсновныеСредства(), "ТаблицаОсновныеСредства");
	
	абс_ПроведениеДокументов.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапросов, ТаблицыДанных);
	
	Если ТаблицыДанных.Свойство("ТаблицаШапка") И ТаблицыДанных.ТаблицаШапка.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТаблицыДанных.ТаблицаШапка[0]);
	КонецЕсли;
	
	Если ТаблицыДанных.Свойство("ТаблицаОсновныеСредства") Тогда
		ОсновныеСредства.Загрузить(ТаблицыДанных.ТаблицаОсновныеСредства);
	КонецЕсли;
	
КонецПроцедуры
