// Вернуть статус документа на дату и время
//
// Параметры
//  ДокументСсылка  - ДокументСсылка.ОтчетКомиссионераОПродажах и т.др. - Документ статуса
//  ПериодСтатуса - ДатаВремя - Необязательный по ум. текущее время. Дата и время статуса 
//
// Возвращаемое значение:
//   ПеречислениеСсылка.абс_СтатусыКадровоРасчетныхДокументов   - Искомый статус
//
// {{KM WARE Трухан А.Г. ЧТЗ Агентский НДС 11.09.2015 начало
Функция ВернутьСтатусДокумента(Знач ДокументСсылка, ПериодСтатуса=Неопределено) Экспорт
	Отборы_стру = Новый Структура("Документ",ДокументСсылка); 
	ДатаСтатуса = ?(ТипЗнч(ПериодСтатуса)<>Тип("Дата"),ТекущаяДата(),ПериодСтатуса);
	Ресурсы_стру = РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.ПолучитьПоследнее(ДатаСтатуса,Отборы_стру);
	Возврат Ресурсы_стру.Статус;
КонецФункции // () }}KM WARE Трухан А.Г.  ЧТЗ Агентский НДС 11.09.2015 окончание

// Установить статус документу на дату и время
//
// Параметры
//  ДокументСсылка  - ДокументСсылка.ОтчетКомиссионераОПродажах и т.др. - Документ статуса
//  Статус 		- ПеречислениеСсылка.абс_СтатусыКадровоРасчетныхДокументов   - Требуемый статус 
//  ПериодСтатуса 	- ДатаВремя - Необязательный по ум. текущее время. Дата и время статуса 
//  Комментарий 	- Строка(200) - Необязательный  
//
// Возвращаемое значение:
//   ПеречислениеСсылка.абс_СтатусыКадровоРасчетныхДокументов   - Требуемый статус
// {{KM WARE Трухан А.Г. ЧТЗ Агентский НДС 11.09.2015 начало
Функция УстановитьСтатус(Знач ДокументСсылка, Знач Статус, Знач ПериодСтатуса=Неопределено, Комментарий) Экспорт
	//Отборы_стру = Новый Структура("ДокументСсылка",ДокументСсылка); 
	ДатаСтатуса = ?(ТипЗнч(ПериодСтатуса)<>Тип("Дата"),ТекущаяДата(),ПериодСтатуса);
    Набор = РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(ДокументСсылка);
	Набор.Отбор.Период.Установить(ДатаСтатуса);
    Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
	    ЗаписьНабора = Набор.Добавить();
	ИначеЕсли Набор.Количество() = 1 Тогда
	    ЗаписьНабора = Набор[0];
	КонецЕсли;	
	
	ЗаписьНабора.Документ = ДокументСсылка;
    ЗаписьНабора.Период = ДатаСтатуса;
    ЗаписьНабора.Статус = Статус;
    ЗаписьНабора.Пользователь = ПараметрыСеанса.ТекущийПользователь;
    ЗаписьНабора.Комментарий = сокрЛП(Комментарий);
	Попытка
	    Набор.Записать(Истина);
		Возврат ЗаписьНабора.Статус;
	Исключение
		Комментарий = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;  
		
КонецФункции // () }}KM WARE Трухан А.Г. ЧТЗ Агентский НДС 11.09.2015 окончание
 