
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////
/// Процедуры и функции форм списка и выбора

Процедура ФормаСпискаПередОткрытиемДополнительно(Форма, ДополнительныеДействия = Неопределено) Экспорт
	
	Форма.Заголовок = "Отражения зарплаты в регл. учете";
	
КонецПроцедуры
	
Процедура ВыполнитьДополнительныеДействия(ИмяКоманды, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

#КонецЕсли

// Функция возвращает счет бухгалтерского учета, в зависимости от передаваемого
// вида базы
//
// Параметры
//  ВидБазы  - "Строка" - вид базы, для которой определяется счет
//
// Возвращаемое значение:
//   <ПланыСчетов.Хозрасчетный>   - счет учета
//
Функция ПолучитьСчетПрочихРасходов(ВидБазы = Неопределено) Экспорт

	Если ВидБазы = Неопределено Тогда
	
		Возврат ПланыСчетов.Хозрасчетный.ПрочиеРасходыОблагаемыеЕНВД
	
	КонецЕсли;
	
	Если ВидБазы = "БазаПФР_ЕНВД" Тогда
	
		Возврат ПланыСчетов.Хозрасчетный.ПрочиеРасходыОблагаемыеЕНВД
	
	Иначе
	
		Возврат ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД
	
	КонецЕсли;

КонецФункции // ПолучитьСчетПрочихРасходов()
 