Функция ЗаполнитьПрежниеЗначенияКонтрагента(ТекКонтрагент,ТекДокумент) Экспорт
	Если ТекКонтрагент.Пустая() ТОгда
		Возврат Ложь;
	КонецЕсли;
	Если ТекКонтрагент.абс_СтатусКонтрагента <> Перечисления.абсСтатусыКонтрагентов.Активный Тогда
		Сообщить("Создавать документ - Заявка на изменение реквизитов контрагентов, можно только для контрагентов со статусом - Активный");
		//ТекКонтрагент = "";
		Возврат Ложь;
	КонецЕсли;	
	
	МетаЗаявка = Метаданные.Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента;
	МетаКонтрагенты = Метаданные.Справочники.Контрагенты;
	Для Каждого ТекРеквизит из МетаКонтрагенты.Реквизиты Цикл
		Если МетаЗаявка.Реквизиты.Найти(ТекРеквизит.Имя) <> Неопределено  ТОгда
			Попытка
				ТекДокумент[ТекРеквизит.Имя]	 = ТекКонтрагент[ТекРеквизит.Имя];
				ТекДокумент[ТекРеквизит.Имя+"Новое"]	 = ТекКонтрагент[ТекРеквизит.Имя];
			Исключение
			КОнецПОпытки;
		КонецЕсли;
	КонецЦикла;
	Если МетаЗаявка.Реквизиты.Найти("Наименование") <> Неопределено ТОгда
		ТекДокумент["Наименование"]	 = ТекКонтрагент["Наименование"];
		ТекДокумент["НаименованиеНовое"]	 = ТекКонтрагент["Наименование"];
		
	КонецЕсли;
	Возврат Истина;
КонецФункции
