Процедура ОтправитьПисьмо(Сообщение) Экспорт

Профиль = Новый ИнтернетПочтовыйПрофиль;
Учетная = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000001");
Профиль.АдресСервераSMTP = Учетная.SMTPСервер;
Профиль.ПортSMTP = Учетная.ПортSMTP;
Профиль.АдресСервераSMTP = СпособSMTPАутентификации.БезАутентификации;
//Профиль.АдресСервераPOP3 = "";
//Профиль.АдресСервераIMAP = 
//Профиль.ПортSMTP = 25;
//Профиль.ПортPOP3 = 110;
//Профиль.ПортIMAP  = 143;
//Профиль.ПользовательIMAP = 
//Профиль.ПользовательSMTP = 
//Профиль.Пользователь = "isup-ttk@ttk.ru";
//POP3ПередSMTP (POP3BeforeSMTP)
//АдресСервераIMAP (IMAPServerAddress)
//АдресСервераPOP3 (POP3ServerAddress)
//АдресСервераSMTP (SMTPServerAddress)
//АутентификацияPOP3 (POP3Authentication)
//АутентификацияSMTP (SMTPAuthentication)
//ИспользоватьSSLIMAP (IMAPUseSSL)
//Пароль (Password)
//ПарольIMAP (IMAPPassword)
//ПарольSMTP (SMTPPassword)
//Пользователь (User)
//ПользовательIMAP (IMAPUser)
//ПользовательSMTP (SMTPUser)
//ПортIMAP (IMAPPort)
//ПортPOP3 (POP3Port)
//ПортSMTP (SMTPPort)
//Таймаут (Timeout)
Почта = Новый ИнтернетПочта;
//Почта.Подключиться(Профиль, ПротоколИнтернетПочты.IMAP);
Почта.Подключиться(Профиль);
//Послать(<Сообщение>, <ОбрабатыватьТексты>, <ПротоколОтправкиПочты>) 
Почта.Послать(Сообщение);

КонецПроцедуры

