
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ОбособленноеПодразделение", ПараметрКоманды);
	
	Форма = ПолучитьФорму("Справочник.абс_ОбособленныеПодразделения.Форма.ФормаИсторияПереименования", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	Форма.ОткрытьМодально();
	//ОткрытьФорму("Справочник.абс_ОбособленныеПодразделения.Форма.ФормаИсторияПереименования", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
