Процедура Заполнить()   Экспорт
	Макет = ПолучитьМакет("Макет");
	Для й = 1 По 100 Цикл
		Код = СокрЛП(Макет.Область(й,2).Текст);
		Если Не ЗначениеЗаполнено(Код) Тогда
			Прервать;
		КонецЕсли;
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Код,".");
		Уровень = МассивСтрок.Количество();
		КодРодителя = "";
		Если Уровень>1 Тогда
			Для Сч = 0 По Уровень-1 Цикл
				КодРодителя = ?(ЗначениеЗаполнено(КодРодителя),КодРодителя+"."+МассивСтрок[Сч],МассивСтрок[Сч]);
			КонецЦикла;
			
		КонецЕсли;
		
		СтрокаПорядка = Код;
		Пока  Найти(СтрокаПорядка,".")>0 Цикл
			СтрокаПорядка = СтрЗаменить(СтрокаПорядка,".","");
		КонецЦикла;
		
		ЧислоДобНулей =15 - СтрДлина(СтрокаПорядка);
		
		Для п = 1 По ЧислоДобНулей Цикл
		СтрокаПорядка = СтрокаПорядка+"0";
	КонецЦикла;
	
	ЧислоПорядка = 0;
	
	ЧислоПорядка = Число(СтрокаПорядка);
		
		
		СтрокаАБФ = Справочники.абс_СтрокиАБФРЖД.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(СтрокаАБФ) И ЗначениеЗаполнено(ЧислоПорядка) Тогда
			  Об = СтрокаАБФ.ПолучитьОбъект();
			  Об.Порядок = ЧислоПорядка;
			  Если ЗначениеЗаполнено(кодРодителя) Тогда
				  СтрокаРодительАБФ = справочники.абс_СтрокиАБФРЖД.НайтиПоКоду(КодРодителя);
				  Об.ВерхнийУровень = СтрокаРодительАБФ
			  КонецЕсли;
			  
			  Об.Записать();
			  состояние("Обрабатыается "+й+" из "+Макет.ВысотаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
