Перем мРегламентноеЗадание Экспорт;
 Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания = "", Постфикс = "")
	
	Если ПараметрЗадания = Неопределено Тогда
		
		РеквизитЗадания = "";
		
	Иначе	
		
		РеквизитЗадания = Строка(ПараметрЗадания.УникальныйИдентификатор);
		
		ПараметрЗадания.Наименование = Наименование + Постфикс;
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ПустаяСтрока(ПараметрЗадания.Ключ) Тогда
			ПараметрЗадания.Ключ = РеквизитЗадания;
		КонецЕсли;
		
		Массив = Новый Массив();
		Массив.Добавить(Код);
		
		//АБС ВСТАВКА  14.04.2014  Навценя
		Массив.Добавить("");
		//АБС ВСТАВКА  КОНЕЦ
		
		ПараметрЗадания.Параметры = Массив;
		ПараметрЗадания.Записать();	
					
	КонецЕсли;	
	
КонецПроцедуры
//Процедура ЗапуститьФоновоеЗадание()
////размерность массива - по числу параметров запускаемой в фоновом режиме процедуры
//	МассивПараметров = Новый Массив(1);
//	МассивПараметров[0] = "123-входной параметр-строка";
//	Ключ = Новый УникальныйИдентификатор; //чтобы отличить наше фоновое задание от других
//	
//	//внимание! Первый параметр - полный путь к запускаемой процедуре, включая имя общего модуля, в котором она находится.
//	ФоновыеЗадания.Выполнить("МодульРегламентныхЗаданий.ФоноваяПроцедура", МассивПараметров, Ключ, "Тестовое ФЗ"); // запуск
//		
//	ПодключитьОбработчикОжидания("ЗаполнитьТП", 1); //ждем, пока ФЗ нам что-то вернет.
//	//Важно! В данном случае применить метод ОжидатьЗавершения не получится. Если получится - пишите как.
//КонецПроцедуры
Процедура ПередЗаписью(Отказ)
	
	//АБС ВСТАВКА  10.04.2014  Навценя
	Справочники.абс_НастройкиОбменаСSQL.ИнтеграцияLotus_ПроверитьУникальностьТипаОбъекта(Ссылка, ТипОбъекта, Отказ);
	Если Отказ Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Для выбранного типа объекта уже существует настройка обмена");
		Возврат;
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ
	
	НужноОтключитьРегЗаданияОбмена =  ПометкаУдаления
		ИЛИ НЕ ИспользоватьРегламентныеЗадания;
	Если мРегламентноеЗадание <>Неопределено Тогда	
		Если НужноОтключитьРегЗаданияОбмена Тогда
				
			Если мРегламентноеЗадание <> Неопределено Тогда
				мРегламентноеЗадание.Использование = Ложь;			
			КонецЕсли;
						
		Иначе
			
			// если оба выключены регл задания - то включаем основное регл задание
			Если мРегламентноеЗадание = Неопределено Тогда
				
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Не выбрано регламентное задание для настройки обмена.", Отказ);				
							
			КонецЕсли;
			
			Если мРегламентноеЗадание <> Неопределено Тогда
				
				мРегламентноеЗадание.Использование = Истина;
				мРегламентноеЗадание.ИмяПользователя = СокрЛП(Ответственный.Код);
				
			КонецЕсли;
				
		КонецЕсли;
		УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, мРегламентноеЗадание);
     КонецЕсли;
	 
КонецПроцедуры
