
Функция НеобходимаПроверкаЗаполненияПроекта(СтруктураПараметров) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_КонтрольЗаполненияПроектов.ЦФО,
	|	абс_КонтрольЗаполненияПроектов.ЦФУ,
	|	абс_КонтрольЗаполненияПроектов.БюджетнаяСтатья
	|ИЗ
	|	РегистрСведений.абс_КонтрольЗаполненияПроектов КАК абс_КонтрольЗаполненияПроектов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЦФО = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ абс_КонтрольЗаполненияПроектов.ЦФО = &ЦФО
	|					ИЛИ абс_КонтрольЗаполненияПроектов.ЦФО = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЦФУ = ЗНАЧЕНИЕ(Справочник.абс_ЦФУ.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ абс_КонтрольЗаполненияПроектов.ЦФУ = &ЦФУ
	|					ИЛИ абс_КонтрольЗаполненияПроектов.ЦФУ = ЗНАЧЕНИЕ(Справочник.абс_ЦФУ.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &БюджетнаяСтатья = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ абс_КонтрольЗаполненияПроектов.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетнаяСтатья)
	|					ИЛИ абс_КонтрольЗаполненияПроектов.БюджетнаяСтатья = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|		КОНЕЦ";
	Для Каждого Параметр Из СтруктураПараметров Цикл 
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
КонецФункции