
// Процедура предназначена для получения начислений и действий с ними
// в зависимости от действия с сотрудником.
//
// Параметры:
//  ДанныеДокумента					- исходные данные для выполнения запроса: ссылка на сотрудника, 
//									  если сотрудник один, таблица значений в случае, если их несколько
//  ДокументСсылка					- ссылка на документ
//  ДокументДата					- дата документа
//  Организация						- ссылка на организацию
//	ИмяДатыДействия					- в разных документах поле с датой действия 
//									  имеет разное имя: ДатаНачала, ДатаДействия, ДатаПриема
//	КоэффициентИндексацииЗаработка 	- необязательный, по умолчанию - 1 (нет индексации), 
//									  используется для пересчета значений при заполнении документа 
//									  Кадровое перемещение сотрудников организаций
//	ПоДаннымТрудовогоДоговора 		- необязательный, по умолчанию - Ложь, признак необходимости 
//									  получать данные трудового договора
//	ПолучатьПлановыеНачисления 		- необязательный, по умолчанию - Истина, признак необходимости 
//									  получать плановые начисления
//
Функция ПолучитьТаблицуДействийСНачислениями(ДанныеДокумента, ДокументСсылка, ДокументДата, Организация, ИмяДатыДействия, КоэффициентИндексацииЗаработка = 1, ПоДаннымТрудовогоДоговора = Ложь, ПолучатьПлановыеНачисления = Истина, ОбособленноеПодразделение = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ИндексируемыеСпособыРасчета = Новый Массив;
	ИндексируемыеСпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	ИндексируемыеСпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	ИндексируемыеСпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	ИндексируемыеСпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	ИндексируемыеСпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой);
	ИндексируемыеСпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок);
	
	Запрос.УстановитьПараметр("ПолучатьПлановыеНачисления", ПолучатьПлановыеНачисления);
	Запрос.УстановитьПараметр("ИндексируемыеСпособыРасчета", ИндексируемыеСпособыРасчета);
	Запрос.УстановитьПараметр("КоэффициентИндексацииЗаработка", КоэффициентИндексацииЗаработка);

	Если ТипЗнч(ДанныеДокумента) = Тип("ТаблицаЗначений") Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеДокумента.Сотрудник,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента." + ИмяДатыДействия + " <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеДокумента." + ИмяДатыДействия + "
		|		ИНАЧЕ ДанныеДокумента.ДатаДокумента
		|	КОНЕЦ КАК ДатаДействия,
		|	ДанныеДокумента.ОбособленноеПодразделение,
		|	ДанныеДокумента.ПодразделениеОрганизации,
		|	ДанныеДокумента.Должность,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.ДатаДокумента
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	&ДанныеДокумента КАК ДанныеДокумента
		|		
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Организация,
		|	ДатаДействия
		|;";
		
		Если ДанныеДокумента.Колонки.Найти("ПодразделениеОрганизации") = Неопределено Тогда 
			ДанныеДокумента.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
			ДанныеДокумента.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.ДолжностиОрганизаций"));
		КонецЕсли;
		
		// дополним таблицу данными шапки документа
		ДанныеДокумента.Колонки.Добавить("ДатаДокумента", 	ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
		ДанныеДокумента.Колонки.Добавить("Организация", 	Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ДанныеДокумента.Колонки.Добавить("ОбособленноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		
		ДанныеДокумента.ЗаполнитьЗначения(ДокументДата,		"ДатаДокумента");
		ДанныеДокумента.ЗаполнитьЗначения(?(ЗначениеЗаполнено(Организация.ГоловнаяОрганизация), Организация.ГоловнаяОрганизация, Организация), 		"Организация");
		ДанныеДокумента.ЗаполнитьЗначения(?(ЗначениеЗаполнено(ОбособленноеПодразделение), ОбособленноеПодразделение, Организация), "ОбособленноеПодразделение");
		
		Запрос.УстановитьПараметр("ДанныеДокумента", ДанныеДокумента);
	Иначе	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
		|	&ДатаДокумента КАК ДатаДействия,
		|	&ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	NULL КАК ПодразделениеОрганизации,
		|	NULL КАК Должность,
		|	&Организация,
		|	&ДатаДокумента
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка = &Сотрудник
		|;";
		
		Запрос.УстановитьПараметр("Сотрудник", ДанныеДокумента);
		Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация.ГоловнаяОрганизация), Организация.ГоловнаяОрганизация, Организация));
		Запрос.УстановитьПараметр("ОбособленноеПодразделение", ?(ЗначениеЗаполнено(ОбособленноеПодразделение), ОбособленноеПодразделение, Организация));
		Запрос.УстановитьПараметр("ДатаДокумента", ДокументДата);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +  "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ДатаДействия,
	|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период
	|ПОМЕСТИТЬ РаботникиСрезПоследнихДаты
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО ДанныеДокумента.Сотрудник = РаботникиОрганизаций.Сотрудник
	|			И ДанныеДокумента.Организация = РаботникиОрганизаций.Организация
	|			И ДанныеДокумента.ДатаДействия >= РаботникиОрганизаций.Период
	|			И (&Ссылка <> РаботникиОрганизаций.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.ДатаДействия,
	|	ДанныеДокумента.Организация
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.Организация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка КАК ВидРасчета,
	|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки КАК НомерПоказателя,
	|	ОсновныеНачисленияОрганизацийПоказатели.Показатель,
	|	ОсновныеНачисленияОрганизацийПоказатели.Показатель.Валюта КАК ВалютаПоказателя
	|ПОМЕСТИТЬ ПоказателиВидовРасчета
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидРасчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаботникиСрезПоследних.Сотрудник,
	|	РаботникиСрезПоследних.Организация,
	|	РаботникиСрезПоследних.ДатаДействия,
	|	РаботникиСрезПоследних.Период,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= РаботникиСрезПоследних.Период
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= РаботникиСрезПоследних.Период
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= РаботникиСрезПоследних.Период
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ КАК ОбособленноеПодразделение
	|ПОМЕСТИТЬ РаботникиСрезПоследних
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботникиСрезПоследнихДаты КАК РаботникиСрезПоследних
	|		ПО РаботникиОрганизаций.Сотрудник = РаботникиСрезПоследних.Сотрудник
	|			И РаботникиОрганизаций.Организация = РаботникиСрезПоследних.Организация
	|			И РаботникиОрганизаций.Период = РаботникиСрезПоследних.Период
	|			И (РаботникиОрганизаций.Регистратор <> &Ссылка)
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	РаботникиСрезПоследних.Сотрудник,
	|	РаботникиСрезПоследних.Организация,
	|	РаботникиСрезПоследних.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.ДатаДействия,
	|	ДанныеДокумента.Организация,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Сотрудник.ОбособленноеПодразделение
	|		ИНАЧЕ ДанныеДокумента.ОбособленноеПодразделение
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПодразделениеОрганизации ЕСТЬ NULL 
	|				ИЛИ ДанныеДокумента.ПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ТОГДА РаботникиСрезПоследних.ПодразделениеОрганизации
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Должность ЕСТЬ NULL 
	|				ИЛИ ДанныеДокумента.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
	|			ТОГДА РаботникиСрезПоследних.Должность
	|		ИНАЧЕ ДанныеДокумента.Должность
	|	КОНЕЦ КАК Должность,
	|	РаботникиСрезПоследних.Организация КАК СтараяОрганизация,
	|	РаботникиСрезПоследних.ОбособленноеПодразделение КАК СтароеОбособленноеПодразделение,
	|	РаботникиСрезПоследних.ПодразделениеОрганизации КАК СтароеПодразделениеОрганизации,
	|	РаботникиСрезПоследних.Должность КАК СтараяДолжность,
	|	СотрудникиОрганизаций.ВидРасчета,
	|	СотрудникиОрганизаций.ТарифнаяСтавка,
	|	СотрудникиОрганизаций.ВалютаТарифнойСтавки,
	|	СотрудникиОрганизаций.ТарифныйРазряд
	|ПОМЕСТИТЬ ДанныеСотрудников
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаботникиСрезПоследних КАК РаботникиСрезПоследних
	|		ПО ДанныеДокумента.Сотрудник = РаботникиСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО ДанныеДокумента.Сотрудник = СотрудникиОрганизаций.Ссылка
	|		
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.ДатаДействия,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Начисления.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
	|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА Начисления.ПериодЗавершения
	|			ИНАЧЕ Начисления.Период
	|		КОНЕЦ) КАК Период
	|ПОМЕСТИТЬ ОсновныеНачисленияСрезПоследних
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
	|		ПО ДанныеДокумента.Сотрудник = Начисления.Сотрудник
	|			И ДанныеДокумента.Организация = Начисления.Организация
	|			И (ВЫБОР
	|				КОГДА ДанныеДокумента.ДатаДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ДанныеДокумента.ДатаДействия >= Начисления.Период
	|			КОНЕЦ)
	|ГДЕ
	|	Начисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|	И Начисления.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
	|	И Начисления.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.ДатаДействия,
	|	ДанныеДокумента.Организация
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.Организация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеНачисленияСрезПоследних.Организация,
	|	ОсновныеНачисленияСрезПоследних.Сотрудник,
	|	ОсновныеНачисленияСрезПоследних.ДатаДействия,
	|	ОсновныеНачисленияСрезПоследних.Период КАК Период,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= ОсновныеНачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.ВидРасчетаЗавершения
	|		ИНАЧЕ Начисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета,
	|	Начисления.ВидРасчетаЗавершения,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= ОсновныеНачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА NULL
	|					ИНАЧЕ Начисления.Показатель1Завершения
	|				КОНЕЦ
	|		КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|			ТОГДА NULL
	|		ИНАЧЕ Начисления.Показатель1
	|	КОНЕЦ КАК Показатель1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= ОсновныеНачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд1Завершения
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд1
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= ОсновныеНачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта1Завершения
	|		ИНАЧЕ Начисления.Валюта1
	|	КОНЕЦ КАК Валюта1
	|ПОМЕСТИТЬ ОсновныеНачисленияСотрудников
	|ИЗ
	|	ОсновныеНачисленияСрезПоследних КАК ОсновныеНачисленияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
	|		ПО ОсновныеНачисленияСрезПоследних.Сотрудник = Начисления.Сотрудник
	|			И ОсновныеНачисленияСрезПоследних.Организация = Начисления.Организация
	|			И (ВЫБОР
	|				КОГДА Начисления.ПериодЗавершения <= ОсновныеНачисленияСрезПоследних.ДатаДействия
	|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ОсновныеНачисленияСрезПоследних.Период = Начисления.ПериодЗавершения
	|				ИНАЧЕ ОсновныеНачисленияСрезПоследних.Период = Начисления.Период
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Начисления.ПериодЗавершения <= ОсновныеНачисленияСрезПоследних.ДатаДействия
	|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА Начисления.ДействиеЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|				ИНАЧЕ Начисления.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|			КОНЕЦ)
	|ГДЕ
	|	Начисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|	И Начисления.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
	|	И Начисления.Регистратор <> &Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.ДатаДействия,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Начисления.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
	|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА Начисления.ПериодЗавершения
	|			ИНАЧЕ Начисления.Период
	|		КОНЕЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.ВидРасчетаЗавершения
	|		ИНАЧЕ Начисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета
	|ПОМЕСТИТЬ НачисленияСрезПоследних
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
	|		ПО ДанныеДокумента.Сотрудник = Начисления.Сотрудник
	|			И ДанныеДокумента.Организация = Начисления.Организация
	|			И ДанныеДокумента.ДатаДействия >= Начисления.Период
	|			И (ВЫБОР
	|				КОГДА ДанныеДокумента.ДатаДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ДанныеДокумента.ДатаДействия >= Начисления.Период
	|			КОНЕЦ)
	|ГДЕ
	|	Начисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|	И Начисления.ВидРасчетаИзмерение <> НЕОПРЕДЕЛЕНО
	|	И Начисления.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.ДатаДействия,
	|	ДанныеДокумента.Организация,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.ВидРасчетаЗавершения
	|		ИНАЧЕ Начисления.ВидРасчета
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленияСрезПоследних.Сотрудник,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.ВидРасчетаЗавершения
	|		ИНАЧЕ Начисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА NULL
	|					ИНАЧЕ Начисления.Показатель1Завершения
	|				КОНЕЦ
	|		КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|			ТОГДА NULL
	|		ИНАЧЕ Начисления.Показатель1
	|	КОНЕЦ КАК Показатель1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА NULL
	|					ИНАЧЕ Начисления.Показатель2Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА NULL
	|				ИНАЧЕ Начисления.Показатель2
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА NULL
	|					ИНАЧЕ Начисления.Показатель3Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА NULL
	|				ИНАЧЕ Начисления.Показатель3
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА NULL
	|					ИНАЧЕ Начисления.Показатель4Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА NULL
	|				ИНАЧЕ Начисления.Показатель4
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА NULL
	|					ИНАЧЕ Начисления.Показатель5Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА NULL
	|				ИНАЧЕ Начисления.Показатель5
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель5,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА NULL
	|					ИНАЧЕ Начисления.Показатель6Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА NULL
	|				ИНАЧЕ Начисления.Показатель6
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель6,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд1Завершения
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд1
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд2Завершения
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд2
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд3Завершения
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд3
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд4Завершения
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд4
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд5Завершения
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд5
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд5,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд6Завершения
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд6
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд6,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта1Завершения
	|		ИНАЧЕ Начисления.Валюта1
	|	КОНЕЦ КАК Валюта1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта2Завершения
	|		ИНАЧЕ Начисления.Валюта2
	|	КОНЕЦ КАК Валюта2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта3Завершения
	|		ИНАЧЕ Начисления.Валюта3
	|	КОНЕЦ КАК Валюта3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта4Завершения
	|		ИНАЧЕ Начисления.Валюта4
	|	КОНЕЦ КАК Валюта4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта5Завершения
	|		ИНАЧЕ Начисления.Валюта5
	|	КОНЕЦ КАК Валюта5,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта6Завершения
	|		ИНАЧЕ Начисления.Валюта6
	|	КОНЕЦ КАК Валюта6,
	|	НачисленияСрезПоследних.ДатаДействия
	|ПОМЕСТИТЬ НачисленияСотрудника
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСрезПоследних КАК НачисленияСрезПоследних
	|		ПО (Начисления.Регистратор <> &Ссылка)
	|			И Начисления.Сотрудник = НачисленияСрезПоследних.Сотрудник
	|			И Начисления.Организация = НачисленияСрезПоследних.Организация
	|			И (ВЫБОР
	|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА Начисления.ПериодЗавершения = НачисленияСрезПоследних.Период
	|				ИНАЧЕ Начисления.Период = НачисленияСрезПоследних.Период
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА Начисления.ВидРасчетаЗавершения = НачисленияСрезПоследних.ВидРасчета
	|				ИНАЧЕ Начисления.ВидРасчета = НачисленияСрезПоследних.ВидРасчета
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
	|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА Начисления.ДействиеЗавершения
	|				ИНАЧЕ Начисления.Действие
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить))
	|ГДЕ
	|	Начисления.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
	|	И Начисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|	И &ПолучатьПлановыеНачисления
	|	И Начисления.ВидРасчетаИзмерение <> НЕОПРЕДЕЛЕНО
	|	И Начисления.Регистратор <> &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОсновныеНачисленияСотрудников.Сотрудник,
	|	ОсновныеНачисленияСотрудников.ВидРасчета,
	|	ОсновныеНачисленияСотрудников.Показатель1,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ОсновныеНачисленияСотрудников.ТарифныйРазряд1,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ОсновныеНачисленияСотрудников.Валюта1,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ОсновныеНачисленияСотрудников.ДатаДействия
	|ИЗ
	|	ОсновныеНачисленияСотрудников КАК ОсновныеНачисленияСотрудников";
	
	Если ПоДаннымТрудовогоДоговора Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДанныеСотрудников.Сотрудник,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Надбавка,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель4,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель5,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель6,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд4,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд5,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд6,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта4,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта5,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта6,
		|	ДанныеСотрудников.ДатаДействия
		|ИЗ
		|	ДанныеСотрудников КАК ДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций.ПерсональныеНадбавки КАК СотрудникиОрганизацийПерсональныеНадбавки
		|		ПО ДанныеСотрудников.Сотрудник = СотрудникиОрганизацийПерсональныеНадбавки.Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДанныеСотрудников.Сотрудник,
		|	ДанныеСотрудников.ВидРасчета,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ДанныеСотрудников.ТарифныйРазряд = ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ ДанныеСотрудников.ТарифныйРазряд
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВЫБОР
		|		КОГДА ДанныеСотрудников.ВалютаТарифнойСтавки = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ ДанныеСотрудников.ВалютаТарифнойСтавки
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.ДатаДействия
		|ИЗ
		|	ДанныеСотрудников КАК ДанныеСотрудников
		|ГДЕ
		|   ДанныеСотрудников.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
		|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	НачисленияСрезПоследних.Сотрудник,
	|	ВидРасчета
	|;";
	
	ЗаполнениеДокументовПереопределяемый.ДобавитьТаблицыВЗапросПолученияДействийСНачислениями(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапроса + "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСотрудников.Сотрудник,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки,
	|	МАКСИМУМ(НадбавкиПоШтатномуРасписаниюОрганизаций.Период) КАК Период,
	|	ДанныеСотрудников.ДатаДействия,
	|	ДанныеСотрудников.СтароеПодразделениеОрганизации,
	|	ДанныеСотрудников.СтараяДолжность
	|ПОМЕСТИТЬ НадбавкиШтатногоРасписанияСрезСтараяПозиция
	|ИЗ
	|	РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК НадбавкиПоШтатномуРасписаниюОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НадбавкиПоШтатномуРасписаниюОрганизаций.Период <= ДанныеСотрудников.ДатаДействия
	|			И НадбавкиПоШтатномуРасписаниюОрганизаций.ПодразделениеОрганизации = ДанныеСотрудников.СтароеПодразделениеОрганизации
	|			И НадбавкиПоШтатномуРасписаниюОрганизаций.Должность = ДанныеСотрудников.СтараяДолжность
	|ГДЕ
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|
	|СГРУППИРОВАТЬ ПО
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки,
	|	ДанныеСотрудников.Сотрудник,
	|	ДанныеСотрудников.ДатаДействия,
	|	ДанныеСотрудников.СтароеПодразделениеОрганизации,
	|	ДанныеСотрудников.СтараяДолжность
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ВидНадбавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСотрудников.Сотрудник,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки,
	|	МАКСИМУМ(НадбавкиПоШтатномуРасписаниюОрганизаций.Период) КАК Период,
	|	ДанныеСотрудников.ДатаДействия,
	|	ДанныеСотрудников.Подразделение,
	|	ДанныеСотрудников.Должность КАК Должность
	|ПОМЕСТИТЬ НадбавкиШтатногоРасписанияСрезНоваяПозиция
	|ИЗ
	|	РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК НадбавкиПоШтатномуРасписаниюОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НадбавкиПоШтатномуРасписаниюОрганизаций.Период <= ДанныеСотрудников.ДатаДействия
	|			И НадбавкиПоШтатномуРасписаниюОрганизаций.ПодразделениеОрганизации = ДанныеСотрудников.Подразделение
	|			И НадбавкиПоШтатномуРасписаниюОрганизаций.Должность = ДанныеСотрудников.Должность
	|ГДЕ
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|
	|СГРУППИРОВАТЬ ПО
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки,
	|	ДанныеСотрудников.Сотрудник,
	|	ДанныеСотрудников.ДатаДействия,
	|	ДанныеСотрудников.Подразделение,
	|	ДанныеСотрудников.Должность
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ВидНадбавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НадбавкиШтатногоРасписанияСрезПоследних.Сотрудник,
	|	НадбавкиШтатногоРасписанияСрезПоследних.ВидНадбавки,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель1,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель2,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель3,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель4,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель5,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель6,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта1,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта2,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта3,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта4,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта5,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта6,
	|	НадбавкиШтатногоРасписанияСрезПоследних.ДатаДействия,
	|	NULL КАК ТарифныйРазряд1,
	|	NULL КАК ТарифныйРазряд2,
	|	NULL КАК ТарифныйРазряд3,
	|	NULL КАК ТарифныйРазряд4,
	|	NULL КАК ТарифныйРазряд5,
	|	NULL КАК ТарифныйРазряд6
	|ПОМЕСТИТЬ НачисленияСтаройПозицииСрезПоследних
	|ИЗ
	|	НадбавкиШтатногоРасписанияСрезСтараяПозиция КАК НадбавкиШтатногоРасписанияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК НадбавкиПоШтатномуРасписаниюОрганизаций
	|		ПО НадбавкиШтатногоРасписанияСрезПоследних.Период = НадбавкиПоШтатномуРасписаниюОрганизаций.Период
	|			И НадбавкиШтатногоРасписанияСрезПоследних.ВидНадбавки = НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки
	|			И НадбавкиШтатногоРасписанияСрезПоследних.СтароеПодразделениеОрганизации = НадбавкиПоШтатномуРасписаниюОрганизаций.ПодразделениеОрганизации
	|			И НадбавкиШтатногоРасписанияСрезПоследних.СтараяДолжность = НадбавкиПоШтатномуРасписаниюОрганизаций.Должность
	|ГДЕ
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|	И НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РайонныйКоэффициент)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеСотрудников.Сотрудник,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РайонныйКоэффициент),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеСотрудников.СтароеПодразделениеОрганизации.КодПоОКАТО, """") <> """"
	|			ТОГДА ДанныеСотрудников.СтароеПодразделениеОрганизации.РайонныйКоэффициент
	|		КОГДА ДанныеСотрудников.СтароеОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеСотрудников.СтараяОрганизация.РайонныйКоэффициент > 1
	|						ТОГДА ДанныеСотрудников.СтараяОрганизация.РайонныйКоэффициент
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА ДанныеСотрудников.СтароеОбособленноеПодразделение.РайонныйКоэффициент > 1
	|			ТОГДА ДанныеСотрудников.СтароеОбособленноеПодразделение.РайонныйКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ * 100 - 100,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ДанныеСотрудников.ДатаДействия,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ДанныеСотрудников КАК ДанныеСотрудников
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеСотрудников.СтароеПодразделениеОрганизации.КодПоОКАТО, """") <> """"
	|			ТОГДА ДанныеСотрудников.СтароеПодразделениеОрганизации.РайонныйКоэффициент
	|		КОГДА ДанныеСотрудников.СтароеОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеСотрудников.СтараяОрганизация.РайонныйКоэффициент > 1
	|						ТОГДА ДанныеСотрудников.СтараяОрганизация.РайонныйКоэффициент
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА ДанныеСотрудников.СтароеОбособленноеПодразделение.РайонныйКоэффициент > 1
	|			ТОГДА ДанныеСотрудников.СтароеОбособленноеПодразделение.РайонныйКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ > 1
	|
	|";
	
	ЗаполнениеДокументовПереопределяемый.ДобавитьОбъединенияВЗапросПолученияДействийСНачислениями(ТекстЗапроса, 1);
	
	ТекстЗапроса = ТекстЗапроса + "
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НадбавкиШтатногоРасписанияСрезПоследних.ВидНадбавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НадбавкиШтатногоРасписанияСрезНоваяПозиция.Сотрудник,
	|	НадбавкиШтатногоРасписанияСрезНоваяПозиция.ВидНадбавки,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель1,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель2,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель3,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель4,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель5,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Показатель6,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта1,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта2,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта3,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта4,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта5,
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.Валюта6,
	|	НадбавкиШтатногоРасписанияСрезНоваяПозиция.ДатаДействия,
	|	NULL КАК ТарифныйРазряд1,
	|	NULL КАК ТарифныйРазряд2,
	|	NULL КАК ТарифныйРазряд3,
	|	NULL КАК ТарифныйРазряд4,
	|	NULL КАК ТарифныйРазряд5,
	|	NULL КАК ТарифныйРазряд6
	|ПОМЕСТИТЬ НачисленияНовойПозицииСрезПоследних
	|ИЗ
	|	НадбавкиШтатногоРасписанияСрезНоваяПозиция КАК НадбавкиШтатногоРасписанияСрезНоваяПозиция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК НадбавкиПоШтатномуРасписаниюОрганизаций
	|		ПО НадбавкиШтатногоРасписанияСрезНоваяПозиция.Период = НадбавкиПоШтатномуРасписаниюОрганизаций.Период
	|			И НадбавкиШтатногоРасписанияСрезНоваяПозиция.ВидНадбавки = НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки
	|			И НадбавкиШтатногоРасписанияСрезНоваяПозиция.Должность = НадбавкиПоШтатномуРасписаниюОрганизаций.Должность
	|			И НадбавкиШтатногоРасписанияСрезНоваяПозиция.Подразделение = НадбавкиПоШтатномуРасписаниюОрганизаций.ПодразделениеОрганизации
	|ГДЕ
	|	НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|	И НадбавкиПоШтатномуРасписаниюОрганизаций.ВидНадбавки <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РайонныйКоэффициент)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеСотрудников.Сотрудник,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РайонныйКоэффициент),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеСотрудников.Подразделение.КодПоОКАТО, """") <> """"
	|			ТОГДА ДанныеСотрудников.Подразделение.РайонныйКоэффициент
	|		КОГДА ДанныеСотрудников.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеСотрудников.Организация.РайонныйКоэффициент > 1
	|						ТОГДА ДанныеСотрудников.Организация.РайонныйКоэффициент
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА ДанныеСотрудников.ОбособленноеПодразделение.РайонныйКоэффициент > 1
	|			ТОГДА ДанныеСотрудников.ОбособленноеПодразделение.РайонныйКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ * 100 - 100,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ДанныеСотрудников.ДатаДействия,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ДанныеСотрудников КАК ДанныеСотрудников
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеСотрудников.Подразделение.КодПоОКАТО, """") <> """"
	|			ТОГДА ДанныеСотрудников.Подразделение.РайонныйКоэффициент
	|		КОГДА ДанныеСотрудников.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеСотрудников.Организация.РайонныйКоэффициент > 1
	|						ТОГДА ДанныеСотрудников.Организация.РайонныйКоэффициент
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА ДанныеСотрудников.ОбособленноеПодразделение.РайонныйКоэффициент > 1
	|			ТОГДА ДанныеСотрудников.ОбособленноеПодразделение.РайонныйКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ > 1
	|";
	
	ЗаполнениеДокументовПереопределяемый.ДобавитьОбъединенияВЗапросПолученияДействийСНачислениями(ТекстЗапроса, 2);
	
	// В оставшейся части запроса объединяются выборки, сформированные по следующим условиям:
	//	- часть 1: вид расчета есть в наборах старой и новой позиций, в "наборе сотруднике" (везде)
	//  и все записи равны по показателям - не изменять
	//	- часть 2: есть везде, в старой и новой позициях по показателям равны, в сотруднике 
	//  значения показателей отличаются	- не изменять
	//	- часть 3: есть в наборе новой позиции, но нет в наборе старой - начать
	//	- часть 4: есть в наборе старой позиции, но нет в наборе новой - прекратить
	//	- часть 5: есть в наборе старой позиции, есть в наборе новой, но нет в наборе сотрудника - начать
	//	- часть 6: есть в наборе старой, есть в наборе новой, есть в наборе сотрудника, 
	//	отличаются значения показателей - изменить (занулить показатели)
	//	- часть 7: все, чего нет ни в наборе старой ни в наборе новой позиций - не изменять
	
	ТекстЗапроса = ТекстЗапроса + "
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	НадбавкиШтатногоРасписанияСрезНоваяПозиция.ВидНадбавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие,
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.Показатель1,
	|	НачисленияСотрудника.Показатель2,
	|	НачисленияСотрудника.Показатель3,
	|	НачисленияСотрудника.Показатель4,
	|	НачисленияСотрудника.Показатель5,
	|	НачисленияСотрудника.Показатель6,
	|	НачисленияСотрудника.ТарифныйРазряд1,
	|	НачисленияСотрудника.ТарифныйРазряд2,
	|	НачисленияСотрудника.ТарифныйРазряд3,
	|	НачисленияСотрудника.ТарифныйРазряд4,
	|	НачисленияСотрудника.ТарифныйРазряд5,
	|	НачисленияСотрудника.ТарифныйРазряд6,
	|	НачисленияСотрудника.Валюта1,
	|	НачисленияСотрудника.Валюта2,
	|	НачисленияСотрудника.Валюта3,
	|	НачисленияСотрудника.Валюта4,
	|	НачисленияСотрудника.Валюта5,
	|	НачисленияСотрудника.Валюта6,
	|	НачисленияСотрудника.ДатаДействия
	|ПОМЕСТИТЬ Начисления
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияНовойПозицииСрезПоследних.ВидНадбавки
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель1 = НачисленияНовойПозицииСрезПоследних.Показатель1
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель2 = НачисленияНовойПозицииСрезПоследних.Показатель2
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель3 = НачисленияНовойПозицииСрезПоследних.Показатель3
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель4 = НачисленияНовойПозицииСрезПоследних.Показатель4
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель5 = НачисленияНовойПозицииСрезПоследних.Показатель5
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель6 = НачисленияНовойПозицииСрезПоследних.Показатель6
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСотрудника КАК НачисленияСотрудника
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияСотрудника.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель1 = НачисленияСотрудника.Показатель1
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель2 = НачисленияСотрудника.Показатель2
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель3 = НачисленияСотрудника.Показатель3
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель4 = НачисленияСотрудника.Показатель4
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель5 = НачисленияСотрудника.Показатель5
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель6 = НачисленияСотрудника.Показатель6
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияСотрудника.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять),
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.Показатель1,
	|	НачисленияСотрудника.Показатель2,
	|	НачисленияСотрудника.Показатель3,
	|	НачисленияСотрудника.Показатель4,
	|	НачисленияСотрудника.Показатель5,
	|	НачисленияСотрудника.Показатель6,
	|	НачисленияСотрудника.ТарифныйРазряд1,
	|	НачисленияСотрудника.ТарифныйРазряд2,
	|	НачисленияСотрудника.ТарифныйРазряд3,
	|	НачисленияСотрудника.ТарифныйРазряд4,
	|	НачисленияСотрудника.ТарифныйРазряд5,
	|	НачисленияСотрудника.ТарифныйРазряд6,
	|	НачисленияСотрудника.Валюта1,
	|	НачисленияСотрудника.Валюта2,
	|	НачисленияСотрудника.Валюта3,
	|	НачисленияСотрудника.Валюта4,
	|	НачисленияСотрудника.Валюта5,
	|	НачисленияСотрудника.Валюта6,
	|	НачисленияСотрудника.ДатаДействия
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияНовойПозицииСрезПоследних.ВидНадбавки
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель1 = НачисленияНовойПозицииСрезПоследних.Показатель1
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель2 = НачисленияНовойПозицииСрезПоследних.Показатель2
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель3 = НачисленияНовойПозицииСрезПоследних.Показатель3
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель4 = НачисленияНовойПозицииСрезПоследних.Показатель4
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель5 = НачисленияНовойПозицииСрезПоследних.Показатель5
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель6 = НачисленияНовойПозицииСрезПоследних.Показатель6
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСотрудника КАК НачисленияСотрудника
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияСотрудника.ВидРасчета
	|			И (НачисленияСтаройПозицииСрезПоследних.Показатель1 <> НачисленияСотрудника.Показатель1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель2 <> НачисленияСотрудника.Показатель2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель3 <> НачисленияСотрудника.Показатель3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель4 <> НачисленияСотрудника.Показатель4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель5 <> НачисленияСотрудника.Показатель5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель6 <> НачисленияСотрудника.Показатель6)
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияСотрудника.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать),
	|	ДанныеСотрудников.Сотрудник,
	|	НачисленияНовойПозицииСрезПоследних.ВидНадбавки,
	|	НачисленияНовойПозицииСрезПоследних.Показатель1,
	|	НачисленияНовойПозицииСрезПоследних.Показатель2,
	|	НачисленияНовойПозицииСрезПоследних.Показатель3,
	|	НачисленияНовойПозицииСрезПоследних.Показатель4,
	|	НачисленияНовойПозицииСрезПоследних.Показатель5,
	|	НачисленияНовойПозицииСрезПоследних.Показатель6,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НачисленияНовойПозицииСрезПоследних.Валюта1,
	|	НачисленияНовойПозицииСрезПоследних.Валюта2,
	|	НачисленияНовойПозицииСрезПоследних.Валюта3,
	|	НачисленияНовойПозицииСрезПоследних.Валюта4,
	|	НачисленияНовойПозицииСрезПоследних.Валюта5,
	|	НачисленияНовойПозицииСрезПоследних.Валюта6,
	|	ДанныеСотрудников.ДатаДействия
	|ИЗ
	|	НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ПО (НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияНовойПозицииСрезПоследних.ВидНадбавки)
	|			И НачисленияНовойПозицииСрезПоследних.Сотрудник = НачисленияСтаройПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НачисленияНовойПозицииСрезПоследних.Сотрудник = ДанныеСотрудников.Сотрудник
	|ГДЕ
	|	НачисленияСтаройПозицииСрезПоследних.ВидНадбавки ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить),
	|	ДанныеСотрудников.Сотрудник,
	|	НачисленияСтаройПозицииСрезПоследних.ВидНадбавки,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель1,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель2,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель3,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель4,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель5,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель6,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта1,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта2,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта3,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта4,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта5,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта6,
	|	ДанныеСотрудников.ДатаДействия
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияНовойПозицииСрезПоследних.ВидНадбавки
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НачисленияСтаройПозицииСрезПоследних.Сотрудник = ДанныеСотрудников.Сотрудник
	|ГДЕ
	|	НачисленияНовойПозицииСрезПоследних.ВидНадбавки ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать),
	|	ДанныеСотрудников.Сотрудник,
	|	НачисленияНовойПозицииСрезПоследних.ВидНадбавки,
	|	НачисленияНовойПозицииСрезПоследних.Показатель1,
	|	НачисленияНовойПозицииСрезПоследних.Показатель2,
	|	НачисленияНовойПозицииСрезПоследних.Показатель3,
	|	НачисленияНовойПозицииСрезПоследних.Показатель4,
	|	НачисленияНовойПозицииСрезПоследних.Показатель5,
	|	НачисленияНовойПозицииСрезПоследних.Показатель6,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НачисленияНовойПозицииСрезПоследних.Валюта1,
	|	НачисленияНовойПозицииСрезПоследних.Валюта2,
	|	НачисленияНовойПозицииСрезПоследних.Валюта3,
	|	НачисленияНовойПозицииСрезПоследних.Валюта4,
	|	НачисленияНовойПозицииСрезПоследних.Валюта5,
	|	НачисленияНовойПозицииСрезПоследних.Валюта6,
	|	ДанныеСотрудников.ДатаДействия
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияНовойПозицииСрезПоследних.ВидНадбавки
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСотрудника КАК НачисленияСотрудника
	|		ПО НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияСотрудника.Сотрудник
	|			И НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияСотрудника.ВидРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НачисленияСтаройПозицииСрезПоследних.Сотрудник = ДанныеСотрудников.Сотрудник
	|ГДЕ
	|	НачисленияСотрудника.ВидРасчета ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить),
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСтаройПозицииСрезПоследних.ВидНадбавки,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Показатель1 = НачисленияСтаройПозицииСрезПоследних.Показатель1
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Показатель1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Показатель2 = НачисленияСтаройПозицииСрезПоследних.Показатель2
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Показатель2
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Показатель3 = НачисленияСтаройПозицииСрезПоследних.Показатель3
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Показатель3
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Показатель4 = НачисленияСтаройПозицииСрезПоследних.Показатель4
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Показатель4
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Показатель5 = НачисленияСтаройПозицииСрезПоследних.Показатель5
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Показатель5
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Показатель6 = НачисленияСтаройПозицииСрезПоследних.Показатель6
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Показатель6
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.ТарифныйРазряд1 = НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.ТарифныйРазряд2 = НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.ТарифныйРазряд3 = НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.ТарифныйРазряд4 = НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.ТарифныйРазряд5 = НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.ТарифныйРазряд6 = НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Валюта1 = НачисленияСтаройПозицииСрезПоследних.Валюта1
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Валюта1
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Валюта2 = НачисленияСтаройПозицииСрезПоследних.Валюта2
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Валюта2
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Валюта3 = НачисленияСтаройПозицииСрезПоследних.Валюта3
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Валюта3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Валюта4 = НачисленияСтаройПозицииСрезПоследних.Валюта4
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Валюта4
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Валюта5 = НачисленияСтаройПозицииСрезПоследних.Валюта5
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Валюта5
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияСотрудника.Валюта6 = НачисленияСтаройПозицииСрезПоследних.Валюта6
	|			ТОГДА НачисленияНовойПозицииСрезПоследних.Валюта6
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ,
	|	НачисленияСотрудника.ДатаДействия
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияНовойПозицииСрезПоследних.ВидНадбавки
	|			И (НачисленияСтаройПозицииСрезПоследних.Показатель1 <> НачисленияНовойПозицииСрезПоследних.Показатель1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель2 <> НачисленияНовойПозицииСрезПоследних.Показатель2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель3 <> НачисленияНовойПозицииСрезПоследних.Показатель3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель4 <> НачисленияНовойПозицииСрезПоследних.Показатель4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель5 <> НачисленияНовойПозицииСрезПоследних.Показатель5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель6 <> НачисленияНовойПозицииСрезПоследних.Показатель6)
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСотрудника КАК НачисленияСотрудника
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияСотрудника.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияСотрудника.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять),
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.Показатель1,
	|	НачисленияСотрудника.Показатель2,
	|	НачисленияСотрудника.Показатель3,
	|	НачисленияСотрудника.Показатель4,
	|	НачисленияСотрудника.Показатель5,
	|	НачисленияСотрудника.Показатель6,
	|	НачисленияСотрудника.ТарифныйРазряд1,
	|	НачисленияСотрудника.ТарифныйРазряд2,
	|	НачисленияСотрудника.ТарифныйРазряд3,
	|	НачисленияСотрудника.ТарифныйРазряд4,
	|	НачисленияСотрудника.ТарифныйРазряд5,
	|	НачисленияСотрудника.ТарифныйРазряд6,
	|	НачисленияСотрудника.Валюта1,
	|	НачисленияСотрудника.Валюта2,
	|	НачисленияСотрудника.Валюта3,
	|	НачисленияСотрудника.Валюта4,
	|	НачисленияСотрудника.Валюта5,
	|	НачисленияСотрудника.Валюта6,
	|	НачисленияСотрудника.ДатаДействия
	|ИЗ
	|	НачисленияСотрудника КАК НачисленияСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСотрудника.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидНадбавки
	|			И НачисленияСотрудника.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ПО (НачисленияСтаройПозицииСрезПоследних.ВидНадбавки = НачисленияСотрудника.ВидРасчета)
	|			И НачисленияСотрудника.Сотрудник = НачисленияСтаройПозицииСрезПоследних.Сотрудник
	|ГДЕ
	|	НачисленияНовойПозицииСрезПоследних.ВидНадбавки ЕСТЬ NULL 
	|	И НачисленияСтаройПозицииСрезПоследних.ВидНадбавки ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Начисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(Начисления.Показатель1, 0) * ВЫБОР
	|							КОГДА Начисления.ВидРасчета.СпособРасчета В (&ИндексируемыеСпособыРасчета)
	|								ТОГДА &КоэффициентИндексацииЗаработка
	|							ИНАЧЕ 1
	|						КОНЕЦ = ЕСТЬNULL(Начисления.Показатель1, 0)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить)
	|				КОНЕЦ
	|		ИНАЧЕ Начисления.Действие
	|	КОНЕЦ КАК Действие,
	|	Начисления.ДатаДействия,
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо КАК Физлицо,
	|	Начисления.ВидРасчета,
	|	ЕСТЬNULL(Начисления.Показатель1, 0) * ВЫБОР
	|		КОГДА Начисления.ВидРасчета.СпособРасчета В (&ИндексируемыеСпособыРасчета)
	|			ТОГДА &КоэффициентИндексацииЗаработка
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Показатель1,
	|	ЕСТЬNULL(Начисления.Показатель2, 0) КАК Показатель2,
	|	ЕСТЬNULL(Начисления.Показатель3, 0) КАК Показатель3,
	|	ЕСТЬNULL(Начисления.Показатель4, 0) КАК Показатель4,
	|	ЕСТЬNULL(Начисления.Показатель5, 0) КАК Показатель5,
	|	ЕСТЬNULL(Начисления.Показатель6, 0) КАК Показатель6,
	|	Начисления.ТарифныйРазряд1,
	|	Начисления.ТарифныйРазряд2,
	|	Начисления.ТарифныйРазряд3,
	|	Начисления.ТарифныйРазряд4,
	|	Начисления.ТарифныйРазряд5,
	|	Начисления.ТарифныйРазряд6,
	|	ЕСТЬNULL(Начисления.Валюта1, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта1,
	|	ЕСТЬNULL(Начисления.Валюта2, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта2,
	|	ЕСТЬNULL(Начисления.Валюта3, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта3,
	|	ЕСТЬNULL(Начисления.Валюта4, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта4,
	|	ЕСТЬNULL(Начисления.Валюта5, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта5,
	|	ЕСТЬNULL(Начисления.Валюта6, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта6
	|ИЗ
	|	Начисления КАК Начисления";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура заполняет реквизит Физлицо в документе. Значение реквизита получается из Сотрудника.
//
Процедура ПередЗаписьюДокументаЗаполнитьФизЛицоВШапке(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизаций.Физлицо
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|ГДЕ
	|	СотрудникиОрганизаций.Ссылка = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник",	Источник.Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Источник.Физлицо = Выборка.Физлицо;
	КонецЕсли;
	
КонецПроцедуры