
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	СписокПередНачаломДобавленияСервер(Отказ, Группа);
	
КонецПроцедуры


&НаСервере
Процедура СписокПередНачаломДобавленияСервер(Отказ, Группа)
	
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	
	Если Группа Тогда
		Если  мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникГруппыНСИ) = Неопределено
			И мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено Тогда
			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Запрещено добавлять группы номенклатуры.", Отказ);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
	
	
