
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивОС") Тогда
        ТаблицаОС.Загрузить(Параметры.МассивОС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОС = Элемент.ТекущиеДанные.ОсновноеСредство;
	
	ОткрытьФормуМодально("Справочник.ОсновныеСредства.ФормаОбъекта", Новый Структура("Ключ", ОС), ЭтаФорма);
	Элемент.ТекущиеДанные.Заполнено = ВедетсяРеестрДляОС(ОС);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВедетсяРеестрДляОС(ОС)
	
	Возврат ПланыВидовХарактеристик.абс_СвойстваОС.ВедетсяРеестрДляОС(ОС);
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСПроверкой(Команда)

	Отказ = Ложь;
	
	Для Каждого строка из ТаблицаОС Цикл 
		Если НЕ строка.Заполнено Тогда 
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(Отказ);
		
КонецПроцедуры

