
Процедура ЗаписатьОперацию(ДоговорКонтрагента, Операция) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.абс_СоответствиеДоговоровВнутрихолдинговымОперациямРЖД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ДоговорКонтрагента);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		строкаНабора = НаборЗаписей[0];
		Если строкаНабора.ВнутрихолдинговаяОперацияРЖД = Операция Тогда 
			Возврат;
		КонецЕсли;
	Иначе
		строкаНабора = НаборЗаписей.Добавить();
	КонецЕсли;

	строкаНабора.ДоговорКонтрагента = ДоговорКонтрагента;
	строкаНабора.ВнутрихолдинговаяОперацияРЖД = Операция;
		
	НаборЗаписей.Записать();
	
	
КонецПроцедуры