
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Константы.ИспользоватьОбменЭД.Получить() Тогда
		ТекстСообщения = НСтр("ru = 'Для работы с электронными документами необходимо в настройках системы включить использование обмена электронными документами'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
	СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности", НачалоДня(ТекущаяДата()));
	СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("Контрагент",       Параметры.Контрагент);
	СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("Организация",      Параметры.Организация);
	Если ЭлектронныеДокументыПереопределяемый.ПолучитьЗначениеФункциональнойОпции("ИспользоватьОбменЭДМеждуОрганизациями") Тогда
		СписокСоглашенийМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности", НачалоДня(ТекущаяДата()));
		СписокСоглашенийМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Контрагент",       Параметры.Контрагент);
		СписокСоглашенийМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Организация",      Параметры.Организация);
		Элементы.ГруппаКнопокГлобальныхКоманд2.ПодчиненныеЭлементы.ЭД1.Видимость = Ложь;
	Иначе
		Элементы.ГруппаСоглашения.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИнтеркампаниПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	Параметр = ?(Копирование, Новый Структура("ЗначениеКопирования", Элементы.СписокИнтеркампани.ТекущаяСтрока), Новый Структура);
	ОткрытьФорму("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаИнтеркампани", Параметр, Элементы.СписокИнтеркампани);
КонецПроцедуры

&НаКлиенте
Процедура СписокИнтеркампаниВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Параметр = Новый Структура("Ключ", ВыбраннаяСтрока);
	ОткрытьФорму("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаИнтеркампани", Параметр, Поле);
КонецПроцедуры
