Перем глОбщиеЗначения Экспорт;
// СтандартныеПодсистемы.ОценкаПроизводительности
Перем ОценкаПроизводительностиЗамерВремени Экспорт;
// Конец СтандартныеПодсистемы.ОценкаПроизводительности

Процедура ПриНачалеРаботыСистемы()
	
	// Вызов исключения, если не прошла процедура определения пользователя
	УправлениеПользователями.ПользовательОпределен();
	
	//Добавление обязательных значений в кеш ОбщиеЗначения
	РаботаСОбщимиПеременными.ДобавитьОбязательныеЗначенияВКэш();
	
	// {{ТТК Сладков А. Заявка № 24.05.2016 начало
	//<< вн
	внЖурналРегистрацииКлиент.ПриНачалеРаботыСистемы();
	//>>
	// }}ТТК Сладков А. Заявка № 24.05.2016 окончание

КонецПроцедуры

Функция ПолучитьТип(СтрокаОписанияТипа) Экспорт
	Возврат(Тип(СтрокаОписанияТипа));
КонецФункции	


// {{ТТК Сладков А. Заявка № 24.05.2016 начало
Процедура ПриЗавершенииРаботыСистемы()
	//<< вн	
	внЖурналРегистрацииКлиент.ПриЗавершенииРаботыСистемы();
	//>>	
КонецПроцедуры
// }}ТТК Сладков А. Заявка № 24.05.2016 окончание


