Перем глСерверТО Экспорт;
//АБС ВСТАВКА 37725  17.01.2014 21:13:40  Шамов
Перем СтруктураПараметровЗавершенияРаботы Экспорт;
//АБС ВСТАВКА 37725 КОНЕЦ

//АБС ВСТАВКА 38320 30.01.2014 15:15:15  Пугачев

// СтандартныеПодсистемы.ОценкаПроизводительности
Перем ОценкаПроизводительностиЗамерВремени Экспорт;
// Конец СтандартныеПодсистемы.ОценкаПроизводительности

//АБС ВСТАВКА 38320 КОНЕЦ 

// {{ТТК Сладков А. Заявка № 24.05.2016 начало
// СписокЗначений для накапливания пакета сообщений в журнал регистрации, 
// формируемых в клиентской бизнес-логике.
Перем СообщенияДляЖурналаРегистрации Экспорт; 
// }}ТТК Сладков А. Заявка № 24.05.2016 окончание


// Функция возвращает объект для взаимодействия с торговым оборудованием.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  <ОбработкаОбъект> - Объект для взаимодействия с торговым оборудованием.
//
Функция ПолучитьСерверТО() Экспорт

	Если глСерверТО = Неопределено Тогда
		//глСерверТО = Обработки.ТОСервер.Создать();
	КонецЕсли;

	Возврат глСерверТО;

КонецФункции // ПолучитьСерверТО()

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// Получим параметры работы клиента за одно обращение к серверу
	// Чтобы при повторном вызове этой функции не было обращений к серверу
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	
	Если НЕ ПараметрыРаботыКлиента.ПользователюРазрешенЗапускКонфигурации Тогда
		Предупреждение(НСтр("ru = 'Вам не назначена роль ""Пользователь"". Запуск конфигурации невозможен.'"));
		Отказ = Истина;		
		Возврат; //Дальше нет необходимости выполнения, т.к. могут быть ошибки нарушения прав
	КонецЕсли; 	
	
	Если НЕ Отказ И ПараметрыРаботыКлиента.НеобходимоОбновлениеИнформационнойБазы  Тогда
		Предупреждение(НСтр("ru = 'Требуется обновить информационную базу. Обратитесь к администратору информационной базы. 
		|Работа системы будет завершена.'"));
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	//АБС ВСТАВКА
	//абс_УТК_Клиент.ПриНачалеРаботыСистемы();
	//\\АБС ВСТАВКА
	//АБС ВСТАВКА 37725  17.01.2014 18:37:40  Шамов
	СтруктураПараметровЗавершенияРаботы = абс_УправлениеСеансомТонкогоКлиента.абс_УстановитьПараметрыКонтроляЗавершенияРаботы();
	//АБС ВСТАВКА 37725 КОНЕЦ
	
	ОбщегоНазначенияКлиент.УстановитьПроизвольныйЗаголовокПриложения();
	ИнтервалПроверка = 0;
	абс_УправлениеСеансомТонкогоКлиента.ПолучитьИнтервалПроверки(ИнтервалПроверка);
	Если ИнтервалПроверка>0 Тогда
		ПодключитьОбработчикОжидания("абс_ПроверитьСообщения", ИнтервалПроверка);
	КонецЕсли;
	
	//АБС
	Если Не абс_УправлениеСеансомТонкогоКлиентаСервер.ПроверкаСеансаПользователя() Тогда
		
		//СсылкаНаФайл = абс_УправлениеСеансомТонкогоКлиентаСервер.ПолучитьФайлHTML();
		//СтрокаКоманды = "";
		//Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
		//	НаименованиеФайла = "";
		//	АдресХран = абс_УправлениеСеансомТонкогоКлиентаСервер.ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла);
		//	
		//	Если АдресХран = Неопределено Тогда
		//		Возврат;
		//	КонецЕсли;
		//	
		//	ПолучитьФайл(АдресХран, НаименованиеФайла, Истина);
		//	
		//	СтрокаКоманды = АдресХран;		
		//	
		//	
		//	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		//		
		//		УстановитьРасширениеРаботыСФайлами();
		//		
		//	КонецЕсли;
		//	
		//	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		//		
		//		ЗапуститьПриложение(СтрокаКоманды);
		//		
		//		
		//	Иначе
		//		
		//		Предупреждение(НСтр("ru ='Данная возможность недоступна, так как не подключено расширение работы с файлами.'", "ru"));
		//		
		//	КонецЕсли;
		//	
		//	ЗавершитьРаботуСистемы (Ложь);
		//	
		//КонецЕсли;
		Попытка
			
			Предупреждение(НСтр("ru ='Под данным пользователем есть запущенные сеансы. Для работы в новом сеансе требуется завершение старого'", "ru"),10);
		Исключение
		КонецПопытки;
		ЗавершитьРаботуСистемы (Ложь);
		
		
		
		
	КонецЕсли;	
	
	//АБС ВСТАВКА 37725  17.01.2014 18:37:40  Шамов
	Если СтруктураПараметровЗавершенияРаботы.абс_ИспользоватьТаймаутЗавершенияРаботы
		И НЕ СтруктураПараметровЗавершенияРаботы.ЭтоИсключение Тогда
		ПодключитьОбработчикОжидания("абс_ЗавершениеРаботы", СтруктураПараметровЗавершенияРаботы.абс_ИнтервалПроверкиЗавершенияРаботы);
	КонецЕсли;
	//АБС ВСТАВКА 37725 КОНЕЦ

	// {{ТТК Сладков А. Заявка № 24.05.2016 начало	
	//<< вн
	внЖурналРегистрацииКлиент.ПриНачалеРаботыСистемы();
	//>>
	// }}ТТК Сладков А. Заявка № 24.05.2016 окончание	
	
КонецПроцедуры

Процедура абс_ПроверитьСообщения() Экспорт
	абс_УправлениеСеансомТонкогоКлиента.ВывестиСообщениеПользователю();
//абс_УправлениеСеансомТонкогоКлиента.ПрочитатьСообщения();
	//АБС ВСТАВКА 37725  17.01.2014 18:22:08  Шамов
	СтруктураПараметровЗавершенияРаботыСтар = Новый Структура("ЭтоИсключение,абс_ИспользоватьТаймаутЗавершенияРаботы,абс_ИнтервалПроверкиЗавершенияРаботы,абс_ТаймаутЗавершенияРаботы",
		СтруктураПараметровЗавершенияРаботы.ЭтоИсключение,
		СтруктураПараметровЗавершенияРаботы.абс_ИспользоватьТаймаутЗавершенияРаботы,
		СтруктураПараметровЗавершенияРаботы.абс_ИнтервалПроверкиЗавершенияРаботы,
		СтруктураПараметровЗавершенияРаботы.абс_ТаймаутЗавершенияРаботы);
	СтруктураПараметровЗавершенияРаботы = абс_УправлениеСеансомТонкогоКлиента.абс_ОбновитьПараметрыКонтроляЗавершенияРаботы(СтруктураПараметровЗавершенияРаботы);	
	
	Если СтруктураПараметровЗавершенияРаботыСтар.абс_ИспользоватьТаймаутЗавершенияРаботы <> СтруктураПараметровЗавершенияРаботы.абс_ИспользоватьТаймаутЗавершенияРаботы
		ИЛИ СтруктураПараметровЗавершенияРаботыСтар.абс_ИнтервалПроверкиЗавершенияРаботы <> СтруктураПараметровЗавершенияРаботы.абс_ИнтервалПроверкиЗавершенияРаботы
		ИЛИ СтруктураПараметровЗавершенияРаботыСтар.ЭтоИсключение <> СтруктураПараметровЗавершенияРаботы.ЭтоИсключение
		Тогда
		
		Если СтруктураПараметровЗавершенияРаботы.абс_ИспользоватьТаймаутЗавершенияРаботы И НЕ СтруктураПараметровЗавершенияРаботы.ЭтоИсключение Тогда
			ПодключитьОбработчикОжидания("абс_ЗавершениеРаботы", СтруктураПараметровЗавершенияРаботы.абс_ИнтервалПроверкиЗавершенияРаботы);			
		Иначе
			ОтключитьОбработчикОжидания("абс_ЗавершениеРаботы");
		КонецЕсли;
				
	КонецЕсли;	
	
	Если СтруктураПараметровЗавершенияРаботыСтар.ЭтоИсключение И СтруктураПараметровЗавершенияРаботыСтар.ЭтоИсключение <> СтруктураПараметровЗавершенияРаботы.ЭтоИсключение Тогда
		абс_ЗавершениеРаботы();
	КонецЕсли;
	//АБС ВСТАВКА 37725 КОНЕЦ 
КонецПроцедуры

//АБС ВСТАВКА 37725  17.01.2014 18:22:08  Шамов
Процедура абс_ЗавершениеРаботы() Экспорт
	Проверять = абс_УправлениеСеансомТонкогоКлиента.абс_ЗавершениеРаботыКлиент(СтруктураПараметровЗавершенияРаботы.абс_ИнтервалПроверкиЗавершенияРаботы);      
	
	Если Проверять ТОгда
		
		Ответ = Вопрос("Система не используется продолжительное время. Продолжить работу в системе?", РежимДиалогаВопрос.ДаНет, СтруктураПараметровЗавершенияРаботы.абс_ТаймаутЗавершенияРаботы, КодВозвратаДиалога.Да, "ВНИМАНИЕ", КодВозвратаДиалога.Нет);
	
		Если Ответ = КодВозвратаДиалога.Таймаут
			ИЛИ Ответ = КодВозвратаДиалога.Нет Тогда
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры
//АБС ВСТАВКА 37725 КОНЕЦ 

// {{ТТК Сладков А. Заявка № 24.05.2016 начало
Процедура ПриЗавершенииРаботыСистемы()
		//...
	
	//<< вн	
	внЖурналРегистрацииКлиент.ПриЗавершенииРаботыСистемы();
	//>>	
КонецПроцедуры
// }}ТТК Сладков А. Заявка № 24.05.2016 окончание