Функция ПревышенПорогСогласованияПоФилиалу(Сумма,Филиал) Экспорт
	
	ПределПревышен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Сумма > абс_ЛимитыПоФилиалам.Лимит
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПределПревышен
		|ИЗ
		|	РегистрСведений.абс_ЛимитыПоФилиалам КАК абс_ЛимитыПоФилиалам
		|ГДЕ
		|	абс_ЛимитыПоФилиалам.Филиал = &Филиал";

	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("Сумма", Сумма);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПределПревышен = ВыборкаДетальныеЗаписи.ПределПревышен;	
	КонецЕсли;

    Возврат ПределПревышен;
	
КонецФункции 
