
Процедура ttk_КонтрольЛимитовПоДоговорамОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Константы.ttk_ИспользоватьКонтрольЛимитовПоДоговорам.Получить() = Истина И Источник.ДоговорКонтрагента.ttk_ИспользоватьКонтрольЛимитов = Истина Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ttk_ОстаткиЛимитовПоДоговорамОстатки.СуммаБезНДСОстаток) КАК СуммаБезНДС,
			|	СУММА(ttk_ОстаткиЛимитовПоДоговорамОстатки.СуммаНДСОстаток) КАК СуммаНДС,
			|	СУММА(ttk_ОстаткиЛимитовПоДоговорамОстатки.СуммаСНДСОстаток) КАК СуммаСНДС,
			|	ttk_ОстаткиЛимитовПоДоговорамОстатки.Распоряжение,
			|	ttk_ЛимитыПоДоговорам.Статус,
			|	ttk_ЛимитыПоДоговорам.НачалоПериода,
			|	ВЫБОР
			|		КОГДА ttk_ЛимитыПоДоговорам.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА &Дт
			|		ИНАЧЕ ttk_ЛимитыПоДоговорам.ОкончаниеПериода
			|	КОНЕЦ КАК ОкончаниеПериода
			|ИЗ
			|	РегистрНакопления.ttk_ОстаткиЛимитовПоДоговорам.Остатки(&Дт, ) КАК ttk_ОстаткиЛимитовПоДоговорамОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ttk_ЛимитыПоДоговорам КАК ttk_ЛимитыПоДоговорам
			|		ПО ttk_ОстаткиЛимитовПоДоговорамОстатки.Распоряжение = ttk_ЛимитыПоДоговорам.Распоряжение
			|			И (&Дт МЕЖДУ НАЧАЛОПЕРИОДА(ttk_ЛимитыПоДоговорам.НачалоПериода, ДЕНЬ) И ВЫБОР
			|				КОГДА ttk_ЛимитыПоДоговорам.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА &Дт
			|				ИНАЧЕ ttk_ЛимитыПоДоговорам.ОкончаниеПериода
			|			КОНЕЦ)
			|ГДЕ
			|	ttk_ОстаткиЛимитовПоДоговорамОстатки.Организация = &Организация
			|	И ttk_ОстаткиЛимитовПоДоговорамОстатки.Контрагент = &Контрагент
			|	И ttk_ОстаткиЛимитовПоДоговорамОстатки.Договор = &Договор
			|
			|СГРУППИРОВАТЬ ПО
			|	ttk_ОстаткиЛимитовПоДоговорамОстатки.Распоряжение,
			|	ttk_ЛимитыПоДоговорам.Статус,
			|	ttk_ЛимитыПоДоговорам.НачалоПериода,
			|	ВЫБОР
			|		КОГДА ttk_ЛимитыПоДоговорам.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА &Дт
			|		ИНАЧЕ ttk_ЛимитыПоДоговорам.ОкончаниеПериода
			|	КОНЕЦ";
		Запрос.УстановитьПараметр("Организация", Источник.Организация);
		Запрос.УстановитьПараметр("Контрагент", Источник.Контрагент);
		Запрос.УстановитьПараметр("Договор", Источник.ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Дт", Источник.Дата);
		
		Выборка = Запрос.Выполнить();		
		Если Выборка.Пустой() Тогда
			Сообщить("По договору '" + Строка(Источник.ДоговорКонтрагента) + "' нет ни одного действующего распоряжения на закупку.");
			Отказ = Истина;
			Возврат;			
		КонецЕсли;
		
		Результат = Выборка.Выбрать();
		Пока Результат.Следующий() Цикл
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Или ТипЗнч(Источник) = Тип("ДокументОбъект.ПолучениеУслугПоПереработке") Тогда
		ВсегоНДС = УчетНДС.ПолучитьНДСДокумента(Источник);
		Источник.Движения.ttk_ОстаткиЛимитовПоДоговорам.Записывать = Истина;
		Движение = Источник.Движения.ttk_ОстаткиЛимитовПоДоговорам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник.Дата;
		Движение.Организация = Источник.Организация;
		Движение.Контрагент = Источник.Контрагент;
		Движение.Договор = Источник.ДоговорКонтрагента;
		Движение.СуммаНДС = ВсегоНДС;
		Движение.СуммаСНДС = Источник.СуммаДокумента;
		Движение.СуммаБезНДС = ?(Источник.СуммаВключаетНДС, (Движение.СуммаСНДС - Движение.СуммаНДС), (Движение.СуммаСНДС - Движение.СуммаНДС));
	КонецЕсли;
	
КонецПроцедуры
