
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Инициатор = глЗначениеПеременной("глТекущийПользователь");
	
		ДатаРазмещения = ТекущаяДата();
		
		Статус = Перечисления.абс_СтатусыИТР.РазработкаЗавершена;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусИТРПоРегистру(Ссылка);
		
	Если НЕ Статус = СтатусПоРегистру ИЛИ НЕ ЗначениеЗаполнено(СтатусПоРегистру) Тогда
		ЗаписатьНовыйСтатус(Статус);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНовыйСтатус(НовыйСтатус, пКомментарий = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовИТР.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ИТР.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата();

	Запись.ИТР					= Ссылка;
	Запись.Пользователь	 		= глЗначениеПеременной("глТекущийПользователь");	
	Запись.Статус				= НовыйСтатус;
	
	Запись.Комментарий 			= пКомментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
