

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	
	Если Параметры.Свойство("ПроверкаЗаполненияКонтрагента") Тогда 
		ПроверкаЗаполненияКонтрагента = Параметры.ПроверкаЗаполненияКонтрагента;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если (ПроверкаЗаполненияКонтрагента) И (НЕ ЗначениеЗаполнено(Запись.КонтрагентЕИСУП)) Тогда 
		Отказ = Истина;
		Сообщить("Необходимо заполнить контрагента ЕИСУП");
	КонецЕсли;
	
КонецПроцедуры
