
Процедура ПроведениеДокумента(ДополнительныеСвойства, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Период = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
	//Сторчевой А.Н. 00-00000074 {                                   
	ПериодДатаКон = КонецДня(ДополнительныеСвойства.ДляПроведения.Ссылка.ДатаКон);
	// } Сторчевой А.Н. 00-00000074
	Для Каждого ДанныеПоРегистру Из ДополнительныеСвойства.ДанныеПоРегистрам Цикл
		
		ИмяРегистра = ДанныеПоРегистру.Ключ;
		
		Для Каждого ТаблицыДанных Из ДанныеПоРегистру.Значение Цикл
			
			НомерСтроки = 1;
			Для Каждого СтрокаТаблицыДанных Из ТаблицыДанных Цикл

				СтрокаДвижений = ДополнительныеСвойства.Движения[ИмяРегистра].Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаТаблицыДанных);
				//Сторчевой А.Н. 00-00000074 {
				Если ИмяРегистра = "kwr_КорректировкиБюджетныхАналитик" Тогда
					СтрокаДвижений.Период              = ПериодДатаКон;
					//Сторчевой А.Н. 00-00000111 {                                   
				ИначеЕсли ИмяРегистра = "kwr_СборФактаТабличныеЧасти" Тогда
					СтрокаДвижений.Период = ПериодДатаКон;
					// } Сторчевой А.Н. 00-00000111
				Иначе 
					// } Сторчевой А.Н. 00-00000074
					СтрокаДвижений.Период              = Период;
					//Сторчевой А.Н. 00-00000074 {
				КонецЕсли;
				// } Сторчевой А.Н. 00-00000074
				
				Если ИмяРегистра = "kwr_СборФактаТабличныеЧасти" Тогда
					
					//Сторчевой А.Н. 77297726 // СтрокаДвижений.КлючСтроки = НомерСтроки;
					НомерСтроки               = НомерСтроки + 1;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Попытка 
		
		Если Не ДополнительныеСвойства.Движения.kwr_СборФактаТабличныеЧасти.Количество() = 0 Тогда
			ДополнительныеСвойства.Движения.kwr_СборФактаТабличныеЧасти.Записать();
		КонецЕсли;
		
		//Сторчевой А.Н. 77297726 {Если Не ДополнительныеСвойства.Движения.kwr_КорректировкиБюджетныхАналитик.Количество() = 0 Тогда
			ДополнительныеСвойства.Движения.kwr_КорректировкиБюджетныхАналитик.Записать();
		//Сторчевой А.Н. 77297726 {КонецЕсли;
		
	Исключение
		
		Отказ           = Истина;
		Сообщение       = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();	
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	ДополнительныеСвойства.Очистить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
