&НаСервере
Процедура ЗагрузитьТаблицуВложений(НомерСообщения,Регистратор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ВложенияТЭО.Вложение КАК ФайлВложение,
	|	абс_ВложенияТЭО.Комментарий,
	|	абс_ВложенияТЭО.Вложение.ИмяФайла КАК ИмяФайла
	|ИЗ
	|	РегистрСведений.абс_ВложенияТЭО КАК абс_ВложенияТЭО
	|ГДЕ
	|	абс_ВложенияТЭО.Регистратор = &Регистратор
	|	И абс_ВложенияТЭО.НомерСообщения = &НомерСообщения";
	
	Запрос.УстановитьПараметр("НомерСообщения", НомерСообщения);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	ТЗВложения.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьТаблицуВложений(Параметры.НомерСообщения,Параметры.Регистратор);
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла)
	
	ДвоичныеДанные = абс_РаботаСФайлами.ПолучитьФайлИзВнешнегоХранилища(СсылкаНаФайл);
	
	Если ДвоичныеДанные = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка 
		АдресХранилища = "";	
		АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		НаименованиеФайла = СсылкаНаФайл.Наименование;

	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при получении файла из хранилища.");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат АдресХранилища;
			
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлФложения()

	Состояние("Загрузка файла...");
	
	СсылкаНаФайл = Элементы.ТЗВложения.ТекущиеДанные.ФайлВложение;
	
	НаименованиеФайла = "";
	
	АдресХран = ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла);
	
	Если АдресХран = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(АдресХран, НаименованиеФайла, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложение(Команда)
	ОткрытьФайлФложения();	
КонецПроцедуры

&НаКлиенте
Процедура ТЗВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФайлФложения();
КонецПроцедуры
