//Перем ДатаНачалаОтчетногоПериода;
//Перем ДатаОкончанияОтчетногоПериода;

//Перем ДатаСНачалаТекущегоПериода;
//Перем ДатаЗаСекундуДоДатаНачала;

//Перем НачалоПериодаПрошлогоГода;
//Перем ОкончаниеПериодаПрошлогоГода;

//Перем ДатаОкончанияТекущегоГода;

Перем СтруктураДанныхОтчетаКлючевыеПоказатели;

Процедура РассчитатьПериоды(ДатаНачала,ДатаОкончания)Экспорт
	
		

	ДатаНачалаОтчетногоПериода = НачалоДня(ДатаНачала);
	ДатаОкончанияОтчетногоПериода = КонецДня(ДатаОкончания);
	
	//ДатаОкончанияТекущегоГода = КонецГода(ДатаНачалаОтчетногоПериода);
	ДатаОкончанияТекущегоГода = КонецГода(ДатаОкончанияОтчетногоПериода);
	
	ДатаСНачалаТекущегоПериода = НачалоГода(ДатаНачалаОтчетногоПериода);
	
	ДатаЗаСекундуДоДатаНачала = ?(ДатаОкончанияОтчетногоПериода=ДатаОкончанияТекущегоГода,ДатаОкончанияОтчетногоПериода,ДатаНачалаОтчетногоПериода-1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, МЕСЯЦ) КАК РазностьДат";

	Запрос.УстановитьПараметр("ДатаНачала", ДатаСНачалаТекущегоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияТекущегоГода);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
    КоличествоМесНазад = -(ВыборкаДетальныеЗаписи.РазностьДат+1);
	
	НачалоПериодаПрошлогоГода =  ДобавитьМесяц(ДатаНачалаОтчетногоПериода,КоличествоМесНазад);
	ОкончаниеПериодаПрошлогоГода = ДобавитьМесяц(ДатаОкончанияОтчетногоПериода,КоличествоМесНазад);
	
	

КонецПроцедуры

Процедура ИнициализацияСтруктурДанныхОтчетов() Экспорт
		 
     СтруктураДанныхОтчетаКлючевыеПоказатели = Новый Структура;
	 СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("Показатель");
	 
	 СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательФОП",0);
	 СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательБОП",0);
	 СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательВОП",0);
	 
     СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательФСГ",0);
     СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательБСГ",0);
	 СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательВСГ",0);
	 
	 СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательФПГ",0);
	 
	 	 
	 СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательБТГ",0);
     СтруктураДанныхОтчетаКлючевыеПоказатели.Вставить("ПоказательПТГ",0);
	 
КонецПроцедуры


Процедура СформироватьОтчетКлючевыеПоказатели(ОтчетВывод) Экспорт	

	МакетКлючевыеФинансовыеПоказатели = ЭтотОбъект.ПолучитьМакет("КлючевыеФинансовыеПоказатели");	
	Шапка = МакетКлючевыеФинансовыеПоказатели.ПолучитьОбласть("Шапка");
	
	ОтчетВывод.Очистить();
	ОтчетВывод.Вывести(Шапка);
	 ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели.Очистить();
	
//	ПоказательОбъект = Справочники.абс_СоставФинансовыхПоказателей.Выручка.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_СоставыПоказателейФинансовыхОтчетов.ФинансовыйПоказатель,
		|	абс_СоставыПоказателейФинансовыхОтчетов.ВыводитсяВОтчет
		|ИЗ
		|	РегистрСведений.абс_СоставыПоказателейФинансовыхОтчетов КАК абс_СоставыПоказателейФинансовыхОтчетов
		|ГДЕ
		|	абс_СоставыПоказателейФинансовыхОтчетов.ФинансовыйОтчет = &Отчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	абс_СоставыПоказателейФинансовыхОтчетов.ПорядокРасчета";

	Запрос.УстановитьПараметр("Отчет", Справочники.абс_ФинансовыеОтчеты.КлючевыеФинансовыеПоказатели);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбработкаПрерыванияПользователя();
		
		
		Если Не ВыборкаДетальныеЗаписи.ФинансовыйПоказатель.Формула Тогда 
			ПолучитьСтрокуФинПоказателя(ВыборкаДетальныеЗаписи.ФинансовыйПоказатель.ПолучитьОбъект()
			,СтруктураДанныхОтчетаКлючевыеПоказатели);
		Иначе
			ВычислитьСтрокуФинПоказателя(ВыборкаДетальныеЗаписи.ФинансовыйПоказатель.ПолучитьОбъект());
		КонецЕсли; 
		
		Если ВыборкаДетальныеЗаписи.ВыводитсяВОтчет Тогда
			ДанныеОтчета = МакетКлючевыеФинансовыеПоказатели.ПолучитьОбласть("ДанныеОтчета");
			ДанныеОтчета.Параметры.Заполнить(СтруктураДанныхОтчетаКлючевыеПоказатели);
			Если Не ВыборкаДетальныеЗаписи.ФинансовыйПоказатель.Формула И (ВыборкаДетальныеЗаписи.ФинансовыйПоказатель.СоставБюджетныхСтатей.Количество()>0)  Тогда 
							ДанныеОтчета.Параметры.ДанныеРасшифровки = СтруктураДанныхОтчетаКлючевыеПоказатели.Показатель.Ссылка;
			КонецЕсли;
			ОтчетВывод.Вывести(ДанныеОтчета); 
		КонецЕсли;		 
		
	КонецЦикла;
   
		
	
	
КонецПроцедуры


Процедура ПолучитьСтрокуФинПоказателя(Показатель,СтруктураДанныхОтчетаКлючевыеПоказатели)
	
	СтруктураДанныхОтчетаКлючевыеПоказатели.Показатель = Показатель;


	//---------------------------------------------------------------Отчетный период
			МассивПараметров = Новый Массив;
			
			ДобавитьВМассивПараметр(МассивПараметров,"НачалоПериода",ДатаНачалаОтчетногоПериода);
			
			ДобавитьВМассивПараметр(МассивПараметров,"КонецПериода",ДатаОкончанияОтчетногоПериода);

			ДобавитьВМассивПараметр(МассивПараметров,"Организация",ВыбранныеОрганизации.Выгрузить(Новый Структура("Отбирать",Истина),"Организация"));
												
		    ПостроительОтчетов =	Показатель.ВыполнитьЗапрос( ,МассивПараметров);
			СуммыОтчета = ПостроительОтчетов.Результат.Выбрать();
			СуммыОтчета.Следующий();
		    СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФОП = СуммыОтчета.СуммаРезультат;
			СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБОП = ?(Показатель.НаОсновеБухгалтерии,СуммыОтчета.СуммаРезультат,СуммыОтчета.СуммаРезультатПлан);

	//---------------------------------------------------------------С начала года
	
	        МассивПараметров.Очистить();
						
			ДобавитьВМассивПараметр(МассивПараметров,"НачалоПериода",ДатаСНачалаТекущегоПериода);
			
			ДобавитьВМассивПараметр(МассивПараметров,"КонецПериода",ДатаЗаСекундуДоДатаНачала);

			ДобавитьВМассивПараметр(МассивПараметров,"Организация",ВыбранныеОрганизации.Выгрузить(Новый Структура("Отбирать",Истина),"Организация"));
			
		    ПостроительОтчетов =	Показатель.ВыполнитьЗапрос( ,МассивПараметров);
			СуммыОтчета = ПостроительОтчетов.Результат.Выбрать();
			СуммыОтчета.Следующий();
		    СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФСГ = СуммыОтчета.СуммаРезультат;
            СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБСГ = ?(Показатель.НаОсновеБухгалтерии,СуммыОтчета.СуммаРезультат,СуммыОтчета.СуммаРезультатПлан);
	//--------------------------------------------------------------- Отчетный период в прошлом году
	  

			МассивПараметров.Очистить();
			
						
			ДобавитьВМассивПараметр(МассивПараметров,"НачалоПериода",НачалоПериодаПрошлогоГода);
			
			ДобавитьВМассивПараметр(МассивПараметров,"КонецПериода",ОкончаниеПериодаПрошлогоГода);

			ДобавитьВМассивПараметр(МассивПараметров,"Организация",ВыбранныеОрганизации.Выгрузить(Новый Структура("Отбирать",Истина),"Организация"));

			
			ПостроительОтчетов =	Показатель.ВыполнитьЗапрос( ,МассивПараметров);
			СуммыОтчета = ПостроительОтчетов.Результат.Выбрать();
			СуммыОтчета.Следующий();

			СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФПГ = СуммыОтчета.СуммаРезультат;
			
	//--------------------------------------------------------------- Отчетный период в прошлом году
       
			МассивПараметров.Очистить();
			
						
			ДобавитьВМассивПараметр(МассивПараметров,"НачалоПериода",ДатаСНачалаТекущегоПериода);
			
			ДобавитьВМассивПараметр(МассивПараметров,"КонецПериода",ДатаОкончанияТекущегоГода);

			ДобавитьВМассивПараметр(МассивПараметров,"Организация",ВыбранныеОрганизации.Выгрузить(Новый Структура("Отбирать",Истина),"Организация"));

			
		    ПостроительОтчетов =	Показатель.ВыполнитьЗапрос( ,МассивПараметров);
			СуммыОтчета = ПостроительОтчетов.Результат.Выбрать();
			СуммыОтчета.Следующий();

		    СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБТГ = ?(Показатель.НаОсновеБухгалтерии,СуммыОтчета.СуммаРезультат,СуммыОтчета.СуммаРезультатПлан);	


	    СкопироватьВТЗ(Показатель);

	
	КонецПроцедуры
	
Процедура ДобавитьВМассивПараметр(МассивДляДобавления,ИмяПараметра,ЗначениеПараметра)	
			
	СтруктураПараметров  = Новый Структура("ИмяПараметра,Значение");	
	СтруктураПараметров.ИмяПараметра = ИмяПараметра;
	СтруктураПараметров.Значение = ЗначениеПараметра;
	МассивДляДобавления.Добавить(СтруктураПараметров);
	
КонецПроцедуры
	
Процедура СкопироватьВТЗ(Показатель)

	 НоваяСтрока =  ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели.Добавить();
	 НоваяСтрока.Показатель = Показатель.Ссылка;
	 НоваяСтрока.ПоказательФОП = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФОП ;
	 НоваяСтрока.ПоказательБОП = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБОП;
	 НоваяСтрока.ПоказательВОП = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательВОП;
	 
	 НоваяСтрока.ПоказательФСГ = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФСГ;
	 НоваяСтрока.ПоказательБСГ = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБСГ;
	 НоваяСтрока.ПоказательВСГ = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательВСГ;
	 
	 НоваяСтрока.ПоказательФПГ = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФПГ;
	 
	 НоваяСтрока.ПоказательБТГ = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБТГ;
	 НоваяСтрока.ПоказательПТГ = СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательПТГ;

КонецПроцедуры

	
Процедура ВычислитьСтрокуФинПоказателя(Показатель)
	

	
	СтруктураДанныхОтчетаКлючевыеПоказатели.Показатель = Показатель;

	
    //-------------------------------------------------
	
	МассивЗначений = Новый Массив;
	
	Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
		ДобавитьВМассивПараметр(МассивЗначений,ТекущийПоказатель.Показатель.КодДляВычисления,ТекущийПоказатель.ПоказательФОП);
	КонецЦикла;
	
	СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФОП = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------
	
	МассивЗначений.Очистить();
	
	Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
		ДобавитьВМассивПараметр(МассивЗначений,ТекущийПоказатель.Показатель.КодДляВычисления,ТекущийПоказатель.ПоказательБОП);
	КонецЦикла;
	
	СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБОП = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	
	
	//МассивЗначений.Очистить();
	//
	//Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
	//	Структура = Новый Структура("ИмяПеременной,ЗначениеПеременной",ТекущийПоказатель.Показатель,ТекущийПоказатель.ПоказательВОП);
	//	МассивЗначений.Добавить(Структура);
	//КонецЦикла;
	//
	//СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательВОП = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	
	
	МассивЗначений.Очистить();
	
	Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
		ДобавитьВМассивПараметр(МассивЗначений,ТекущийПоказатель.Показатель.КодДляВычисления,ТекущийПоказатель.ПоказательФСГ);
	КонецЦикла;
	
	СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФСГ = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	
	
	
	МассивЗначений.Очистить();
	
	Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
		ДобавитьВМассивПараметр(МассивЗначений,ТекущийПоказатель.Показатель.КодДляВычисления,ТекущийПоказатель.ПоказательБСГ);
	КонецЦикла;
	
	СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБСГ = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	

	//МассивЗначений.Очистить();
	//
	//Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
	//	Структура = Новый Структура("ИмяПеременной,ЗначениеПеременной",ТекущийПоказатель.Показатель,ТекущийПоказатель.ПоказательВСГ);
	//	МассивЗначений.Добавить(Структура);
	//КонецЦикла;
	//
	//СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательВСГ = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	

     МассивЗначений.Очистить();
	
	 Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
		 	ДобавитьВМассивПараметр(МассивЗначений,ТекущийПоказатель.Показатель.КодДляВычисления,ТекущийПоказатель.ПоказательФПГ);
	КонецЦикла;
	
	СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательФПГ = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	

	     МассивЗначений.Очистить();
	
		 Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
			 ДобавитьВМассивПараметр(МассивЗначений,ТекущийПоказатель.Показатель.КодДляВычисления,ТекущийПоказатель.ПоказательБТГ);
	   	КонецЦикла;
	
	СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательБТГ = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	

//			 МассивЗначений.Очистить();
//	
//	Для Каждого ТекущийПоказатель ИЗ ТаблицаСтруктурыДанныхОтчетаКлючевыеПоказатели Цикл
//		Структура = Новый Структура("ИмяПеременной,ЗначениеПеременной",ТекущийПоказатель.Показатель,ТекущийПоказатель.ПоказательПТГ);
//		МассивЗначений.Добавить(Структура);
//	КонецЦикла;
//	
//	СтруктураДанныхОтчетаКлючевыеПоказатели.ПоказательПТГ = Показатель.ВычислитьПоФормуле(МассивЗначений);
	
	//-------------------------------------------------	

			
    СкопироватьВТЗ(Показатель);		
КонецПроцедуры
		
Процедура СформироватьОтчетРасшифровки(Показатель) Экспорт

	ФормаРасшифровки = ЭтотОбъект.ПолучитьФорму("ФормаРасшифровки");
	ТабДок = ФормаРасшифровки.ЭлементыФормы.ТабличныйДокументРасшифровка;
	
	РасшифровкаБюджетныхСтатей = ЭтотОбъект.ПолучитьМакет("РасшифровкаБюджетныхСтатей");	
	Шапка = РасшифровкаБюджетныхСтатей.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Показатель = Показатель.Наименование;
	//ТабДок.Очистить();
	ТабДок.Вывести(Шапка);


		ТекстЗапроса = "ВЫБРАТЬ
		               |	абс_СоставФинансовыхПоказателейСоставБюджетныхСтатей.БюджетнаяСтатья
		               |ПОМЕСТИТЬ ВТБюджетныеСтатьи
		               |ИЗ
		               |	Справочник.абс_СоставФинансовыхПоказателей.СоставБюджетныхСтатей КАК абс_СоставФинансовыхПоказателейСоставБюджетныхСтатей
		               |ГДЕ
		               |	абс_СоставФинансовыхПоказателейСоставБюджетныхСтатей.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	абс_СоставФинансовыхПоказателейПараметрыЗапроса.Значение
		               |ПОМЕСТИТЬ ВТСценарий
		               |ИЗ
		               |	Справочник.абс_СоставФинансовыхПоказателей.ПараметрыЗапроса КАК абс_СоставФинансовыхПоказателейПараметрыЗапроса
		               |ГДЕ
		               |	абс_СоставФинансовыхПоказателейПараметрыЗапроса.ИмяПараметра = &ИмяПараметра
		               |	И абс_СоставФинансовыхПоказателейПараметрыЗапроса.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ОборотыБюджетовОбороты.СуммаСценарияОборот) КАК СуммаРезультатПланОП,
		               |	ОборотыБюджетовОбороты.СтатьяОборотов КАК БюджетнаяСтатья
		               |ПОМЕСТИТЬ ВТОтчетныйПериод
		               |ИЗ
		               |	РегистрНакопления.ОборотыБюджетов.Обороты(
		               |			НАЧАЛОПЕРИОДА(&НачалоПериодаОП, ДЕНЬ),
		               |			КОНЕЦПЕРИОДА(&КонецПериодаОП, ДЕНЬ),
		               |			,
		               |			СтатьяОборотов В
		               |					(ВЫБРАТЬ
		               |						Т.БюджетнаяСтатья
		               |					ИЗ
		               |						ВТБюджетныеСтатьи КАК Т)
		               |				И Сценарий В
		               |					(ВЫБРАТЬ
		               |						Т.Значение
		               |					ИЗ
		               |						ВТСценарий КАК Т)
		               |				И Организация В (&Организация)) КАК ОборотыБюджетовОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ОборотыБюджетовОбороты.СтатьяОборотов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ОборотыБюджетовОбороты.СуммаСценарияОборот) КАК СуммаРезультатПланСГ,
		               |	ОборотыБюджетовОбороты.СтатьяОборотов КАК БюджетнаяСтатья
		               |ПОМЕСТИТЬ ВТСначалаГода
		               |ИЗ
		               |	РегистрНакопления.ОборотыБюджетов.Обороты(
		               |			НАЧАЛОПЕРИОДА(&НачалоПериодаСГ, ДЕНЬ),
		               |			КОНЕЦПЕРИОДА(&КонецПериодаСГ, ДЕНЬ),
		               |			,
		               |			СтатьяОборотов В
		               |					(ВЫБРАТЬ
		               |						Т.БюджетнаяСтатья
		               |					ИЗ
		               |						ВТБюджетныеСтатьи КАК Т)
		               |				И Сценарий В
		               |					(ВЫБРАТЬ
		               |						Т.Значение
		               |					ИЗ
		               |						ВТСценарий КАК Т)
		               |				И Организация В (&Организация)) КАК ОборотыБюджетовОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ОборотыБюджетовОбороты.СтатьяОборотов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ОборотыБюджетовОбороты.СуммаСценарияОборот) КАК СуммаРезультатПланПГ,
		               |	ОборотыБюджетовОбороты.СтатьяОборотов КАК БюджетнаяСтатья
		               |ПОМЕСТИТЬ ВТПрощлыйГод
		               |ИЗ
		               |	РегистрНакопления.ОборотыБюджетов.Обороты(
		               |			НАЧАЛОПЕРИОДА(&НачалоПериодаПГ, ДЕНЬ),
		               |			КОНЕЦПЕРИОДА(&КонецПериодаПГ, ДЕНЬ),
		               |			,
		               |			СтатьяОборотов В
		               |					(ВЫБРАТЬ
		               |						Т.БюджетнаяСтатья
		               |					ИЗ
		               |						ВТБюджетныеСтатьи КАК Т)
		               |				И Сценарий В
		               |					(ВЫБРАТЬ
		               |						Т.Значение
		               |					ИЗ
		               |						ВТСценарий КАК Т)
		               |				И Организация В (&Организация)) КАК ОборотыБюджетовОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ОборотыБюджетовОбороты.СтатьяОборотов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ОборотыБюджетовОбороты.СуммаСценарияОборот) КАК СуммаРезультатПланТГ,
		               |	ОборотыБюджетовОбороты.СтатьяОборотов КАК БюджетнаяСтатья
		               |ПОМЕСТИТЬ ВТТекущийГод
		               |ИЗ
		               |	РегистрНакопления.ОборотыБюджетов.Обороты(
		               |			НАЧАЛОПЕРИОДА(&НачалоПериодаТГ, ДЕНЬ),
		               |			КОНЕЦПЕРИОДА(&КонецПериодаТГ, ДЕНЬ),
		               |			,
		               |			СтатьяОборотов В
		               |					(ВЫБРАТЬ
		               |						Т.БюджетнаяСтатья
		               |					ИЗ
		               |						ВТБюджетныеСтатьи КАК Т)
		               |				И Сценарий В
		               |					(ВЫБРАТЬ
		               |						Т.Значение
		               |					ИЗ
		               |						ВТСценарий КАК Т)
		               |				И Организация В (&Организация)) КАК ОборотыБюджетовОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ОборотыБюджетовОбороты.СтатьяОборотов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТОтчетныйПериод.БюджетнаяСтатья,
		               |	ВТОтчетныйПериод.СуммаРезультатПланОП,
		               |	0 КАК СуммаРезультатПланСГ,
		               |	0 КАК СуммаРезультатПланПГ,
		               |	0 КАК СуммаРезультатПланТГ
		               |ПОМЕСТИТЬ ВТПредварительныйРезультат
		               |ИЗ
		               |	ВТОтчетныйПериод КАК ВТОтчетныйПериод
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТСначалаГода.БюджетнаяСтатья,
		               |	0,
		               |	ВТСначалаГода.СуммаРезультатПланСГ,
		               |	0,
		               |	0
		               |ИЗ
		               |	ВТСначалаГода КАК ВТСначалаГода
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТПрощлыйГод.БюджетнаяСтатья,
		               |	0,
		               |	0,
		               |	ВТПрощлыйГод.СуммаРезультатПланПГ,
		               |	0
		               |ИЗ
		               |	ВТПрощлыйГод КАК ВТПрощлыйГод
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТТекущийГод.БюджетнаяСтатья,
		               |	0,
		               |	0,
		               |	0,
		               |	ВТТекущийГод.СуммаРезультатПланТГ
		               |ИЗ
		               |	ВТТекущийГод КАК ВТТекущийГод
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТПредварительныйРезультат.БюджетнаяСтатья,
		               |	СУММА(ВТПредварительныйРезультат.СуммаРезультатПланОП) КАК СуммаРезультатПланОП,
		               |	СУММА(ВТПредварительныйРезультат.СуммаРезультатПланСГ) КАК СуммаРезультатПланСГ,
		               |	СУММА(ВТПредварительныйРезультат.СуммаРезультатПланПГ) КАК СуммаРезультатПланПГ,
		               |	СУММА(ВТПредварительныйРезультат.СуммаРезультатПланТГ) КАК СуммаРезультатПланТГ
		               |ИЗ
		               |	ВТПредварительныйРезультат КАК ВТПредварительныйРезультат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТПредварительныйРезультат.БюджетнаяСтатья";
				   
					   
					   
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка",Показатель);
	Запрос.УстановитьПараметр("ИмяПараметра","СценарийПлан");
    Запрос.УстановитьПараметр("НачалоПериодаОП",ДатаНачалаОтчетногоПериода);
    Запрос.УстановитьПараметр("КонецПериодаОП",ДатаОкончанияОтчетногоПериода);
	 Запрос.УстановитьПараметр("НачалоПериодаСГ",ДатаСНачалаТекущегоПериода);
    Запрос.УстановитьПараметр("КонецПериодаСГ",ДатаЗаСекундуДоДатаНачала);
	 Запрос.УстановитьПараметр("НачалоПериодаПГ",НачалоПериодаПрошлогоГода);
    Запрос.УстановитьПараметр("КонецПериодаПГ",ОкончаниеПериодаПрошлогоГода);
	 Запрос.УстановитьПараметр("НачалоПериодаТГ",ДатаСНачалаТекущегоПериода);
    Запрос.УстановитьПараметр("КонецПериодаТГ",ДатаОкончанияТекущегоГода);

    Запрос.УстановитьПараметр("Организация",ВыбранныеОрганизации.Выгрузить(Новый Структура("Отбирать",Истина),"Организация"));

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	 ДанныеОтчета = РасшифровкаБюджетныхСтатей.ПолучитьОбласть("ДанныеОтчета");
  	 СуммаРезультатПланОП = 0;
	 СуммаРезультатПланСГ = 0;
	 СуммаРезультатПланПГ = 0;
	 СуммаРезультатПланТГ = 0;
	Пока Выборка.Следующий() Цикл
	    ДанныеОтчета.Параметры.Показатель = Выборка.БюджетнаяСтатья;
		ДанныеОтчета.Параметры.ПоказательОП = Выборка.СуммаРезультатПланОП;
		ДанныеОтчета.Параметры.ПоказательСГ = Выборка.СуммаРезультатПланСГ;
		ДанныеОтчета.Параметры.ПоказательПГ = Выборка.СуммаРезультатПланПГ;
		ДанныеОтчета.Параметры.ПоказательТГ = Выборка.СуммаРезультатПланТГ;
		ТабДок.Вывести(ДанныеОтчета);
	 СуммаРезультатПланОП = СуммаРезультатПланОП+Выборка.СуммаРезультатПланОП;
	 СуммаРезультатПланСГ = СуммаРезультатПланСГ+Выборка.СуммаРезультатПланСГ;
	 СуммаРезультатПланПГ = СуммаРезультатПланПГ+Выборка.СуммаРезультатПланПГ;
	 СуммаРезультатПланТГ = СуммаРезультатПланТГ+Выборка.СуммаРезультатПланТГ;


 КонецЦикла;
 
   ДанныеОтчетаИтог = РасшифровкаБюджетныхСтатей.ПолучитьОбласть("ДанныеОтчетаИтог");
   ДанныеОтчетаИтог.Параметры.ПоказательОП = СуммаРезультатПланОП;
	ДанныеОтчетаИтог.Параметры.ПоказательСГ = СуммаРезультатПланСГ;
	ДанныеОтчетаИтог.Параметры.ПоказательПГ = СуммаРезультатПланПГ;
	ДанныеОтчетаИтог.Параметры.ПоказательТГ = СуммаРезультатПланТГ;
    ТабДок.Вывести(ДанныеОтчетаИтог);

	ФормаРасшифровки.Открыть(); 

КонецПроцедуры


ТекущийОтчет = Справочники.абс_ФинансовыеОтчеты.КлючевыеФинансовыеПоказатели;