Процедура ЗаполнитьСписокДоступныхСтатусов(ЗаявкаСсылка, СписокСтатусов) Экспорт
	
	Если не ЗначениеЗаполнено(ЗаявкаСсылка) Тогда
		СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Подготовка);
		Возврат;
	КонецЕсли;
	
	СписокСтатусов.Очистить(); 	
	мТекущийПользователь 	  = глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя 		  = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	ЕстьРольСуперПользователь = не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено; 	
	ТекСтатус                 = ЗаявкаСсылка.Статус;    	
	СписокСтатусов.Добавить(ТекСтатус);
	ТекущийПользовательСоздалЗаявку = мТекущийПользователь = ЗаявкаСсылка.Инициатор;
	
	//СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
	
	Если ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.Подготовка Тогда		
		Если ТекущийПользовательСоздалЗаявку или ЕстьРольСуперПользователь Тогда 			
			Если не ЗначениеЗаполнено(ЗаявкаСсылка.Задача) Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.АнализДирМФС);
			Иначе	
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
			КонецЕсли;	
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Отмена);
		КонецЕсли;
		//АБС ВСТАВКА №4555 НАЧАЛО
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
		КонецЕсли;
		//\\АБС ВСТАВКА №4555 КОНЕЦ
			 
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.АнализДирМФС Тогда    		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда   			 
			// АБС 20110818 Фролов Добавлена возможность отказа и закрытия.
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Уточнение);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ДополнительноеСогласование);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Согласовано);			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.СогласованиеЧТЗ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.КонтрольАрхитектуры);  //АБС ВСТАВКА 57369  28.05.2015 16:46:50  Коломиец
			Если ЗначениеЗаполнено(ЗаявкаСсылка.Исполнитель) и ЗаявкаСсылка.Исполнитель.абс_ЭтоПользовательАбсолютСофт Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеДирМФС);
			Иначе	
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеИнициатором);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
			КонецЕсли;
		КонецЕсли;
		
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ  			
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.Согласовано Тогда 		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ИсполнительЗаявкиНаПоддержку) = Неопределено или ЕстьРольСуперПользователь Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Уточнение);
		КонецЕсли;
		//АБС ВСТАВКА №4555 НАЧАЛО
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
		КонецЕсли;
		//\\АБС ВСТАВКА №4555 КОНЕЦ		
		
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ 		
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение Тогда  		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ИсполнительЗаявкиНаПоддержку) = Неопределено или ЕстьРольСуперПользователь Тогда 			 
			 Если ЗначениеЗаполнено(ЗаявкаСсылка.Задача) Тогда 
				 СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеИнициатором);
			 Иначе	
				 СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеДирМФС);					
			 КонецЕсли;	
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Уточнение);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ДополнительноеСогласование);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ОбновлениеРабочегоПриложения); 
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.СогласованиеЧТЗ);
		КонецЕсли;
		//АБС ВСТАВКА №4555, 7623 НАЧАЛО
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено 
			или ЕстьРольСуперПользователь или ТекущийПользовательСоздалЗаявку Тогда  
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
		КонецЕсли;
		//\\АБС ВСТАВКА №4555 КОНЕЦ	
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ 
		
	//АБС ВСТАВКА №39121 НАЧАЛО «20 февраля 2014 г.», Пополитов 			
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.ДополнительноеСогласование Тогда  		
		Если мТекущийПользователь = ЗаявкаСсылка.СотрудникДополнительногоСогласования или ЕстьРольСуперПользователь Тогда  
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.АнализДирМФС);
		КонецЕсли;	
	//\\АБС ВСТАВКА №39121 КОНЕЦ
	
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.СогласованиеЧТЗ Тогда  		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда  
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
		КонецЕсли;	
	
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.ОбновлениеРабочегоПриложения Тогда  		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ИсполнительЗаявкиНаПоддержку) = Неопределено или ЕстьРольСуперПользователь Тогда   			 
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
			Если не ЗначениеЗаполнено(ЗаявкаСсылка.Задача) Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеДирМФС);
			Иначе				
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеИнициатором);	
			КонецЕсли;			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ОшибкаТестирования);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта); 			
		КонецЕсли;		
		
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ		
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.Уточнение Тогда		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено 
			или ЕстьРольСуперПользователь
			или не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено Тогда  				
			Если не ЗначениеЗаполнено(ЗаявкаСсылка.Задача) Тогда	
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.АнализДирМФС);
				//АБС ВСТАВКА №6956 НАЧАЛО
				Если ЗначениеЗаполнено(ЗаявкаСсылка.СтарыйСтатус) 
					и ЗаявкаСсылка.СтарыйСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение Тогда 				
					СписокСтатусов.Добавить(ЗаявкаСсылка.СтарыйСтатус); 
				КонецЕсли;
				//\\АБС ВСТАВКА №6956 КОНЕЦ 
			Иначе	
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);					
			КонецЕсли;							           			
		КонецЕсли;    					 
		//АБС ВСТАВКА №4555 НАЧАЛО
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
		КонецЕсли;
		//\\АБС ВСТАВКА №4555 КОНЕЦ			 
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеДирМФС Тогда			
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеИнициатором);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ОшибкаТестирования);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
			//АБС ВСТАВКА №4555 НАЧАЛО
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
			//\\АБС ВСТАВКА №4555 КОНЕЦ				
		КонецЕсли; 	
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ		
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеИнициатором Тогда				
		Если ТекущийПользовательСоздалЗаявку или ЕстьРольСуперПользователь Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ОшибкаТестирования);
			//АБС ВСТАВКА №24932 НАЧАЛО «19 февраля 2014 г.», Пополитов
			Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ОжидаетТестированияЗаявки) = Неопределено или ЕстьРольСуперПользователь Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ОжидаетТестирования);	
			КонецЕсли;
			//\\АБС ВСТАВКА №24932 КОНЕЦ
		КонецЕсли;    		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда 		 
			 СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);   			 
		КонецЕсли;	
		
	//АБС ВСТАВКА №24932 НАЧАЛО «19 февраля 2014 г.», Пополитов
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.ОжидаетТестирования Тогда	
		Если ТекущийПользовательСоздалЗаявку или ЕстьРольСуперПользователь Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеИнициатором);			
		КонецЕсли;  	
		//\\АБС ВСТАВКА №24932 КОНЕЦ
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ		
	
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.ОшибкаТестирования Тогда  		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ИсполнительЗаявкиНаПоддержку) = Неопределено или ЕстьРольСуперПользователь Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Исполнение);
		КонецЕсли;			
		//АБС ВСТАВКА №4555 НАЧАЛО
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
		КонецЕсли;
		//\\АБС ВСТАВКА №4555 КОНЕЦ			
		//АБС ВСТАВКА №40079 НАЧАЛО «28 марта 2014 г.», Пополитов
		Если ТекущийПользовательСоздалЗаявку Тогда 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Выполнена);
		КонецЕсли;	
		//\\АБС ВСТАВКА №40079 КОНЕЦ		
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.Отказ Тогда  		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено 
			 или ЕстьРольСуперПользователь 
			 или не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено Тогда			 		 
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Подготовка);
		КонецЕсли;   		
		//АБС ВСТАВКА №4555 НАЧАЛО
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда
		    СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Закрыта);
		КонецЕсли;
		//\\АБС ВСТАВКА №4555 КОНЕЦ	
		
	//АБС ВСТАВКА 57369  28.05.2015 16:47:23  Коломиец
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыЗаявокВПоддержку.КонтрольАрхитектуры Тогда 
		
		Если не мРолиПользователя.Найти(Справочники.РолиИсполнителей.ДирМФС) = Неопределено или ЕстьРольСуперПользователь Тогда  
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.АнализДирМФС);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Согласовано);
		КонецЕсли;			
	//АБС ВСТАВКА 57369 КОНЕЦ	
		
	КонецЕсли;	
	
КонецПроцедуры
