Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

Процедура ПередЗаписью(Отказ, Замещение)
	//АБС ВСТАВКА 47248  28.10.2014 12:06:22  Манжела
	ДатаОчисткиДокументаОснованияПоПартиямБУНУ = Константы.абс_ДатаОчисткиДокументаОснованияПоПартиямБУНУ.Получить();
	МассивСчетаПоСредней      = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыПоСредней();
	
	Если ЭтотОбъект.Количество()>0 И ДатаОчисткиДокументаОснованияПоПартиямБУНУ <> '00010101' Тогда
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			Если ЗаписьНабора.Период>ДатаОчисткиДокументаОснованияПоПартиямБУНУ И МассивСчетаПоСредней.Найти(ЗаписьНабора.СчетУчета.Код)<>Неопределено И ЗаписьНабора.Организация=ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК Тогда 
				ЗаписьНабора.ДокументОприходования = Неопределено;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли; 
	//АБС ВСТАВКА 47248 КОНЕЦ
КонецПроцедуры
