
Функция Абс_НайтиПодчиненныйДокОтражениеРеализацииТоваровИУслугНДС(Знач ДокументСсылка) Экспорт

	Если не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	НайденныйДокумент = Неопределено;

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("РасчетныйДокумент", ДокументСсылка);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтражениеРеализацииТоваровИУслугНДС КАК ОтражениеРеализацииТоваровИУслугНДС
	|ГДЕ
	|	ОтражениеРеализацииТоваровИУслугНДС.РасчетныйДокумент = &РасчетныйДокумент";
	
	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

	
	Если ВыборкаИзЗапроса.Следующий() Тогда 		
		НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НайденныйДокумент) Тогда    		
		Возврат Неопределено;
	Иначе
		Возврат НайденныйДокумент;
	КонецЕсли;
	
КонецФункции // НайтиПодчиненныйДокумент()
