// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ИНТЕРАКТИВНОЙ АКТИВАЦИИ
//Процедура ДействиеСогласованиеДФМОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;	
//	ОткрытьРекласификацию();
//	
//КонецПроцедуры

Процедура ДействиеПроведенОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьРекласификацию();
	
КонецПроцедуры

//Процедура ДействиеУточнениеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	ОткрытьРекласификацию();
//	
//КонецПроцедуры

Процедура ДействиеОтказОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//Сторчевой оставить	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьРекласификацию();
	
КонецПроцедуры

Процедура ОткрытьРекласификацию()
	
	ФормаРекласификации = РекласификацияБюджета.ПолучитьФорму("ФормаДокумента");
	
	Если ФормаРекласификации.Открыта() Тогда
		ФормаРекласификации.Активизировать();
	Иначе
		ФормаРекласификации.Открыть();
	КонецЕсли;
	
КонецПроцедуры

// ПРОЦЕДУРЫ ОБРАБОТКИЧИ ПРИСОЗДАНИИЗАДАЧ
//Процедура ДействиеСогласованиеДФМПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
//	
//	//АБС ВСТАВКА №19248 НАЧАЛО
//	//Перенос между аналитиками или фактом согласуется только сотрудником КТТК
//	ОрганизацияСогласования = ?(РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами
//								,РекласификацияБюджета.ИсточникОрганизация,Справочники.Организации.НайтиПоНаименованию("КТТК"));   	
//	//\\АБС ВСТАВКА №19248 КОНЕЦ	
//	
//	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ОрганизацияСогласования, РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами);
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
//	
//КонецПроцедуры

Процедура ДействиеПроведенПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
	
КонецПроцедуры

Процедура ДействиеОтказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
//Сторчевой оставить
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
	
КонецПроцедуры

//Процедура ДействиеУточнениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
//	
//	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
//	
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
//	
//КонецПроцедуры

Процедура СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ФормируемыеЗадачи.Очистить();	
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	абс_БизнесПроцессы.СформироватьЗадачуРекласификацияБюджета(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, ПользовательИнициаторБП, Отказ,,,Неопределено);
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	   
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи, Отказ = Ложь, Организация = Неопределено, ПереносМеждуПериодами = Ложь) Экспорт
	
	ФормируемыеЗадачи.Очистить();
	
	//АБС ВСТАВКА №40157,43593 НАЧАЛО «2 апреля 2014 г.», Пополитов
	Если ЭтотОбъект.Ссылка.РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами
		и (ТочкаМаршрута = БизнесПроцессы.абсРекласификацияБюджета.ТочкиМаршрута.ДействиеСогласованиеДЭИ
			или ТочкаМаршрута = БизнесПроцессы.абсРекласификацияБюджета.ТочкиМаршрута.ДействиеСогласованиеСотрудникомДК
			или ТочкаМаршрута = БизнесПроцессы.абсРекласификацияБюджета.ТочкиМаршрута.ДействиеСогласованиеДФМ)
		и не абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(ПользовательИнициаторБП).Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено Тогда  		
		абс_БизнесПроцессы.СформироватьЗадачуРекласификацияБюджета(ЭтотОбъект.Ссылка, ТочкаМаршрута, ФормируемыеЗадачи, ПользовательИнициаторБП, Отказ,,,Неопределено);
		абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрута, ФормируемыеЗадачи);	
		Возврат;
	КонецЕсли;
 	//\\АБС ВСТАВКА №40157 КОНЕЦ   	
	
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямРекласификация(ЭтотОбъект.Ссылка, ТочкаМаршрута, ФормируемыеЗадачи, , Организация);
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач. Не найдено ответственных.", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ПереносМеждуПериодами И РекласификацияБюджета.ИсточникОрганизация = Справочники.Организации.НайтиПоНаименованию("КТТК") Тогда    //АБС Коломиец 19806
		 абс_БизнесПроцессы.СформироватьЗадачуРекласификацияБюджета(ЭтотОбъект.Ссылка, ТочкаМаршрута, ФормируемыеЗадачи, ПользовательИнициаторБП, Отказ,,,Неопределено);
	КонецЕсли;
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

// ПРОЦЕДУРЫ ПРОВЕРКИ УСЛОВИЙ
//Процедура УсловиеСогласованДФМПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = (РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Проведен
//					или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль
//					или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеПВП);  //АБС Коломиец 19255
//    	
//КонецПроцедуры

//Процедура УсловиеУточнениеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение;
//	
//КонецПроцедуры

//Процедура ДействиеСогласованиеРуководителемЦФОПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
//	
//	//СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
//	
//	//МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
//	//	ЗакупочныйЗаказ.ЦФО.абс_Ответственные.ВыгрузитьКолонку("ОтветственныйСотрудник"));
//	
//	МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
//		абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(РекласификацияБюджета.ИсточникЦФО, , РекласификацияБюджета.ИсточникОрганизация));
//	
//	Если МассивИсполнителей.Количество() = 0 Тогда
//		
//		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных для ЦФО: " + РекласификацияБюджета.ИсточникЦФО + ".", Отказ);
//		Возврат;
//	КонецЕсли;
//	
//	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямРекласификация(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей);
//	
//	// Добавим задачи для суперпользователей
//	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
//	
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);	
//	
//КонецПроцедуры

//Процедура ДействиеСогласованиеДЭИПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
//	
//	//АБС ВСТАВКА №19248 НАЧАЛО
//	//Перенос между аналитиками или фактом согласуется только сотрудником КТТК
//	ОрганизацияСогласования = ?(РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами
//								,РекласификацияБюджета.ИсточникОрганизация,Справочники.Организации.НайтиПоНаименованию("КТТК"));   	
//	//\\АБС ВСТАВКА №19248 КОНЕЦ
//	
//	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ОрганизацияСогласования, РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами); 	
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
//	
//КонецПроцедуры

//Процедура УсловиеКВПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	//АБС ВСТАВКА №19248 НАЧАЛО
//	Результат = РекласификацияБюджета.ПриемникСтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост");
//	//\\АБС ВСТАВКА №19248 КОНЕЦ
//	
//КонецПроцедуры

//Процедура ДействиеСогласованиеДЭИОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//		
//	СтандартнаяОбработка = Ложь; 	
//	ОткрытьРекласификацию();
//	
//КонецПроцедуры

Процедура ДействиеСогласованиеРуководителемЦФООбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//Сторчевой оставить		
	СтандартнаяОбработка = Ложь;  	
	ОткрытьРекласификацию();
	
КонецПроцедуры

Процедура УсловиеОтказУточнениеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) //Сторчевой оставить
	//Сторчевой оставить
	//Сторчевой А.Н. 7796764 {                                   
	//Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ  
	//			или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ
	//			или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК
	//			или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУ   //АБС Коломиец 19255
	//            или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФОПриемник;  //АБС Коломиец 19806
	Результат = НЕ РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Отказ;
	// } Сторчевой А.Н. 7796764
КонецПроцедуры

//Процедура УсловиеСогласованиеДКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК;	
//	
//КонецПроцедуры

//Процедура ДействиеСогласованиеСотрудникомДКОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь; 	
//	ОткрытьРекласификацию();
//	
//КонецПроцедуры
                          
Процедура ДействиеСогласованиеСотрудникомДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	//АБС ВСТАВКА №19248 НАЧАЛО
	//Перенос между аналитиками или фактом согласуется только сотрудником КТТК
	ОрганизацияСогласования = ?(РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами
								,РекласификацияБюджета.ИсточникОрганизация,Справочники.Организации.НайтиПоНаименованию("КТТК"));   	
	//\\АБС ВСТАВКА №19248 КОНЕЦ
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ОрганизацияСогласования, РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами);   	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
	
КонецПроцедуры

//АБС Коломиец 19255+
//Процедура УсловиеНеобходимоУтверждениеПВППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	//ОрганизацияСогласование78 = Константы.абс_Согласование78БюджетаВключитьДля.Получить();
//	//Если ОрганизацияСогласование78 <> Справочники.Организации.ПустаяСсылка() 
//	//	И РекласификацияБюджета.ИсточникОрганизация <> ОрганизацияСогласование78 
//	//	И РекласификацияБюджета.ПриемникОрганизация <> ОрганизацияСогласование78 Тогда
//	//	Результат = Ложь;
//	//	Возврат;
//	//КонецЕсли;
//	//
//	//ПределСуммыУтверждения = абс_БизнесПроцессы.ПолучитьПределСуммыУтвержденияПоРоли(
//	//Перечисления.абсВидыБизнесПроцессовТТК.СогласованиеПланаБюджета, 
//	//Справочники.РолиИсполнителей.ПервыйВицеПрезидент);
//	//
//	//Если ((ЗначениеЗаполнено(РекласификацияБюджета.ИсточникСтатьяОборотов) И РекласификацияБюджета.ИсточникСтатьяОборотов.абс_Согласование78)
//	// ИЛИ (ЗначениеЗаполнено(РекласификацияБюджета.ПриемникСтатьяОборотов) И РекласификацияБюджета.ПриемникСтатьяОборотов.абс_Согласование78))	
//	//	И РекласификацияБюджета.Сумма >= ПределСуммыУтверждения  Тогда
//	//	
//	//	Результат = Истина;
//	//	
//	//Иначе
//	//	
//	//	Результат = Ложь;
//	//	
//	//КонецЕсли;
//	
//	//АБС Коломиец 19806
//	Если РекласификацияБюджета.ПриемникСтатьяОборотов.абс_СверхБюджет 
//	 ИЛИ РекласификацияБюджета.ИсточникСтатьяОборотов.абс_СверхБюджет Тогда
//	 
//	     Результат = Истина;

//	 Иначе
//		 
//		 Результат = Ложь;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ДействиеУтверждениеПВПОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь; 	
//	ОткрытьРекласификацию();

//КонецПроцедуры

//Процедура ДействиеУтверждениеПВППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//	
//	ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");	
//	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ОрганизацияКТТК);   	
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
//	
//КонецПроцедуры

//Процедура УсловиеСогласованПВППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Проведен
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль;	

//КонецПроцедуры

//Процедура ДействиеСогласованиеРуководителемЦФУОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь; 	
//	ОткрытьРекласификацию();

//КонецПроцедуры

//Процедура ДействиеСогласованиеРуководителемЦФУПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//	
//	МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
//		абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(РекласификацияБюджета.ИсточникЦФУ, , РекласификацияБюджета.ИсточникОрганизация));
//	
//	Если МассивИсполнителей.Количество() = 0 Тогда
//		
//		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных для ЦФУ: " + РекласификацияБюджета.ИсточникЦФУ + ".", Отказ);
//		Возврат;
//	КонецЕсли;
//	
//	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямРекласификация(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей);
//	
//	// Добавим задачи для суперпользователей
//	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
//	
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);	
//	
//	
//КонецПроцедуры

//Процедура УсловиеСогласованЦФУПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ  
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУПриемник;  //АБС Коломиец 19806

//КонецПроцедуры

//Процедура УсловиеНеобходимоСогласованиеЦФУПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	ОрганизацияСогласование78 = Константы.абс_Согласование78БюджетаВключитьДля.Получить();
//	//Сторчевой А.Н. 05.12.2016 7759851 {
//	ttk_ЕдиноеЦФУ = ПараметрыСеанса.ttk_ЕдиноеЦФУ;
//	ПерехНаЕдиноеЦФУ = (РекласификацияБюджета.Дата >= '20170101' и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
//	// } Сторчевой А.Н. 05.12.2016 7759851
//	Если ОрганизацияСогласование78 <> Справочники.Организации.ПустаяСсылка()
//		И НЕ ПерехНаЕдиноеЦФУ //Сторчевой А.Н. 05.12.2016 7759851
//		И РекласификацияБюджета.ИсточникОрганизация <> ОрганизацияСогласование78 
//		И РекласификацияБюджета.ПриемникОрганизация <> ОрганизацияСогласование78 Тогда
//		Результат = Ложь;
//		Возврат;
//	КонецЕсли;
//	
//	Если (ЗначениеЗаполнено(РекласификацияБюджета.ИсточникСтатьяОборотов) И РекласификацияБюджета.ИсточникСтатьяОборотов.абс_Согласование78)
//		И НЕ ПерехНаЕдиноеЦФУ //Сторчевой А.Н. 27.12.2016 7764190 
//	 ИЛИ (ЗначениеЗаполнено(РекласификацияБюджета.ПриемникСтатьяОборотов) И РекласификацияБюджета.ПриемникСтатьяОборотов.абс_Согласование78)
// 		И НЕ ПерехНаЕдиноеЦФУ //Сторчевой А.Н. 27.12.2016 7764190 
//	 Тогда		
//		Результат = Истина;		
//	Иначе		
//		Результат = Ложь;		
//	КонецЕсли;

//	//Результат = Истина;    //АБС Коломиец 19806
//	
//КонецПроцедуры
//АБС Коломиец 19255-

//АБС Коломиец 19806+
Процедура УсловиеНеобходимоСогласованиеРуководителемЦФОИстичникаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//Сторчевой оставить	
	Результат = НЕ (РекласификацияБюджета.ИсточникЦФО = РекласификацияБюджета.ПриемникЦФО)
	//Сторчевой А.Н. 7796764 {
	ИЛИ НЕ (РекласификацияБюджета.ИсточникОрганизация = РекласификацияБюджета.ПриемникОрганизация); 
	// } Сторчевой А.Н. 7796764
КонецПроцедуры

Процедура ДействиеСогласованиеРуководителемЦФОПриемникаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//Сторчевой оставить	
	СтандартнаяОбработка = Ложь;  	
	ОткрытьРекласификацию();
	
КонецПроцедуры

Процедура ДействиеСогласованиеРуководителемЦФОПриемникаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) //Сторчевой оставить
//Сторчевой оставить
	ПриемникОрганизация = ?(ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абсРекласификацияБюджета.ТочкиМаршрута.ДействиеСогласованиеРуководителемЦФОПриемника
							, ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК ,РекласификацияБюджета.ПриемникОрганизация);
	МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
	абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(РекласификацияБюджета.ПриемникЦФО, , ПриемникОрганизация));
	
	Если МассивИсполнителей.Количество() = 0 Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных для ЦФО: " + РекласификацияБюджета.ПриемникЦФО + ".", Отказ);
		Возврат;
	КонецЕсли;
	
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямРекласификация(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей, ПриемникОрганизация);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);	
	
КонецПроцедуры

//Процедура УсловиеСогласованЦФОПриеминкаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ  
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУ;   //АБС Коломиец 19255
//				
//КонецПроцедуры

//Процедура УсловиеНеобходимоСогласованиеЦФУПриемникаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = НЕ (РекласификацияБюджета.ИсточникЦФУ = РекласификацияБюджета.ПриемникЦФУ); 
//	
//КонецПроцедуры

//Процедура Действие1ОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;  	
//	ОткрытьРекласификацию();	

//КонецПроцедуры

Процедура ДействиеСогласованиеРуководителемЦФУПриемникаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
		абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(РекласификацияБюджета.ПриемникЦФУ, , РекласификацияБюджета.ПриемникОрганизация));
	
	Если МассивИсполнителей.Количество() = 0 Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных для ЦФУ: " + РекласификацияБюджета.ПриемникЦФУ + ".", Отказ);
		Возврат;
	КонецЕсли;
	
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямРекласификация(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);	
	
КонецПроцедуры

//Процедура УсловиеСогласованЦФУПриемникаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ  
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК;  //АБС Коломиец 19806

//КонецПроцедуры
                    
//Процедура БюджетныйКонтрольПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль;
//	
//КонецПроцедуры
           
//Процедура БюджетныйКонтрольОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;  	
//	ОткрытьРекласификацию();

//КонецПроцедуры
         
//Процедура БюджетныйКонтрольПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//	
//	ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
//	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ОрганизацияКТТК);   	
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
//	
//КонецПроцедуры
            
Процедура УсловиеОдобренияПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//Сторчевой оставить	
	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Проведен;
	
КонецПроцедуры
          
//Процедура УсловиеСогласованиеБКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = не РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами
//				и (РекласификацияБюджета.ИсточникСтатьяОборотов.абс_БюджетныйКонтроль или РекласификацияБюджета.ПриемникСтатьяОборотов.абс_БюджетныйКонтроль);
//	
//КонецПроцедуры  

//Процедура СогласованиеБКОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;	
//	ОткрытьРекласификацию();

//КонецПроцедуры
             
//Процедура СогласованиеБКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//	
//	МассивИсполнителей = абс_БизнесПроцессы.НайтиОтветственныхЗаСогласованиеБК(РекласификацияБюджета);
//	
//	Если МассивИсполнителей.Количество() = 0 Тогда    		
//		Сообщить("Не найдено ответственных по согласованию БК: " + ?(РекласификацияБюджета.ИсточникСтатьяОборотов.абс_БюджетныйКонтроль,РекласификацияБюджета.ИсточникСтатьяОборотов,РекласификацияБюджета.ПриемникСтатьяОборотов), СтатусСообщения.Важное);
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;
//	
//	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямРекласификация(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей);
//	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
//	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);
//	
//КонецПроцедуры   

//Процедура СогласовалиБКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//	
//	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ  
//				или РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ;	
//	
//КонецПроцедуры

//Сторчевой А.Н. 7796764 {
Процедура ПремникКТТКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = РекласификацияБюджета.ПриемникОрганизация = ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК;
	
КонецПроцедуры

Процедура СогласованиеЭкономистомМКРПриемникаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//Сторчевой оставить
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, РекласификацияБюджета.ПриемникОрганизация, РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами);   	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);

КонецПроцедуры

Процедура УсловиеСменаРегионаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = НЕ (РекласификацияБюджета.ИсточникОрганизация = РекласификацияБюджета.ПриемникОрганизация); 
КонецПроцедуры

Процедура УсловиеНеобходимоСогласованиеРуководителемЦФОПриемникаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//Сторчевой оставить	
	Результат = НЕ (РекласификацияБюджета.ИсточникОрганизация = РекласификацияБюджета.ПриемникОрганизация); 
	
КонецПроцедуры

Процедура ИсточникКТТКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//Сторчевой оставить	
	Результат = РекласификацияБюджета.ИсточникОрганизация = ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК;
	
КонецПроцедуры

Процедура УсловиеПоПериодамИНеКТТКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//Сторчевой оставить	
	Результат = (НЕ РекласификацияБюджета.ИсточникОрганизация = ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК
				и РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами);
	
КонецПроцедуры

Процедура ДействиеСогласованиеРуководителемЦФОИсточникаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//Сторчевой оставить
	ИсточникОрганизация = ?(ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абсРекласификацияБюджета.ТочкиМаршрута.ДействиеСогласованиеРуководителемЦФОИсточника
							, ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК ,РекласификацияБюджета.ИсточникОрганизация);

	МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
	абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(РекласификацияБюджета.ИсточникЦФО, , ИсточникОрганизация));
	
	Если МассивИсполнителей.Количество() = 0 Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных для ЦФО: " + РекласификацияБюджета.ИсточникЦФО + ".", Отказ);
		Возврат;
	КонецЕсли;
	
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямРекласификация(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей, ИсточникОрганизация);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, РекласификацияБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);	
	
КонецПроцедуры

Процедура СогласованиеЭкономистомМКРИсточникаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//Сторчевой оставить
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, РекласификацияБюджета.ИсточникОрганизация, РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами);   	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);

КонецПроцедуры

Процедура СогласованиеЭкономистомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
//Сторчевой оставить
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК, РекласификацияБюджета.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами);   	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, РекласификацияБюджета.Статус);

КонецПроцедуры

Процедура УсловиеСогласованиеРуководителяЭкономистаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//Сторчевой оставить	
	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеБК;
	
КонецПроцедуры

Процедура УсловиеРуководителяКТТКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
//Сторчевой оставить	
	Результат = РекласификацияБюджета.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеПВП;

КонецПроцедуры



// } Сторчевой А.Н. 7796764	