
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СвободныеОстатки.Записывать=Истина;
	Движения.СвободныеОстатки.Записать();
	
	Движения.ТоварыВРезервеНаСкладах.Записывать=Истина;
	Движения.ТоварыВРезервеНаСкладах.Очистить();

	Если ВидОперации=Перечисления.ttk_ФормированиеРезерваВидОперации.УстановкаРезерва Тогда
	
			Запрос = новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ФормированиеРезерваТовары.Номенклатура,
			               |	ФормированиеРезерваТовары.Характеристика,
			               |	ФормированиеРезерваТовары.СерияНоменклатуры,
			               |	ФормированиеРезерваТовары.Ссылка.Склад КАК Склад,
			               |	СУММА(ФормированиеРезерваТовары.Количество) КАК Количество
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	Документ.ttk_ФормированиеРезерва.Номенклатура КАК ФормированиеРезерваТовары
			               |ГДЕ
			               |	ФормированиеРезерваТовары.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ФормированиеРезерваТовары.Номенклатура,
			               |	ФормированиеРезерваТовары.Характеристика,
			               |	ФормированиеРезерваТовары.СерияНоменклатуры,
			               |	ФормированиеРезерваТовары.Ссылка.Склад
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ.Номенклатура,
			               |	ВТ.Склад,
			               |	СУММА(ВТ.Количество) КАК Количество,
			               |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
			               |	ВТ.Характеристика,
			               |	ВТ.СерияНоменклатуры
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
			               |				&МоментВремени,
			               |				Склад В
			               |						(ВЫБРАТЬ
			               |							ВТ.Склад
			               |						ИЗ
			               |							ВТ)
			               |					И Номенклатура В
			               |						(ВЫБРАТЬ
			               |							ВТ.Номенклатура
			               |						ИЗ
			               |							ВТ)) КАК СвободныеОстаткиОстатки
			               |		ПО ВТ.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
			               |			И ВТ.Склад = СвободныеОстаткиОстатки.Склад
			               |			И ВТ.Характеристика = СвободныеОстаткиОстатки.ХарактеристикаНоменклатуры
			               |			И ВТ.СерияНоменклатуры = СвободныеОстаткиОстатки.СерияНоменклатуры
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ.Номенклатура,
			               |	ВТ.Склад,
			               |	ВТ.Характеристика,
			               |	ВТ.СерияНоменклатуры
			               |
			               |ДЛЯ ИЗМЕНЕНИЯ
			               |	РегистрНакопления.СвободныеОстатки.Остатки";
						   
						   
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("МоментВремени", 	Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая)); 

			
			Выборка = Запрос.Выполнить().Выбрать();	
			
			

			Пока Выборка.Следующий()  Цикл
				
				Если ВЫборка.КоличествоОстаток < Выборка.Количество   Тогда
					
					Сообщить(" Не хватает " + Выборка.Номенклатура.НаименованиеПолное + " на складе " + Выборка.Склад.Наименование + " количество для списания = "+Выборка.Количество + ", количество в свободном остатке = "+ Выборка.КоличествоОстаток);
					
					Отказ = Истина;
					
					Продолжить;
					
				КонецЕсли;	

			КонецЦикла;



					
			Для Каждого ТекСтрокаТовары Из Номенклатура Цикл
				
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Приход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
				
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
						
				ДвижениеТОварыВРезерве.ДокументРезерва 				= Заказ;		


			КонецЦикла;
			
			
			
	ИначеЕсли ВидОперации=Перечисления.ttk_ФормированиеРезерваВидОперации.СнятиеРезерва Тогда		
		
		
		Запрос = новый Запрос;
			
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры,
		               |	ФормированиеРезерваТовары.Ссылка.Склад КАК Склад,
		               |	СУММА(ФормированиеРезерваТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.ttk_ФормированиеРезерва.Номенклатура КАК ФормированиеРезерваТовары
		               |ГДЕ
		               |	ФормированиеРезерваТовары.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Ссылка.Склад,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	СУММА(ВТ.Количество) КАК Количество,
		               |	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)) КАК КоличествоОстаток,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
		               |				&МоментВремени,
		               |				Склад В
		               |						(ВЫБРАТЬ
		               |							ВТ.Склад
		               |						ИЗ
		               |							ВТ)
		               |					И Номенклатура В
		               |						(ВЫБРАТЬ
		               |							ВТ.Номенклатура
		               |						ИЗ
		               |							ВТ)) КАК ТоварыВРезервеНаСкладах
		               |		ПО ВТ.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
		               |			И ВТ.Склад = ТоварыВРезервеНаСкладах.Склад
		               |			И ВТ.Характеристика = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
		               |			И ВТ.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки";

						   
						   
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("МоментВремени", 	Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая)); 

			
			Выборка = Запрос.Выполнить().Выбрать();	
			
			

			Пока Выборка.Следующий()  Цикл
				
				Если ВЫборка.КоличествоОстаток < Выборка.Количество   Тогда
					
					Сообщить(" Не достаточно резерва  " + Выборка.Номенклатура.НаименованиеПолное + " на складе " + Выборка.Склад.Наименование + " количество для снятие резерва = "+Выборка.Количество + ", количество в резерве = "+ Выборка.КоличествоОстаток);
					
					Отказ = Истина;
					
					Продолжить;
					
				КонецЕсли;	

			КонецЦикла;



					
			Для Каждого ТекСтрокаТовары Из Номенклатура Цикл
				
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Расход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
				
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
						
				ДвижениеТОварыВРезерве.ДокументРезерва 				= Заказ;		

			КонецЦикла;
			
	ИначеЕсли ВидОперации=Перечисления.ttk_ФормированиеРезерваВидОперации.ПеремещениеРезерва Тогда
		
		
		
		Запрос = новый Запрос;
			
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры,
		               |	ФормированиеРезерваТовары.Ссылка.Склад КАК Склад,
		               |	СУММА(ФормированиеРезерваТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.ttk_ФормированиеРезерва.Номенклатура КАК ФормированиеРезерваТовары
		               |ГДЕ
		               |	ФормированиеРезерваТовары.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Ссылка.Склад,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	СУММА(ВТ.Количество) КАК Количество,
		               |	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)) КАК КоличествоОстаток,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
		               |				&МоментВремени,
		               |				Склад В
		               |						(ВЫБРАТЬ
		               |							ВТ.Склад
		               |						ИЗ
		               |							ВТ)
		               |					И Номенклатура В
		               |						(ВЫБРАТЬ
		               |							ВТ.Номенклатура
		               |						ИЗ
		               |							ВТ)
		               |					И ДокументРезерва = &ЗаказСписания) КАК ТоварыВРезервеНаСкладах
		               |		ПО ВТ.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
		               |			И ВТ.Склад = ТоварыВРезервеНаСкладах.Склад
		               |			И ВТ.Характеристика = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
		               |			И ВТ.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки";

						   
						   
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("МоментВремени", 	Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая)); 
			Запрос.УстановитьПараметр("ЗаказСписания", 	Заказ); 

			
			Выборка = Запрос.Выполнить().Выбрать();	
			
			

			Пока Выборка.Следующий()  Цикл
				
				Если ВЫборка.КоличествоОстаток < Выборка.Количество   Тогда
					
					Сообщить(" Не достаточно резерва по заказу:  "+Заказ.Номер+" от "+Заказ.Дата+" по номенклатуре " + Символы.ПС + Выборка.Номенклатура.НаименованиеПолное + " на складе " + Выборка.Склад.Наименование  +" количество для снятие резерва = "+Выборка.Количество + ", количество в резерве = "+ Выборка.КоличествоОстаток);
					
					Отказ = Истина;
					
					Продолжить;
					
				КонецЕсли;	

			КонецЦикла;
			
			Если не ЗначениеЗАполнено(ЗаказПриемник) Тогда
				
				Сообщить("Не указан заказ на перемещение! Проведение отменено!");
					
				Отказ = Истина;

				
			КонецЕсли;


			Для Каждого ТекСтрокаТовары Из Номенклатура Цикл
				
				
				// Спишем резерв с заказа источника 
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Расход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
							
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
						
				ДвижениеТОварыВРезерве.ДокументРезерва 				= Заказ;
				
				
				//Добавим резерв в заказ применик
				
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Приход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
				
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
				
				ДвижениеТОварыВРезерве.ДокументРезерва 				= ЗаказПриемник;

		
			КонецЦикла;

		
			
			
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		
		Заказ = ДанныеЗаполнения.Ссылка;
		
		Если ТипЗнч(ДанныеЗаполнения.СкладГруппа) = Тип("СправочникСсылка.Склады") Тогда

			 Склад = ДанныеЗаполнения.СкладГруппа ;
			
		КонецЕсли;
				
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ЭтотОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры


