
&НаКлиенте
Процедура КомандаОК(Команда)

	РезультатВыбора = Новый Структура;
	
	РезультатВыбора.Вставить("Год"				, Год);
	РезультатВыбора.Вставить("БюджетДоходов"	, БюджетДоходов);
	РезультатВыбора.Вставить("Организация"		, Организация);
	РезультатВыбора.Вставить("ЦФУ"				, ЦФУ);
	РезультатВыбора.Вставить("ЦФО"				, ЦФО);
	РезультатВыбора.Вставить("КапЗатраты"		, КапЗатраты);
	РезультатВыбора.Вставить("Сценарий"			, Сценарий);
	РезультатВыбора.Вставить("абс_Бюджет"		, Бюджет);
	
	ЭтаФорма.Закрыть(РезультатВыбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ЭтаФорма.Закрыть(Неопределено);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДоступныхАналитик()
	//Сторчевой А.Н. 05.12.2016 7759851 {
	//Сторчевой А.Н. 77225295 30.11.2017 {ПерехНаЕдиноеЦФУ = (Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	ПерехНаЕдиноеЦФУ = (Год = 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	// } Сторчевой А.Н. 77225295 30.11.2017

	Если ПерехНаЕдиноеЦФУ 
		//Сторчевой А.Н. 77225295 30.11.2017 {
		Или Год >= 2018 
			// } Сторчевой А.Н. 77225295 30.11.2017
		Тогда
		//Отключем отбор по Исполнителям и Группам пользователей
		
	Иначе 
		// } Сторчевой А.Н. 05.12.2016 7759851
		ЗапросГруппы = Новый Запрос(
		"ВЫБРАТЬ
		|	ГруппыПользователейПользователиГруппы.Ссылка
		|ИЗ
		|	Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователейПользователиГруппы
		|ГДЕ
		|	ГруппыПользователейПользователиГруппы.Пользователь = &Пользователь
		|	И (НЕ ГруппыПользователейПользователиГруппы.Ссылка.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГруппыПользователейПользователиГруппы.Ссылка");
		
		ЗапросГруппы.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		
		СписокГрупп = ЗапросГруппы.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
		//Сторчевой А.Н. 05.12.2016 7759851 {
	КонецЕсли; 
	// } Сторчевой А.Н. 05.12.2016 7759851
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ДоступностьБюджетныхАналитик.Организация,
	|	абс_ДоступностьБюджетныхАналитик.ЦФУ,
	|	абс_ДоступностьБюджетныхАналитик.ЦФО,
	|	абс_ДоступностьБюджетныхАналитик.БюджетнаяСтатья
	|ИЗ
	|	РегистрСведений.абс_ДоступностьБюджетныхАналитик КАК абс_ДоступностьБюджетныхАналитик
	|ГДЕ
	|	ВЫБОР
	|			КОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель ССЫЛКА Справочник.Пользователи
	|				ТОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель = &Исполнитель
	|			КОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель ССЫЛКА Справочник.ГруппыПользователей
	|				ТОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель В (&ГруппыПользователя)
	|		КОНЕЦ";
	//Сторчевой А.Н. 05.12.2016 7759851 {
	Если ПерехНаЕдиноеЦФУ 
		//Сторчевой А.Н. 77225295 30.11.2017 {
		Или Год >= 2018 
		// } Сторчевой А.Н. 77225295 30.11.2017
		Тогда
		//Отключем отбор по Исполнителям и Группам пользователей
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "
		|	ВЫБОР
		|			КОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель ССЫЛКА Справочник.Пользователи
		|				ТОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель = &Исполнитель
		|			КОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель ССЫЛКА Справочник.ГруппыПользователей
		|				ТОГДА абс_ДоступностьБюджетныхАналитик.Исполнитель В (&ГруппыПользователя)
		|		КОНЕЦ", "
		|	абс_ДоступностьБюджетныхАналитик.ЦФУ = &ЦФУ");
		Запрос.УстановитьПараметр("ЦФУ", ttk_ЕдиноеЦФУ);
		
	Иначе 
		// } Сторчевой А.Н. 05.12.2016 7759851
		
		Запрос.УстановитьПараметр("Исполнитель", глЗначениеПеременной("глТекущийПользователь"));
		Запрос.УстановитьПараметр("ГруппыПользователя", СписокГрупп);
		//Сторчевой А.Н. 05.12.2016 7759851 {
	КонецЕсли;
	
	// } Сторчевой А.Н. 05.12.2016 7759851
	
	ТЧДоступныхАналитик.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Сторчевой А.Н. 05.12.2016 7759851 {
	ttk_ЕдиноеЦФУ = ПараметрыСеанса.ttk_ЕдиноеЦФУ;
	// } Сторчевой А.Н. 05.12.2016 7759851
	ЗаполнитьТЧДоступныхАналитик();
	
	Год = Год(ТекущаяДата());
	
	ЗаполнитьСписокСценариевСервер(Элементы.Сценарий.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	//Сторчевой А.Н. 05.12.2016 7759851 {
	//Сторчевой А.Н. 77225295 30.11.2017 {ПерехНаЕдиноеЦФУ = (Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	ПерехНаЕдиноеЦФУ = (Год = 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	// } Сторчевой А.Н. 77225295 30.11.2017
	Если ПерехНаЕдиноеЦФУ Тогда
		Элементы.ЦФУ.Доступность = Ложь;
		Элементы.ЦФО.Доступность = Истина;
	Иначе
		// } Сторчевой А.Н. 05.12.2016 7759851	Элементы.ЦФУ.Доступность = ЗначениеЗаполнено(Организация);
		Элементы.ЦФО.Доступность = ЗначениеЗаполнено(ЦФУ);
		//Сторчевой А.Н. 05.12.2016 7759851 {
	КонецЕсли;
	// } Сторчевой А.Н. 05.12.2016 7759851
	Элементы.Сценарий.Доступность = ПроверитьВидБюджета(Бюджет);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВидБюджета (Бюджет)
	
	Возврат Бюджет = Перечисления.абс_Бюджет.абс_САРЕХ;
	
КонецФункции


&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	//Сторчевой А.Н. 05.12.2016 7759851 {
	//Сторчевой А.Н. 77225295 30.11.2017 {ПерехНаЕдиноеЦФУ = (Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	ПерехНаЕдиноеЦФУ = (Год = 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	// } Сторчевой А.Н. 77225295 30.11.2017
	Если НЕ ПерехНаЕдиноеЦФУ 
		//Сторчевой А.Н. 77225295 30.11.2017 {
		Или НЕ Год >= 2018 
		// } Сторчевой А.Н. 77225295 30.11.2017
		Тогда

		// } Сторчевой А.Н. 05.12.2016 7759851
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		
		//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
		
		Для Каждого СтрокаТЧДоступныхАналитик Из ТЧДоступныхАналитик Цикл
			
			Если ДанныеВыбора.НайтиПоЗначению(СтрокаТЧДоступныхАналитик.Организация) = Неопределено Тогда
				ДанныеВыбора.Добавить(СтрокаТЧДоступныхАналитик.Организация);
				
			КонецЕсли;
		КонецЦикла;
		
		//ОткрытьФормуМодально("Справочник.Организация.Форма.ФормаВыбораУправляемая", СтруктураПараметров, ЭтаФорма);
		
		//Сторчевой А.Н. 05.12.2016 7759851 {
	КонецЕсли;
	// } Сторчевой А.Н. 05.12.2016 7759851

КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	//Сторчевой А.Н. 05.12.2016 7759851 {
	//Сторчевой А.Н. 77225295 30.11.2017 {ПерехНаЕдиноеЦФУ = (Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	ПерехНаЕдиноеЦФУ = (Год = 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	// } Сторчевой А.Н. 77225295 30.11.2017
	Если ПерехНаЕдиноеЦФУ Тогда
		ЦФУ = ttk_ЕдиноеЦФУ;
	КонецЕсли;
	// } Сторчевой А.Н. 05.12.2016 7759851
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ЦФУПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура КапЗатратыПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ЦФУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.абс_ЦФУ.ПустаяСсылка"));
	
	Для Каждого СтрокаТЧДоступныхАналитик Из ТЧДоступныхАналитик Цикл
		
		Если НЕ Организация = СтрокаТЧДоступныхАналитик.Организация Тогда
			Продолжить;
		Конецесли;
		
		Если ДанныеВыбора.НайтиПоЗначению(СтрокаТЧДоступныхАналитик.ЦФУ) = Неопределено Тогда
			ДанныеВыбора.Добавить(СтрокаТЧДоступныхАналитик.ЦФУ);
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ЦФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДанныеВыбораСписок = Новый СписокЗначений;
	
	//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка"));
	
	//Сторчевой А.Н. 05.12.2016 7759851 {
	//Сторчевой А.Н. 77225295 30.11.2017 {ПерехНаЕдиноеЦФУ = (Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	ПерехНаЕдиноеЦФУ = (Год = 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	// } Сторчевой А.Н. 77225295 30.11.2017
	// } Сторчевой А.Н. 05.12.2016 7759851
	
	Для Каждого СтрокаТЧДоступныхАналитик Из ТЧДоступныхАналитик Цикл
		//Сторчевой А.Н. 05.12.2016 7759851 {
		//ПерехНаЕдиноеЦФУ = (Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
		Если НЕ ПерехНаЕдиноеЦФУ 
			//Сторчевой А.Н. 77225295 30.11.2017 {
			ИЛИ НЕ Год >= 2018 
			// } Сторчевой А.Н. 77225295 30.11.2017
			Тогда
			// } Сторчевой А.Н. 05.12.2016 7759851
			Если НЕ Организация = СтрокаТЧДоступныхАналитик.Организация Тогда
				Продолжить;
			Конецесли;
			//Сторчевой А.Н. 05.12.2016 7759851 {
		КонецЕсли;
		// } Сторчевой А.Н. 05.12.2016 7759851
		Если НЕ ЦФУ = СтрокаТЧДоступныхАналитик.ЦФУ Тогда
			Продолжить;
		Конецесли;		
		
		Если ДанныеВыбораСписок.НайтиПоЗначению(СтрокаТЧДоступныхАналитик.ЦФО) = Неопределено Тогда
			ДанныеВыбораСписок.Добавить(СтрокаТЧДоступныхАналитик.ЦФО);
			
		КонецЕсли;
	КонецЦикла;
	ПараметрыВыбораЦФО = Новый Структура();
	
	ПараметрыВыбораЦФО.Вставить("СписокЭлементов", ДанныеВыбораСписок);
	
	ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.Подразделения.Форма.ФормаВыбораУправляемая", ПараметрыВыбораЦФО, ЭтаФорма);
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЦФО = ВыбранныйЭлемент;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСценариев()
		
	ЗаполнитьСписокСценариевСервер(Элементы.Сценарий.СписокВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСценариевСервер(СписокСценариев)

	СписокСценариев.Очистить();
	
	СписокСценариев.Добавить(Справочники.СценарииПланирования.НайтиПоНаименованию("КВ по вводу"));
	СписокСценариев.Добавить(Справочники.СценарииПланирования.НайтиПоНаименованию("КВ по оплате (задолженность)"));
	СписокСценариев.Добавить(Справочники.СценарииПланирования.НайтиПоНаименованию("КВ по поставке"));	

КонецПроцедуры

&НаКлиенте
Процедура БюджетПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	//Сторчевой А.Н. 05.12.2016 7759851 {
	//Сторчевой А.Н. 77225295 30.11.2017 {ПерехНаЕдиноеЦФУ = (Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	ПерехНаЕдиноеЦФУ = (Год = 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	// } Сторчевой А.Н. 77225295 30.11.2017
	Если ПерехНаЕдиноеЦФУ Тогда
		ЗаполнитьТЧДоступныхАналитик();
		Организация = Неопределено;
		ЦФО = Неопределено;
		ЦФУ = Неопределено;
		абс_Бюджет = Неопределено;
		Сценарий = Неопределено;   
		Элементы.ЦФО.Доступность = Ложь;
		Элементы.ЦФУ.Доступность = Ложь;
	Иначе
		Элементы.ЦФУ.Доступность = Истина;
	КонецЕсли;
	// } Сторчевой А.Н. 05.12.2016 7759851
КонецПроцедуры
