Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

Процедура ДобавитьДвижение(ЗаполнитьДатуСобытия = истина) Экспорт
	
	//мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");
	
	Если мТаблицаДвижений.Колонки.Найти("ДатаСобытия") = Неопределено Тогда
		мТаблицаДвижений.Колонки.Добавить("ДатаСобытия");
		ЗаполнитьДатуСобытия = истина;
	КонецЕсли; 
	
	Если ЗаполнитьДатуСобытия Тогда
		мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "ДатаСобытия");
	КонецЕсли; 
	
	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);
	
КонецПроцедуры // ДобавитьДвижение()

Процедура ПередЗаписью(Отказ, Замещение)
	
	//АБС ВСТАВКА №44969 НАЧАЛО «2 июля 2014 г.», Пополитов
	Для Каждого Движение Из ЭтотОбъект Цикл
// +++ввв 01.03.2016 г.
		Если Движение.КодВидаОперации="" И ЗначениеЗаполнено(Движение.Регистратор) Тогда
			Если ТипЗнч(Движение.Регистратор.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Движение.КодВидаОперации="01";
			   	йЮЛ=Константы.ttk_АгрегатноеЮридическоеЛицо.Получить();
				Если ЗначениеЗаполнено(йЮЛ) Тогда
					Если йЮЛ=Движение.Регистратор.Контрагент Тогда
						//Движение.КодВидаОперации="26";
					КонецЕсли;
				КонецЕсли;
				йФЛ=Константы.ttk_АгрегатноеФизическоеЛицо.Получить();
				Если ЗначениеЗаполнено(йФЛ) Тогда
					Если йФЛ=Движение.Регистратор.Контрагент Тогда
						Движение.КодВидаОперации="26";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
// ---ввв 01.03.2016 г.
		Если Движение.ВидЦенности = Перечисления.ВидыЦенностей.АвансыПолученные Тогда
			Движение.абс_СчетУчета = kwr_ОбщиеСерверКлиентПовтИсп.ПланыСчетовХозрасчетныйНайтиПоКоду("76.АВ");	
		ИначеЕсли Движение.ВидЦенности = Перечисления.ВидыЦенностей.АвансыВыданные Тогда
			Движение.абс_СчетУчета = kwr_ОбщиеСерверКлиентПовтИсп.ПланыСчетовХозрасчетныйНайтиПоКоду("76.ВА");	
		КонецЕсли;	 				
	КонецЦикла;	
	//\\АБС ВСТАВКА №44969 КОНЕЦ 
	
КонецПроцедуры
