// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(МассивОбъектов,ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	Для Инд = 0 По МассивОбъектов.Количество() - 1 Цикл
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "" Тогда
			
		ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
			ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(МассивОбъектов[Инд].Ссылка, ИмяМакета);
			Если ТабДокумент = Неопределено Тогда
				Возврат
			КонецЕсли; 
		КонецЕсли;
		
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(МассивОбъектов[Инд]), МассивОбъектов[Инд].Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура();
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Функция ПолучитьТаблицуОплат(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_СчетНаОплату.Ссылка КАК СчетНаОплату,
	|	абс_СчетНаОплату.СтатусСчета КАК Статус,
	|	абс_СчетНаОплату.Валюта КАК ВалютаПлатежа,
	|	абс_СчетНаОплату.СуммаПлатежа,
	|	абс_СчетНаОплату.ДатаПлатежа,
	|	абс_СчетНаОплату.ДоговорКонтрагента КАК Договор
	|ИЗ
	|	Документ.абс_СчетНаОплату КАК абс_СчетНаОплату
	|ГДЕ
	|	абс_СчетНаОплату.ЗакупочныйЗаказ = &ЗакупочныйЗаказ";
	Запрос.УстановитьПараметр("ЗакупочныйЗаказ",Ссылка);
	ТабличноеПолеОплат = Запрос.Выполнить().Выгрузить();
	Возврат ТабличноеПолеОплат
КонецФункции  

Функция ПолучитьТаблицуОплатТТК(Ссылка) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	абс_Оплата.Ссылка КАК Оплата,
	                      |	абс_Оплата.СтатусОплаты КАК СтатусОплаты,
	                      |	абс_СчетНаОплатуОплаты.Ссылка КАК СчетНаОплату,
	                      |	абс_СчетНаОплатуОплаты.Ссылка.СтатусСчета КАК СтатусСчета,
	                      |	абс_ПлатежСоставПлатежей.Ссылка КАК Платеж,
	                      |	абс_Оплата.СуммаПлатежа КАК СуммаПлатежа
	                      |ИЗ
	                      |	Документ.абс_Оплата КАК абс_Оплата
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_СчетНаОплату.Оплаты КАК абс_СчетНаОплатуОплаты
	                      |		ПО (абс_СчетНаОплатуОплаты.Оплата = абс_Оплата.Ссылка)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	                      |		ПО (абс_ПлатежСоставПлатежей.Оплата = абс_Оплата.Ссылка)
	                      |ГДЕ
	                      |	абс_Оплата.ЗакупочныйЗаказ В(&ЗакупочныйЗаказ)
	                      |	И абс_Оплата.ПометкаУдаления = ЛОЖЬ");
						  
	Запрос.УстановитьПараметр("ЗакупочныйЗаказ", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
КонецФункции

Функция ПолучитьТаблицуПоставок(Ссылка) Экспорт
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ПриходныйОрдерНаТовары.Ссылка КАК ПриходныйОрдер
	//|ИЗ
	//|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	//|ГДЕ
	//|	ПриходныйОрдерНаТовары.ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	//|	И (НЕ ПриходныйОрдерНаТовары.ПометкаУдаления)";
	//Запрос.УстановитьПараметр("ЗакупочныйЗаказ",Ссылка);
	//МассивОрдеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПриходныйОрдер");
	//Запрос.УстановитьПараметр("МассивОрдеров",МассивОрдеров);
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			   |	ПоступлениеТоваровУслуг.Ссылка КАК ПоступлениеТоваровИУслуг,
	//			   |	ПоступлениеТоваровУслуг.СкладОрдер,
	//			   |	ПоступлениеТоваровУслуг.Дата КАК Дата,
	//			   |	0 КАК Сумма,
	//			   |	0 КАК Количество,
	//			   |	ПоступлениеТоваровУслуг.НомерВходящегоДокумента,
	//			   |	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента
	//			   |ИЗ
	//			   |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	//			   |ГДЕ
	//			   |	(НЕ ПоступлениеТоваровУслуг.ПометкаУдаления)
	//			   |	И ПоступлениеТоваровУслуг.СкладОрдер В(&МассивОрдеров)
	//			   |
	//			   |ОБЪЕДИНИТЬ ВСЕ
	//			   |
	//			   |ВЫБРАТЬ
	//			   |	ПоступлениеТоваровУслуг.Ссылка,
	//			   |	ПоступлениеТоваровУслуг.СкладОрдер,
	//			   |	ПоступлениеТоваровУслуг.Дата,
	//			   |	0,
	//			   |	0,
	//			   |	ПоступлениеТоваровУслуг.НомерВходящегоДокумента,
	//			   |	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента
	//			   |ИЗ
	//			   |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	//			   |ГДЕ
	//			   |	(НЕ ПоступлениеТоваровУслуг.ПометкаУдаления)
	//			   |	И (НЕ ПоступлениеТоваровУслуг.СкладОрдер В (&МассивОрдеров))
	//			   |	И ПоступлениеТоваровУслуг.ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Дата";
	//ТабличноеПолеПоставок = Запрос.Выполнить().Выгрузить();
	//Для Каждого Инд из ТабличноеПолеПоставок Цикл
	//	Инд.Сумма = ОбщегоНазначения.ФорматСумм(УчетНДС.ПолучитьСуммуДокументаСНДС(Инд.ПоступлениеТоваровИУслуг));
	//	Инд.Количество = Инд.ПоступлениеТоваровИУслуг.Товары.Итог("Количество");
	//КонецЦикла;
	//Возврат ТабличноеПолеПоставок;
КонецФункции

//***** АБС Гетц. 30.01.2013 38257 // 20.02.2014 - изменен текст запроса
Функция ПолучитьТаблицуПоставокПоЗакупочномуЗаказу(ЗЗ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = // АБС ВСТАВКА Гетц 14.03.14 - добавлена сортировка в запрос
	// АБС ИЗМЕНЕНО Нарыжный 19.03.14 39319 -сумма по ЗЗ берется из ТЧ Поступления
	// - это неактульный текст запроса, актуальный - ниже
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Ссылка.Проведен
	|			ТОГДА 0
	|		КОГДА ПоступлениеТоваровУслуг.Ссылка.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
	|	ПоступлениеТоваровУслуг.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Ссылка.УчитыватьНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента - ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС = 0
	|						ТОГДА 0
	|					ИНАЧЕ ПоступлениеТоваровУслуг.абс_СуммаБезНДС * (1 + ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС / (ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента - ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС))
	|				КОНЕЦ
	|		ИНАЧЕ ПоступлениеТоваровУслуг.абс_СуммаБезНДС
	|	КОНЕЦ КАК СуммаПоЗЗ,
	|	ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ПоступлениеТоваровУслуг.Ссылка.КурсВзаиморасчетов КАК Курс,
	|	ПоступлениеТоваровУслуг.Ссылка.КратностьВзаиморасчетов КАК Кратность,
	|	ПоступлениеТоваровУслуг.Ссылка.НомерВходящегоДокумента КАК ВхНомер,
	|	ПоступлениеТоваровУслуг.Ссылка.ДатаВходящегоДокумента КАК ВхДата,
	|	ПоступлениеТоваровУслуг.Ссылка.Контрагент,
	|	ПоступлениеТоваровУслуг.Ссылка.ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.Ссылка.Ответственный,
	|	ПоступлениеТоваровУслуг.Ссылка.ОтражатьВУправленческомУчете КАК УУ,
	|	ПоступлениеТоваровУслуг.Ссылка.ОтражатьВБухгалтерскомУчете КАК БУ,
	|	ПоступлениеТоваровУслуг.Ссылка.ОтражатьВНалоговомУчете КАК НУ,
	|	ПоступлениеТоваровУслуг.Ссылка.абс_Статус КАК Статус,
	|	ПоступлениеТоваровУслуг.Ссылка.Организация
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ИндексКартинки,
	|	ВложенныйЗапрос.Ссылка,
	|	ВложенныйЗапрос.СсылкаВалютаДокумента,
	|	ВложенныйЗапрос.СуммаПоЗЗ,
	|	ВложенныйЗапрос.СсылкаСуммаДокумента,
	|	ВложенныйЗапрос.СсылкаКурсВзаиморасчетов,
	|	ВложенныйЗапрос.СсылкаКратностьВзаиморасчетов,
	|	ВложенныйЗапрос.СсылкаНомерВходящегоДокумента,
	|	ВложенныйЗапрос.СсылкаДатаВходящегоДокумента,
	|	ВложенныйЗапрос.СсылкаКонтрагент,
	|	ВложенныйЗапрос.СсылкаДоговорКонтрагента,
	|	ВложенныйЗапрос.СсылкаОтветственный,
	|	ВложенныйЗапрос.СсылкаОтражатьВУправленческомУчете,
	|	ВложенныйЗапрос.СсылкаОтражатьВБухгалтерскомУчете,
	|	ВложенныйЗапрос.СсылкаОтражатьВНалоговомУчете,
	|	ВложенныйЗапрос.Ссылкаабс_Статус,
	|	ВложенныйЗапрос.СсылкаОрганизация
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ПоступлениеТоваровУслуг.Ссылка.Проведен
	|				ТОГДА 0
	|			КОГДА ПоступлениеТоваровУслуг.Ссылка.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК ИндексКартинки,
	|		ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|		ПоступлениеТоваровУслуг.Ссылка.ВалютаДокумента КАК СсылкаВалютаДокумента,
	|		ВЫБОР
	|			КОГДА ПоступлениеТоваровУслуг.Ссылка.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента - ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента
	|		КОНЕЦ КАК СуммаПоЗЗ,
	|		ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента КАК СсылкаСуммаДокумента,
	|		ПоступлениеТоваровУслуг.Ссылка.КурсВзаиморасчетов КАК СсылкаКурсВзаиморасчетов,
	|		ПоступлениеТоваровУслуг.Ссылка.КратностьВзаиморасчетов КАК СсылкаКратностьВзаиморасчетов,
	|		ПоступлениеТоваровУслуг.Ссылка.НомерВходящегоДокумента КАК СсылкаНомерВходящегоДокумента,
	|		ПоступлениеТоваровУслуг.Ссылка.ДатаВходящегоДокумента КАК СсылкаДатаВходящегоДокумента,
	|		ПоступлениеТоваровУслуг.Ссылка.Контрагент КАК СсылкаКонтрагент,
	|		ПоступлениеТоваровУслуг.Ссылка.ДоговорКонтрагента КАК СсылкаДоговорКонтрагента,
	|		ПоступлениеТоваровУслуг.Ссылка.Ответственный КАК СсылкаОтветственный,
	|		ПоступлениеТоваровУслуг.Ссылка.ОтражатьВУправленческомУчете КАК СсылкаОтражатьВУправленческомУчете,
	|		ПоступлениеТоваровУслуг.Ссылка.ОтражатьВБухгалтерскомУчете КАК СсылкаОтражатьВБухгалтерскомУчете,
	|		ПоступлениеТоваровУслуг.Ссылка.ОтражатьВНалоговомУчете КАК СсылкаОтражатьВНалоговомУчете,
	|		ПоступлениеТоваровУслуг.Ссылка.абс_Статус КАК Ссылкаабс_Статус,
	|		ПоступлениеТоваровУслуг.Ссылка.Организация КАК СсылкаОрганизация,
	|		ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы
	|			ПО (ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = ПоступлениеТоваровУслуг.Ссылка)
	|				И (ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = ПоступлениеТоваровУслуг.Ссылка)
	|	ГДЕ
	|		ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|		И ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.НомерСтроки ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.Проведен
	|			ТОГДА 0
	|		КОГДА АвансовыйОтчет.Ссылка.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	АвансовыйОтчет.Ссылка,
	|	АвансовыйОтчет.Ссылка.ВалютаДокумента,
	|	АвансовыйОтчет.Ссылка.абс_СуммаДокументаБезНДСБезНоменклатурыБезДвижений,
	|	АвансовыйОтчет.Ссылка.СуммаДокумента,
	|	АвансовыйОтчет.Ссылка.КурсДокумента,
	|	АвансовыйОтчет.Ссылка.КратностьДокумента,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	АвансовыйОтчет.Ссылка.Ответственный,
	|	АвансовыйОтчет.Ссылка.ОтражатьВУправленческомУчете,
	|	АвансовыйОтчет.Ссылка.ОтражатьВБухгалтерскомУчете,
	|	АвансовыйОтчет.Ссылка.ОтражатьВНалоговомУчете,
	|	АвансовыйОтчет.Ссылка.абс_Статус,
	|	АвансовыйОтчет.Ссылка.Организация
	|ИЗ
	|	Документ.АвансовыйОтчет.абс_ЗакупочныеЗаказы КАК АвансовыйОтчет
	|ГДЕ
	|	(АвансовыйОтчет.Ссылка.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|			ИЛИ АвансовыйОтчет.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПоступлениеДопРасходов.Проведен
	|			ТОГДА 0
	|		КОГДА ПоступлениеДопРасходов.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ПоступлениеДопРасходов.Ссылка,
	|	ПоступлениеДопРасходов.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ПоступлениеДопРасходов.СуммаВключаетНДС
	|			ТОГДА ПоступлениеДопРасходов.СуммаДокумента - ПоступлениеДопРасходов.СуммаНДС
	|		ИНАЧЕ ПоступлениеДопРасходов.СуммаДокумента
	|	КОНЕЦ,
	|	ПоступлениеДопРасходов.СуммаДокумента,
	|	ПоступлениеДопРасходов.КурсВзаиморасчетов,
	|	ПоступлениеДопРасходов.КратностьВзаиморасчетов,
	|	ПоступлениеДопРасходов.НомерВходящегоДокумента,
	|	ПоступлениеДопРасходов.ДатаВходящегоДокумента,
	|	ПоступлениеДопРасходов.Контрагент,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента,
	|	ПоступлениеДопРасходов.Ответственный,
	|	ПоступлениеДопРасходов.ОтражатьВУправленческомУчете,
	|	ПоступлениеДопРасходов.ОтражатьВБухгалтерскомУчете,
	|	ПоступлениеДопРасходов.ОтражатьВНалоговомУчете,
	|	NULL,
	|	ПоступлениеДопРасходов.Организация
	|ИЗ
	|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|ГДЕ
	|	ПоступлениеДопРасходов.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПоступлениеНМА.Проведен
	|			ТОГДА 0
	|		КОГДА ПоступлениеНМА.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ПоступлениеНМА.Ссылка,
	|	ПоступлениеНМА.ВалютаДокумента,
	|	ПоступлениеНМА.СуммаДокумента,
	|	ПоступлениеНМА.СуммаДокумента,
	|	ПоступлениеНМА.КурсВзаиморасчетов,
	|	ПоступлениеНМА.КратностьВзаиморасчетов,
	|	ПоступлениеНМА.НомерВходящегоДокумента,
	|	ПоступлениеНМА.ДатаВходящегоДокумента,
	|	ПоступлениеНМА.Контрагент,
	|	ПоступлениеНМА.ДоговорКонтрагента,
	|	ПоступлениеНМА.Ответственный,
	|	ЛОЖЬ,
	|	ПоступлениеНМА.ОтражатьВБухгалтерскомУчете,
	|	ПоступлениеНМА.ОтражатьВНалоговомУчете,
	|	NULL,
	|	ПоступлениеНМА.Организация
	|ИЗ
	|	Документ.ПоступлениеНМА КАК ПоступлениеНМА
	|ГДЕ
	|	ПоступлениеНМА.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст = 
	// актуальный текст запроса
	// АБС ВСТАВКА Нарыжный 02.04.14 40210 -сумма по ЗЗ берется из ТЧ документа поступления 
	// и из ТЧ авансового отчета и из шапки этих документов, если в ТЧ нет записей. 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Ссылка.Проведен
	|			ТОГДА 0
	|		КОГДА ПоступлениеТоваровУслуг.Ссылка.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
	|	ПоступлениеТоваровУслуг.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Ссылка.УчитыватьНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента - ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС = 0
	|						ТОГДА ПоступлениеТоваровУслуг.абс_СуммаБезНДС
	|					ИНАЧЕ ПоступлениеТоваровУслуг.абс_СуммаБезНДС * (1 + ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС / (ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента - ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС))
	|				КОНЕЦ
	|		ИНАЧЕ ПоступлениеТоваровУслуг.абс_СуммаБезНДС
	|	КОНЕЦ КАК СуммаПоЗЗ,
	|	ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ПоступлениеТоваровУслуг.Ссылка.КурсВзаиморасчетов КАК Курс,
	|	ПоступлениеТоваровУслуг.Ссылка.КратностьВзаиморасчетов КАК Кратность,
	|	ПоступлениеТоваровУслуг.Ссылка.НомерВходящегоДокумента КАК ВхНомер,
	|	ПоступлениеТоваровУслуг.Ссылка.ДатаВходящегоДокумента КАК ВхДата,
	|	ПоступлениеТоваровУслуг.Ссылка.Контрагент,
	|	ПоступлениеТоваровУслуг.Ссылка.ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.Ссылка.Ответственный,
	|	ПоступлениеТоваровУслуг.Ссылка.ОтражатьВУправленческомУчете КАК УУ,
	|	ПоступлениеТоваровУслуг.Ссылка.ОтражатьВБухгалтерскомУчете КАК БУ,
	|	ПоступлениеТоваровУслуг.Ссылка.ОтражатьВНалоговомУчете КАК НУ,
	|	ПоступлениеТоваровУслуг.Ссылка.абс_Статус КАК Статус,
	|	ПоступлениеТоваровУслуг.Ссылка.Организация
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапросШапкаПоступление.ИндексКартинки,
	|	ВложенныйЗапросШапкаПоступление.Ссылка,
	|	ВложенныйЗапросШапкаПоступление.СсылкаВалютаДокумента,
	|	ВложенныйЗапросШапкаПоступление.СуммаПоЗЗ,
	|	ВложенныйЗапросШапкаПоступление.СсылкаСуммаДокумента,
	|	ВложенныйЗапросШапкаПоступление.СсылкаКурсВзаиморасчетов,
	|	ВложенныйЗапросШапкаПоступление.СсылкаКратностьВзаиморасчетов,
	|	ВложенныйЗапросШапкаПоступление.СсылкаНомерВходящегоДокумента,
	|	ВложенныйЗапросШапкаПоступление.СсылкаДатаВходящегоДокумента,
	|	ВложенныйЗапросШапкаПоступление.СсылкаКонтрагент,
	|	ВложенныйЗапросШапкаПоступление.СсылкаДоговорКонтрагента,
	|	ВложенныйЗапросШапкаПоступление.СсылкаОтветственный,
	|	ВложенныйЗапросШапкаПоступление.СсылкаОтражатьВУправленческомУчете,
	|	ВложенныйЗапросШапкаПоступление.СсылкаОтражатьВБухгалтерскомУчете,
	|	ВложенныйЗапросШапкаПоступление.СсылкаОтражатьВНалоговомУчете,
	|	ВложенныйЗапросШапкаПоступление.Ссылкаабс_Статус,
	|	ВложенныйЗапросШапкаПоступление.СсылкаОрганизация
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ПоступлениеТоваровУслуг.Ссылка.Проведен
	|				ТОГДА 0
	|			КОГДА ПоступлениеТоваровУслуг.Ссылка.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК ИндексКартинки,
	|		ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|		ПоступлениеТоваровУслуг.Ссылка.ВалютаДокумента КАК СсылкаВалютаДокумента,
	|		ВЫБОР
	|			КОГДА ПоступлениеТоваровУслуг.Ссылка.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента - ПоступлениеТоваровУслуг.Ссылка.абс_СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента
	|		КОНЕЦ КАК СуммаПоЗЗ,
	|		ПоступлениеТоваровУслуг.Ссылка.СуммаДокумента КАК СсылкаСуммаДокумента,
	|		ПоступлениеТоваровУслуг.Ссылка.КурсВзаиморасчетов КАК СсылкаКурсВзаиморасчетов,
	|		ПоступлениеТоваровУслуг.Ссылка.КратностьВзаиморасчетов КАК СсылкаКратностьВзаиморасчетов,
	|		ПоступлениеТоваровУслуг.Ссылка.НомерВходящегоДокумента КАК СсылкаНомерВходящегоДокумента,
	|		ПоступлениеТоваровУслуг.Ссылка.ДатаВходящегоДокумента КАК СсылкаДатаВходящегоДокумента,
	|		ПоступлениеТоваровУслуг.Ссылка.Контрагент КАК СсылкаКонтрагент,
	|		ПоступлениеТоваровУслуг.Ссылка.ДоговорКонтрагента КАК СсылкаДоговорКонтрагента,
	|		ПоступлениеТоваровУслуг.Ссылка.Ответственный КАК СсылкаОтветственный,
	|		ПоступлениеТоваровУслуг.Ссылка.ОтражатьВУправленческомУчете КАК СсылкаОтражатьВУправленческомУчете,
	|		ПоступлениеТоваровУслуг.Ссылка.ОтражатьВБухгалтерскомУчете КАК СсылкаОтражатьВБухгалтерскомУчете,
	|		ПоступлениеТоваровУслуг.Ссылка.ОтражатьВНалоговомУчете КАК СсылкаОтражатьВНалоговомУчете,
	|		ПоступлениеТоваровУслуг.Ссылка.абс_Статус КАК Ссылкаабс_Статус,
	|		ПоступлениеТоваровУслуг.Ссылка.Организация КАК СсылкаОрганизация,
	|		ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.абс_ЗакупочныеЗаказы КАК ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы
	|			ПО (ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = ПоступлениеТоваровУслуг.Ссылка)
	|				И (ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.Ссылка = ПоступлениеТоваровУслуг.Ссылка)
	|	ГДЕ
	|		ПоступлениеТоваровУслуг.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|		И ПоступлениеТоваровУслугабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ) КАК ВложенныйЗапросШапкаПоступление
	|ГДЕ
	|	ВложенныйЗапросШапкаПоступление.НомерСтроки ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.Проведен
	|			ТОГДА 0
	|		КОГДА АвансовыйОтчет.Ссылка.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	АвансовыйОтчет.Ссылка,
	|	АвансовыйОтчет.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.УчитыватьНДС
	|			ТОГДА ВЫБОР
	|					КОГДА АвансовыйОтчет.Ссылка.абс_СуммаДокументаБезНДСБезНоменклатурыБезДвижений = 0
	|						ТОГДА АвансовыйОтчет.абс_СуммаБезНДС
	|					ИНАЧЕ АвансовыйОтчет.абс_СуммаБезНДС * (1 + (АвансовыйОтчет.Ссылка.абс_СуммаДокументаБезНоменклатурыБезДвижений - АвансовыйОтчет.Ссылка.абс_СуммаДокументаБезНДСБезНоменклатурыБезДвижений) / АвансовыйОтчет.Ссылка.абс_СуммаДокументаБезНДСБезНоменклатурыБезДвижений)
	|				КОНЕЦ
	|		ИНАЧЕ АвансовыйОтчет.абс_СуммаБезНДС
	|	КОНЕЦ,
	|	АвансовыйОтчет.Ссылка.СуммаДокумента,
	|	АвансовыйОтчет.Ссылка.КурсДокумента,
	|	АвансовыйОтчет.Ссылка.КратностьДокумента,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	АвансовыйОтчет.Ссылка.Ответственный,
	|	АвансовыйОтчет.Ссылка.ОтражатьВУправленческомУчете,
	|	АвансовыйОтчет.Ссылка.ОтражатьВБухгалтерскомУчете,
	|	АвансовыйОтчет.Ссылка.ОтражатьВНалоговомУчете,
	|	АвансовыйОтчет.Ссылка.абс_Статус,
	|	АвансовыйОтчет.Ссылка.Организация
	|ИЗ
	|	Документ.АвансовыйОтчет.абс_ЗакупочныеЗаказы КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапросШапкаАвансовыйОтчет.ИндексКартинки,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.Ссылка,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаВалютаДокумента,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СуммаПоЗЗ,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаСуммаДокумента,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаКурсВзаиморасчетов,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаКратностьВзаиморасчетов,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаНомерВходящегоДокумента,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаДатаВходящегоДокумента,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаКонтрагент,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаДоговорКонтрагента,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаОтветственный,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаОтражатьВУправленческомУчете,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаОтражатьВБухгалтерскомУчете,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаОтражатьВНалоговомУчете,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.Ссылкаабс_Статус,
	|	ВложенныйЗапросШапкаАвансовыйОтчет.СсылкаОрганизация
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА АвансовыйОтчет.Ссылка.Проведен
	|				ТОГДА 0
	|			КОГДА АвансовыйОтчет.Ссылка.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК ИндексКартинки,
	|		АвансовыйОтчет.Ссылка КАК Ссылка,
	|		АвансовыйОтчет.Ссылка.ВалютаДокумента КАК СсылкаВалютаДокумента,
	|		ВЫБОР
	|			КОГДА АвансовыйОтчет.Ссылка.СуммаВключаетНДС
	|				ТОГДА АвансовыйОтчет.Ссылка.абс_СуммаДокументаБезНДСБезНоменклатурыБезДвижений
	|			ИНАЧЕ АвансовыйОтчет.Ссылка.СуммаДокумента
	|		КОНЕЦ КАК СуммаПоЗЗ,
	|		АвансовыйОтчет.Ссылка.СуммаДокумента КАК СсылкаСуммаДокумента,
	|		АвансовыйОтчет.Ссылка.КурсДокумента КАК СсылкаКурсВзаиморасчетов,
	|		АвансовыйОтчет.Ссылка.КратностьДокумента КАК СсылкаКратностьВзаиморасчетов,
	|		NULL КАК СсылкаНомерВходящегоДокумента,
	|		NULL КАК СсылкаДатаВходящегоДокумента,
	|		NULL КАК СсылкаКонтрагент,
	|		NULL КАК СсылкаДоговорКонтрагента,
	|		АвансовыйОтчет.Ссылка.Ответственный КАК СсылкаОтветственный,
	|		АвансовыйОтчет.Ссылка.ОтражатьВУправленческомУчете КАК СсылкаОтражатьВУправленческомУчете,
	|		АвансовыйОтчет.Ссылка.ОтражатьВБухгалтерскомУчете КАК СсылкаОтражатьВБухгалтерскомУчете,
	|		АвансовыйОтчет.Ссылка.ОтражатьВНалоговомУчете КАК СсылкаОтражатьВНалоговомУчете,
	|		АвансовыйОтчет.Ссылка.абс_Статус КАК Ссылкаабс_Статус,
	|		АвансовыйОтчет.Ссылка.Организация КАК СсылкаОрганизация,
	|		АвансовыйОтчетабс_ЗакупочныеЗаказы.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.абс_ЗакупочныеЗаказы КАК АвансовыйОтчетабс_ЗакупочныеЗаказы
	|			ПО (АвансовыйОтчетабс_ЗакупочныеЗаказы.Ссылка = АвансовыйОтчет.Ссылка)
	|				И (АвансовыйОтчетабс_ЗакупочныеЗаказы.Ссылка = АвансовыйОтчет.Ссылка)
	|	ГДЕ
	|		АвансовыйОтчет.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|		И АвансовыйОтчетабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ) КАК ВложенныйЗапросШапкаАвансовыйОтчет
	|ГДЕ
	|	ВложенныйЗапросШапкаАвансовыйОтчет.НомерСтроки ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПоступлениеДопРасходов.Проведен
	|			ТОГДА 0
	|		КОГДА ПоступлениеДопРасходов.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ПоступлениеДопРасходов.Ссылка,
	|	ПоступлениеДопРасходов.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ПоступлениеДопРасходов.СуммаВключаетНДС
	|			ТОГДА ПоступлениеДопРасходов.СуммаДокумента - ПоступлениеДопРасходов.СуммаНДС
	|		ИНАЧЕ ПоступлениеДопРасходов.СуммаДокумента
	|	КОНЕЦ,
	|	ПоступлениеДопРасходов.СуммаДокумента,
	|	ПоступлениеДопРасходов.КурсВзаиморасчетов,
	|	ПоступлениеДопРасходов.КратностьВзаиморасчетов,
	|	ПоступлениеДопРасходов.НомерВходящегоДокумента,
	|	ПоступлениеДопРасходов.ДатаВходящегоДокумента,
	|	ПоступлениеДопРасходов.Контрагент,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента,
	|	ПоступлениеДопРасходов.Ответственный,
	|	ПоступлениеДопРасходов.ОтражатьВУправленческомУчете,
	|	ПоступлениеДопРасходов.ОтражатьВБухгалтерскомУчете,
	|	ПоступлениеДопРасходов.ОтражатьВНалоговомУчете,
	|	NULL,
	|	ПоступлениеДопРасходов.Организация
	|ИЗ
	|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|ГДЕ
	|	ПоступлениеДопРасходов.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА абс_НеотфактурованнаяПоставка.Ссылка.Проведен
	|			ТОГДА 0
	|		КОГДА абс_НеотфактурованнаяПоставка.Ссылка.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	абс_НеотфактурованнаяПоставка.Ссылка,
	|	абс_НеотфактурованнаяПоставка.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА абс_НеотфактурованнаяПоставка.Ссылка.УчитыватьНДС
	|			ТОГДА ВЫБОР
	|					КОГДА абс_НеотфактурованнаяПоставка.Ссылка.СуммаДокумента - абс_НеотфактурованнаяПоставка.Ссылка.абс_СуммаНДС = 0
	|						ТОГДА абс_НеотфактурованнаяПоставка.абс_СуммаБезНДС
	|					ИНАЧЕ абс_НеотфактурованнаяПоставка.абс_СуммаБезНДС * (1 + абс_НеотфактурованнаяПоставка.Ссылка.абс_СуммаНДС / (абс_НеотфактурованнаяПоставка.Ссылка.СуммаДокумента - абс_НеотфактурованнаяПоставка.Ссылка.абс_СуммаНДС))
	|				КОНЕЦ
	|		ИНАЧЕ абс_НеотфактурованнаяПоставка.абс_СуммаБезНДС
	|	КОНЕЦ,
	|	абс_НеотфактурованнаяПоставка.Ссылка.СуммаДокумента,
	|	абс_НеотфактурованнаяПоставка.Ссылка.КурсВзаиморасчетов,
	|	абс_НеотфактурованнаяПоставка.Ссылка.КратностьВзаиморасчетов,
	|	абс_НеотфактурованнаяПоставка.Ссылка.НомерВходящегоДокумента,
	|	абс_НеотфактурованнаяПоставка.Ссылка.ДатаВходящегоДокумента,
	|	абс_НеотфактурованнаяПоставка.Ссылка.Контрагент,
	|	абс_НеотфактурованнаяПоставка.Ссылка.ДоговорКонтрагента,
	|	абс_НеотфактурованнаяПоставка.Ссылка.Ответственный,
	|	абс_НеотфактурованнаяПоставка.Ссылка.ОтражатьВУправленческомУчете,
	|	абс_НеотфактурованнаяПоставка.Ссылка.ОтражатьВБухгалтерскомУчете,
	|	абс_НеотфактурованнаяПоставка.Ссылка.ОтражатьВНалоговомУчете,
	|	абс_НеотфактурованнаяПоставка.Ссылка.абс_Статус,
	|	абс_НеотфактурованнаяПоставка.Ссылка.Организация
	|ИЗ
	|	Документ.абс_НеотфактурованнаяПоставка.абс_ЗакупочныеЗаказы КАК абс_НеотфактурованнаяПоставка
	|ГДЕ
	|	абс_НеотфактурованнаяПоставка.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапросШапкаНеотфактуровка.ИндексКартинки,
	|	ВложенныйЗапросШапкаНеотфактуровка.Ссылка,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаВалютаДокумента,
	|	ВложенныйЗапросШапкаНеотфактуровка.СуммаПоЗЗ,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаСуммаДокумента,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаКурсВзаиморасчетов,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаКратностьВзаиморасчетов,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаНомерВходящегоДокумента,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаДатаВходящегоДокумента,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаКонтрагент,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаДоговорКонтрагента,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаОтветственный,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаОтражатьВУправленческомУчете,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаОтражатьВБухгалтерскомУчете,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаОтражатьВНалоговомУчете,
	|	ВложенныйЗапросШапкаНеотфактуровка.Ссылкаабс_Статус,
	|	ВложенныйЗапросШапкаНеотфактуровка.СсылкаОрганизация
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА абс_НеотфактурованнаяПоставка.Ссылка.Проведен
	|				ТОГДА 0
	|			КОГДА абс_НеотфактурованнаяПоставка.Ссылка.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК ИндексКартинки,
	|		абс_НеотфактурованнаяПоставка.Ссылка КАК Ссылка,
	|		абс_НеотфактурованнаяПоставка.Ссылка.ВалютаДокумента КАК СсылкаВалютаДокумента,
	|		ВЫБОР
	|			КОГДА абс_НеотфактурованнаяПоставка.Ссылка.СуммаВключаетНДС
	|				ТОГДА абс_НеотфактурованнаяПоставка.Ссылка.СуммаДокумента - абс_НеотфактурованнаяПоставка.Ссылка.абс_СуммаНДС
	|			ИНАЧЕ абс_НеотфактурованнаяПоставка.Ссылка.СуммаДокумента
	|		КОНЕЦ КАК СуммаПоЗЗ,
	|		абс_НеотфактурованнаяПоставка.Ссылка.СуммаДокумента КАК СсылкаСуммаДокумента,
	|		абс_НеотфактурованнаяПоставка.Ссылка.КурсВзаиморасчетов КАК СсылкаКурсВзаиморасчетов,
	|		абс_НеотфактурованнаяПоставка.Ссылка.КратностьВзаиморасчетов КАК СсылкаКратностьВзаиморасчетов,
	|		абс_НеотфактурованнаяПоставка.Ссылка.НомерВходящегоДокумента КАК СсылкаНомерВходящегоДокумента,
	|		абс_НеотфактурованнаяПоставка.Ссылка.ДатаВходящегоДокумента КАК СсылкаДатаВходящегоДокумента,
	|		абс_НеотфактурованнаяПоставка.Ссылка.Контрагент КАК СсылкаКонтрагент,
	|		абс_НеотфактурованнаяПоставка.Ссылка.ДоговорКонтрагента КАК СсылкаДоговорКонтрагента,
	|		абс_НеотфактурованнаяПоставка.Ссылка.Ответственный КАК СсылкаОтветственный,
	|		абс_НеотфактурованнаяПоставка.Ссылка.ОтражатьВУправленческомУчете КАК СсылкаОтражатьВУправленческомУчете,
	|		абс_НеотфактурованнаяПоставка.Ссылка.ОтражатьВБухгалтерскомУчете КАК СсылкаОтражатьВБухгалтерскомУчете,
	|		абс_НеотфактурованнаяПоставка.Ссылка.ОтражатьВНалоговомУчете КАК СсылкаОтражатьВНалоговомУчете,
	|		абс_НеотфактурованнаяПоставка.Ссылка.абс_Статус КАК Ссылкаабс_Статус,
	|		абс_НеотфактурованнаяПоставка.Ссылка.Организация КАК СсылкаОрганизация,
	|		абс_НеотфактурованнаяПоставкаабс_ЗакупочныеЗаказы.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.абс_НеотфактурованнаяПоставка КАК абс_НеотфактурованнаяПоставка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_НеотфактурованнаяПоставка.абс_ЗакупочныеЗаказы КАК абс_НеотфактурованнаяПоставкаабс_ЗакупочныеЗаказы
	|			ПО (абс_НеотфактурованнаяПоставкаабс_ЗакупочныеЗаказы.Ссылка = абс_НеотфактурованнаяПоставка.Ссылка)
	|				И (абс_НеотфактурованнаяПоставкаабс_ЗакупочныеЗаказы.Ссылка = абс_НеотфактурованнаяПоставка.Ссылка)
	|	ГДЕ
	|		абс_НеотфактурованнаяПоставка.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|		И абс_НеотфактурованнаяПоставкаабс_ЗакупочныеЗаказы.абс_ЗакупочныйЗаказТЧ = &ЗакупочныйЗаказ) КАК ВложенныйЗапросШапкаНеотфактуровка
	|ГДЕ
	|	ВложенныйЗапросШапкаНеотфактуровка.НомерСтроки ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПоступлениеНМА.Проведен
	|			ТОГДА 0
	|		КОГДА ПоступлениеНМА.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ПоступлениеНМА.Ссылка,
	|	ПоступлениеНМА.ВалютаДокумента,
	|	ПоступлениеНМА.СуммаДокумента,
	|	ПоступлениеНМА.СуммаДокумента,
	|	ПоступлениеНМА.КурсВзаиморасчетов,
	|	ПоступлениеНМА.КратностьВзаиморасчетов,
	|	ПоступлениеНМА.НомерВходящегоДокумента,
	|	ПоступлениеНМА.ДатаВходящегоДокумента,
	|	ПоступлениеНМА.Контрагент,
	|	ПоступлениеНМА.ДоговорКонтрагента,
	|	ПоступлениеНМА.Ответственный,
	|	ЛОЖЬ,
	|	ПоступлениеНМА.ОтражатьВБухгалтерскомУчете,
	|	ПоступлениеНМА.ОтражатьВНалоговомУчете,
	|	NULL,
	|	ПоступлениеНМА.Организация
	|ИЗ
	|	Документ.ПоступлениеНМА КАК ПоступлениеНМА
	|ГДЕ
	|	ПоступлениеНМА.абс_ЗакупочныйЗаказ = &ЗакупочныйЗаказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос.УстановитьПараметр("ЗакупочныйЗаказ", ?(ЗЗ = Документы.абс_ЗакупочныйЗаказ.ПустаяСсылка(), Неопределено, ЗЗ));  // АБС ВСТАВКА Гетц 14.03.14. В случае пустой ссылки параметр равен "Неопределено" (для новых документов)
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
	
КонецФункции
//***** АБС Гетц. 30.01.2013 \\




