
/////////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБСЛУЖИВАНИЯ МЕХАНИЗМА НАСТРОЙКИ ПРАВ ДОСТУПА

		

// Проверка доступности роли "управленческого" кадровика
// это или КадровикУправленческихДанных или полные права
// Применяется для проверки прав на доступ к кадровым даннам, например, 
// в формах или при выводе на печать
// Возвращаемое значение:
//	булево - истина если есть доступ к "кадровым" данным
Функция ДоступнаРольКадровикаУпр() Экспорт
	Возврат РольДоступна("КадровикУправленческихДанных")
	//или РольДоступна("УдалитьКадровикУправленческихДанныхБезОграниченияПрав")
	или РольДоступна("ПолныеПрава");
	
	//Крамаренко Д.М.
	//Правильный код
	//Если Метаданные.Роли.Найти("УдалитьКадровикУправленческихДанныхБезОграниченияПрав") = Неопределено Тогда
	//	Возврат Ложь;
	//Иначе Возврат РольДоступна("УдалитьКадровикУправленческихДанныхБезОграниченияПрав");
	
КонецФункции  //ДоступнаРольРасчетчика




