
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
	НаборЗаписей = РегистрыСведений.ttk_ОтветственныеЗаЗагрузкуПроверкуБиллинга.СоздатьНаборЗаписей(); 
	
	Для Каждого Строка Из Ответственные Цикл
	
	
		

		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 

		НоваяЗапись 					= НаборЗаписей.Добавить(); 
		НоваяЗапись.Период 				= Ссылка.Дата; 
		НоваяЗапись.Организация 		= Строка.Организация; 
		НоваяЗапись.ТипОтветственного	= Строка.ТипОтветственного; 
		НоваяЗапись.ТипБиллинга			= Строка.ТипБиллинга; 
		НоваяЗапись.Ответственный 		= Строка.Ответственный; 

		
	КонецЦикла;
	
	
	НаборЗаписей.Записать(); 

	ЭтотОбъект.Изменил = глЗначениеПеременной("глТекущийПользователь");

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ЭтотОбъект.Изменил = глЗначениеПеременной("глТекущийПользователь");
		
КонецПроцедуры


