// Процедура заполняет новый реквизит "Вид имущества"
//
Процедура ЗаполнитьВидИмущества() Экспорт
	
	НаборЗаписей = РегистрыСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТекстСообщения = "Не удалось установить виды имущества для объектов";
	Для каждого СтрокаНабора Из НаборЗаписей Цикл
		Если СтрокаНабора.УдалитьВходитВСоставЕСГС Тогда
			СтрокаНабора.ВидИмущества = Перечисления.ВидыИмущества.ВходитВСоставЕСГС;
			ВидИмущества = "Входит в состав единой системы газоснабжения (ЕСГС)";
		Иначе
			СтрокаНабора.ВидИмущества = Перечисления.ВидыИмущества.ОсобенностиОтсутствуют;
			ВидИмущества = "Особенности отсутствуют";
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения + "
			|" + СтрокаНабора.ОсновноеСредство + " - " + ВидИмущества;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

// Процедура заполняет новый реквизит "Налоговая база"
//
Процедура ЗаполнитьПорядокОпределенияНалоговойБазы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговаяБаза
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|ГДЕ
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
	
		НаборЗаписей = РегистрыСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			
			Если НЕ ЗначениеЗаполнено(Запись.НалоговаяБаза) Тогда
				Запись.НалоговаяБаза = Перечисления.НалоговаяБазаПоНалогуНаИмущество.СреднегодоваяСтоимость;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстСообщения	= НСтр("ru = 'Не выполнено обновление записей регистра сведений ""Ставки налога на имущество по отдельным основным средствам""'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры
