
Процедура ПриЗаписи(Отказ)
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовПервичныхДокументов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ПервичныйДокумент.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
	Запись.ПервичныйДокумент = Ссылка;
	Запись.Пользователь = ТекПользователь;	
	Запись.СтатусДокумента = Статус;	
	Запись.Комментарий = Комментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
		Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
	Комментарий = "";
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	СоответствиеКонтрагентов.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.абс_СтатусыПервичныхДокументов.Согласован Тогда
		Движения.ttk_СоответствиеКонтрагентовЕИСУПиВГО.Записывать = Истина;
		Движения.ttk_СоответствиеКонтрагентовЕИСУПиВГО.Очистить();
		Для Каждого ТекСтрокаСоответствиеКонтрагентов Из СоответствиеКонтрагентов Цикл
			Движение = Движения.ttk_СоответствиеКонтрагентовЕИСУПиВГО.Добавить();
			Движение.Организация = Организация;
			Движение.КонтрагентЕИСУП = ТекСтрокаСоответствиеКонтрагентов.КонтрагентЕИСУП;
			Движение.ДоговорЕИСУП = ТекСтрокаСоответствиеКонтрагентов.ДоговорЕИСУП;
			Движение.КонтрагентВГО = ТекСтрокаСоответствиеКонтрагентов.КонтрагентВГО;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Или Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена Тогда
		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена;
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
	
КонецПроцедуры
