
Функция ПолучитьТаблицуРасходов(Кейсы) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыБюджетовОбороты.ДоговорКонтрагента КАК Договор,
	|	ОборотыБюджетовОбороты.Проект,
	|	ОборотыБюджетовОбороты.Регистратор,
	|	ОборотыБюджетовОбороты.СуммаУпрОборот КАК Сумма,
	|	0 КАК СуммаОплаты
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|				И Сценарий В (&СценарииФакт)
	|				И Проект В ИЕРАРХИИ (&Кейсы)) КАК ОборотыБюджетовОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ДДСПоПроектамОбороты.ДоговорКонтрагента,
	|	абс_ДДСПоПроектамОбороты.Проект,
	|	абс_ДДСПоПроектамОбороты.Регистратор,
	|	0,
	|	абс_ДДСПоПроектамОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.абс_ДДСПоПроектам.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|				И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				И ФактОперФакт = ЗНАЧЕНИЕ(Перечисление.абс_ФактОперФакт.Факт)
	|				И ОплатаАванс В (ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Оплата), ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Аванс))
	|				И Проект В ИЕРАРХИИ (&Кейсы)) КАК абс_ДДСПоПроектамОбороты";
	
	Запрос.УстановитьПараметр("РасходныйДоговор", РасходныйДоговор);
	СписокСценариевФакт = Новый СписокЗначений;
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000003"));  //Факт
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000055"));  //ТД по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000028"));  //КВ по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000059"));  //Поступление ТМЦ
	Запрос.УстановитьПараметр("СценарииФакт", СписокСценариевФакт);
	Запрос.УстановитьПараметр("Кейсы", Кейсы);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции

Функция ПолучитьТаблицуДоходов(Кейсы) Экспорт 
	Запрос = Новый Запрос;
	Запрос .Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыБюджетовОбороты.ДоговорКонтрагента КАК Договор,
	|	ОборотыБюджетовОбороты.Проект,
	|	ОборотыБюджетовОбороты.Регистратор,
	|	ОборотыБюджетовОбороты.СуммаУпрОборот КАК Сумма,
	|	0 КАК СуммаОплаты
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &ДоходныйДоговор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДоговорКонтрагента = &ДоходныйДоговор
	|				КОНЕЦ
	|				И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|				И Проект В ИЕРАРХИИ (&ПроектКейс)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	ОборотыБюджетовОбороты.ДоговорКонтрагента.абс_СтатусДоговора  в (&Исполнение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ДДСПоПроектамОбороты.ДоговорКонтрагента,
	|	абс_ДДСПоПроектамОбороты.Проект,
	|	абс_ДДСПоПроектамОбороты.Регистратор,
	|	0,
	|	абс_ДДСПоПроектамОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.абс_ДДСПоПроектам.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &ДоходныйДоговор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДоговорКонтрагента = &ДоходныйДоговор
	|				КОНЕЦ
	|				И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				И ФактОперФакт = ЗНАЧЕНИЕ(Перечисление.абс_ФактОперФакт.Факт)
	|				И ОплатаАванс В (ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Оплата), ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Аванс))
	|				И Проект В ИЕРАРХИИ (&ПроектКейс)) КАК абс_ДДСПоПроектамОбороты";
	
	//родин лимиты по договорам			   
	МассивИсполнение = Новый Массив;			   
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.Корректировка);
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.СогласованиеОФКПослеКоррректировки);
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.ОтказПослеКорректировки);
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.Исполнение);
	Запрос.УстановитьПараметр("Исполнение",МассивИсполнение);
	//родин лимиты по договорам	
	
	Запрос.УстановитьПараметр("ПроектКейс", Кейсы);
	СписокСценариевФакт = Новый СписокЗначений;
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000003"));  //Факт
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000055"));  //ТД по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000028"));  //КВ по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000059"));  //Поступление ТМЦ
	Запрос.УстановитьПараметр("СценарииФакт", СписокСценариевФакт);
	Запрос.УстановитьПараметр("ДоходныйДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции

Функция ПолучитьМассивКейсПроектов(ДоговорКонтрагента) Экспорт 
		
	Если Проекты.Количество() > 0 Тогда 
		ТаблицаПроектов = Проекты.Выгрузить();
	Иначе 
		ТаблицаПроектов = ДоговорКонтрагента.абс_Проекты.Выгрузить(, "Проект");
	КонецЕсли;
	
	ТаблицаПроектов.Свернуть("Проект");
	
	Результат = ТаблицаПроектов.СкопироватьКолонки();
	
	Для каждого СтрокаТЗ Из ТаблицаПроектов Цикл
		КейсПроект = ОпределитьКейсПроект(СтрокаТЗ.Проект);
		Если Не КейсПроект = Неопределено Тогда
			СтрРез = Результат.Добавить();
			СтрРез.Проект = КейсПроект;
		КонецЕСли;
	КонецЦикла;
	
	Результат.Свернуть("Проект");
	МассивКейсПроектов = Результат.ВыгрузитьКолонку("Проект");
	Если МассивКейсПроектов.Количество() > 0 Тогда 
		Кейс = МассивКейсПроектов[0];
	Иначе 
		Кейс = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
	
	
	Возврат Результат.ВыгрузитьКолонку("Проект");
	
КонецФункции

Функция ОпределитьКейсПроект(ТекПроект) 
			
	Если ТекПроект.абс_Case Тогда
		КейсПроект = ТекПроект;
	Иначе
		Если ЗначениеЗаполнено(ТекПроект.Родитель) Тогда
			КейсПроект = ОпределитьКейсПроект(ТекПроект.Родитель);
		Иначе
			КейсПроект = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат КейсПроект;
	
КонецФункции

Процедура ЗаполнитьТаблицы() Экспорт 
	Кейсы = ПолучитьМассивКейсПроектов(РасходныйДоговор);
	РасходыПоПроектам = ПолучитьТаблицуРасходов(Кейсы);
	ДоходыПоПроектам = ПолучитьТаблицуДоходов(Кейсы);
	Расходы.Загрузить(РасходыПоПроектам);
	Доходы.Загрузить(ДоходыПоПроектам);
КонецПроцедуры
