Процедура УстановитьОтборДоговоровКонфиденциально(ОтборСписка, НастройкаОтбора) Экспорт
	
	ОтборКонфиденциально 			= ОтборСписка["абс_Конфиденциальный"];
	НастройкаОтбораКонфиденциально 	= НастройкаОтбора["абс_Конфиденциальный"];
	
	МассивРолей = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя();
	
	Если НЕ МассивРолей.Найти(Справочники.РолиИсполнителей.КонфиденциальныеДоговоры) = Неопределено Тогда
		
		ОтборКонфиденциально.Использование 	= Ложь;
		ОтборКонфиденциально.ВидСравнения 	= ВидСравнения.Равно;
		ОтборКонфиденциально.Значение		= Истина;

		НастройкаОтбораКонфиденциально.Доступность = Истина;
		
	Иначе
		
		ОтборКонфиденциально.Использование 	= Истина;
		ОтборКонфиденциально.ВидСравнения 	= ВидСравнения.Равно;
		ОтборКонфиденциально.Значение 		= Ложь;
		
		НастройкаОтбораКонфиденциально.Доступность = Ложь;

		
	КонецЕсли;
	
КонецПроцедуры

Функция РазрешенПросмотрКонфиденциальныДоговоров() Экспорт
	
	Возврат РольДоступна("абс_ПросмотрКонфиденциальныДоговоров");
	
КонецФункции