
&НаКлиенте
Процедура РесурсПриИзменении(Элемент)
	ПриИзмененииИзмерений();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПриИзмененииИзмерений();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	ПересчитатьИзменение();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПриИзменении(Элемент)
	Значение = ИсходноеЗначение + Изменение;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИзмерений()
	
	ИсходноеЗначение = ПолучитьЗначение(Период, Проект, Ресурс);
	Значение = ИсходноеЗначение;
	ПересчитатьИзменение();
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьИзменение()
	
	Изменение = Значение - ИсходноеЗначение;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначение(Период, Проект, Ресурс)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_РесурсыПоПроектамБазаСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.абс_РесурсыПоПроектамБаза.СрезПоследних(
		|			&Период,
		|			Проект = &Проект
		|				И Ресурс = &Ресурс) КАК абс_РесурсыПоПроектамБазаСрезПоследних";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если Не ЗначениеЗаполнено(Период) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен период записи";
		Сообщение.Поле = "Период";
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Ресурс) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен ресурс";
		Сообщение.Поле = "Ресурс";
		Сообщение.Сообщить();
		Возврат;		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.абс_РесурсыПоПроектамБаза.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.Проект = Проект;
	МенеджерЗаписи.Ресурс = Ресурс;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = Параметры.ЗначенияЗаполнения.Период;
	Проект = Параметры.ЗначенияЗаполнения.Проект;
КонецПроцедуры




