////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		Дата = КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1));	
	КонецЕсли;
	 
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РаспределениеПоПроектам.Очистить();	
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОборотыБюджетов.Записывать = Истина;
	
	Движения.ОборотыБюджетов.Загрузить(Документы.абс_РаспределениеРесурсовНаПроект.ПолучитьДанныеДляПроведенияОборотыБюджетов(Ссылка));
	
КонецПроцедуры


