// Возвращает список видов документов для этого журнала в виде списка значений
// 
Функция ПолучитьСписокВидовДокументов(мСписокВидовДокументов) Экспорт
	Если мСписокВидовДокументов <> НеОпределено Тогда
		Возврат мСписокВидовДокументов;
	КонецЕсли;
	
	мСписокВидовДокументов = Новый СписокЗначений;
	мСписокВидовДокументов.Добавить("ПриемНаРаботуВОрганизацию");
	мСписокВидовДокументов.Добавить("КадровоеПеремещениеОрганизаций");
	мСписокВидовДокументов.Добавить("УвольнениеИзОрганизаций");
	
	РаботаСДиалогами.ДополнитьСписокВидовДокументов(Метаданные.ЖурналыДокументов.УчетКадровОрганизаций, мСписокВидовДокументов);
	
	Возврат мСписокВидовДокументов;
	
КонецФункции
