
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НайтиДоговоры(ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Контрагент,ЭтаФорма.ВладелецФормы.Объект.Организация,ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Валюта);
	Если ЗначениеЗаполнено(ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Договор) Тогда
		Код=ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Договор.Код;
		йй=0;
		Для каждого йСтр Из ЭтаФорма.СписокДоговоров Цикл
			Если СокрЛП(Код)=СокрЛП(йСтр.Код) Тогда
				ЭтаФорма.Элементы.ТаблицаДоговоров.ТекущаяСтрока=йй;
				Прервать;
			КонецЕсли;
			йй=йй+1;
		КонецЦикла;
	Иначе
		Код="";
	КонецЕсли;
	Элементы.ДекорацияКонтрагент.Заголовок="Контрагент: ["+
					ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Контрагент.Код+"] "+
					ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Контрагент+
					", Договор: ["+Код+"] "+
					ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Договор;
КонецПроцедуры

&НаСервере
Процедура НайтиДоговоры(Контрагент,Организация,Валюта)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ДоговорыКонтрагентов.Ссылка,
	             |	ДоговорыКонтрагентов.Наименование КАК НаименованиеДоговора,
	             |	ДоговорыКонтрагентов.Код,
	             |	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	             |	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	             |	ДоговорыКонтрагентов.абс_ЛицевойСчетБиллинга КАК ЛицевойСчет,
	             |	ДоговорыКонтрагентов.абс_СтатусДоговора КАК Статус,
	             |	ДоговорыКонтрагентов.ввв_МестонахождениеБиллинга КАК МестонахождениеБиллинга
	             |ИЗ
	             |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	             |ГДЕ
	             |	ДоговорыКонтрагентов.Владелец = &Контрагент
	             |	И ДоговорыКонтрагентов.Организация = &Организация
	             |	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта
	             |	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	             |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	             |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДоговорыКонтрагентов.Наименование";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Валюта",Валюта);
	ЭтаФорма.СписокДоговоров.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоговоровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭтаФорма.ВладелецФормы.Элементы.ТаблицаКонтрагентыДоговоры.ТекущиеДанные.Договор=Элемент.ТекущиеДанные.Ссылка;
	Закрыть();
КонецПроцедуры
