
////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

// Возвращает текст поля запроса (для предложения ВЫБРАТЬ)
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   строка
//
Функция ПолучитьДополнительноеПолеОписанияСтроки() Экспорт 
	
	Возврат	""

КонецФункции // ПолучитьПоле()

Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопленияДополнительно(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено	
	
КонецПроцедуры

// Создает дополнительное движение по строке ТЧ
//
// Параметры
//	ВыборкаПоШапкеДокумента
//	ВыборкаПоТЧ
//	СтавкаНалогообложения
//	СуммаВозврата
//
Процедура ДобавитьСтрокуДвиженийПоСтавкеДополнительно(Движения, ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, СтавкаНалогообложения, СуммаВозврата) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено	
	
КонецПроцедуры // ДобавитьСтрокуДвиженийПоСтавкеДополнительно
////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы документа

#Если Клиент Тогда
	

// Добавляет колонки, соответствующие уникальным реквизитам т.ч. документа
//
// Параметры
//  Колонки - КолонкиТабличногоПоля - колонки т.п., редактирующего
//                 табличную часть документа
//
Процедура ДополнитьКолонкиТабличногоПоля(ТабличноеПоле) Экспорт 
	
	// В этой конфигурации дополнительных колонок не предусмотрено	

КонецПроцедуры // ДополнитьКолонкиТабличнойЧасти()

// Добавляет в командную панель формы дополнительную кнопку с разделителем
//
// Параметры
//  КоманднаяПанель - командная панель 
//  Действие - дополнительное действие
//
Процедура ДополнитьКомандыФормы(КоманднаяПанель, Действие, Смещение = 0) Экспорт
	
	// В этой конфигурации дополнительных команд не предусмотрено	
	
КонецПроцедуры

// Реализует дополнительную команду формы
//
// Параметры
//  Объект - ДокументОбъект.НДФЛВозвратНалога - текущий документ списка
//  Форма - Форма списка документов
//
Процедура ОбработатьНажатиеНаКнопкуСоздания(Объект, Форма) Экспорт
	
	// В этой конфигурации дополнительных команд не предусмотрено	
	
КонецПроцедуры 

#КонецЕсли

 