
Функция ПолучитьСтруктуруЗапросовПроведения(ТипДокументаОснования) Экспорт 
	
	СтруктураЗапросов = Новый Структура;
	СтруктураЗапросов.Вставить("абс_МеждународныйУчетОСРЖД_ТекстЗапросаВидыСубконтоСчетов", абс_МеждународныйУчетОСРЖД.ТекстЗапросаВидыСубконтоСчетов("ВидыСубконтоСчетов"));
	СтруктураЗапросов.Вставить("абс_МеждународныйУчетОСРЖД_ТекстЗапросаСоответствиеСчетовХозрасчетныйРЖД", абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("Период",, "СоответствиеСчетовХозрасчетныйРЖД"));
	СтруктураЗапросов.Вставить("ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД", абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("Период",, "СоответствиеСчетовХозрасчетныйРЖД"));
	
	
	Если ТипДокументаОснования = Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда 
		ДобавитьЗапросыДляПоступление_Принятие(СтруктураЗапросов);
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.МодернизацияОС") Тогда 	
		ДобавитьЗапросыДляПоступление_Модернизация(СтруктураЗапросов);
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда 	
		ДобавитьЗапросыДляПоступление_Остатки(СтруктураЗапросов);
	КонецЕсли;
	
	ДобавитьОбщиеЗапросы(СтруктураЗапросов);
	
	Возврат СтруктураЗапросов;
	
КонецФункции 

Процедура ДобавитьЗапросыДляПоступление_Принятие(СтруктураЗапросов) 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПринятиеКУчетуОС.Дата КАК ДатаПринятияКУчету,
		|	ПринятиеКУчетуОС.ПодразделениеОрганизации КАК Местонахождение,
		|	ПринятиеКУчетуОС.МОЛБУ КАК МОЛ,
		|	ВЫБОР
		|		КОГДА ПринятиеКУчетуОС.КоэффициентУскоренияБУ = 0
		|			ТОГДА 1
		|		ИНАЧЕ ПринятиеКУчетуОС.КоэффициентУскоренияБУ
		|	КОНЕЦ КАК КоэффициентУскорения,
		|	ЕСТЬNULL(Соответствие_СчетУчета.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации)) КАК СчетУчета,
		|	ЕСТЬNULL(Соответствие_СчетАмортизации.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01)) КАК СчетНачисленияАмортизации,
		|	ПринятиеКУчетуОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
		|	ПринятиеКУчетуОС.СпособыОтраженияРасходовПоАмортизации
		|ПОМЕСТИТЬ ДанныеШапкиОснования
		|ИЗ
		|	Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК Соответствие_СчетУчета
		|		ПО ПринятиеКУчетуОС.СчетУчетаБУ = Соответствие_СчетУчета.СчетХозрасчетный
		|			И (Соответствие_СчетУчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК Соответствие_СчетАмортизации
		|		ПО ПринятиеКУчетуОС.СчетНачисленияАмортизацииБУ = Соответствие_СчетАмортизации.СчетХозрасчетный
		|			И (Соответствие_СчетАмортизации.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|ГДЕ
		|	ПринятиеКУчетуОС.Ссылка = &ДокументОснование";
		
	СтруктураЗапросов.Вставить("Поступление_Принятие_ТекстЗапросаДанныеШапкиОснования", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеШапкиОснования.ДатаПринятияКУчету,
		|	ДанныеШапкиОснования.Местонахождение,
		|	ДанныеШапкиОснования.МОЛ,
		|	ДанныеШапкиОснования.КоэффициентУскорения,
		|	ДанныеШапкиОснования.СчетУчета,
		|	ДанныеШапкиОснования.СчетНачисленияАмортизации,
		|	ДанныеШапкиОснования.НачислятьАмортизацию,
		|	СоответствиеСчетовХозрасчетныйРЖД.СчетМеждународный КАК СчетЗатрат,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто3
		|ПОМЕСТИТЬ ДанныеДляЗаполненияТабличнойЧасти
		|ИЗ
		|	ДанныеШапкиОснования КАК ДанныеШапкиОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
		|			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК СоответствиеСчетовХозрасчетныйРЖД
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|				ПО СоответствиеСчетовХозрасчетныйРЖД.СчетМеждународный = ВидыСубконтоСчетов.Счет
		|			ПО СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = СоответствиеСчетовХозрасчетныйРЖД.СчетХозрасчетный
		|				И (СоответствиеСчетовХозрасчетныйРЖД.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ПО (СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки = 1)
		|			И ДанныеШапкиОснования.СпособыОтраженияРасходовПоАмортизации = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка";
		
	СтруктураЗапросов.Вставить("Поступление_Принятие_ТекстЗапросаДанныеДляЗаполненияТабличнойЧасти", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
		|	ДанныеДляЗаполненияТабличнойЧасти.ДатаПринятияКУчету,
		|	ДанныеДляЗаполненияТабличнойЧасти.Местонахождение,
		|	ДанныеДляЗаполненияТабличнойЧасти.МОЛ,
		|	0 КАК СрокПолезногоИспользования,
		|	ДанныеДляЗаполненияТабличнойЧасти.КоэффициентУскорения,
		|	ХозрасчетныйДвиженияССубконто.Сумма КАК Стоимость,
		|	0 КАК Амортизация,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетУчета,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетНачисленияАмортизации,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетЗатрат,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто1,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто2,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто3,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный) КАК СчетСниженияСтоимости,
		|	ДанныеДляЗаполненияТабличнойЧасти.НачислятьАмортизацию,
		|	СчетаРЖД_Коррсчет.СчетМеждународный КАК КоррСчет,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК КоррСубконто1,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК КоррСубконто2,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК КоррСубконто3,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).КодПоОКОФ КАК ОКОФ,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).абс_ГруппаОСРЖД КАК ГруппаОСРЖД
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
		|			&МоментОснования,
		|			&МоментОснования,
		|			Регистратор = &ДокументОснование
		|				И СчетДт В (&СчетаУчетаБУ),
		|			,
		|			) КАК ХозрасчетныйДвиженияССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК СчетаРЖД_Коррсчет
		|		ПО ХозрасчетныйДвиженияССубконто.СчетКт = СчетаРЖД_Коррсчет.СчетХозрасчетный
		|			И (СчетаРЖД_Коррсчет.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит)),
		|	ДанныеДляЗаполненияТабличнойЧасти КАК ДанныеДляЗаполненияТабличнойЧасти";
	
	СтруктураЗапросов.Вставить("Поступление_Принятие_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ДанныеШапкиОснования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДляЗаполненияТабличнойЧасти
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства";
		
	СтруктураЗапросов.Вставить("Поступление_Принятие_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
КонецПроцедуры

Процедура ДобавитьЗапросыДляПоступление_Модернизация(СтруктураЗапросов) 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	МодернизацияОСОС.ОсновноеСредство
		|ПОМЕСТИТЬ ОсновныеСредстваОснования
		|ИЗ
		|	Документ.МодернизацияОС.ОС КАК МодернизацияОСОС
		|ГДЕ
		|	МодернизацияОСОС.Ссылка = &ДокументОснование";
	
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаОсновныеСредстваОснования", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.ОсновноеСредство,
		|	абс_ОсновныеСредстваРЖД.Организация,
		|	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
		|	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
		|	абс_ОсновныеСредстваРЖД.МОЛ,
		|	абс_ОсновныеСредстваРЖД.Состояние,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(абс_ОсновныеСредстваРЖД.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации)
		|		ИНАЧЕ абс_ОсновныеСредстваРЖД.СчетУчета
		|	КОНЕЦ КАК СчетУчета,
		|	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
		|	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
		|	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01)
		|		ИНАЧЕ абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации
		|	КОНЕЦ КАК СчетНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СчетЗатрат,
		|	абс_ОсновныеСредстваРЖД.Субконто1,
		|	абс_ОсновныеСредстваРЖД.Субконто2,
		|	абс_ОсновныеСредстваРЖД.Субконто3,
		|	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
		|	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
		|	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
		|	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный)
		|		ИНАЧЕ абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
		|	КОНЕЦ КАК СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновныхСредствОснования
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(абс_ОсновныеСредстваРЖД.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ОсновныеСредстваОснования.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(абс_ОсновныеСредстваРЖД.Период) КАК Период
		|		ИЗ
		|			ОсновныеСредстваОснования КАК ОсновныеСредстваОснования
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|				ПО ОсновныеСредстваОснования.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|					И (абс_ОсновныеСредстваРЖД.Период <= &Период)
		|					И (абс_ОсновныеСредстваРЖД.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОсновныеСредстваОснования.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|			ПО ПериодыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|				И ПериодыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|		ПО ПериодыРегистраторыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|			И ПериодыРегистраторыСреза.Регистратор = абс_ОсновныеСредстваРЖД.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство";
	
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаПараметрыОсновныхСредствОснования", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_ПоступлениеОСРЖДОсновныеСредства.ОсновноеСредство,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.ДатаПринятияКУчету,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.МестонахождениеОбъекта КАК Местонахождение,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.МОЛ,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.КоэффициентУскорения,
		|	ПараметрыОсновныхСредствОснования.СчетУчета,
		|	ПараметрыОсновныхСредствОснования.СчетНачисленияАмортизации,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.НачислятьАмортизацию,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.СчетЗатрат КАК СчетЗатрат,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто1 КАК Субконто1,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто2 КАК Субконто2,
		|	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто3 КАК Субконто3
		|ПОМЕСТИТЬ ДанныеДляЗаполненияТабличнойЧасти
		|ИЗ
		|	Документ.абс_ПоступлениеОСРЖД.ОсновныеСредства КАК абс_ПоступлениеОСРЖДОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствОснования КАК ПараметрыОсновныхСредствОснования
		|		ПО абс_ПоступлениеОСРЖДОсновныеСредства.ОсновноеСредство = ПараметрыОсновныхСредствОснования.ОсновноеСредство
		|ГДЕ
		|	абс_ПоступлениеОСРЖДОсновныеСредства.Ссылка = &Ссылка";
	
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаДанныеДляЗаполненияТабличнойЧасти", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
		|	ДанныеДляЗаполненияТабличнойЧасти.ДатаПринятияКУчету,
		|	ДанныеДляЗаполненияТабличнойЧасти.Местонахождение,
		|	ДанныеДляЗаполненияТабличнойЧасти.МОЛ,
		|	0 КАК СрокПолезногоИспользования,
		|	ДанныеДляЗаполненияТабличнойЧасти.КоэффициентУскорения,
		|	ХозрасчетныйДвиженияССубконто.Сумма КАК Стоимость,
		|	0 КАК Амортизация,
		|	ЕСТЬNULL(ДанныеДляЗаполненияТабличнойЧасти.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации)) КАК СчетУчета,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетНачисленияАмортизации,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетЗатрат,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто1,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто2,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто3,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный) КАК СчетСниженияСтоимости,
		|	ДанныеДляЗаполненияТабличнойЧасти.НачислятьАмортизацию,
		|	СчетаРЖД_Коррсчет.СчетМеждународный КАК КоррСчет,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК КоррСубконто1,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК КоррСубконто2,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК КоррСубконто3,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).КодПоОКОФ КАК ОКОФ,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).абс_ГруппаОСРЖД КАК ГруппаОСРЖД
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
		|			&МоментОснования,
		|			&МоментОснования,
		|			Регистратор = &ДокументОснование
		|				И СчетДт В (&СчетаУчетаБУ),
		|			,
		|			) КАК ХозрасчетныйДвиженияССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК СчетаРЖД_Коррсчет
		|		ПО ХозрасчетныйДвиженияССубконто.СчетКт = СчетаРЖД_Коррсчет.СчетХозрасчетный
		|			И (СчетаРЖД_Коррсчет.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДляЗаполненияТабличнойЧасти КАК ДанныеДляЗаполненияТабличнойЧасти
		|		ПО ХозрасчетныйДвиженияССубконто.СубконтоДт1 = ДанныеДляЗаполненияТабличнойЧасти.ОсновноеСредство";
	
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ОсновныеСредстваОснования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПараметрыОсновныхСредствОснования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДляЗаполненияТабличнойЧасти
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства";
	
	СтруктураЗапросов.Вставить("Поступление_Модернизация_УдалениеВременныхТаблиц", ТекстЗапроса+";");

	
	
КонецПроцедуры

Процедура ДобавитьЗапросыДляПоступление_Остатки(СтруктураЗапросов);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВводНачальныхОстатковОСОС.ОсновноеСредство,
		|	ВводНачальныхОстатковОСОС.ДатаПринятияКУчетуРегл КАК ДатаПринятияКУчету,
		|	ВводНачальныхОстатковОСОС.Ссылка.ПодразделениеОрганизации КАК Местонахождение,
		|	ВводНачальныхОстатковОСОС.МОЛРегл КАК МОЛ,
		|	ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.СрокПолезногоИспользования, 0) КАК СрокПолезногоИспользования,
		|	ВводНачальныхОстатковОСОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
		|	ВводНачальныхОстатковОСОС.ТекущаяСтоимостьБУ КАК Стоимость,
		|	ВводНачальныхОстатковОСОС.НакопленнаяАмортизацияБУ КАК Амортизация,
		|	ЕСТЬNULL(СчетаУчета.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации)) КАК СчетУчета,
		|	ЕСТЬNULL(СчетаАмортизации.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01)) КАК СчетНачисленияАмортизации,
		|	СчетаЗатрат.СчетМеждународный КАК СчетЗатрат,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто3,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный) КАК СчетСниженияСтоимости,
		|	ВводНачальныхОстатковОСОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
		|	КоррСчета.СчетМеждународный КАК КоррСчет,
		|	ВводНачальныхОстатковОСОС.СубконтоБУ КАК КоррСубконто1,
		|	НЕОПРЕДЕЛЕНО КАК КоррСубконто2,
		|	НЕОПРЕДЕЛЕНО КАК КоррСубконто3,
		|	ВводНачальныхОстатковОСОС.ОсновноеСредство.КодПоОКОФ КАК ОКОФ,
		|	ВводНачальныхОстатковОСОС.ОсновноеСредство.абс_ГруппаОСРЖД КАК ГруппаОСРЖД
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.ВводНачальныхОстатковОС.ОС КАК ВводНачальныхОстатковОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеОКОФГруппОСРЖД КАК абс_СоответствиеОКОФГруппОСРЖД
		|		ПО ВводНачальныхОстатковОСОС.ОсновноеСредство.КодПоОКОФ = абс_СоответствиеОКОФГруппОСРЖД.ОКОФ
		|			И ВводНачальныхОстатковОСОС.ОсновноеСредство.абс_ГруппаОСРЖД = абс_СоответствиеОКОФГруппОСРЖД.ГруппаОСРЖД
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК СчетаУчета
		|		ПО ВводНачальныхОстатковОСОС.СчетУчетаБУ = СчетаУчета.СчетХозрасчетный
		|			И (СчетаУчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК СчетаАмортизации
		|		ПО (СчетаАмортизации.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|			И ВводНачальныхОстатковОСОС.СчетАмортизацииБУ = СчетаАмортизации.СчетХозрасчетный
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК КоррСчета
		|		ПО (КоррСчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|			И ВводНачальныхОстатковОСОС.СчетБУ = КоррСчета.СчетХозрасчетный
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
		|			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйРЖД КАК СчетаЗатрат
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|				ПО СчетаЗатрат.СчетМеждународный = ВидыСубконтоСчетов.Счет
		|			ПО СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = СчетаЗатрат.СчетХозрасчетный
		|				И (СчетаЗатрат.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ПО ВводНачальныхОстатковОСОС.СпособОтраженияРасходовПоАмортизацииБУ = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
		|			И (СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки = 1)
		|ГДЕ
		|	ВводНачальныхОстатковОСОС.Ссылка = &ДокументОснование";
		
	СтруктураЗапросов.Вставить("Поступление_Остатки_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства";
		
	СтруктураЗапросов.Вставить("Поступление_Остатки_УдалениеВременныхТаблиц", ТекстЗапроса+";");

	
КонецПроцедуры

Процедура ДобавитьОбщиеЗапросы(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство КАК ОсновноеСредство,
		|	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
		|	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьОсновныхСредствДоДокумента
		|ИЗ
		|	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
		|			&МоментДокумента,
		|			ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|					ИЗ
		|						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
		|				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
	
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаСтоимостьОсновныхСредствДоДокумента", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.Период,
		|	ПериодыРегистраторыСреза.Регистратор,
		|	ПериодыРегистраторыСреза.ОсновноеСредство,
		|	абс_ОсновныеСредстваРЖД.Организация,
		|	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
		|	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
		|	абс_ОсновныеСредстваРЖД.МОЛ,
		|	абс_ОсновныеСредстваРЖД.Состояние,
		|	абс_ОсновныеСредстваРЖД.СчетУчета,
		|	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
		|	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
		|	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СчетЗатрат,
		|	абс_ОсновныеСредстваРЖД.Субконто1,
		|	абс_ОсновныеСредстваРЖД.Субконто2,
		|	абс_ОсновныеСредстваРЖД.Субконто3,
		|	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
		|	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
		|	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
		|	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
		|	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновныхСредствРЖД
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(абс_ОсновныеСредстваРЖД.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(абс_ОсновныеСредстваРЖД.Период) КАК Период
		|		ИЗ
		|			ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|				ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|					И (абс_ОсновныеСредстваРЖД.Период <= &Период)
		|					И (абс_ОсновныеСредстваРЖД.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|			ПО ПериодыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|				И ПериодыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|		ПО ПериодыРегистраторыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|			И ПериодыРегистраторыСреза.Регистратор = абс_ОсновныеСредстваРЖД.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
		|	ВложенныйЗапрос.Стоимость + ЕСТЬNULL(СтоимостьОсновныхСредствДоДокумента.Стоимость, 0) КАК Сумма,
		|	ВложенныйЗапрос.Амортизация + ЕСТЬNULL(СтоимостьОсновныхСредствДоДокумента.Амортизация, 0) КАК Амортизация
		|ПОМЕСТИТЬ НоваяСтоимостьОсновныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|		СУММА(ТабличнаяЧастьОсновныеСредства.Стоимость) КАК Стоимость,
		|		СУММА(ТабличнаяЧастьОсновныеСредства.Амортизация) КАК Амортизация
		|	ИЗ
		|		ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТабличнаяЧастьОсновныеСредства.ОсновноеСредство) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредствДоДокумента КАК СтоимостьОсновныхСредствДоДокумента
		|		ПО ВложенныйЗапрос.ОсновноеСредство = СтоимостьОсновныхСредствДоДокумента.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаНоваяСтоимостьОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету) КАК ДатаПринятияКУчету,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Местонахождение) КАК Местонахождение,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.МОЛ) КАК МОЛ,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования) КАК СрокПолезногоИспользования,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения) КАК КоэффициентУскорения,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетУчета) КАК СчетУчета,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации) КАК СчетНачисленияАмортизации,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетЗатрат) КАК СчетЗатрат,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Субконто1) КАК Субконто1,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Субконто2) КАК Субконто2,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Субконто3) КАК Субконто3,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости) КАК СчетСниженияСтоимости,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.НачислятьАмортизацию) КАК НачислятьАмортизацию,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.ОКОФ) КАК ОКОФ,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.ГруппаОСРЖД) КАК ГруппаОСРЖД
		|ПОМЕСТИТЬ ИзменениеПараметровОсновныхСредств
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаИзменениеПараметровОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ТабличнаяЧастьОсновныеСредства.Стоимость,
		|	ТабличнаяЧастьОсновныеСредства.Амортизация
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|ГДЕ
		|	(ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
		|			ИЛИ ТабличнаяЧастьОсновныеСредства.Амортизация <> 0)";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаТаблица_абс_СтоимостьОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ИзменениеПараметровОсновныхСредств.ОсновноеСредство,
		|	&Организация,
		|	ИзменениеПараметровОсновныхСредств.ДатаПринятияКУчету,
		|	ИзменениеПараметровОсновныхСредств.Местонахождение,
		|	ИзменениеПараметровОсновныхСредств.МОЛ,
		|	ЕСТЬNULL(ПараметрыОсновныхСредствРЖД.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)) КАК Состояние,
		|	ИзменениеПараметровОсновныхСредств.СчетУчета,
		|	ВЫБОР
		|		КОГДА ИзменениеПараметровОсновныхСредств.СрокПолезногоИспользования = 0
		|			ТОГДА ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.СрокПолезногоИспользования, ЕСТЬNULL(ПараметрыОсновныхСредствРЖД.СрокПолезногоИспользования, 0))
		|		ИНАЧЕ ИзменениеПараметровОсновныхСредств.СрокПолезногоИспользования
		|	КОНЕЦ КАК СрокПолезногоИспользования,
		|	ИзменениеПараметровОсновныхСредств.НачислятьАмортизацию,
		|	ЕСТЬNULL(ПараметрыОсновныхСредствРЖД.МетодНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.Линейный)) КАК МетодНачисленияАмортизации,
		|	ИзменениеПараметровОсновныхСредств.СчетНачисленияАмортизации,
		|	ЕСТЬNULL(ПараметрыОсновныхСредствРЖД.ПервоначальнаяСтоимость, ЕСТЬNULL(НоваяСтоимостьОсновныхСредств.Сумма, 0)) КАК ПервоначальнаяСтоимость,
		|	ЕСТЬNULL(НоваяСтоимостьОсновныхСредств.Сумма, 0) КАК СправедливаяСтоимость,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(НоваяСтоимостьОсновныхСредств.Сумма, 0) * ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.ПроцентЛиквидационнойСтоимости, 0) / 100 КАК ЧИСЛО(15, 2)) КАК ЛиквидационнаяСтоимость,
		|	ИзменениеПараметровОсновныхСредств.СчетЗатрат,
		|	ИзменениеПараметровОсновныхСредств.Субконто1,
		|	ИзменениеПараметровОсновныхСредств.Субконто2,
		|	ИзменениеПараметровОсновныхСредств.Субконто3,
		|	ЕСТЬNULL(ПараметрыОсновныхСредствРЖД.ПредполагаемыйОбъемПродукции, 0) КАК ПредполагаемыйОбъемПродукции,
		|	ЕСТЬNULL(НоваяСтоимостьОсновныхСредств.Амортизация, 0) КАК СуммаНачисленнойАмортизации,
		|	ЕСТЬNULL(ПараметрыОсновныхСредствРЖД.УбытокОтОбесценения, 0) КАК УбытокОтОбесценения,
		|	ИзменениеПараметровОсновныхСредств.КоэффициентУскорения,
		|	ИзменениеПараметровОсновныхСредств.СчетСниженияСтоимости
		|ИЗ
		|	ИзменениеПараметровОсновныхСредств КАК ИзменениеПараметровОсновныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствРЖД КАК ПараметрыОсновныхСредствРЖД
		|		ПО ИзменениеПараметровОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредствРЖД.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоваяСтоимостьОсновныхСредств КАК НоваяСтоимостьОсновныхСредств
		|		ПО ИзменениеПараметровОсновныхСредств.ОсновноеСредство = НоваяСтоимостьОсновныхСредств.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеОКОФГруппОСРЖД КАК абс_СоответствиеОКОФГруппОСРЖД
		|		ПО ИзменениеПараметровОсновныхСредств.ОКОФ = абс_СоответствиеОКОФГруппОСРЖД.ОКОФ
		|			И ИзменениеПараметровОсновныхСредств.ГруппаОСРЖД = абс_СоответствиеОКОФГруппОСРЖД.ГруппаОСРЖД";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.СчетУчета КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК СубконтоДт1,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ТабличнаяЧастьОсновныеСредства.КоррСчет КАК СчетКт,
		|	ВидыСубконтоСчетов.ВидСубконто1 КАК ВидСубконтоКт1,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто1 КАК СубконтоКт1,
		|	ВидыСубконтоСчетов.ВидСубконто2 КАК ВидСубконтоКт2,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто2 КАК СубконтоКт2,
		|	ВидыСубконтоСчетов.ВидСубконто3 КАК ВидСубконтоКт3,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто3 КАК СубконтоКт3,
		|	ТабличнаяЧастьОсновныеСредства.Стоимость КАК Сумма,
		|	&ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
		|ГДЕ
		|	ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.КоррСчет,
		|	ВидыСубконтоСчетов.ВидСубконто1,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто1,
		|	ВидыСубконтоСчетов.ВидСубконто2,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто2,
		|	ВидыСубконтоСчетов.ВидСубконто3,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто3,
		|	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ТабличнаяЧастьОсновныеСредства.Амортизация,
		|	&ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
		|ГДЕ
		|	ТабличнаяЧастьОсновныеСредства.Амортизация <> 0";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД", ТекстЗапроса+";");
		
    ТекстЗапроса = 
		"УНИЧТОЖИТЬ СтоимостьОсновныхСредствДоДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПараметрыОсновныхСредствРЖД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НоваяСтоимостьОсновныхСредств
		|;
		
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИзменениеПараметровОсновныхСредств";
		
	СтруктураЗапросов.Вставить("Поступление_УдалениеВременныхТаблиц", ТекстЗапроса+";");

КонецПроцедуры









////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////// Старый алгоритм проведения (не используется) ////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс проведения документов

Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка.ДокументОснование);
	
	ТекстыЗапросов = Новый СписокЗначений;
	
	ТекстыЗапросов.Добавить(абс_МеждународныйУчетОСРЖД.ТекстЗапросаВидыСубконтоСчетов("ВидыСубконтоСчетов"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличнаяЧастьОсновныеСредства(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаНесуммовыеПараметрыОсновныхСредств(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаНовыйПараметрыОсновныхСредств(), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС("ТабличнаяЧастьОсновныеСредства", "Период", "ПараметрыОсновныхСредств"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаСтараяСтоимостьОсновныхСредств(), "");

	
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД(), "Таблица_абс_ОсновныеСредстваРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_СтоимостьОСРЖД(), "Таблица_абс_СтоимостьОСРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_МеждународныйОСРЖД(), "Таблица_абс_МеждународныйОСРЖД");
	
	абс_ПроведениеДокументов.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапросов, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// Функции, возвращающие тексты запросов для инициализации данных документа

Функция ОбщийЗапрос()
	
	Возврат "ВЫБРАТЬ
	        |	абс_МеждународныйОСРЖД.Ссылка КАК Счет,
	        |	абс_МеждународныйОСРЖДВидыСубконто1.ВидСубконто КАК ВидСубконто1,
	        |	абс_МеждународныйОСРЖДВидыСубконто2.ВидСубконто КАК ВидСубконто2,
	        |	абс_МеждународныйОСРЖДВидыСубконто.ВидСубконто КАК ВидСубконто3
	        |ПОМЕСТИТЬ ВидыСубконтоСчетов
	        |ИЗ
	        |	ПланСчетов.абс_МеждународныйОСРЖД.ВидыСубконто КАК абс_МеждународныйОСРЖДВидыСубконто
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.абс_МеждународныйОСРЖД КАК абс_МеждународныйОСРЖД
	        |		ПО абс_МеждународныйОСРЖДВидыСубконто.Ссылка = абс_МеждународныйОСРЖД.Ссылка,
	        |	ПланСчетов.абс_МеждународныйОСРЖД.ВидыСубконто КАК абс_МеждународныйОСРЖДВидыСубконто1,
	        |	ПланСчетов.абс_МеждународныйОСРЖД.ВидыСубконто КАК абс_МеждународныйОСРЖДВидыСубконто2
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ОсновноеСредство,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ДатаПринятияКУчету,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МестонахождениеОбъекта,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МОЛ,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СрокПолезногоИспользования,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоэффициентУскорения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Стоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СправедливаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ЛиквидационнаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.УбытокОтОбесценения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетУчета,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетЗатрат,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто3,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетСниженияСтоимости,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.НачислятьАмортизацию,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МетодНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Состояние,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСчет,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто3
	        |ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
	        |ИЗ
	        |	Документ.абс_ПоступлениеОСРЖД.ОсновныеСредства КАК абс_ПоступлениеОСРЖДОсновныеСредства
	        |ГДЕ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Ссылка = &Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету,
	        |	ТабличнаяЧастьОсновныеСредства.МестонахождениеОбъекта,
	        |	ТабличнаяЧастьОсновныеСредства.МОЛ,
	        |	ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования,
	        |	ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.СчетЗатрат,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто1,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто2,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости,
	        |	ТабличнаяЧастьОсновныеСредства.НачислятьАмортизацию,
	        |	ТабличнаяЧастьОсновныеСредства.МетодНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	ТабличнаяЧастьОсновныеСредства.Состояние
	        |ПОМЕСТИТЬ НесуммовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.Стоимость) КАК Стоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации) КАК СуммаНачисленнойАмортизации,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СправедливаяСтоимость) КАК СправедливаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.ЛиквидационнаяСтоимость) КАК ЛиквидационнаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.УбытокОтОбесценения) КАК УбытокОтОбесценения
	        |ПОМЕСТИТЬ НовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	НесуммовыеПараметрыОсновныхСредств КАК НесуммовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ПО НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство = ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	абс_ОсновныеСредстваРЖД.Период,
	        |	абс_ОсновныеСредстваРЖД.Регистратор,
	        |	абс_ОсновныеСредстваРЖД.ОсновноеСредство,
	        |	абс_ОсновныеСредстваРЖД.Организация,
	        |	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
	        |	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
	        |	абс_ОсновныеСредстваРЖД.МОЛ,
	        |	абс_ОсновныеСредстваРЖД.Состояние,
	        |	абс_ОсновныеСредстваРЖД.СчетУчета,
	        |	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
	        |	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
	        |	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СчетЗатрат,
	        |	абс_ОсновныеСредстваРЖД.Субконто1,
	        |	абс_ОсновныеСредстваРЖД.Субконто2,
	        |	абс_ОсновныеСредстваРЖД.Субконто3,
	        |	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
	        |	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
	        |	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
	        |ПОМЕСТИТЬ ПараметрыОсновныхСредств
	        |ИЗ
	        |	РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство КАК ОсновноеСредство,
	        |	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
	        |	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
	        |ПОМЕСТИТЬ СтараяСтоимостьОсновныхСредств
	        |ИЗ
	        |	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
	        |			&МоментДокумента,
	        |			ОсновноеСредство В
	        |					(ВЫБРАТЬ
	        |						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |					ИЗ
	        |						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
	        |				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	&Период,
	        |	НовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	&Организация,
	        |	НовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НовыеПараметрыОсновныхСредств.МОЛ,
	        |	НовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НовыеПараметрыОсновныхСредств.СуммаНачисленнойАмортизации + ЕСТЬNULL(СтараяСтоимостьОсновныхСредств.Амортизация, 0) КАК СуммаНакопленнойАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СправедливаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.СправедливаяСтоимость, 0) КАК СправедливаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.ЛиквидационнаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.УбытокОтОбесценения + ЕСТЬNULL(ПараметрыОсновныхСредств.УбытокОтОбесценения, 0) КАК УбытокОтОбесценения,
	        |	НовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НовыеПараметрыОсновныхСредств.Субконто1,
	        |	НовыеПараметрыОсновныхСредств.Субконто2,
	        |	НовыеПараметрыОсновныхСредств.Субконто3,
	        |	НовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НовыеПараметрыОсновныхСредств.Состояние
	        |ПОМЕСТИТЬ Таблица_абс_ОсновныеСредстваРЖД
	        |ИЗ
	        |	НовыеПараметрыОсновныхСредств КАК НовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтараяСтоимостьОсновныхСредств КАК СтараяСтоимостьОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = СтараяСтоимостьОсновныхСредств.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации КАК Амортизация
	        |ПОМЕСТИТЬ Таблица_абс_СтоимостьОСРЖД
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |ГДЕ
	        |	(ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |			ИЛИ ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета КАК СчетДт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК СубконтоДт1,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет КАК СчетКт,
	        |	ВидыСубконтоСчетов.ВидСубконто1 КАК ВидСубконтоКт1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1 КАК СубконтоКт1,
	        |	ВидыСубконтоСчетов.ВидСубконто2 КАК ВидСубконтоКт2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2 КАК СубконтоКт2,
	        |	ВидыСубконтоСчетов.ВидСубконто3 КАК ВидСубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3 КАК СубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость КАК Сумма,
	        |	&ДокументОснование КАК ПервичныйДокумент
	        |ПОМЕСТИТЬ Таблица_абс_МеждународныйОСРЖД
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет,
	        |	ВидыСубконтоСчетов.ВидСубконто1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1,
	        |	ВидыСубконтоСчетов.ВидСубконто2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2,
	        |	ВидыСубконтоСчетов.ВидСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	&ДокументОснование
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства,
	        |	ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0";
	
КонецФункции

Функция ТекстЗапросаТабличнаяЧастьОсновныеСредства()
	
	Возврат "ВЫБРАТЬ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ОсновноеСредство,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ДатаПринятияКУчету,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МестонахождениеОбъекта,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МОЛ,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СрокПолезногоИспользования,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоэффициентУскорения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Стоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СправедливаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ЛиквидационнаяСтоимость,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.УбытокОтОбесценения,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетУчета,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетЗатрат,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Субконто3,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.СчетСниженияСтоимости,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.НачислятьАмортизацию,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.МетодНачисленияАмортизации,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Состояние,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСчет,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто1,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто2,
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.КоррСубконто3
	        |ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
	        |ИЗ
	        |	Документ.абс_ПоступлениеОСРЖД.ОсновныеСредства КАК абс_ПоступлениеОСРЖДОсновныеСредства
	        |ГДЕ
	        |	абс_ПоступлениеОСРЖДОсновныеСредства.Ссылка = &Ссылка
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаСтараяСтоимостьОсновныхСредств()
	
	Возврат "ВЫБРАТЬ
	        |	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство КАК ОсновноеСредство,
	        |	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
	        |	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
	        |ПОМЕСТИТЬ СтараяСтоимостьОсновныхСредств
	        |ИЗ
	        |	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
	        |			&МоментДокумента,
	        |			ОсновноеСредство В
	        |					(ВЫБРАТЬ
	        |						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |					ИЗ
	        |						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
	        |				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаНесуммовыеПараметрыОсновныхСредств()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету,
	        |	ТабличнаяЧастьОсновныеСредства.МестонахождениеОбъекта,
	        |	ТабличнаяЧастьОсновныеСредства.МОЛ,
	        |	ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования,
	        |	ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.СчетЗатрат,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто1,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто2,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости,
	        |	ТабличнаяЧастьОсновныеСредства.НачислятьАмортизацию,
	        |	ТабличнаяЧастьОсновныеСредства.МетодНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.ПредполагаемыйОбъемПродукции,
	        |	ТабличнаяЧастьОсновныеСредства.Состояние
	        |ПОМЕСТИТЬ НесуммовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаНовыйПараметрыОсновныхСредств()
	
	Возврат "ВЫБРАТЬ
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.Стоимость) КАК Стоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации) КАК СуммаНачисленнойАмортизации,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.СправедливаяСтоимость) КАК СправедливаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.ЛиквидационнаяСтоимость) КАК ЛиквидационнаяСтоимость,
	        |	СУММА(ТабличнаяЧастьОсновныеСредства.УбытокОтОбесценения) КАК УбытокОтОбесценения
	        |ПОМЕСТИТЬ НовыеПараметрыОсновныхСредств
	        |ИЗ
	        |	НесуммовыеПараметрыОсновныхСредств КАК НесуммовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ПО НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство = ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НесуммовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НесуммовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	НесуммовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НесуммовыеПараметрыОсновныхСредств.МОЛ,
	        |	НесуммовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто2,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто3,
	        |	НесуммовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НесуммовыеПараметрыОсновныхСредств.Состояние,
	        |	НесуммовыеПараметрыОсновныхСредств.Субконто1,
	        |	НесуммовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НесуммовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НесуммовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	&Период,
	        |	НовыеПараметрыОсновныхСредств.ОсновноеСредство,
	        |	&Организация,
	        |	НовыеПараметрыОсновныхСредств.ДатаПринятияКУчету,
	        |	НовыеПараметрыОсновныхСредств.МестонахождениеОбъекта,
	        |	НовыеПараметрыОсновныхСредств.МОЛ,
	        |	НовыеПараметрыОсновныхСредств.СрокПолезногоИспользования,
	        |	НовыеПараметрыОсновныхСредств.КоэффициентУскорения,
	        |	НовыеПараметрыОсновныхСредств.СуммаНачисленнойАмортизации + ЕСТЬNULL(СтараяСтоимостьОсновныхСредств.Амортизация, 0) КАК СуммаНакопленнойАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СправедливаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.СправедливаяСтоимость, 0) КАК СправедливаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.ЛиквидационнаяСтоимость + ЕСТЬNULL(ПараметрыОсновныхСредств.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	        |	НовыеПараметрыОсновныхСредств.УбытокОтОбесценения + ЕСТЬNULL(ПараметрыОсновныхСредств.УбытокОтОбесценения, 0) КАК УбытокОтОбесценения,
	        |	НовыеПараметрыОсновныхСредств.СчетУчета,
	        |	НовыеПараметрыОсновныхСредств.СчетНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.СчетЗатрат,
	        |	НовыеПараметрыОсновныхСредств.Субконто1,
	        |	НовыеПараметрыОсновныхСредств.Субконто2,
	        |	НовыеПараметрыОсновныхСредств.Субконто3,
	        |	НовыеПараметрыОсновныхСредств.СчетСниженияСтоимости,
	        |	НовыеПараметрыОсновныхСредств.НачислятьАмортизацию,
	        |	НовыеПараметрыОсновныхСредств.МетодНачисленияАмортизации,
	        |	НовыеПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
	        |	НовыеПараметрыОсновныхСредств.Состояние
	        |ИЗ
	        |	НовыеПараметрыОсновныхСредств КАК НовыеПараметрыОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтараяСтоимостьОсновныхСредств КАК СтараяСтоимостьОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = СтараяСтоимостьОсновныхСредств.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
	        |		ПО НовыеПараметрыОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_СтоимостьОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации КАК Амортизация
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |ГДЕ
	        |	(ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |			ИЛИ ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0)
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_МеждународныйОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета КАК СчетДт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК СубконтоДт1,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет КАК СчетКт,
	        |	ВидыСубконтоСчетов.ВидСубконто1 КАК ВидСубконтоКт1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1 КАК СубконтоКт1,
	        |	ВидыСубконтоСчетов.ВидСубконто2 КАК ВидСубконтоКт2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2 КАК СубконтоКт2,
	        |	ВидыСубконтоСчетов.ВидСубконто3 КАК ВидСубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3 КАК СубконтоКт3,
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость КАК Сумма,
	        |	&ДокументОснование КАК ПервичныйДокумент
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСчет,
	        |	ВидыСубконтоСчетов.ВидСубконто1,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто1,
	        |	ВидыСубконтоСчетов.ВидСубконто2,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто2,
	        |	ВидыСубконтоСчетов.ВидСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.КоррСубконто3,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации,
	        |	&ДокументОснование
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства,
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
	        |		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.СуммаНачисленнойАмортизации <> 0
			|;
			|";
	
КонецФункции

////////////////////////////////// Старый алгоритм проведения (не используется) ////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////