
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(Параметры) Тогда
		
		Если Параметры.Свойство("СписокЭлементов") Тогда
			ОтборЭлементов = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ОтборЭлементов.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
			ОтборЭлементов.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
			ОтборЭлементов.ПравоеЗначение 	= Параметры.СписокЭлементов;
			ОтборЭлементов.Использование	= Истина;
			
			
		КонецЕсли;		
	//КонецЕсли;
		
	ИмяРеквизитаИспользуется = ?(ПараметрыСеанса.абс_ПользовательДЗО, "абс_ЦФОИспользуетсяДЗО", "абс_ЦФОИспользуется");
	
	ОтборИспользуется = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборИспользуется.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ОтборИспользуется.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяРеквизитаИспользуется);
	ОтборИспользуется.ПравоеЗначение 	= Истина;
	ОтборИспользуется.Использование		= Истина;	
	
КонецПроцедуры
