Перем мТаблицаДвижений Экспорт; // Таблица движений


// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// АБС ВСТАВКА 20120206
	//Отключаем контроль не используемых статей для счетов прошедщих согласование
	//Инициатор: Калымкин
	ТекРегистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ОтключитьКонтрольНеиспользуемыхСтатей = Ложь;
	
	Если ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.абс_СчетНаОплату") Тогда
		
		ТекСтатусСчета = ТекРегистратор.СтатусСчета;
		
		СписокСтатусов = абс_БизнесПроцессы.ПолучитьМассивСтатусовСчетаНаОплату();
		
		ИндексСтатусаСогласован = СписокСтатусов.Найти(Перечисления.абсСтатусыСчетов.Согласован);
		ИндексТекСтатуса 		= СписокСтатусов.Найти(ТекСтатусСчета);
		
		Если ИндексТекСтатуса > ИндексСтатусаСогласован Тогда
			ОтключитьКонтрольНеиспользуемыхСтатей = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	// АБС ВСТАВКА 20120206 КОНЕЦ	
	
	Если НЕ Константы.абс_ОтключитьКонтрольНеиспользуемыхБС.Получить() И НЕ ОтключитьКонтрольНеиспользуемыхСтатей Тогда
		
		ТабСтатей = ЭтотОбъект.Выгрузить(,"Сценарий,СтатьяОборотов");
		
		ТабСтатей.Свернуть("Сценарий,СтатьяОборотов");
		
		Сч = 0;
		Пока Сч < ТабСтатей.Количество() Цикл
			СтрокаТЗ = ТабСтатей[Сч];
			Если Не СтрокаТЗ.Сценарий.абс_КонтрольЗаполненияАналитик Тогда
				ТабСтатей.Удалить(СтрокаТЗ);
			Иначе
				Сч = Сч+ 1;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ТабСтатей.Количество() = 0 Тогда
			
			
			Запрос = Новый Запрос(
			"
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтатьиОборотовПоБюджетам.Ссылка,
			|	СтатьиОборотовПоБюджетам.Код
			|ИЗ
			|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам,
			|	ВТ_СтатьяОборотов КАК ВТ_СтатьяОборотов
			|ГДЕ
			|	СтатьиОборотовПоБюджетам.Ссылка В (СписокСтатей)
			|	И (НЕ СтатьиОборотовПоБюджетам.абс_Используется)");
			
			Запрос.УстановитьПараметр("СписокСтатей", ТабСтатей.ВыгрузитьКолонку("СтатьяОборотов"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Количество() > 0 Тогда
				
				ТекстСообщения = "Контроль бюджетных статей при проведении документа:" + Символы.ПС + ТекРегистратор + Символы.ПС;
				
				Пока Выборка.Следующий() Цикл
					ТекстСообщения = ТекстСообщения + " статья " + Выборка.Ссылка + " код (" + Выборка.Код + ") не используется" + Символы.ПС;
					
					ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
		
	Если НЕ Константы.абс_ОтключитьКонтрольАналитикОборотовБюджетов.Получить() Тогда
		
		ТекстСообщения = "Контроль заполнения аналитик при проведении документа:" + Символы.ПС + ТекРегистратор + Символы.ПС;
			
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			Если Не ЗаписьНабора.Сценарий.абс_КонтрольЗаполненияАналитик Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ЗаписьНабора.СтатьяОборотов) Тогда				
				ТекстСообщения = ТекстСообщения + "Регистр Обороты бюджетов,строка " + ЗаписьНабора.НомерСтроки + " не заполнена статья оборотов.";	
				Отказ = Истина;
			КонецЕсли;
			
			Если ЗаписьНабора.Сценарий.абс_КонтрольЗаполненияАналитик И (
				НЕ ЗначениеЗаполнено(ЗаписьНабора.абс_ЦФУ) 				ИЛИ 
				НЕ ЗначениеЗаполнено(ЗаписьНабора.ЦФО) 					ИЛИ
				НЕ ЗначениеЗаполнено(ЗаписьНабора.абс_ТипКонтрагента) 	ИЛИ
				НЕ ЗначениеЗаполнено(ЗаписьНабора.Организация))  Тогда
				
				ТекстСообщения = ТекстСообщения + "Регистр Обороты бюджетов,строка " + ЗаписьНабора.НомерСтроки + " не заполнены бюджетные аналитики (ЦФУ, ЦФО, Организация, Тип контрагента)";
				Отказ = Истина;
				Продолжить;  //АБС Коломиец 11032012
			КонецЕсли;
			
			//АБС Коломиец+ 11032012
			Если НЕ Константы.абс_ОтключитьКонтрольНеиспользуемыхЦФОЦФУ.Получить()
				  И ЗаписьНабора.Период > '20120101000000' Тогда
				
				Если ЗаписьНабора.абс_ЦФУ.абс_НеиспользованиеВДокументах Тогда
					
					ТекстСообщения = ТекстСообщения + "Регистр Обороты бюджетов,строка " + ЗаписьНабора.НомерСтроки +  " ЦФУ "  + ЗаписьНабора.абс_ЦФУ.Наименование + " код (" + СокрЛП(ЗаписьНабора.абс_ЦФУ.Код) + ") не используется" + Символы.ПС;
					Отказ = Истина;
					
				КонецЕсли;
				
				Если (ПараметрыСеанса.абс_ПользовательДЗО И Не ЗаписьНабора.ЦФО.абс_ЦФОИспользуетсяДЗО)
				 Или (Не ПараметрыСеанса.абс_ПользовательДЗО И Не ЗаписьНабора.ЦФО.абс_ЦФОИспользуется) Тогда
					
					ТекстСообщения = ТекстСообщения + "Регистр Обороты бюджетов,строка " + ЗаписьНабора.НомерСтроки +  " ЦФО "  + ЗаписьНабора.ЦФО.Наименование + " код (" + СокрЛП(ЗаписьНабора.ЦФО.Код) + ") не используется" + Символы.ПС;
					Отказ = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			//АБС Коломиец-		
			
		КонецЦикла;
		
		Если Отказ Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// АБС ВСТАВКА Фролов 20121026
	Если Константы.абс_КонтрольГодаВБюджетныхАналитиках.Получить() Тогда
		
		Если ЭтотОбъект.Количество() > 0 Тогда
						
			ТекПериод = НачалоГода(ЭтотОбъект[0].Период);
			
			абс_ИсключитьДатуИзГрафикаПоставок = Константы.абс_ИсключитьДатуИзГрафикаПоставок.Получить();
			Если (ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
					или ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.АвансовыйОтчет")) 
				и ЗначениеЗаполнено(абс_ИсключитьДатуИзГрафикаПоставок) 
				и НачалоДня(ЭтотОбъект[0].Период) = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок) Тогда
				
				ТекПериод = НачалоДня(абс_ИсключитьДатуИзГрафикаПоставок)-1; 
				
			КонецЕсли;
				           			            			
			СтатьиБС = ЭтотОбъект.Выгрузить(, "СтатьяОборотов");
			СтатьиБС.Свернуть("СтатьяОборотов", "");
			
			абс_Бюджетирование.ПроверитьСтатьюОборотовПоГодуИспользования(СтатьиБС.ВыгрузитьКолонку("СтатьяОборотов"), ТекПериод, ТекРегистратор, Отказ);
			
			
			СпЦФО = ЭтотОбъект.Выгрузить(, "ЦФО");
			СпЦФО.Свернуть("ЦФО", "");
			
			абс_Бюджетирование.ПроверитьЦФОПоГодуИспользования(СпЦФО.ВыгрузитьКолонку("ЦФО"), ТекПериод, ТекРегистратор, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	// АБС ВСТАВКА Фролов 20121026 КОНЕЦ
			
КонецПроцедуры