Функция ПревышенЛимитПоЦФО(Сумма,ЦФО) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Сумма > абс_ЛимитыПоБлокам.Сумма
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьПревышение
		|ИЗ
		|	РегистрСведений.абс_ЛимитыПоБлокам КАК абс_ЛимитыПоБлокам
		|ГДЕ
		|	абс_ЛимитыПоБлокам.ЦФО = &ЦФО";
		
	Запрос.УстановитьПараметр("Сумма", Сумма);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЕстьПревышение; 
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции 
