////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	ДоступностьКлючевыхЗаписей = Истина;
	Если Параметры.Свойство("ДоступностьКлючевыхЗаписей") Тогда
		ДоступностьКлючевыхЗаписей = Параметры.ДоступностьКлючевыхЗаписей;
	КонецЕсли;
	
	ЭтаФорма.Элементы.ПредметСделки.Доступность 							= ДоступностьКлючевыхЗаписей;	
	ЭтаФорма.Элементы.ЯвляетсяТоваромМировойБиржевойТорговли.Доступность 	= ДоступностьКлючевыхЗаписей;	
	
	ОтметкаЗаполнения = Мин(НЕ Макс(ЗначениеЗаполнено(Запись.КодПоОКВЭД),ЗначениеЗаполнено(Запись.КодПоОКП),ЗначениеЗаполнено(Запись.КодПоТНВЭД)),Не ДоступностьКлючевыхЗаписей);
	
	ЭтаФорма.Элементы.КодПоОквэд.АвтоОтметкаНезаполненного 	= ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКП.АвтоОтметкаНезаполненного 	= ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоТНВЭД.АвтоОтметкаНезаполненного 	= ОтметкаЗаполнения;
	
КонецПроцедуры
