
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.абс_СтатусыНоменклатуры.Подготовка;
		Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ДатаСеанса = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовСтатейЗатрат.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
	НаборЗаписей.Отбор.СтатьяЗатрат.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ДатаСеанса;
	Запись.СтатьяЗатрат = Ссылка;
	Запись.Исполнитель = ТекПользователь;	
	Запись.СтатусСтатьиЗатрат = Статус;	
	Запись.Комментарий = ПричинаИзмененияСтатуса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.абс_СтатусыНоменклатуры.Подготовка;
	Комментарий = "";
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры
