

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

НаборЗаписей = РегистрыСведений.абс_ПаспортаСделки.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ЭтотОбъект.ДоговорКонтрагента);
НаборЗаписей.Отбор.ПаспортСделка.Установить(ЭтотОбъект.Ссылка);
НаборЗаписей.Прочитать();
НаборЗаписей.Очистить();
НоваяЗапись = НаборЗаписей.Добавить();
НоваяЗапись.ДоговорКонтрагента= ДоговорКонтрагента;
НоваяЗапись.ПаспортСделка =  Ссылка;
НаборЗаписей.Записать(Истина);
//	Движение.ДоговорКонтрагента = ДоговорКонтрагента;
//	Движение.ПаспортСделка = Ссылка;

//	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	НаборЗаписей = РегистрыСведений.абс_ПаспортаСделки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ЭтотОбъект.ДоговорКонтрагента);
	НаборЗаписей.Отбор.ПаспортСделка.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

