Перем СоответствиеТиповИПредставлений;
Перем ТипыДокументов;
Перем ПараметрыСФ;
Перем мВалютаРегламентированногоУчета;

#Если Клиент Тогда

// Формирование отчета в виде табличного документа.
// Параметры:
//  ТабличныйДокумент - макет отчета.
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	МассивПрефиксовДляРИБиОрганизации = ОбщегоНазначения.СформироватьМассивПрефиксовДляРИБИОрганизации(Организация);
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("Макет");

	// Вывод шапки
	Секция = Макет.ПолучитьОбласть("Шапка");
	Секция.Параметры.НачалоПериода = Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
	Секция.Параметры.КонецПериода = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	Секция.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное;
	ТабличныйДокумент.Вывести(Секция);
	
	// Выполнение запроса.
	Результат = ПодготовитьОтчетКВыводуНаПечать();
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Результат.Пустой() Тогда
	
		Секция = Макет.ПолучитьОбласть("Строка");
		УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(
			ТабличныйДокумент, , Строка(глЗначениеПеременной("глТекущийПользователь")));
	    Возврат;
		
	КонецЕсли; 
	
	Секция  = Макет.ПолучитьОбласть("Строка");
	Счетчик = 1;
	
	Если НЕ СформироватьОтчетПоСтандартнойФорме И ГруппироватьПоКонтрагентам Тогда
		
		//Режим построения с группировкой по контрагенту
		СекцияКонтрагента = Макет.ПолучитьОбласть("Контрагент");
		ГруппировкаПоКонтрагенту = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
		
		Пока ГруппировкаПоКонтрагенту.Следующий() Цикл
			СекцияКонтрагента.Параметры.Заполнить(ГруппировкаПоКонтрагенту);
			ТабличныйДокумент.Вывести(СекцияКонтрагента,1);
		
			СчетФактура = ГруппировкаПоКонтрагенту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока СчетФактура.Следующий() Цикл
				
			Если ТипЗнч(СчетФактура.СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный") 
				И СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
					Документ = СчетФактура.Выбрать();
					Пока Документ.Следующий() Цикл
						Секция.Параметры.НПП = Счетчик;
						ВыводСтрокиКорректировочногоСФ(Документ, Секция, МассивПрефиксовДляРИБиОрганизации);
						ТабличныйДокумент.Вывести(Секция, 2);
						Счетчик = Счетчик + 1;
					КонецЦикла;
				Иначе
					Секция.Параметры.НПП = Счетчик;
					ВыводСтроки(СчетФактура, Секция, МассивПрефиксовДляРИБиОрганизации);
					ТабличныйДокумент.Вывести(Секция, 2);
					Счетчик = Счетчик + 1;
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		
	Иначе
		
		// Простой режим
		СчетФактура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока СчетФактура.Следующий() Цикл
			
			Если ТипЗнч(СчетФактура.СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный") 
				И СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
					Документ = СчетФактура.Выбрать();
					Пока Документ.Следующий() Цикл
						Секция.Параметры.НПП = Счетчик;
						ВыводСтрокиКорректировочногоСФ(Документ, Секция, МассивПрефиксовДляРИБиОрганизации);
						ТабличныйДокумент.Вывести(Секция, 2);
						Счетчик = Счетчик + 1;
					КонецЦикла;
				Иначе
					Секция.Параметры.НПП = Счетчик;
					ВыводСтроки(СчетФактура, Секция, МассивПрефиксовДляРИБиОрганизации);
					ТабличныйДокумент.Вывести(Секция, 2);
					Счетчик = Счетчик + 1;
				КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТабличныйДокумент.ПовторятьПриПечатиСтроки = ТабличныйДокумент.Области.Шапка;
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ТабличныйДокумент, , Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры

// Функция вызывается из тела процедуры "Сформировать".
// Функция осуществляет первичную обработку результатов запроса к движениям регистра НДСПродажи,
// и по данным запроса заполняет таблицу значений, на основании которой, будет напечатана книга продаж
// Параметры:
// 	Результат - ссылка на результаты выполнения запроса к данным регистра "НДСПродажи"
//  МоментОпределенияНалоговойБазыНДС
Функция ПодготовитьОтчетКВыводуНаПечать()
	
	// Документы с реквизитом Предъявлен счет-фактура
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтрагентПоАО.Ссылка КАК АО,
	|	КонтрагентПоАО.СчетФактура КАК СчетФактура,
	|	КонтрагентПоАО.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_КонтрагентПоАО
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетТовары.СчетФактура КАК СчетФактура,
	|		АвансовыйОтчетТовары.Поставщик КАК Контрагент,
	|		АвансовыйОтчетТовары.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АвансовыйОтчетПрочее.СчетФактура,
	|		АвансовыйОтчетПрочее.Поставщик,
	|		АвансовыйОтчетПрочее.Ссылка
	|	ИЗ
	|		Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее) КАК КонтрагентПоАО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	АО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураПолученный.Ссылка КАК СчетФактура,
	|	СчетФактураПолученный.Ссылка.Дата КАК ДатаРегистрации,
	|	СчетФактураПолученный.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.СформированПриВводеНачальныхОстатковНДС
	|			ТОГДА СчетФактураПолученный.Ссылка.СуммаДокумента
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА СчетФактураПолученный.Ссылка.СуммаДокумента
	|		ИНАЧЕ СчетФактураПолученный.ДокументОснование.СуммаДокумента
	|	КОНЕЦ КАК СуммаДокумента,
	|	СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	СчетФактураПолученный.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА СчетФактураПолученный.Ссылка.Контрагент
	|		КОГДА СчетФактураПолученный.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|			ТОГДА ВложенныйЗапрос.Контрагент
	|		ИНАЧЕ СчетФактураПолученный.ДокументОснование.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	СчетФактураПолученный.ДокументОснование.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА (НЕ СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс))
	|					И СчетФактураПолученный.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|				ИЛИ СчетФактураПолученный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|			ТОГДА ИСТИНА
	|		КОГДА (НЕ СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс))
	|				И (СчетФактураПолученный.ДокументОснование.ДоговорКонтрагента.Владелец ЕСТЬ NULL 
	|					ИЛИ СчетФактураПолученный.ДокументОснование.СуммаДокумента ЕСТЬ NULL )
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОпределитьПараметрыСчетаФактуры,
	|	СчетФактураПолученный.ДокументОснование.Дата КАК ДокументОснованиеДата,
	|	СчетФактураПолученный.ДокументОснование.Номер КАК ДокументОснованиеНомер,
	|	СчетФактураПолученный.Ссылка.ВидСчетаФактуры КАК ВидСчетаФактуры
	|
	|ПОМЕСТИТЬ ВТ_НеКорректировочныеСФ
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентПоАО КАК ВложенныйЗапрос
	|		ПО СчетФактураПолученный.ДокументОснование = ВложенныйЗапрос.АО
	|			И СчетФактураПолученный.Ссылка = ВложенныйЗапрос.СчетФактура
	|ГДЕ
	|	(НЕ СчетФактураПолученный.Ссылка.ПометкаУдаления)
	|	И СчетФактураПолученный.Ссылка.Дата >= &НачалоПериода
	|	И СчетФактураПолученный.Ссылка.Дата <= &КонецПериода
	|	И СчетФактураПолученный.Ссылка.Организация = &Организация
	|	И (НЕ СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировочныйСчетФактураПолученный.Ссылка,
	|	КорректировочныйСчетФактураПолученный.Ссылка.Дата КАК Дата,
	|	КорректировочныйСчетФактураПолученный.ДокументОснование,
	|	КорректировочныйСчетФактураПолученный.Ссылка.СуммаУвеличение КАК СуммаУвеличение,
	|	КорректировочныйСчетФактураПолученный.Ссылка.СуммаУменьшение КАК СуммаУменьшение,
	|	КорректировочныйСчетФактураПолученный.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	КорректировочныйСчетФактураПолученный.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	КорректировочныйСчетФактураПолученный.Ссылка.Контрагент КАК Контрагент,
	|	КорректировочныйСчетФактураПолученный.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	КорректировочныйСчетФактураПолученный.ДокументОснование.Дата КАК ДокументОснованиеДата,
	|	КорректировочныйСчетФактураПолученный.ДокументОснование.Номер КАК ДокументОснованиеНомер,
	|	КорректировочныйСчетФактураПолученный.Ссылка.ВидСчетаФактуры КАК ВидСчетаФактуры
	|
	|ПОМЕСТИТЬ ВТ_КорректировочныеСФ
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК КорректировочныйСчетФактураПолученный
	|ГДЕ
	|	(НЕ КорректировочныйСчетФактураПолученный.Ссылка.ПометкаУдаления)
	|	И КорректировочныйСчетФактураПолученный.Ссылка.Дата >= &НачалоПериода
	|	И КорректировочныйСчетФактураПолученный.Ссылка.Дата <= &КонецПериода
	|	И КорректировочныйСчетФактураПолученный.Ссылка.Организация = &Организация
	|	И КорректировочныйСчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеестрСчетовФактур.СчетФактура КАК СчетФактура,
	|	РеестрСчетовФактур.ДатаРегистрации КАК ДатаРегистрации,
	|	РеестрСчетовФактур.ДатаВходящегоДокумента,
	|	РеестрСчетовФактур.НомерВходящегоДокумента,
	|	РеестрСчетовФактур.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РеестрСчетовФактур.ВалютаДокумента, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаРегламентированногоУчета
	|		ИНАЧЕ РеестрСчетовФактур.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|	РеестрСчетовФактур.Контрагент,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(РеестрСчетовФактур.Контрагент.НаименованиеПолное, 1, 250) = """"
	|			ТОГДА РеестрСчетовФактур.Контрагент.Наименование
	|		ИНАЧЕ ПОДСТРОКА(РеестрСчетовФактур.Контрагент.НаименованиеПолное, 1, 250)
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	РеестрСчетовФактур.ДокументОснование,
	|	РеестрСчетовФактур.ДокументОснованиеДата,
	|	РеестрСчетовФактур.ДокументОснованиеНомер,
	|	РеестрСчетовФактур.ОпределитьПараметрыСчетаФактуры КАК ОпределитьПараметрыСчетаФактуры,
	|	РеестрСчетовФактур.ВидСчетаФактуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_НеКорректировочныеСФ.СчетФактура,
	|		ВТ_НеКорректировочныеСФ.ДатаРегистрации,
	|		ВТ_НеКорректировочныеСФ.ДокументОснование,
	|		ВТ_НеКорректировочныеСФ.СуммаДокумента,
	|		ВТ_НеКорректировочныеСФ.ДатаВходящегоДокумента,
	|		ВТ_НеКорректировочныеСФ.НомерВходящегоДокумента,
	|		ВТ_НеКорректировочныеСФ.Контрагент,
	|		ВТ_НеКорректировочныеСФ.ВалютаДокумента КАК ВалютаДокумента,
	|		ВТ_НеКорректировочныеСФ.ОпределитьПараметрыСчетаФактуры,
	|		ВТ_НеКорректировочныеСФ.ДокументОснованиеДата,
	|		ВТ_НеКорректировочныеСФ.ДокументОснованиеНомер,
	|		ВТ_НеКорректировочныеСФ.ВидСчетаФактуры
	|	ИЗ
	|		ВТ_НеКорректировочныеСФ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГТДИмпортТовары.Ссылка,
	|		ГТДИмпортТовары.Ссылка.Дата,
	|		ГТДИмпортТовары.Ссылка,
	|		СУММА(ГТДИмпортТовары.ФактурнаяСтоимость),
	|		NULL,
	|		ГТДИмпортТовары.Ссылка.НомерГТД,
	|		ГТДИмпортТовары.Ссылка.Контрагент,
	|		ГТДИмпортТовары.Ссылка.ВалютаДокумента,
	|		ЛОЖЬ,
	|		ГТДИмпортТовары.Ссылка.Дата,
	|		ГТДИмпортТовары.Ссылка.Номер,
	|		ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.ПустаяСсылка) КАК ВидСчетаФактуры
	|	ИЗ
	|		Документ.ГТДИмпорт.Товары КАК ГТДИмпортТовары
	|	ГДЕ
	|		(НЕ ГТДИмпортТовары.Ссылка.ПометкаУдаления)
	|		И ГТДИмпортТовары.Ссылка.Дата >= &НачалоПериода
	|		И ГТДИмпортТовары.Ссылка.Дата <= &КонецПериода
	|		И ГТДИмпортТовары.Ссылка.Организация = &Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГТДИмпортТовары.Ссылка,
	|		ГТДИмпортТовары.Ссылка.Дата,
	|		ГТДИмпортТовары.Ссылка.НомерГТД,
	|		ГТДИмпортТовары.Ссылка.Контрагент,
	|		ГТДИмпортТовары.Ссылка.Номер,
	|		ГТДИмпортТовары.Ссылка.ВалютаДокумента,
	|		ГТДИмпортТовары.Ссылка,
	|		ГТДИмпортТовары.Ссылка.Дата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировочныйСчетФактураПолученный.Ссылка,
	|		КорректировочныйСчетФактураПолученный.Дата,
	|		КорректировочныйСчетФактураПолученный.ДокументОснование,
	|		-КорректировочныйСчетФактураПолученный.СуммаУменьшение,
	|		КорректировочныйСчетФактураПолученный.ДатаВходящегоДокумента,
	|		КорректировочныйСчетФактураПолученный.НомерВходящегоДокумента,
	|		КорректировочныйСчетФактураПолученный.Контрагент,
	|		КорректировочныйСчетФактураПолученный.ВалютаДокумента,
	|		ЛОЖЬ КАК ОпределитьПараметрыСчетаФактуры,
	|		КорректировочныйСчетФактураПолученный.ДокументОснованиеДата,
	|		КорректировочныйСчетФактураПолученный.ДокументОснованиеНомер,
	|		КорректировочныйСчетФактураПолученный.ВидСчетаФактуры
	|	ИЗ
	|		ВТ_КорректировочныеСФ КАК КорректировочныйСчетФактураПолученный
	|	ГДЕ
	|		КорректировочныйСчетФактураПолученный.Ссылка.СуммаУменьшение > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировочныйСчетФактураПолученный.Ссылка,
	|		КорректировочныйСчетФактураПолученный.Дата,
	|		КорректировочныйСчетФактураПолученный.ДокументОснование,
	|		КорректировочныйСчетФактураПолученный.СуммаУвеличение,
	|		КорректировочныйСчетФактураПолученный.ДатаВходящегоДокумента,
	|		КорректировочныйСчетФактураПолученный.НомерВходящегоДокумента,
	|		КорректировочныйСчетФактураПолученный.Контрагент,
	|		КорректировочныйСчетФактураПолученный.ВалютаДокумента,
	|		ЛОЖЬ КАК ОпределитьПараметрыСчетаФактуры,
	|		КорректировочныйСчетФактураПолученный.ДокументОснованиеДата,
	|		КорректировочныйСчетФактураПолученный.ДокументОснованиеНомер,
	|		КорректировочныйСчетФактураПолученный.ВидСчетаФактуры
	|	ИЗ
	|		ВТ_КорректировочныеСФ КАК КорректировочныйСчетФактураПолученный
	|	ГДЕ
	|		(КорректировочныйСчетФактураПолученный.Ссылка.СуммаУвеличение > 0
	|				ИЛИ КорректировочныйСчетФактураПолученный.Ссылка.СуммаУвеличение = 0
	|					И КорректировочныйСчетФактураПолученный.Ссылка.СуммаУменьшение = 0)) КАК РеестрСчетовФактур
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтбиратьПоКонтрагенту
	|				ТОГДА РеестрСчетовФактур.Контрагент В ИЕРАРХИИ (&КонтрагентДляОтбора)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРегистрации,
	|	РеестрСчетовФактур.ДатаВходящегоДокумента
	|ИТОГИ
	|	СУММА(СуммаДокумента),
	|	МАКСИМУМ(ОпределитьПараметрыСчетаФактуры),
	|	МАКСИМУМ(ВидСчетаФактуры)
	|ПО СчетФактура";
	
	Если не СформироватьОтчетПоСтандартнойФорме и ГруппироватьПоКонтрагентам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"
			|ИТОГИ
			|	СУММА(СуммаДокумента),
			|	МАКСИМУМ(ОпределитьПараметрыСчетаФактуры),
			|	МАКСИМУМ(ВидСчетаФактуры)
			|ПО СчетФактура",
			"
			|ИТОГИ
			|	СУММА(СуммаДокумента),
			|	МАКСИМУМ(ОпределитьПараметрыСчетаФактуры),
			|	МАКСИМУМ(ВидСчетаФактуры)
			|ПО	Контрагент, СчетФактура");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УПОРЯДОЧИТЬ ПО", "УПОРЯДОЧИТЬ ПО
		|КонтрагентНаименование, ");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ОтбиратьПоКонтрагенту", НЕ СформироватьОтчетПоСтандартнойФорме 
		И ОтбиратьПоКонтрагенту 
		И НЕ КонтрагентДляОтбора = Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("КонтрагентДляОтбора", КонтрагентДляОтбора);

	Возврат Запрос.Выполнить();

КонецФункции

Процедура ВыводСтроки(СчетФактура, Секция, МассивПрефиксовДляРИБиОрганизации)

	Если СчетФактура.ОпределитьПараметрыСчетаФактуры Тогда
		ПолучитьПараметрыСчетаФактуры(СчетФактура.СчетФактура, мВалютаРегламентированногоУчета, ПараметрыСФ);
		Секция.Параметры.Сумма = ?(ПараметрыСФ.СуммаДокумента = 0, 
			"", Формат(ПараметрыСФ.СуммаДокумента, "ЧЦ=19; ЧДЦ=2") + " " + Строка(ПараметрыСФ.ВалютаДокумента));
		ПредставлениеОснования = "";
		УстановитьПараметры = Истина;
		
		Документ = СчетФактура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Документ.Следующий() Цикл
			Если УстановитьПараметры Тогда
				УстановитьПараметры = Ложь;
				Секция.Параметры.Заполнить(Документ);
			КонецЕсли;					
			Если ПустаяСтрока(ПредставлениеОснования) Тогда
				Секция.Параметры.ДокументОснование = Документ.ДокументОснование;
			Иначе
				ПредставлениеОснования = ПредставлениеОснования + Символы.ПС;
			КонецЕсли; 
					
			ПредставлениеТипа = ПолучитьПредставлениеПоТипу(ТипЗнч(Документ.ДокументОснование));
					
			Если Не ПредставлениеТипа = Неопределено Тогда
				ПредставлениеОснования = ПредставлениеОснования + ПредставлениеТипа 
					+ " № " + ОбщегоНазначения.ПолучитьНомерНаПечать(Документ.ДокументОснование, МассивПрефиксовДляРИБиОрганизации)
					+ " от "+ Формат(Документ.ДокументОснованиеДата, "ДФ=dd.MM.yyyy") + " г.";
			Иначе	
				ПредставлениеОснования = ПредставлениеОснования + Строка(Документ.ДокументОснование);
			КонецЕсли; 
			Секция.Параметры.ПредставлениеОснования = ПредставлениеОснования;
					
			Секция.Параметры.Контрагент = ПараметрыСФ.Контрагент;
			Если ЗначениеЗаполнено(ПараметрыСФ.Контрагент)  Тогда
				Секция.Параметры.КонтрагентНаименование = ?(ПустаяСтрока(ПараметрыСФ.Контрагент.НаименованиеПолное),
					СокрЛП(ПараметрыСФ.Контрагент), СокрЛП(ПараметрыСФ.Контрагент.НаименованиеПолное));
			КонецЕсли; 
			Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.ГТДИмпорт") Тогда
			    Секция.Параметры.ДатаНомер = "ГТД № " + Документ.НомерВходящегоДокумента;
			Иначе
				Секция.Параметры.ДатаНомер = Формат(Документ.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy") 
					+ ", № " + Документ.НомерВходящегоДокумента;
			КонецЕсли; 
		КонецЦикла;
		
	Иначе
		
		Документ = СчетФактура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		УстановитьПараметры = Истина;
		ПредставлениеОснования = "";
		
		Пока Документ.Следующий() Цикл
			Если УстановитьПараметры Тогда
				УстановитьПараметры = Ложь;
				Секция.Параметры.Заполнить(Документ);
				Секция.Параметры.Сумма = ?(СчетФактура.СуммаДокумента = 0, 
					"", Формат(СчетФактура.СуммаДокумента, "ЧЦ=19; ЧДЦ=2") + " " + Строка(Документ.ВалютаДокумента));
			КонецЕсли;					
			Если ПустаяСтрока(ПредставлениеОснования) Тогда
				Секция.Параметры.ДокументОснование = Документ.ДокументОснование;
			Иначе
				ПредставлениеОснования = ПредставлениеОснования+Символы.ПС;
			КонецЕсли; 
			ПредставлениеТипа = ПолучитьПредставлениеПоТипу(ТипЗнч(Документ.ДокументОснование));
			Если Не ПредставлениеТипа = Неопределено Тогда
				ПредставлениеОснования = ПредставлениеОснования + ПредставлениеТипа 
					+ " № " + ОбщегоНазначения.ПолучитьНомерНаПечать(
					Новый Структура("Организация, Номер", Организация, Документ.ДокументОснованиеНомер), 
					МассивПрефиксовДляРИБиОрганизации) 
					+ " от " + Формат(Документ.ДокументОснованиеДата, "ДФ=dd.MM.yyyy") + " г.";
			Иначе	
				ПредставлениеОснования = ПредставлениеОснования + Строка(Документ.ДокументОснование);
			КонецЕсли; 
			Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.ГТДИмпорт") Тогда
			    Секция.Параметры.ДатаНомер = "ГТД № " + Документ.НомерВходящегоДокумента;
			Иначе
				Секция.Параметры.ДатаНомер = Формат(Документ.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy") 
					+ ", № " + Документ.НомерВходящегоДокумента;
			КонецЕсли; 
		КонецЦикла;
		Секция.Параметры.ПредставлениеОснования = ПредставлениеОснования;

	КонецЕсли;
	
КонецПроцедуры

Процедура ВыводСтрокиКорректировочногоСФ(СчетФактура, Секция, МассивПрефиксовДляРИБиОрганизации)
	
	ДатаСФ = Формат(СчетФактура.ДокументОснованиеДата, "ДФ=dd.MM.yyyy");
	ПредставлениеТипа = ПолучитьПредставлениеПоТипу(ТипЗнч(СчетФактура.ДокументОснование));
	Если Не ПредставлениеТипа = Неопределено Тогда
		ПредставлениеОснования = ПредставлениеТипа + " № " + СчетФактура.ДокументОснованиеНомер + " от " + ДатаСФ + " г.";
	Иначе	
		ПредставлениеОснования = Строка(СчетФактура.ДокументОснование);
	КонецЕсли; 
	
	Секция.Параметры.Заполнить(СчетФактура);
	Секция.Параметры.Сумма = ?(СчетФактура.СуммаДокумента = 0, 
		"", Формат(СчетФактура.СуммаДокумента, "ЧЦ=19; ЧДЦ=2") + " " + Строка(СчетФактура.ВалютаДокумента));
	Секция.Параметры.ДокументОснование      = СчетФактура.ДокументОснование;
	Секция.Параметры.ПредставлениеОснования = ПредставлениеОснования;
	Секция.Параметры.ДатаНомер = Формат(СчетФактура.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy") 
		+ ", № " + СчетФактура.НомерВходящегоДокумента;
	
КонецПроцедуры 

Функция ПолучитьПредставлениеПоТипу(ТипЗначения)

	Представление = СоответствиеТиповИПредставлений[ТипЗначения];
	Если Представление = Неопределено Тогда
		Если ТипЗначения <> ТипЗнч(Неопределено) И Документы.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
			Представление = Метаданные.НайтиПоТипу(ТипЗначения).Представление();
		Иначе
			Представление = Неопределено;	
		КонецЕсли; 
		
		СоответствиеТиповИПредставлений.Вставить(ТипЗначения, Представление);
	КонецЕсли; 
	
	Возврат Представление; 

КонецФункции
          
// Для переданного в качестве параметра счета-факутры выданного, получает для него
// ключевые сведения: Контрагент, Договор, Сумма и др., которые содержатся в 
// документе основнии.
//
// Параметры:
//  СчетФактура  - счет-фактура для которого нужно определить параметры
//  Результат - структура в которой возвращаются значения параметров
//
Процедура ПолучитьПараметрыСчетаФактуры(СчетФактура, мВалютаРегламентированногоУчета, Результат) Экспорт

	Результат = Новый Структура("Организация, Контрагент, Договор, СуммаДокумента, ВалютаДокумента, 
		|СуммаУвеличение, СуммаУменьшение, СуммаНДСУвеличение, СуммаНДСУменьшение, СуммаНДСДокумента, СчетФактураБезНДС, НомерСчетаФактурыПродавца, 
		|БланкСтрогойОтчетности, РеквизитыОснований");
		
	Результат.СуммаДокумента 		= 0;
	Результат.СуммаНДСДокумента 	= 0;
	Результат.СуммаУвеличение 		= 0;
	Результат.СуммаНДСУвеличение 	= 0;
	Результат.СуммаУменьшение 		= 0;
	Результат.СуммаНДСУменьшение 	= 0;
	Результат.СчетФактураБезНДС 	= 0;
	
	РеквизитыОснований = Новый ТаблицаЗначений;
	РеквизитыОснований.Колонки.Добавить("ДокументОснование");
	РеквизитыОснований.Колонки.Добавить("НомерИсходногоДокумента", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	РеквизитыОснований.Колонки.Добавить("ДатаИсходногоДокумента", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РеквизитыОснований.Колонки.Добавить("УчитыватьИсправлениеИсходногоДокумента", Новый ОписаниеТипов("Булево"));
	РеквизитыОснований.Колонки.Добавить("НомерИсправленияИсходногоДокумента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	РеквизитыОснований.Колонки.Добавить("ДатаИсправленияИсходногоДокумента", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РеквизитыОснований.Колонки.Добавить("СуммаУвеличение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 2)));
	РеквизитыОснований.Колонки.Добавить("СуммаУменьшение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 2)));
	РеквизитыОснований.Колонки.Добавить("СуммаНДСУвеличение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 2)));
	РеквизитыОснований.Колонки.Добавить("СуммаНДСУменьшение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 2)));
	Результат.РеквизитыОснований = РеквизитыОснований;
	
	Если ТипЗнч(СчетФактура)= Тип("ДокументСсылка.СчетФактураПолученный")
		ИЛИ ТипЗнч(СчетФактура)= Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Ссылка = СчетФактура;
	Иначе
		Ссылка = СчетФактура.Ссылка;
	КонецЕсли; 
	
	ЭтоПолученныйСФ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		ЭтоПолученныйСФ = Истина;
		Если СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс 
			И СчетФактура.ДокументыОснования.Количество() > 0
			И ТипЗнч(СчетФактура.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
			// Реквизиты заново не определяются, получаются из счета-фактуры
			Результат.Вставить("Организация"	, СчетФактура.Организация);
			Результат.Вставить("Контрагент"		, СчетФактура.Контрагент);
			Результат.Вставить("Договор"		, СчетФактура.ДоговорКонтрагента);
			Результат.Вставить("ВалютаДокумента", СчетФактура.ВалютаДокумента);
			Результат.Вставить("СуммаДокумента"	, СчетФактура.СуммаДокумента);
			Возврат;
		КонецЕсли;			
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") 
		И (СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс 
		ИЛИ СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу) Тогда
		// Реквизиты заново не определяются, получаются из счета-фактуры
		Результат.Вставить("Организация"	, СчетФактура.Организация);
		Результат.Вставить("Контрагент"		, СчетФактура.Контрагент);
		Результат.Вставить("Договор"		, СчетФактура.ДоговорКонтрагента);
		Результат.Вставить("ВалютаДокумента", СчетФактура.ВалютаДокумента);
		Результат.Вставить("СуммаДокумента"	, СчетФактура.СуммаДокумента);
		Возврат;
	КонецЕслИ;
	
	ДокументыОснования = ttk_ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(СчетФактура.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"), Истина);
	
	ТипыОснований = Новый Соответствие();
	Для каждого Основание Из ДокументыОснования Цикл
		Если не ЗначениеЗаполнено(Основание) Тогда
			Продолжить;			
		КонецЕсли; 

		МассивДокументов = ТипыОснований[ТипЗнч(Основание)];
		
		Если МассивДокументов = Неопределено Тогда
			МассивДокументов = новый Массив();
			ТипыОснований.Вставить(ТипЗнч(Основание),МассивДокументов);
		КонецЕсли; 
		
		МассивДокументов.Добавить(Основание);
	КонецЦикла; 
	
	Если ТипыОснований.Количество() = 0 Тогда
		// ТЧ оснований не заполнена, параметры определить нельзя
		Возврат;
	КонецЕсли;
	
	Корректировка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", мВалютаРегламентированногоУчета);
	
	Для каждого ТипОснования Из ТипыОснований Цикл
		ТипДокументаОснования	= ТипОснования.Ключ;
		ДокументыОснования		= ТипОснования.Значение;
	    ТекстЗапроса = "";
		
		Если ТипДокументаОснования = Тип("ДокументСсылка.КорректировкаРеализации") 
			ИЛИ ТипДокументаОснования = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			Корректировка = Истина;
		КонецЕсли;
		
		Если ТипДокументаОснования = Тип("ДокументСсылка.ВводНачальныхОстатковНДС") Тогда
			// Для данного документа применяется специфический запрос для расчета параметров счета-фактуры
			Запрос.УстановитьПараметр("ДокументОснованиеВНО", ДокументыОснования);

			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ВводНачальныхОстатковНДСДанныеПоСФ.Ссылка.Организация КАК Организация,
			|	ВводНачальныхОстатковНДСДанныеПоСФ.Контрагент,
			|	ВводНачальныхОстатковНДСДанныеПоСФ.ДоговорКонтрагента КАК Договор,
			|	СУММА(ВводНачальныхОстатковНДСДанныеПоСФ.СуммаБезНДС + ВводНачальныхОстатковНДСДанныеПоСФ.НДС) КАК СуммаДокумента,
			|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента
			|ИЗ
			|	Документ.ВводНачальныхОстатковНДС.ДанныеПоСФ КАК ВводНачальныхОстатковНДСДанныеПоСФ
			|ГДЕ
			|	ВводНачальныхОстатковНДСДанныеПоСФ.Ссылка В(&ДокументОснованиеВНО)
			|	И ВводНачальныхОстатковНДСДанныеПоСФ.СчетФактура = &ТекущийДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ВводНачальныхОстатковНДСДанныеПоСФ.Контрагент,
			|	ВводНачальныхОстатковНДСДанныеПоСФ.ДоговорКонтрагента,
			|	ВводНачальныхОстатковНДСДанныеПоСФ.Ссылка.Организация";
		
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			// Для данного документа применяется специфический запрос для расчета параметров счета-фактуры
			Запрос.УстановитьПараметр("ДокументОснованиеАО", ДокументыОснования);
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АвансовыйОтчетПрочее.Ссылка.Организация КАК Организация,
			|	АвансовыйОтчетПрочее.Поставщик КАК Контрагент,
			|	НЕОПРЕДЕЛЕНО КАК Договор,
			|	СУММА(ВЫБОР
			|			КОГДА АвансовыйОтчетПрочее.Ссылка.СуммаВключаетНДС
			|				ТОГДА АвансовыйОтчетПрочее.Сумма
			|			ИНАЧЕ АвансовыйОтчетПрочее.Сумма + АвансовыйОтчетПрочее.СуммаНДС
			|		КОНЕЦ) КАК СуммаДокумента,
			|	АвансовыйОтчетПрочее.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
			|	СУММА(АвансовыйОтчетПрочее.СуммаНДС) КАК СуммаНДСДокумента,
			|	ВЫБОР
			|		КОГДА АвансовыйОтчетПрочее.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК ЕстьНДС,
			|	АвансовыйОтчетПрочее.БланкСтрогойОтчетности КАК БланкСтрогойОтчетности
			|ИЗ
			|	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
			|ГДЕ
			|	АвансовыйОтчетПрочее.Ссылка В(&ДокументОснованиеАО)
			|	И АвансовыйОтчетПрочее.ПредъявленСФ
			|	И АвансовыйОтчетПрочее.СчетФактура = &ТекущийДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	АвансовыйОтчетПрочее.Поставщик,
			|	АвансовыйОтчетПрочее.Ссылка.ВалютаДокумента,
			|	АвансовыйОтчетПрочее.Ссылка.Организация,
			|	ВЫБОР
			|		КОГДА АвансовыйОтчетПрочее.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ,
			|	АвансовыйОтчетПрочее.БланкСтрогойОтчетности
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	АвансовыйОтчетТовары.Ссылка.Организация,
			|	АвансовыйОтчетТовары.Поставщик,
			|	НЕОПРЕДЕЛЕНО,
			|	СУММА(ВЫБОР
			|			КОГДА АвансовыйОтчетТовары.Ссылка.СуммаВключаетНДС
			|				ТОГДА АвансовыйОтчетТовары.Сумма
			|			ИНАЧЕ АвансовыйОтчетТовары.Сумма + АвансовыйОтчетТовары.СуммаНДС
			|		КОНЕЦ),
			|	АвансовыйОтчетТовары.Ссылка.ВалютаДокумента,
			|	СУММА(АвансовыйОтчетТовары.СуммаНДС),
			|	ВЫБОР
			|		КОГДА АвансовыйОтчетТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ,
			|	ЛОЖЬ
			|ИЗ
			|	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
			|ГДЕ
			|	АвансовыйОтчетТовары.Ссылка В(&ДокументОснованиеАО)
			|	И АвансовыйОтчетТовары.СчетФактура = &ТекущийДокумент
			|	И АвансовыйОтчетТовары.ПредъявленСФ
			|
			|СГРУППИРОВАТЬ ПО
			|	АвансовыйОтчетТовары.Поставщик,
			|	АвансовыйОтчетТовары.Ссылка.ВалютаДокумента,
			|	АвансовыйОтчетТовары.Ссылка.Организация,
			|	ВЫБОР
			|		КОГДА АвансовыйОтчетТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ";
		
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
			И ТипЗнч(Ссылка) <> Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			
			// Для данного документа применяется специфический запрос для расчета параметров счета-фактуры
			Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОтчетКомиссионераОПродажах.Ссылка КАК Ссылка,
			|	ОтчетКомиссионераОПродажах.Ссылка.Организация КАК Организация,
			|	ОтчетКомиссионераОПродажах.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
			|	ОтчетКомиссионераОПродажах.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
			|ПОМЕСТИТЬ ВТ_ОтчетКомиссионераОПродажах
			|ИЗ
			|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажах
			|ГДЕ
			|	ОтчетКомиссионераОПродажах.Ссылка В(&ДокументыОснования)
			|	И ОтчетКомиссионераОПродажах.ВыставленСФ
			|	И ОтчетКомиссионераОПродажах.СчетФактура = &ТекущийДокумент
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОтчетКомиссионераОПродажахТовары.КлючСтроки КАК КлючСтроки,
			|	СУММА(ОтчетКомиссионераОПродажахТовары.Сумма) КАК Сумма,
			|	СУММА(ОтчетКомиссионераОПродажахТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ВЫБОР
			|			КОГДА ОтчетКомиссионераОПродажахТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК ЕстьНДС
			|ПОМЕСТИТЬ ВТ_Суммы
			|ИЗ
			|	ВТ_ОтчетКомиссионераОПродажах КАК ВТ_ОтчетКомиссионераОПродажах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
			|		ПО ВТ_ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахТовары.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомиссионераОПродажахТовары.КлючСтроки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	КлючСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОтчетКомиссионераОПродажах.Организация КАК Организация,
			|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Контрагент,
			|	ОтчетКомиссионераОПродажахПокупатели.ДатаСФ КАК Дата,
			|	ВЫБОР
			|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Покупатель = ОтчетКомиссионераОПродажахПокупатели.Ссылка.Контрагент
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
			|	КОНЕЦ КАК Договор,
			|	СУММА(ВТ_Суммы.Сумма + ВЫБОР
			|			КОГДА ВТ_ОтчетКомиссионераОПродажах.СуммаВключаетНДС
			|				ТОГДА 0
			|			ИНАЧЕ ВТ_Суммы.СуммаНДС
			|		КОНЕЦ) КАК СуммаДокумента,
			|	СУММА(ВТ_Суммы.СуммаНДС) КАК СуммаНДСДокумента,
			|	ВТ_ОтчетКомиссионераОПродажах.ВалютаДокумента КАК ВалютаДокумента,
			|	СУММА(ВТ_Суммы.ЕстьНДС) КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ИЗ
			|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтчетКомиссионераОПродажах КАК ВТ_ОтчетКомиссионераОПродажах
			|		ПО ОтчетКомиссионераОПродажахПокупатели.Ссылка = ВТ_ОтчетКомиссионераОПродажах.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Суммы КАК ВТ_Суммы
			|		ПО ОтчетКомиссионераОПродажахПокупатели.КлючСтроки = ВТ_Суммы.КлючСтроки
			|ГДЕ
			|	ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &ТекущийДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ОтчетКомиссионераОПродажах.ВалютаДокумента,
			|	ОтчетКомиссионераОПродажахПокупатели.Покупатель,
			|	ВТ_ОтчетКомиссионераОПродажах.Организация,
			|	ВЫБОР
			|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Покупатель = ОтчетКомиссионераОПродажахПокупатели.Ссылка.Контрагент
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
			|	КОНЕЦ,
			|	ОтчетКомиссионераОПродажахПокупатели.ДатаСФ";
			
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			
			Запрос.УстановитьПараметр("ДокументОснование_КорректировкаПоступления", ДокументыОснования);
			Запрос.УстановитьПараметр("КорректировочныйСчетФактура", СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный);
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	КорректировкаПоступленияТовары.Ссылка КАК Документ,
			|	КорректировкаПоступленияТовары.Ссылка.Организация КАК Организация,
			|	КорректировкаПоступленияТовары.Ссылка.Контрагент КАК Контрагент,
			|	КорректировкаПоступленияТовары.Ссылка.ДоговорКонтрагента КАК Договор,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения > 0
			|								ТОГДА КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаПоступленияТовары.Сумма + КорректировкаПоступленияТовары.СуммаНДС - (КорректировкаПоступленияТовары.СуммаДоИзменения + КорректировкаПоступленияТовары.СуммаНДСДоИзменения) > 0
			|							ТОГДА КорректировкаПоступленияТовары.Сумма + КорректировкаПоступленияТовары.СуммаНДС - (КорректировкаПоступленияТовары.СуммаДоИзменения + КорректировкаПоступленияТовары.СуммаНДСДоИзменения)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаУвеличение,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения < 0
			|								ТОГДА КорректировкаПоступленияТовары.СуммаДоИзменения - КорректировкаПоступленияТовары.Сумма
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаПоступленияТовары.Сумма + КорректировкаПоступленияТовары.СуммаНДС - (КорректировкаПоступленияТовары.СуммаДоИзменения + КорректировкаПоступленияТовары.СуммаНДСДоИзменения) < 0
			|							ТОГДА КорректировкаПоступленияТовары.СуммаДоИзменения + КорректировкаПоступленияТовары.СуммаНДСДоИзменения - (КорректировкаПоступленияТовары.Сумма + КорректировкаПоступленияТовары.СуммаНДС)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаУменьшение,
			|	КорректировкаПоступленияТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения > 0
			|					ТОГДА КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаНДСУвеличение,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения < 0
			|					ТОГДА КорректировкаПоступленияТовары.СуммаНДСДоИзменения - КорректировкаПоступленияТовары.СуммаНДС
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаНДСУменьшение,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА ВЫБОР
			|					КОГДА КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС
			|						ТОГДА КорректировкаПоступленияТовары.Сумма
			|					ИНАЧЕ КорректировкаПоступленияТовары.Сумма + КорректировкаПоступленияТовары.СуммаНДС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС
			|					ТОГДА КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения
			|				ИНАЧЕ КорректировкаПоступленияТовары.Сумма + КорректировкаПоступленияТовары.СуммаНДС - (КорректировкаПоступленияТовары.СуммаДоИзменения + КорректировкаПоступленияТовары.СуммаНДСДоИзменения)
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаДокумента,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА КорректировкаПоступленияТовары.СуммаНДС
			|		ИНАЧЕ КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения
			|	КОНЕЦ КАК СуммаНДСДокумента,
			|	ВЫБОР
			|		КОГДА КорректировкаПоступленияТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ПОМЕСТИТЬ КорректировкаПоступления
			|ИЗ
			|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
			|ГДЕ
			|	КорректировкаПоступленияТовары.Ссылка В(&ДокументОснование_КорректировкаПоступления)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КорректировкаПоступленияУслуги.Ссылка,
			|	КорректировкаПоступленияУслуги.Ссылка.Организация,
			|	КорректировкаПоступленияУслуги.Ссылка.Контрагент,
			|	КорректировкаПоступленияУслуги.Ссылка.ДоговорКонтрагента,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияУслуги.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения > 0
			|								ТОГДА КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаПоступленияУслуги.Сумма + КорректировкаПоступленияУслуги.СуммаНДС - (КорректировкаПоступленияУслуги.СуммаДоИзменения + КорректировкаПоступленияУслуги.СуммаНДСДоИзменения) > 0
			|							ТОГДА КорректировкаПоступленияУслуги.Сумма + КорректировкаПоступленияУслуги.СуммаНДС - (КорректировкаПоступленияУслуги.СуммаДоИзменения + КорректировкаПоступленияУслуги.СуммаНДСДоИзменения)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияУслуги.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения < 0
			|								ТОГДА КорректировкаПоступленияУслуги.СуммаДоИзменения - КорректировкаПоступленияУслуги.Сумма
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаПоступленияУслуги.Сумма + КорректировкаПоступленияУслуги.СуммаНДС - (КорректировкаПоступленияУслуги.СуммаДоИзменения + КорректировкаПоступленияУслуги.СуммаНДСДоИзменения) < 0
			|							ТОГДА КорректировкаПоступленияУслуги.СуммаДоИзменения + КорректировкаПоступленияУслуги.СуммаНДСДоИзменения - (КорректировкаПоступленияУслуги.Сумма + КорректировкаПоступленияУслуги.СуммаНДС)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ,
			|	КорректировкаПоступленияУслуги.Ссылка.ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения > 0
			|					ТОГДА КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения < 0
			|					ТОГДА КорректировкаПоступленияУслуги.СуммаНДСДоИзменения - КорректировкаПоступленияУслуги.СуммаНДС
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА ВЫБОР
			|					КОГДА КорректировкаПоступленияУслуги.Ссылка.СуммаВключаетНДС
			|						ТОГДА КорректировкаПоступленияУслуги.Сумма
			|					ИНАЧЕ КорректировкаПоступленияУслуги.Сумма + КорректировкаПоступленияУслуги.СуммаНДС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаПоступленияУслуги.Ссылка.СуммаВключаетНДС
			|					ТОГДА КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения
			|				ИНАЧЕ КорректировкаПоступленияУслуги.Сумма + КорректировкаПоступленияУслуги.СуммаНДС - (КорректировкаПоступленияУслуги.СуммаДоИзменения + КорректировкаПоступленияУслуги.СуммаНДСДоИзменения)
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА КорректировкаПоступленияУслуги.СуммаНДС
			|		ИНАЧЕ КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КорректировкаПоступленияУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ,
			|	ЛОЖЬ
			|ИЗ
			|	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
			|ГДЕ
			|	КорректировкаПоступленияУслуги.Ссылка В(&ДокументОснование_КорректировкаПоступления)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КорректировкаПоступления.Документ,
			|	КорректировкаПоступления.Организация,
			|	КорректировкаПоступления.Контрагент,
			|	КорректировкаПоступления.Договор,
			|	КорректировкаПоступления.ВалютаДокумента,
			|	СУММА(КорректировкаПоступления.СуммаУвеличение) КАК СуммаУвеличение,
			|	СУММА(КорректировкаПоступления.СуммаУменьшение) КАК СуммаУменьшение,
			|	СУММА(КорректировкаПоступления.СуммаНДСУвеличение) КАК СуммаНДСУвеличение,
			|	СУММА(КорректировкаПоступления.СуммаНДСУменьшение) КАК СуммаНДСУменьшение,
			|	СУММА(КорректировкаПоступления.СуммаДокумента) КАК СуммаДокумента,
			|	СУММА(КорректировкаПоступления.СуммаНДСДокумента) КАК СуммаНДСДокумента,
			|	СУММА(КорректировкаПоступления.ЕстьНДС) КАК ЕстьНДС
			|ИЗ
			|	КорректировкаПоступления КАК КорректировкаПоступления
			|
			|СГРУППИРОВАТЬ ПО
			|	КорректировкаПоступления.Организация,
			|	КорректировкаПоступления.Контрагент,
			|	КорректировкаПоступления.Договор,
			|	КорректировкаПоступления.Документ,
			|	КорректировкаПоступления.ВалютаДокумента
			|ИТОГИ
			|	СУММА(СуммаУвеличение),
			|	СУММА(СуммаУменьшение),
			|	СУММА(СуммаНДСУвеличение),
			|	СУММА(СуммаНДСУменьшение),
			|	СУММА(СуммаДокумента),
			|	СУММА(СуммаНДСДокумента),
			|	СУММА(ЕстьНДС)
			|ПО
			|	ОБЩИЕ";
			
			Если СчетФактура.Исправление Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДоИзменения", "ДоКорректировки");
			КонецЕсли;
			
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			
			Запрос.УстановитьПараметр("ДокументОснование_КорректировкаРеализации", ДокументыОснования);
			Запрос.УстановитьПараметр("КорректировочныйСчетФактура", СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	КорректировкаРеализацииТовары.Ссылка КАК Документ,
			|	КорректировкаРеализацииТовары.Ссылка.Организация КАК Организация,
			|	КорректировкаРеализацииТовары.Ссылка.Контрагент КАК Контрагент,
			|	КорректировкаРеализацииТовары.Ссылка.ДоговорКонтрагента КАК Договор,
			|	КорректировкаРеализацииТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения > 0
			|								ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС - (КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения) > 0
			|							ТОГДА КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС - (КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаУвеличение,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения < 0
			|								ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС - (КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения) < 0
			|							ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаУменьшение,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения > 0
			|					ТОГДА КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаНДСУвеличение,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения < 0
			|					ТОГДА КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаНДСУменьшение,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА ВЫБОР
			|					КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
			|						ТОГДА КорректировкаРеализацииТовары.Сумма
			|					ИНАЧЕ КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
			|					ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения
			|				ИНАЧЕ КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС - (КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения)
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаДокумента,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА КорректировкаРеализацииТовары.СуммаНДС
			|		ИНАЧЕ КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения
			|	КОНЕЦ КАК СуммаНДСДокумента,
			|	ВЫБОР
			|		КОГДА КорректировкаРеализацииТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ПОМЕСТИТЬ КорректировкаРеализации
			|ИЗ
			|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
			|ГДЕ
			|	КорректировкаРеализацииТовары.Ссылка В(&ДокументОснование_КорректировкаРеализации)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КорректировкаРеализацииУслуги.Ссылка,
			|	КорректировкаРеализацииУслуги.Ссылка.Организация,
			|	КорректировкаРеализацииУслуги.Ссылка.Контрагент,
			|	КорректировкаРеализацииУслуги.Ссылка.ДоговорКонтрагента,
			|	КорректировкаРеализацииУслуги.Ссылка.ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения > 0
			|								ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС - (КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения) > 0
			|							ТОГДА КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС - (КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
			|					ТОГДА ВЫБОР
			|							КОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения < 0
			|								ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС - (КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения) < 0
			|							ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС)
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения > 0
			|					ТОГДА КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения < 0
			|					ТОГДА КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА ВЫБОР
			|					КОГДА КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
			|						ТОГДА КорректировкаРеализацииУслуги.Сумма
			|					ИНАЧЕ КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
			|					ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения
			|				ИНАЧЕ КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС - (КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения)
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ &КорректировочныйСчетФактура
			|			ТОГДА КорректировкаРеализацииУслуги.СуммаНДС
			|		ИНАЧЕ КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА КорректировкаРеализацииУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ,
			|	ЛОЖЬ
			|ИЗ
			|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
			|ГДЕ
			|	КорректировкаРеализацииУслуги.Ссылка В(&ДокументОснование_КорректировкаРеализации)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КорректировкаРеализации.Документ,
			|	КорректировкаРеализации.Организация,
			|	КорректировкаРеализации.Контрагент,
			|	КорректировкаРеализации.Договор,
			|	КорректировкаРеализации.ВалютаДокумента,
			|	СУММА(КорректировкаРеализации.СуммаУвеличение) КАК СуммаУвеличение,
			|	СУММА(КорректировкаРеализации.СуммаУменьшение) КАК СуммаУменьшение,
			|	СУММА(КорректировкаРеализации.СуммаНДСУвеличение) КАК СуммаНДСУвеличение,
			|	СУММА(КорректировкаРеализации.СуммаНДСУменьшение) КАК СуммаНДСУменьшение,
			|	СУММА(КорректировкаРеализации.СуммаДокумента) КАК СуммаДокумента,
			|	СУММА(КорректировкаРеализации.СуммаНДСДокумента) КАК СуммаНДСДокумента,
			|	СУММА(КорректировкаРеализации.ЕстьНДС) КАК ЕстьНДС
			|ИЗ
			|	КорректировкаРеализации КАК КорректировкаРеализации
			|
			|СГРУППИРОВАТЬ ПО
			|	КорректировкаРеализации.Организация,
			|	КорректировкаРеализации.Контрагент,
			|	КорректировкаРеализации.Договор,
			|	КорректировкаРеализации.Документ,
			|	КорректировкаРеализации.ВалютаДокумента
			|ИТОГИ
			|	СУММА(СуммаУвеличение),
			|	СУММА(СуммаУменьшение),
			|	СУММА(СуммаНДСУвеличение),
			|	СУММА(СуммаНДСУменьшение),
			|	СУММА(СуммаДокумента),
			|	СУММА(СуммаНДСДокумента),
			|	СУММА(ЕстьНДС)
			|ПО
			|	ОБЩИЕ";
			
			Если СчетФактура.Исправление Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДоИзменения", "ДоКорректировки");
			КонецЕсли;

		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.НачислениеНДСпоСМРхозспособом") тогда 
			
			Запрос.УстановитьПараметр("ДокументОснование_НачислениеНДСпоСМРхозспособом", ДокументыОснования);
		
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	НачислениеНДСпоСМРхозспособом.Ссылка.Организация,
			|	НЕОПРЕДЕЛЕНО КАК Контрагент,
			|	НЕОПРЕДЕЛЕНО КАК Договор,
			|	СУММА(НачислениеНДСпоСМРхозспособом.СуммаБезНДС + НачислениеНДСпоСМРхозспособом.НДС) КАК СуммаДокумента,
			|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента,
			|	СУММА(НачислениеНДСпоСМРхозспособом.НДС) КАК СуммаНДСДокумента,
			|	1 КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ИЗ
			|	Документ.НачислениеНДСпоСМРхозспособом.СМРхозспособом КАК НачислениеНДСпоСМРхозспособом
			|ГДЕ
			|	НачислениеНДСпоСМРхозспособом.Ссылка В(&ДокументОснование_НачислениеНДСпоСМРхозспособом)
			|
			|СГРУППИРОВАТЬ ПО
			|	НачислениеНДСпоСМРхозспособом.Ссылка.Организация";
			
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда
			
			Запрос.УстановитьПараметр("ДокументОснование_ПринятиеКУчетуОС", ДокументыОснования);
		
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	НДСНачисленныйОбороты.Организация КАК Организация,
			|	НЕОПРЕДЕЛЕНО КАК Контрагент,
			|	НЕОПРЕДЕЛЕНО КАК Договор,
			|	НДСНачисленныйОбороты.СуммаБезНДСПриход + НДСНачисленныйОбороты.НДСПриход КАК СуммаДокумента,
			|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента,
			|	НДСНачисленныйОбороты.НДСПриход КАК СуммаНДСДокумента,
			|	1 КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ИЗ
			|	РегистрНакопления.НДСНачисленный.Обороты(
			|			,
			|			,
			|			Период,
			|			СчетФактура ССЫЛКА Документ.ПринятиеКУчетуОС
			|				И СчетФактура В (&ДокументОснование_ПринятиеКУчетуОС)) КАК НДСНачисленныйОбороты";

		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.МодернизацияОС") Тогда
			
			Запрос.УстановитьПараметр("ДокументОснование_МодернизацияОС", ДокументыОснования);
		
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	НДСНачисленныйОбороты.Организация КАК Организация,
			|	НЕОПРЕДЕЛЕНО КАК Контрагент,
			|	НЕОПРЕДЕЛЕНО КАК Договор,
			|	НДСНачисленныйОбороты.СуммаБезНДСПриход + НДСНачисленныйОбороты.НДСПриход КАК СуммаДокумента,
			|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента,
			|	НДСНачисленныйОбороты.НДСПриход КАК СуммаНДСДокумента,
			|	1 КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ИЗ
			|	РегистрНакопления.НДСНачисленный.Обороты(
			|			,
			|			,
			|			Период,
			|			СчетФактура ССЫЛКА Документ.МодернизацияОС
			|				И СчетФактура В (&ДокументОснование_МодернизацияОС)) КАК НДСНачисленныйОбороты";
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
			
			Запрос.УстановитьПараметр("ДокументОснование_РеализацияОтгруженныхТоваров", ДокументыОснования);
		
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	РеализацияОтгруженныхТоваров.Организация,
			|	РеализацияОтгруженныхТоваров.Контрагент,
			|	РеализацияОтгруженныхТоваров.ДоговорКонтрагента КАК Договор,
			|	РеализацияОтгруженныхТоваров.СуммаДокумента КАК СуммаДокумента,
			|	РеализацияОтгруженныхТоваров.ДокументОтгрузки.ВалютаДокумента КАК ВалютаДокумента,
			|	РеализацияОтгруженныхТоваров.ДокументОтгрузки КАК ДокументОтгрузки
			|ПОМЕСТИТЬ ВТ_РеализацияОтгруженныхТоваров
			|ИЗ
			|	Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
			|ГДЕ
			|	РеализацияОтгруженныхТоваров.Ссылка В(&ДокументОснование_РеализацияОтгруженныхТоваров)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументОтгрузки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
			|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК СуммаДокумента,
			|	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСДокумента,
			|	СУММА(ВЫБОР
			|			КОГДА РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК ЕстьНДС
			|ПОМЕСТИТЬ ВТ_Суммы
			|ИЗ
			|	ВТ_РеализацияОтгруженныхТоваров КАК ВТ_РеализацияОтгруженныхТоваров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|		ПО ВТ_РеализацияОтгруженныхТоваров.ДокументОтгрузки = РеализацияТоваровУслугТовары.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслугТовары.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПередачаОСОС.Ссылка,
			|	СУММА(ПередачаОСОС.Сумма),
			|	СУММА(ПередачаОСОС.СуммаНДС),
			|	СУММА(ВЫБОР
			|			КОГДА ПередачаОСОС.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ)
			|ИЗ
			|	ВТ_РеализацияОтгруженныхТоваров КАК ВТ_РеализацияОтгруженныхТоваров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаОС.ОС КАК ПередачаОСОС
			|		ПО ВТ_РеализацияОтгруженныхТоваров.ДокументОтгрузки = ПередачаОСОС.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПередачаОСОС.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_РеализацияОтгруженныхТоваров.Организация,
			|	ВТ_РеализацияОтгруженныхТоваров.Контрагент,
			|	ВТ_РеализацияОтгруженныхТоваров.Договор,
			|	ВТ_РеализацияОтгруженныхТоваров.ВалютаДокумента,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности,
			|	СУММА(ВТ_Суммы.СуммаДокумента) КАК СуммаДокумента,
			|	СУММА(ВТ_Суммы.СуммаНДСДокумента) КАК СуммаНДСДокумента,
			|	СУММА(ВТ_Суммы.ЕстьНДС) КАК ЕстьНДС
			|ИЗ
			|	ВТ_РеализацияОтгруженныхТоваров КАК ВТ_РеализацияОтгруженныхТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Суммы КАК ВТ_Суммы
			|		ПО ВТ_РеализацияОтгруженныхТоваров.ДокументОтгрузки = ВТ_Суммы.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_РеализацияОтгруженныхТоваров.Организация,
			|	ВТ_РеализацияОтгруженныхТоваров.Контрагент,
			|	ВТ_РеализацияОтгруженныхТоваров.Договор,
			|	ВТ_РеализацияОтгруженныхТоваров.ВалютаДокумента";
		
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
			
			Запрос.УстановитьПараметр("ДокументОснование_ПоступлениеДопРасходов", ДокументыОснования);
				
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Таблица.Ссылка.Организация КАК Организация,
			|	Таблица.Ссылка.Контрагент КАК Контрагент,
			|	Таблица.Ссылка.ДоговорКонтрагента КАК Договор,
			|	СУММА(Таблица.Сумма + ВЫБОР
			|			КОГДА Таблица.Ссылка.СуммаВключаетНДС
			|				ТОГДА 0
			|			ИНАЧЕ Таблица.СуммаНДС
			|		КОНЕЦ) КАК СуммаДокумента,
			|	Таблица.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
			|	СУММА(Таблица.СуммаНДС) КАК СуммаНДСДокумента,
			|	СУММА(ВЫБОР
			|			КОГДА Таблица.Ссылка.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ИЗ
			|	Документ.ПоступлениеДопРасходов.Товары КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В(&ДокументОснование_ПоступлениеДопРасходов)
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.Ссылка,
			|	Таблица.Ссылка.Организация,
			|	Таблица.Ссылка.Контрагент,
			|	Таблица.Ссылка.ДоговорКонтрагента,
			|	Таблица.Ссылка.ВалютаДокумента
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Таблица.Ссылка.Организация,
			|	Таблица.Ссылка.Контрагент,
			|	Таблица.Ссылка.ДоговорКонтрагента,
			|	СУММА(Таблица.Сумма + ВЫБОР
			|			КОГДА Таблица.Ссылка.СуммаВключаетНДС
			|				ТОГДА 0
			|			ИНАЧЕ Таблица.СуммаНДС
			|		КОНЕЦ),
			|	Таблица.Ссылка.ВалютаДокумента,
			|	СУММА(Таблица.СуммаНДС),
			|	СУММА(ВЫБОР
			|			КОГДА Таблица.Ссылка.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ),
			|	ЛОЖЬ
			|ИЗ
			|	Документ.ПоступлениеДопРасходов.Оборудование КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В(&ДокументОснование_ПоступлениеДопРасходов)
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.Ссылка,
			|	Таблица.Ссылка.Организация,
			|	Таблица.Ссылка.Контрагент,
			|	Таблица.Ссылка.ДоговорКонтрагента,
			|	Таблица.Ссылка.ВалютаДокумента
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПоступлениеДопРасходов.Организация,
			|	ПоступлениеДопРасходов.Контрагент,
			|	ПоступлениеДопРасходов.ДоговорКонтрагента,
			|	СУММА(ПоступлениеДопРасходов.Сумма + ВЫБОР
			|			КОГДА ПоступлениеДопРасходов.СуммаВключаетНДС
			|				ТОГДА 0
			|			ИНАЧЕ ПоступлениеДопРасходов.СуммаНДС
			|		КОНЕЦ),
			|	ПоступлениеДопРасходов.ВалютаДокумента,
			|	СУММА(ПоступлениеДопРасходов.СуммаНДС),
			|	СУММА(ВЫБОР
			|			КОГДА ПоступлениеДопРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ),
			|	ЛОЖЬ
			|ИЗ
			|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
			|ГДЕ
			|	ПоступлениеДопРасходов.Ссылка В(&ДокументОснование_ПоступлениеДопРасходов)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеДопРасходов.Организация,
			|	ПоступлениеДопРасходов.Контрагент,
			|	ПоступлениеДопРасходов.ДоговорКонтрагента,
			|	ПоступлениеДопРасходов.ВалютаДокумента";
				
		Иначе
			
			ТекстЗапроса = ПолучитьТекстЗапросаОпределенияПараметровСФ(ДокументыОснования, ЭтоПолученныйСФ, Запрос.Параметры);
			
		КонецЕсли;
				
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
				Запрос.Текст = Запрос.Текст + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС;
			КонецЕсли;
			
			Запрос.Текст = Запрос.Текст + ТекстЗапроса;
		КонецЕсли;
 		
	КонецЦикла;
	
	Если ПустаяСтрока(Запрос.Текст) Тогда
	    Возврат;
	Иначе
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ПерваяСтрока      = Истина;
		РазныеОрганизации = Ложь;
		РазныеКонтрагенты = Ложь;
		РазныеДоговоры    = Ложь;
		РазныеВалюты      = Ложь;
		Пока Выборка.Следующий() Цикл
			
			ЭтоКорректировочный = Ложь;
			
			Если Корректировка Тогда
				
				Если ЭтоПолученныйСФ Тогда
					ЭтоКорректировочный = СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
				Иначе
					ЭтоКорректировочный = СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;						
				КонецЕсли;
				
				Результат.СуммаУвеличение		= Результат.СуммаУвеличение + Выборка.СуммаУвеличение;
				Результат.СуммаУменьшение		= Результат.СуммаУменьшение + Выборка.СуммаУменьшение;
				Результат.СуммаНДСУвеличение	= Результат.СуммаНДСУвеличение + Выборка.СуммаНДСУвеличение;
				Результат.СуммаНДСУменьшение	= Результат.СуммаНДСУменьшение + Выборка.СуммаНДСУменьшение;
				Результат.СуммаДокумента 		= Результат.СуммаДокумента + Выборка.СуммаДокумента;
				Результат.СуммаНДСДокумента 	= Результат.СуммаНДСДокумента + Выборка.СуммаНДСДокумента;
				
				ВыборкаДокументы = Выборка.Выбрать();
				Пока ВыборкаДокументы.Следующий() Цикл
					
					Если ПерваяСтрока Тогда
						СтрокаРеквизитов = "Организация,Контрагент,ВалютаДокумента,Договор";
						ЗаполнитьЗначенияСвойств(Результат, ВыборкаДокументы, СтрокаРеквизитов);
						Результат.СчетФактураБезНДС = ВыборкаДокументы.ЕстьНДС = 0;
						ПерваяСтрока = Ложь;
					КонецЕсли;
					
					РазныеОрганизации	= РазныеОрганизации ИЛИ Результат.Организация <> ВыборкаДокументы.Организация;
					РазныеКонтрагенты	= РазныеКонтрагенты ИЛИ Результат.Контрагент <> ВыборкаДокументы.Контрагент;
					РазныеВалюты		= РазныеВалюты ИЛИ Результат.ВалютаДокумента <> ВыборкаДокументы.ВалютаДокумента;
					РазныеДоговоры		= ?(ЭтоПолученныйСФ, Ложь, РазныеДоговоры ИЛИ Результат.Договор <> ВыборкаДокументы.Договор);
					
					Если Результат.СчетФактураБезНДС Тогда
						Результат.СчетФактураБезНДС = ВыборкаДокументы.ЕстьНДС = 0;
					КонецЕсли;
					
					Если ЭтоКорректировочный Тогда
						
						СтрокаСРеквизитами = РеквизитыОснований.Добавить();
						
						СтрокаСРеквизитами.ДокументОснование 	= ВыборкаДокументы.Документ;
						СтрокаСРеквизитами.СуммаУвеличение 		= ВыборкаДокументы.СуммаУвеличение;
						СтрокаСРеквизитами.СуммаУменьшение 		= ВыборкаДокументы.СуммаУменьшение;
						СтрокаСРеквизитами.СуммаНДСУвеличение	= ВыборкаДокументы.СуммаНДСУвеличение;
						СтрокаСРеквизитами.СуммаНДСУменьшение 	= ВыборкаДокументы.СуммаНДСУменьшение;
						
						Если ЭтоПолученныйСФ Тогда
							
							ДокументПоступления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДокументы.Документ, "ДокументПоступления");	
							
							Если СчетФактура.Исправление Тогда 
								ИсходныйДокументПоступления = ПолучитьИсправляемыйДокументПоступления(ВыборкаДокументы.Документ);
								Если ТипЗнч(ИсходныйДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
									ИсходныйДокументПоступления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокументПоступления, "ДокументПоступления");
								КонецЕсли; 
							Иначе
								ИсходныйДокументПоступления = ДокументПоступления;
							КонецЕсли;
							
							РеквизитыИсходногоСчетаФактуры = ПолучитьРеквизитыСчетаФактурыПолученного(ИсходныйДокументПоступления);
							
							Если РеквизитыИсходногоСчетаФактуры <> Неопределено Тогда 
								
								СтрокаСРеквизитами.НомерИсходногоДокумента 				  = РеквизитыИсходногоСчетаФактуры.НомерСчетаФактуры;
								СтрокаСРеквизитами.ДатаИсходногоДокумента  				  = РеквизитыИсходногоСчетаФактуры.ДатаСчетаФактуры;
								СтрокаСРеквизитами.УчитыватьИсправлениеИсходногоДокумента = РеквизитыИсходногоСчетаФактуры.Исправление;
								СтрокаСРеквизитами.НомерИсправленияИсходногоДокумента     = РеквизитыИсходногоСчетаФактуры.НомерИсправления;
								СтрокаСРеквизитами.ДатаИсправленияИсходногоДокумента      = РеквизитыИсходногоСчетаФактуры.ДатаИсправления;
								
							КонецЕсли;
							
						Иначе
							
							ДокументРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДокументы.Документ, "ДокументРеализации");	
							
							Если СчетФактура.Исправление Тогда 
								ИсходныйДокументРеализации = ПолучитьИсправляемыйДокументРеализации(ВыборкаДокументы.Документ);
								Если ТипЗнч(ИсходныйДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
									ИсходныйДокументРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокументРеализации, "ДокументРеализации");
								КонецЕсли; 
							Иначе
								ИсходныйДокументРеализации = ДокументРеализации;	
							КонецЕсли;
							
							РеквизитыИсходногоСчетаФактуры = ПолучитьРеквизитыСчетаФактурыВыданного(ИсходныйДокументРеализации);
							
							Если РеквизитыИсходногоСчетаФактуры <> Неопределено Тогда 
								
								СтрокаСРеквизитами.НомерИсходногоДокумента = РеквизитыИсходногоСчетаФактуры.НомерСчетаФактуры;
								СтрокаСРеквизитами.ДатаИсходногоДокумента  = РеквизитыИсходногоСчетаФактуры.ДатаСчетаФактуры;
								СтрокаСРеквизитами.УчитыватьИсправлениеИсходногоДокумента = РеквизитыИсходногоСчетаФактуры.Исправление;
								СтрокаСРеквизитами.НомерИсправленияИсходногоДокумента     = РеквизитыИсходногоСчетаФактуры.НомерИсправления;
								СтрокаСРеквизитами.ДатаИсправленияИсходногоДокумента      = РеквизитыИсходногоСчетаФактуры.ДатаИсправления;
								
							КонецЕсли;
 					
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Если ПерваяСтрока Тогда
					ПерваяСтрока = Ложь;
					ЗаполнитьЗначенияСвойств(Результат, Выборка);
					Результат.СчетФактураБезНДС = Выборка.ЕстьНДС = 0;
				Иначе
					РазныеОрганизации = РазныеОрганизации ИЛИ Результат.Организация <> Выборка.Организация;
					РазныеКонтрагенты = РазныеКонтрагенты ИЛИ Результат.Контрагент <> Выборка.Контрагент;
					РазныеВалюты      = РазныеВалюты ИЛИ Результат.ВалютаДокумента <> Выборка.ВалютаДокумента;
					РазныеДоговоры    = ?(ЭтоПолученныйСФ, Ложь, РазныеДоговоры ИЛИ Результат.Договор <> Выборка.Договор);
					
					Результат.СуммаДокумента = 	Результат.СуммаДокумента + Выборка.СуммаДокумента;
					Результат.СуммаНДСДокумента = Результат.СуммаНДСДокумента + Выборка.СуммаНДСДокумента;
					
					Если ТипДокументаОснования = Тип("ДокументСсылка.КорректировкаРеализации") 
						ИЛИ ТипДокументаОснования = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
						
						Результат.СуммаУвеличение    = Результат.СуммаУвеличение    + Выборка.СуммаУвеличение;
						Результат.СуммаУменьшение    = Результат.СуммаУменьшение + Выборка.СуммаУменьшение;
						Результат.СуммаНДСУвеличение = Результат.СуммаНДСУвеличение    + Выборка.СуммаНДСУвеличение;
						Результат.СуммаНДСУменьшение = Результат.СуммаНДСУменьшение + Выборка.СуммаНДСУменьшение;
					Иначе
						Результат.СуммаУвеличение 	 = 0;
						Результат.СуммаУменьшение 	 = 0;					
						Результат.СуммаНДСУвеличение = 0;
						Результат.СуммаНДСУменьшение = 0;					
					КонецЕсли;
					
					Если Результат.СчетФактураБезНДС Тогда
						Результат.СчетФактураБезНДС = Выборка.ЕстьНДС = 0;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если РазныеОрганизации ИЛИ РазныеКонтрагенты ИЛИ РазныеВалюты Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Реквизиты документов, на основании которых зарегистрирован счет-фактура, не совпадают:"+
				?(РазныеОрганизации,Символы.ПС+" - не совпадает организация","")+
				?(РазныеКонтрагенты,Символы.ПС+" - не совпадает контрагент","")+
				?(РазныеДоговоры,Символы.ПС+" - не совпадает договор","")+
				?(РазныеВалюты,Символы.ПС+" - не совпадает валюта документа","")+
				Символы.ПС+"Необходимо изменить параметры документов-оснований или зарегистрировать по документам с расхождениями отдельные счета-фактуры.", Ложь, Строка(СчетФактура), СтатусСообщения.Внимание); 
			Если РазныеОрганизации Тогда
				 Результат.Организация = Неопределено;
			КонецЕсли; 				
			Если РазныеКонтрагенты Тогда
				 Результат.Контрагент = Неопределено;
			КонецЕсли; 				
			Если РазныеВалюты Тогда
				 Результат.ВалютаДокумента = Неопределено;
			КонецЕсли; 				
			Если РазныеДоговоры Тогда
				 Результат.Договор = Неопределено;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры // ПолучитьПараметрыСчетаФактуры()
Функция ПолучитьРеквизитыСчетаФактурыПолученного(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ДокументОснование", ДокументОснование.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка КАК СчетФактура,
	|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаСчетаФактуры,
	|	СчетФактураПолученный.Исправление,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Исправление
	|			ТОГДА СчетФактураПолученный.НомерИсправления
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Исправление
	|			ТОГДА СчетФактураПолученный.ДатаИсправления
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.НомерИсходногоДокумента
	|	КОНЕЦ КАК НомерИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.ДатаИсходногоДокумента
	|	КОНЕЦ КАК ДатаИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученныйДокументыОснования.УчитыватьИсправлениеИсходногоДокумента
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьИсправлениеИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученныйДокументыОснования.НомерИсправленияИсходногоДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерИсправленияИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученныйДокументыОснования.ДатаИсправленияИсходногоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИсправленияИсходногоДокумента
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО СчетФактураПолученныйДокументыОснования.Ссылка = СчетФактураПолученный.Ссылка
	|ГДЕ
	|	(СчетФактураПолученныйДокументыОснования.ДокументОснование = &ДокументОснование
	|			ИЛИ СчетФактураПолученныйДокументыОснования.Ссылка = &ДокументОснование)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураПолученный.ПометкаУдаления,
	|	СчетФактураПолученный.Проведен УБЫВ,
	|	СчетФактураПолученный.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыСчетаФактуры = Новый Структура("СчетФактура, НомерСчетаФактуры, ДатаСчетаФактуры, 
			|Исправление, НомерИсправления, ДатаИсправления, НомерИсходногоДокумента, ДатаИсходногоДокумента,
			|УчитыватьИсправлениеИсходногоДокумента, НомерИсправленияИсходногоДокумента, ДатаИсправленияИсходногоДокумента");
		ЗаполнитьЗначенияСвойств(РеквизитыСчетаФактуры, Выборка);
		Возврат РеквизитыСчетаФактуры;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции
Функция ПолучитьРеквизитыСчетаФактурыВыданного(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ДокументОснование", ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СчетФактура,
	|	СчетФактураВыданный.ПометкаУдаления КАК ПометкаУдаления,
	|	СчетФактураВыданный.Проведен КАК Проведен,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				И СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				И СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	СчетФактураВыданный.Исправление,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсправления
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|			ТОГДА СчетФактураВыданныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.НомерИсходногоДокумента
	|	КОНЕЦ КАК НомерИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|			ТОГДА СчетФактураВыданныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.ДатаИсходногоДокумента
	|	КОНЕЦ КАК ДатаИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|			ТОГДА СчетФактураВыданныйДокументыОснования.УчитыватьИсправлениеИсходногоДокумента
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьИсправлениеИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|			ТОГДА СчетФактураВыданныйДокументыОснования.НомерИсправленияИсходногоДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерИсправленияИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|			ТОГДА СчетФактураВыданныйДокументыОснования.ДатаИсправленияИсходногоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИсправленияИсходногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданныйДокументыОснования.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	(СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
	|			ИЛИ СчетФактураВыданныйДокументыОснования.Ссылка = &ДокументОснование)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления,
	|	Проведен УБЫВ,
	|	СчетФактураВыданный.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыСчетаФактуры = Новый Структура("СчетФактура, ПометкаУдаления, Проведен, НомерСчетаФактуры, ДатаСчетаФактуры, 
			|Исправление, НомерИсправления, ДатаИсправления, НомерИсходногоДокумента, ДатаИсходногоДокумента,
			|УчитыватьИсправлениеИсходногоДокумента, НомерИсправленияИсходногоДокумента, ДатаИсправленияИсходногоДокумента");
		ЗаполнитьЗначенияСвойств(РеквизитыСчетаФактуры, Выборка);
		Если РеквизитыСчетаФактуры.НомерСчетаФактуры = НЕОПРЕДЕЛЕНО Тогда
			РеквизитыСчетаФактуры.НомерСчетаФактуры = ОбщегоНазначения.ПолучитьНомерНаПечать(РеквизитыСчетаФактуры.СчетФактура); 
		КонецЕсли;
		Возврат РеквизитыСчетаФактуры;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции
Функция ПолучитьТекстЗапросаОпределенияПараметровСФ(ДокументыОснования, ЭтоПолученныйСФ, ПараметрыЗапроса, ИмяВременнойТаблицы = "") Экспорт
	
	ИгнорироватьТЧ = Новый Массив;
	ИгнорироватьТЧ.Добавить("ВозвратнаяТара");
	ИгнорироватьТЧ.Добавить("ВыданныеАвансы");
	ИгнорироватьТЧ.Добавить("ДенежныеСредства");
	ИгнорироватьТЧ.Добавить("ПрочиеЗатраты");
	ИгнорироватьТЧ.Добавить("РаспределениеПрочихЗатрат");
	ИгнорироватьТЧ.Добавить("ИспользованныеМатериалы");
	
	МетаданныеДокумента = ДокументыОснования[0].Метаданные();
	ТипДокументаОснования = ТипЗнч(ДокументыОснования[0]);
	
	ИмяОбъекта = МетаданныеДокумента.Имя;
	ПараметрыЗапроса.Вставить("ДокументОснование_" + ИмяОбъекта, ДокументыОснования);
	
	ПостфиксСумм = "";
	Множитель = 1;
	ИмяРеквизитаСтавкаНДС = "СтавкаНДС";
	
	Если ТипДокументаОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		ИЛИ ТипДокументаОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") И ЭтоПолученныйСФ Тогда
			
		ПостфиксСумм = "Вознаграждения";
		ИмяРеквизитаСтавкаНДС = "Ссылка.СтавкаНДСВознаграждения";
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") И НЕ ЭтоПолученныйСФ
		ИЛИ ТипДокументаОснования = Тип("ДокументСсылка.ВозвратТоваровПоставщику") И ЭтоПолученныйСФ Тогда
			
		Множитель = - 1;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Множитель_" + ИмяОбъекта, Множитель);
	
	ТекстЗапроса = "";
	
	ТекстСекцииПоместить = "";
	
	Для каждого МетаданныеТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		Если ИгнорироватьТЧ.Найти(МетаданныеТЧ.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МетаданныеТЧ.Реквизиты.Найти("Сумма") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьСуммаВключаетНДС = МетаданныеДокумента.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено;
		
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			Если НЕ ПустаяСтрока(ИмяВременнойТаблицы) Тогда
				ТекстСекцииПоместить = "
				|ПОМЕСТИТЬ
				|	" + ИмяВременнойТаблицы + "
				|";
			КонецЕсли;
		Иначе
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС;
			ТекстСекцииПоместить = "";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	Таблица.Ссылка.Организация КАК Организация,
		|	Таблица.Ссылка.Контрагент КАК Контрагент,
		|	Таблица.Ссылка.ДоговорКонтрагента КАК Договор,
		|	СУММА(Таблица.Сумма" + ПостфиксСумм + ?(ЕстьСуммаВключаетНДС, " + ВЫБОР
		|			КОГДА Таблица.Ссылка.СуммаВключаетНДС
		|				ТОГДА 0
		|			ИНАЧЕ Таблица.СуммаНДС" + ПостфиксСумм + "
		|		КОНЕЦ", "") + ") * &Множитель_" + ИмяОбъекта + " КАК СуммаДокумента,
		|	Таблица.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
		|	СУММА(Таблица.СуммаНДС" + ПостфиксСумм + ") * &Множитель_" + ИмяОбъекта + " КАК СуммаНДСДокумента,
		|	СУММА(ВЫБОР
		|			КОГДА Таблица." + ИмяРеквизитаСтавкаНДС + " = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК ЕстьНДС,
		|	ЛОЖЬ КАК БланкСтрогойОтчетности" + ТекстСекцииПоместить + "
		|ИЗ
		|	Документ." + МетаданныеДокумента.Имя + "." + МетаданныеТЧ.Имя + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&ДокументОснование_" + ИмяОбъекта + ")
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Ссылка,
		|	Таблица.Ссылка.Организация,
		|	Таблица.Ссылка.Контрагент,
		|	Таблица.Ссылка.ДоговорКонтрагента,
		|	Таблица.Ссылка.ВалютаДокумента";
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда // в документе не оказалось табличных частей
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаНДС") <> Неопределено Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДокОснование.Организация КАК Организация,
			|	ДокОснование.Контрагент КАК Контрагент,
			|	ДокОснование.ДоговорКонтрагента КАК Договор,
			|	СУММА(ДокОснование.Сумма + ВЫБОР
			|			КОГДА ДокОснование.Ссылка.СуммаВключаетНДС
			|				ТОГДА 0
			|			ИНАЧЕ ДокОснование.СуммаНДС
			|		КОНЕЦ) КАК СуммаДокумента,
			|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента,
			|	ДокОснование.СуммаНДС КАК СуммаНДСДокумента,
			|	ВЫБОР
			|		КОГДА ДокОснование.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ИЗ
			|	Документ." + МетаданныеДокумента.Имя + " КАК ДокОснование
			|ГДЕ
			|	ДокОснование.Ссылка В (&ДокументОснование_" + МетаданныеДокумента.Имя + ")
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокОснование.Ссылка,
			|	ДокОснование.ДоговорКонтрагента,
			|	ДокОснование.СуммаНДС,
			|	ДокОснование.Организация,
			|	ДокОснование.Контрагент,
			|	ВЫБОР
			|		КОГДА ДокОснование.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ";
			
			
		Иначе
			
			Если (ТипДокументаОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах"))
				или ((ТипДокументаОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")) И ЭтоПолученныйСФ) Тогда
				ИдРеквСумма = "СуммаВознаграждения";
			ИначеЕсли (ТипДокументаОснования = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") И не ЭтоПолученныйСФ) тогда
				ИдРеквСумма = "СуммаДокумента*(-1)";
			ИначеЕсли (ТипДокументаОснования = Тип("ДокументСсылка.ВозвратТоваровПоставщику") И ЭтоПолученныйСФ) тогда
				ИдРеквСумма = "СуммаДокумента*(-1)";
			Иначе
				ИдРеквСумма = "СуммаДокумента";
			КонецЕсли;
			
			ИмяОбъекта = МетаданныеДокумента.Имя;
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	" + ИмяОбъекта + ".Организация,
			|	" + ИмяОбъекта + ".Контрагент,
			|	" + ИмяОбъекта + ".ДоговорКонтрагента как Договор,
			|	" + ИмяОбъекта + "." + ИдРеквСумма + " Как СуммаДокумента,
			|	" + ИмяОбъекта + ".ВалютаДокумента Как ВалютаДокумента,
			|	0 Как СуммаНДСДокумента,
			|	1 Как ЕстьНДС,
			|	ЛОЖЬ КАК БланкСтрогойОтчетности
			|ИЗ
			|	Документ." + ИмяОбъекта + " КАК " + ИмяОбъекта + "
			
			|ГДЕ
			|	" + ИмяОбъекта + ".Ссылка в (&ДокументОснование_"+ИмяОбъекта+")";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции
// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо ПТУ либо корректировку ПТУ)
// либо первоначальный документ ПТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументПоступления(ДокПоступления, Исходный = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ДокПоступления) 
		И ТипЗнч(ДокПоступления) = Тип("ДокументСсылка.КорректировкаПоступления")
		И (ДокПоступления.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки ИЛИ Исходный) Тогда
		
		Возврат ПолучитьИсправляемыйДокументПоступления(ДокПоступления.ДокументПоступления, Исходный);
		
	Иначе
		Возврат ДокПоступления;
	КонецЕсли;	
	
КонецФункции	
// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо РТУ либо корректировку РТУ)
// либо первоначальный документ РТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации, Исходный = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ДокРеализации) 
		И ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.КорректировкаРеализации")
		И (ДокРеализации.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки ИЛИ Исходный) Тогда
		
		Возврат ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументРеализации, Исходный);
		
	Иначе
		Возврат ДокРеализации;
	КонецЕсли;	
	
КонецФункции

#КонецЕсли

СоответствиеТиповИПредставлений = Новый Соответствие();
ТипыДокументов = Документы.ТипВсеСсылки();

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();