
Функция ВыгрузитьИзмененияДанныхДляУзла(УзелОбмена,КоличествоЭлементовВТранзакцииНаВыгрузкуДанных, ЗаписьXML) Экспорт
	
	возврат ПроцедурыОбменаДанными.ВыгрузитьИзмененияДляУзлаВФайлОбмена(УзелОбмена,КоличествоЭлементовВТранзакцииНаВыгрузкуДанных, ЗаписьXML);
	////	Сообщить("-------- Выгрузка в узел " + Строка(УзелОбмена) + " ------------");
//	
//	// Создаем новое сообщение
//	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
//	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
//	//Сообщить("    Номер сообщения: " + ЗаписьСообщения.НомерСообщения);
//	
//	// Получаем выборку изменённых данных
//	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
//	Пока ВыборкаИзменений.Следующий() Цикл
//		Данные = ВыборкаИзменений.Получить();
//		//Если НЕ НуженПереносДанных(УзелОбмена,Данные) Тогда
//		//	продолжить;
//		//КонецЕсли;
//		
//		// Записываем данные в сообщение
//		ЗаписатьXML(ЗаписьXML, Данные);
//		
//	КонецЦикла;
//	
//	// Завершаем запись сообщения
//	ЗаписьСообщения.ЗакончитьЗапись();
//	ЗаписьXML.Закрыть();
//	
////	Сообщить("-------- Конец выгрузки------------");
//	возврат  Истина;
КонецФункции

Функция ЗагрузитьИзмененияДанныхДляУзла(УзелОбмена,КоличествоЭлементовВТранзакцииНаЗагрузкуДанных, ЧтениеXML) Экспорт
	возврат ПроцедурыОбменаДанными.ЗагрузитьИзмененияДляУзлаИзФайлаОбмена(УзелОбмена,КоличествоЭлементовВТранзакцииНаЗагрузкуДанных, ЧтениеXML);
	////Сообщить("-------- Загрузка из " + Строка(УзелОбмена) + "------------");
	//
	//// Загрузка из найденного файла
	//ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	//ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	//Если ЧтениеСообщения.Отправитель <> УзелОбмена Тогда
	//	
	//	// Сообщение предназначено не для этого узла
	//	ВызватьИсключение "Неверный узел";
	//	
	//КонецЕсли;
	//
	//// Удаляем регистрацию изменений для узла отправителя сообщения
	//ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	//
	//// Читаем данные из сообщения
	//Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
	//	
	//	// Читаем очередное значение
	//	Данные = ПрочитатьXML(ЧтениеXML);
	//	
	//	
	//	// Записываем перенесенные данные
	//	Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
	//	Данные.ОбменДанными.Загрузка = Истина;
	//	Данные.Записать();
	//	
	//КонецЦикла;
	//
	//ЧтениеСообщения.ЗакончитьЧтение();
	//ЧтениеXML.Закрыть();
	//
	////Сообщить("-------- Конец загрузки------------");
	//возврат Истина;
	//
КонецФункции

