
&НаКлиенте
Процедура ОК(Команда)
	НаименованиеПриИзменении(Неопределено);
	СоздатьЭтапСервер();
	Закрыть(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры

&НаСервере
Процедура СоздатьЭтапСервер()
	НовыйЭтап = ?(ЭтоГруппа, Справочники.абс_ЭтапыПроектов.СоздатьГруппу(), Справочники.абс_ЭтапыПроектов.СоздатьЭлемент());
	НовыйЭтап.Наименование = Наименование;
	НовыйЭтап.Проект = Проект;
	Если Не ЭтоГруппа Тогда 
		НовыйЭтап.ВидПроекта = Проект.абс_ВидПроекта;
	КонецЕсли;
	НовыйЭтап.Родитель = Родитель;
	НовыйЭтап.Порядок = Порядок;
	НовыйЭтап.Имя = Имя;
	НовыйЭтап.Записать();
	ЭтапПроекта = НовыйЭтап.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование()
	Наименование = СокрЛП(Порядок + " " + Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры


