
&НаКлиенте
Процедура ДекорацияСсылкиДокументНажатие(Элемент)
	ЭтаФорма.Закрыть("Документы##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасшифровкаДокументыНажатие(Элемент)
	ЭтаФорма.Закрыть("Документы##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкиДоговорНажатие(Элемент)
	ЭтаФорма.Закрыть("Договоры##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтборовДоговоровНажатие(Элемент)
	ЭтаФорма.Закрыть("Договоры##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкиВалютаНажатие(Элемент)
	ЭтаФорма.Закрыть("Валюты##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкиУслугаНажатие(Элемент)
	ЭтаФорма.Закрыть("Услуги##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкиАналитикаНажатие(Элемент)
	ЭтаФорма.Закрыть("Аналитики##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкиСтавкаНДСНажатие(Элемент)
	ЭтаФорма.Закрыть("СтавкиНДС##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтборовСтавокНДСНажатие(Элемент)
	ЭтаФорма.Закрыть("СтавкиНДС##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкиКураторНажатие(Элемент)
	ЭтаФорма.Закрыть("Кураторы##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасшифровкаДеталировкиНажатие(Элемент)
	ЭтаФорма.Закрыть("Деталировка##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНаТекущийВыбранныйЭлементНажатие(Элемент)
	ЭтаФорма.Закрыть("");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеСтрокиСсылки(ИмяТаблицы)
	ТекОбъект=ЭтаФорма.ВладелецФормы.Объект;
	ИстДанные=ЭтаФорма.ВладелецФормы.ТекущийЭлемент.ТекущиеДанные;
	Если ИмяТаблицы="Документы" Тогда
		// документы
		ТекДанные=ТекОбъект.Документы[ИстДанные.ИндексДокумента-1];
		Элементы.ДекорацияНадписьСсылкиНаДокумент.Видимость=Истина;
		Элементы.ДекорацияСсылкиНаДокумент.Видимость=Истина;
		Элементы.ДекорацияСсылкиНаДокумент.Заголовок="["+СокрЛП(?(ПустаяСтрока(ТекДанные.НомерКорректировкиРеализации),ТекДанные.НомерРеализации,ТекДанные.НомерКорректировкиРеализации))+"/"+Строка(ТекДанные.ДатаДокумента)+"] строка ["+ТекДанные.НомерСтроки+"]";
	ИначеЕсли ИмяТаблицы="Договоры" Тогда
		// контрагенты-договоры
		ТекДанные=ТекОбъект.КонтрагентыДоговоры[ИстДанные.ИндексДоговора-1];
		Элементы.ДекорацияНадписьСсылкиНаДоговор.Видимость=Истина;
		Элементы.ДекорацияСсылкиДоговор.Видимость=Истина;
		Элементы.ДекорацияСсылкиДоговор.Заголовок="[("+СокрЛП(ТекДанные.КодКонтрагента)+"|"+СокрЛП(ТекДанные.НомерДоговора)+"|"+СокрЛП(ТекДанные.ЛицевойСчет)+")/"+Строка(ТекДанные.Договор)+"|"+Строка(ТекДанные.Валюта)+"] строка ["+ТекДанные.НомерСтроки+"]";
	ИначеЕсли ИмяТаблицы="СтавкиНДС" Тогда
		// ставки ндс
		ТекДанные=ТекОбъект.СтавкиНДС[ИстДанные.ИндексСтавкиНДС-1];
		Элементы.ДекорацияНадписьСсылкиНаСтавкуНДС.Видимость=Истина;
		Элементы.ДекорацияСсылкиСтавкуНДС.Видимость=Истина;
		Элементы.ДекорацияСсылкиСтавкуНДС.Заголовок="["+СокрЛП(ТекДанные.СтрокаСтавкиНДС)+"/"+Строка(ТекДанные.СтавкаНДС)+"("+Строка(ТекДанные.Валюта)+")] строка ["+ТекДанные.НомерСтроки+"]";
	ИначеЕсли ИмяТаблицы="Услуги" Тогда
		// услуги
		ТекДанные=ТекОбъект.УслугиНоменклатуры[ИстДанные.ИндексУслуги-1];
		Элементы.ДекорацияНадписьСсылкиНаУслугу.Видимость=Истина;
		Элементы.ДекорацияСсылкиУслуга.Видимость=Истина;
		Элементы.ДекорацияСсылкиУслуга.Заголовок="["+СокрЛП(ТекДанные.УслугаИзБиллинга)+"("+ТекДанные.КодУслуги+")/"+Строка(ТекДанные.Номенклатура)+"("+ТекДанные.Номенклатура.Код+")] строка ["+ТекДанные.НомерСтроки+"]";
	ИначеЕсли ИмяТаблицы="Аналитики" Тогда
		// аналитики
		Если ИстДанные.ИндексАналитики>0 Тогда
			ТекДанные=ТекОбъект.Аналитики[ИстДанные.ИндексАналитики-1];
			Элементы.ДекорацияНадписьСсылкиНаАналитику.Видимость=Истина;
			Элементы.ДекорацияСсылкиАналитика.Видимость=Истина;
			Элементы.ДекорацияСсылкиАналитика.Заголовок="["+Строка(ТекДанные.Номенклатура)+"("+ТекДанные.Номенклатура.Код+")|"+ТекДанные.ЦФО+"/"+Строка(ТекДанные.НоменклатурнаяГруппа)+"("+ТекДанные.НоменклатурнаяГруппа.Код+")] строка ["+ТекДанные.НомерСтроки+"]";
		КонецЕсли;
	ИначеЕсли ИмяТаблицы="Валюты" Тогда
		// валюты
		ТекДанные=ТекОбъект.Валюты[ИстДанные.ИндексВалюты-1];
		Элементы.ДекорацияНадписьСсылкиНаВалюту.Видимость=Истина;
		Элементы.ДекорацияСсылкиВалюта.Видимость=Истина;
		Элементы.ДекорацияСсылкиВалюта.Заголовок="["+СокрЛП(ТекДанные.КодВалюты)+"/"+ТекДанные.Валюта+"] строка ["+ТекДанные.НомерСтроки+"]";
	ИначеЕсли ИмяТаблицы="Кураторы" Тогда
		// кураторы
		ТекДанные=ТекОбъект.Кураторы[ИстДанные.ИндексКуратора-1];
		Элементы.ДекорацияНадписьСсылкиНаКуратора.Видимость=Истина;
		Элементы.ДекорацияСсылкиКуратор.Видимость=Истина;
		Элементы.ДекорацияСсылкиКуратор.Заголовок="["+СокрЛП(ТекДанные.НаименованиеКуратор)+"/"+ТекДанные.Куратор+"] строка ["+ТекДанные.НомерСтроки+"]";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеСтрокиОтбора(ИмяТаблицы,ИмяИндексаОтбора,ЗначениеИндексаОтбора,ПредСтрокаОтбора)
	ТекОбъект=ЭтаФорма.ВладелецФормы.Объект;
	Отбор = Новый Структура;
	Отбор.Вставить(ИмяИндексаОтбора, ЗначениеИндексаОтбора);
	Если ИмяТаблицы="Документы" Тогда
		йСтроки=ТекОбъект.Документы.НайтиСтроки(Отбор);
	ИначеЕсли ИмяТаблицы="Договоры" Тогда
		йСтроки=ТекОбъект.КонтрагентыДоговоры.НайтиСтроки(Отбор);
	ИначеЕсли ИмяТаблицы="СтавкиНДС" Тогда
		йСтроки=ТекОбъект.СтавкиНДС.НайтиСтроки(Отбор);
	ИначеЕсли ИмяТаблицы="Деталировка" Тогда
		йСтроки=ТекОбъект.Деталировка.НайтиСтроки(Отбор);
	ИначеЕсли ИмяТаблицы="Задолженность" Тогда
		йСтроки=ТекОбъект.ЗадолженностьМГМН.НайтиСтроки(Отбор);
	КонецЕсли;
	йИ=йСтроки.Количество();
	Если йИ=0 Тогда
		Возврат;
	КонецЕсли;
	Если ИмяТаблицы="Документы" Тогда
		Элементы.ДекорацияНадписьОтборовДокументов.Видимость=Истина;
		Элементы.ДекорацияОтборовДокументов.Видимость=Истина;
		Элементы.ДекорацияОтборовДокументов.Заголовок=ПредСтрокаОтбора+" в "+Строка(йИ)+" "+?(йИ=1,"документе","документах");
	ИначеЕсли ИмяТаблицы="Договоры" Тогда
		Элементы.ДекорацияНадписьОтборовДоговоров.Видимость=Истина;
		Элементы.ДекорацияОтборовДоговоров.Видимость=Истина;
		Элементы.ДекорацияОтборовДоговоров.Заголовок=ПредСтрокаОтбора+" в "+Строка(йИ)+" "+?(йИ=1,"договоре","договорах");
	ИначеЕсли ИмяТаблицы="СтавкиНДС" Тогда
		Элементы.ДекорацияНадписьОтборовСтавокНДС.Видимость=Истина;
		Элементы.ДекорацияОтборовСтавокНДС.Видимость=Истина;
		Элементы.ДекорацияОтборовСтавокНДС.Заголовок=ПредСтрокаОтбора+" в "+Строка(йИ)+" "+?(йИ=1,"ставке","ставках")+" НДС";
	ИначеЕсли ИмяТаблицы="Деталировка" Тогда
		Элементы.ДекорацияНадписьОтборовДеталировки.Видимость=Истина;
		Элементы.ДекорацияОтбораДеталировки.Видимость=Истина;
		Элементы.ДекорацияОтбораДеталировки.Заголовок=ПредСтрокаОтбора+" в "+Строка(йИ)+" "+?(йИ=1,"строке","строках")+" деталировки документа";
	ИначеЕсли ИмяТаблицы="Задолженность" Тогда
		Элементы.ДекорацияНадписьОтборовЗадолженности.Видимость=Истина;
		Элементы.ДекорацияОтбораЗадолженности.Видимость=Истина;
		Элементы.ДекорацияОтбораЗадолженности.Заголовок=ПредСтрокаОтбора+" в "+Строка(йИ)+" "+?(йИ=1,"строке","строках")+" документа задолженности МГМН";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРеквизитыТекущегоЭлемента(НадписьРеквизита, ЗначениеРеквизитаПриЗагрузке, ЗначениеРеквизитаВ1С)
	ТекДанные=ЭтаФорма.ВладелецФормы.ТекущийЭлемент.ТекущиеДанные;
	Элементы.ДекорацияНадписьТекущегоЭлемента.Заголовок=НадписьРеквизита;
	Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок="["+СокрЛП(ЗначениеРеквизитаПриЗагрузке)+"/"+ЗначениеРеквизитаВ1С+"] строка ["+ТекДанные.НомерСтроки+"]";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Состояние("Производится вывод на экран расшифровки...");
	ТекДанные=ЭтаФорма.ВладелецФормы.ТекущийЭлемент.ТекущиеДанные;
	ТекОбъект=ЭтаФорма.ВладелецФормы.Объект;
	ИмяТаблицы=ЭтаФорма.ВладелецФормы.ТекущийЭлемент.Имя;
// установить текущий элемент
	Если ИмяТаблицы="ТаблицаКураторы" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Куратор",ТекДанные.НаименованиеКуратор,ТекДанные.Куратор);
	ИначеЕсли ИмяТаблицы="ТаблицаВалюты" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Валюта",ТекДанные.КодВалюты,ТекДанные.Валюта);
	ИначеЕсли ИмяТаблицы="ТаблицаСтавкиНДС" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Ставка НДС",ТекДанные.СтрокаСтавкиНДС,Строка(ТекДанные.СтавкаНДС)+"("+Строка(ТекДанные.Валюта)+")");
	ИначеЕсли ИмяТаблицы="ТаблицаУслугиНоменклатуры" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Услуга",СокрЛП(ТекДанные.УслугаИзБиллинга)+"("+ТекДанные.КодУслуги+")",Строка(ТекДанные.Номенклатура)+"("+ТекДанные.Номенклатура.Код+")");
	ИначеЕсли ИмяТаблицы="ТаблицаКонтрагентыДоговоры" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Договор","("+СокрЛП(ТекДанные.КодКонтрагента)+"|"+СокрЛП(ТекДанные.НомерДоговора)+"|"+СокрЛП(ТекДанные.ЛицевойСчет)+")",Строка(ТекДанные.Договор)+"|"+Строка(ТекДанные.Валюта));
	ИначеЕсли ИмяТаблицы="ТаблицаАналитики" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Аналитика",Строка(ТекДанные.Номенклатура)+"("+ТекДанные.Номенклатура.Код+")|"+ТекДанные.ЦФО,Строка(ТекДанные.НоменклатурнаяГруппа)+"("+ТекДанные.НоменклатурнаяГруппа.Код+")");
	ИначеЕсли ИмяТаблицы="ТаблицаДокументы" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Документ",?(ПустаяСтрока(ТекДанные.НомерКорректировкиРеализации),ТекДанные.НомерРеализации,ТекДанные.НомерКорректировкиРеализации),Строка(ТекДанные.ДатаДокумента));
	ИначеЕсли ИмяТаблицы="ТаблицаДеталировка" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Детальная запись документа",Строка(ТекДанные.Номенклатура)+" = "+Строка(ТекДанные.Сумма),Строка(ТекДанные.СтавкаНДС));
	ИначеЕсли ИмяТаблицы="ТаблицаЗадолженностиМГМН" Тогда
		УстановитьРеквизитыТекущегоЭлемента("Детальная запись задолженности","("+Строка(ТекДанные.Контрагент)+"|"+Строка(ТекДанные.Договор)+") = "+Строка(ТекДанные.Сумма),"("+Строка(ТекДанные.Оператор)+"|"+Строка(ТекДанные.АгентскийДоговор)+")");
	КонецЕсли;
// установить ссылки
	Для каждого йСтр Из Элементы.ГруппаСсылокВверх.ПодчиненныеЭлементы Цикл
		Для каждого йЭлем Из йСтр.ПодчиненныеЭлементы Цикл
			йЭлем.Видимость=Ложь;
		КонецЦикла;
	КонецЦикла;
	Если ИмяТаблицы="ТаблицаКураторы" Тогда
	ИначеЕсли ИмяТаблицы="ТаблицаВалюты" Тогда
	ИначеЕсли ИмяТаблицы="ТаблицаСтавкиНДС" Тогда
		// валюты
		ЗаполнениеСтрокиСсылки("Валюты");
	ИначеЕсли ИмяТаблицы="ТаблицаУслугиНоменклатуры" Тогда
	ИначеЕсли ИмяТаблицы="ТаблицаКонтрагентыДоговоры" Тогда
		// валюты
		ЗаполнениеСтрокиСсылки("Валюты");
	ИначеЕсли ИмяТаблицы="ТаблицаАналитики" Тогда
	ИначеЕсли ИмяТаблицы="ТаблицаДокументы" Тогда
		// контрагенты-договоры
		ЗаполнениеСтрокиСсылки("Договоры");
		// кураторы
		ЗаполнениеСтрокиСсылки("Кураторы");
		// валюты
		ЗаполнениеСтрокиСсылки("Валюты");
	ИначеЕсли ИмяТаблицы="ТаблицаДеталировка" Тогда
		// документы
		ЗаполнениеСтрокиСсылки("Документы");
		// контрагенты-договоры
		ЗаполнениеСтрокиСсылки("Договоры");
		// услуги
		ЗаполнениеСтрокиСсылки("Услуги");
		// аналитики
		ЗаполнениеСтрокиСсылки("Аналитики");
		// ставки ндс
		ЗаполнениеСтрокиСсылки("СтавкиНДС");
		// валюты
		ЗаполнениеСтрокиСсылки("Валюты");
		// кураторы
		ЗаполнениеСтрокиСсылки("Кураторы");
	ИначеЕсли ИмяТаблицы="ТаблицаЗадолженностиМГМН" Тогда
		// контрагенты-договоры
		ЗаполнениеСтрокиСсылки("Договоры");
	КонецЕсли;
// установить отборы
	Для каждого йСтр Из Элементы.ГруппаОтборовВниз.ПодчиненныеЭлементы Цикл
		Для каждого йЭлем Из йСтр.ПодчиненныеЭлементы Цикл
			йЭлем.Видимость=Ложь;
		КонецЦикла;
	КонецЦикла;
	Если ИмяТаблицы="ТаблицаКураторы" Тогда
		// документы
		ЗаполнениеСтрокиОтбора("Документы","ИндексКуратора",ТекДанные.НомерСтроки,"Этот куратор указан");
		// деталировка
		ЗаполнениеСтрокиОтбора("Деталировка","ИндексКуратора",ТекДанные.НомерСтроки,"Этот куратор указан");
	ИначеЕсли ИмяТаблицы="ТаблицаВалюты" Тогда
		// документы
		ЗаполнениеСтрокиОтбора("Документы","ИндексВалюты",ТекДанные.НомерСтроки,"Эта валюта указана");
		// контрагенты-договоры
		ЗаполнениеСтрокиОтбора("Договоры","ИндексВалюты",ТекДанные.НомерСтроки,"Эта валюта указана");
		// ставки ндс
		ЗаполнениеСтрокиОтбора("СтавкиНДС","ИндексВалюты",ТекДанные.НомерСтроки,"Эта валюта указана");
		// деталировка
		ЗаполнениеСтрокиОтбора("Деталировка","ИндексВалюты",ТекДанные.НомерСтроки,"Эта валюта указана");
	ИначеЕсли ИмяТаблицы="ТаблицаСтавкиНДС" Тогда
		// деталировка
		ЗаполнениеСтрокиОтбора("Деталировка","ИндексСтавкиНДС",ТекДанные.НомерСтроки,"Эта ставка НДС указана");
	ИначеЕсли ИмяТаблицы="ТаблицаУслугиНоменклатуры" Тогда
		// деталировка
		ЗаполнениеСтрокиОтбора("Деталировка","ИндексУслуги",ТекДанные.НомерСтроки,"Эта услуга указана");
	ИначеЕсли ИмяТаблицы="ТаблицаКонтрагентыДоговоры" Тогда
		// документы
		ЗаполнениеСтрокиОтбора("Документы","ИндексДоговора",ТекДанные.НомерСтроки,"Этот договор указан");
		// деталировка
		ЗаполнениеСтрокиОтбора("Деталировка","ИндексДоговора",ТекДанные.НомерСтроки,"Этот договор указан");
		Если ТекОбъект.МестонахождениеБиллинга.БиллингМГМН Тогда
			// задолженность мгмн
			ЗаполнениеСтрокиОтбора("Задолженность","ИндексДоговора",ТекДанные.НомерСтроки,"Этот договор указан");
		КонецЕсли;
	ИначеЕсли ИмяТаблицы="ТаблицаАналитики" Тогда
		// деталировка
		ЗаполнениеСтрокиОтбора("Деталировка","ИндексАналитики",ТекДанные.НомерСтроки,"Эта аналитика указана");
	ИначеЕсли ИмяТаблицы="ТаблицаДокументы" Тогда
		// деталировка
		ЗаполнениеСтрокиОтбора("Деталировка","ИндексДокумента",ТекДанные.НомерСтроки,"Этот документ указан");
	ИначеЕсли ИмяТаблицы="ТаблицаДеталировка" Тогда
		// пусто
	ИначеЕсли ИмяТаблицы="ТаблицаЗадолженностиМГМН" Тогда
		// пусто
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтбораЗадолженностиНажатие(Элемент)
	ЭтаФорма.Закрыть("Задолженность##"+Элементы.ДекорацияНаТекущийВыбранныйЭлемент.Заголовок);
КонецПроцедуры
