
&НаКлиенте
Процедура ЗаполнитьДляПодчиненных(Команда)

	Если НЕ Объект.ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Ответ = Вопрос("Записать?", РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
		Записать();
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("ТранспортноеСредство, ЗемельныйУчасток, ЗданияЭТЦ, ЗданияОфисы, ЗданияГаражи");
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Объект);
	
	ЗаполнитьДляПодчиненныхСервер(Объект.Ссылка, СтруктураРеквизитов);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДляПодчиненныхСервер(Ссылка, СтруктураРеквизитов)
	
	ПланыВидовХарактеристик.абс_СвойстваОС.ЗаполнитьГруппуОСДляПодчиненных(Ссылка, СтруктураРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
