
////////////////////////////////////////////////////////////////////////////////
//  Вспомогательные процедуры/функции формирования файла реестра

Процедура ДобавитьИнформациюВДерево(ДеревоВыгрузки, НаборЗаписей)
	
	Для каждого ЭлементНабора Из НаборЗаписей Цикл
		ИмяЗаписи = ЭлементНабора.Ключ;
		Запись = ЭлементНабора.Значение;
		ТипДанных = Запись.ТипДанных;
		Если ТипДанных = "КОНСТАНТА" Тогда
			
			ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, Запись.Значение)
			
		ИначеЕсли ТипДанных = "ЧИСЛО" Тогда
			
			Если Запись.ЭлементНеОбязателен И Не ЗначениеЗаполнено(Запись.Значение) Тогда
				ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, "")
			Иначе
				ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, Формат(Запись.Значение,"ЧЦ=" + Запись.Размер + "; ЧДЦ=" + Запись.РазрядностьДробнойЧасти + "; ЧРД=.; ЧН=; ЧГ=0"))
			КонецЕсли;
			
		ИначеЕсли ТипДанных = "СТРОКА" Тогда
			
			Если ЗначениеЗаполнено(Запись.Размер) Тогда
				ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, Лев(СокрЛП(Запись.Значение), Запись.Размер))
			Иначе
				ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, СокрЛП(Запись.Значение))
			КонецЕсли;
			
		ИначеЕсли ТипДанных = "ДАТА" Тогда
			
			ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, ?(Не ЗначениеЗаполнено(Запись.Значение),"", Формат(Запись.Значение,"ДФ=yyyy-MM-dd")))
			
		ИначеЕсли ТипДанных = "ТАБЛИЦА" Тогда	
			
			ПроверятьНеобязательныеПоля = Ложь;
			Для каждого Поле Из Запись.Поля Цикл
				ПроверятьНеобязательныеПоля = Поле.ЭлементНеОбязателен;
				Если ПроверятьНеобязательныеПоля Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла; 
			
			Для каждого СтрокаТЗ Из Запись.Значение Цикл
				
				ВеткаСтрокиТЗ = ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, "");
				ВыводитьНеобязательныеПоля = Ложь;
				Если ПроверятьНеобязательныеПоля Тогда
					Для каждого Поле Из Запись.Поля Цикл
						Если Поле.ЭлементНеОбязателен Тогда
							ВыводитьНеобязательныеПоля = ЗначениеЗаполнено(СтрокаТЗ[Поле.ИмяПоля]);
							Если ВыводитьНеобязательныеПоля Тогда
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла; 
				КонецЕсли;
				
				Для каждого Поле Из Запись.Поля Цикл
					
					Если Поле.ЭлементНеОбязателен И Не ВыводитьНеобязательныеПоля Тогда
						Продолжить;
					КонецЕсли;
					
					Данные = СтрокаТЗ[Поле.ИмяПоля];
					
					Если Поле.ТипДанных = "ЧИСЛО" Тогда
						// для проверок
						//Поле.Размер, Поле.РазрядностьДробнойЧасти
						Данные = Формат(Данные,"ЧЦ=" + Поле.Размер + "; ЧДЦ=" + Поле.РазрядностьДробнойЧасти + "; ЧРД=.; ЧН=; ЧГ=0")
					ИначеЕсли Поле.ТипДанных = "СТРОКА" Тогда
						// для проверок
						//Поле.Размер
					ИначеЕсли Поле.ТипДанных = "ДАТА" Тогда
						Если Не ЗначениеЗаполнено(Данные) Тогда
							Данные = ""
						Иначе
							Данные = Формат(Данные,"ДФ=yyyy-MM-dd");
						КонецЕсли;
					КонецЕсли;
					
					ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ВеткаСтрокиТЗ, Поле.ИмяПоля, Данные)
					
				КонецЦикла; 
				
			КонецЦикла; 
			
		ИначеЕсли ТипДанных = "СТРУКТУРА" Тогда	
			
			ВеткаСтруктуры = ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, "");
			Для каждого Поле Из Запись.Поля Цикл
				
				Данные = Запись.Значение[Поле.ИмяПоля];
				
				Если Поле.ТипДанных = "ЧИСЛО" Тогда
					// для проверок
					//Поле.Размер, Поле.РазрядностьДробнойЧасти
					Данные = Формат(Данные,"ЧЦ=" + Поле.Размер + "; ЧДЦ=" + Поле.РазрядностьДробнойЧасти + "; ЧРД=.; ЧН=; ЧГ=0")
				ИначеЕсли Поле.ТипДанных = "СТРОКА" Тогда
					// для проверок
					//Поле.Размер
				ИначеЕсли Поле.ТипДанных = "ДАТА" Тогда
					Если Не ЗначениеЗаполнено(Данные) Тогда
						Данные = ""
					Иначе
						Данные = Формат(Данные,"ДФ=yyyy-MM-dd");
					КонецЕсли;
				КонецЕсли;
				
				ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ВеткаСтруктуры, Поле.ИмяПоля, Данные)
				
			КонецЦикла; 
			
		ИначеЕсли ТипДанных = "НАБОРЗАПИСЕЙ" Тогда
			
			ДобавитьИнформациюВДерево(ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, ИмяЗаписи, ""), Запись.Значение)
			
		КонецЕсли;	
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ДобавитьСтрокуВРеестр(Узел, ФорматСтроки, СтруктураДанных)

	НаборЗаписей = ПроцедурыПерсонифицированногоУчета.СкопироватьСтруктуруДанных(ФорматСтроки);
	
	НаборЗаписей.BATCH_NO.Значение = СтруктураДанных.НомерСтроки;
	НаборЗаписей.DOC_TYPE.Значение = СтруктураДанных.ВидВыплаты;
	НаборЗаписей.DOC_DT1.Значение = СтруктураДанных.ДатаПредставленияПакетаДокументов;
	НаборЗаписей.SNILS.Значение = СтрЗаменить(СтрЗаменить(СтруктураДанных.СтраховойНомерПФР, "-","")," ","");
	НаборЗаписей.INN_PERSON.Значение = СтруктураДанных.ИНН;
	НаборЗаписей.SURNAME.Значение = СтруктураДанных.Фамилия;
	НаборЗаписей.NAME.Значение = СтруктураДанных.Имя;
	НаборЗаписей.PATRONIMIC.Значение = СтруктураДанных.Отчество;
	НаборЗаписей.RESIDENT_FLAG.Значение = СтруктураДанных.СтатусНалогоплательщика;
	НаборЗаписей.BIRTHDAY.Значение = СтруктураДанных.ДатаРождения;
	НаборЗаписей.GENDER.Значение = Формат(СтруктураДанных.Пол = Перечисления.ПолФизическихЛиц.Женский,"БЛ=0; БИ=1");
	НаборЗаписей.ID_TYPE.Значение = СтруктураДанных.ВидУдостоверенияЛичности;
	НаборЗаписей.ID_NO.Значение = СтруктураДанных.СерияДокумента + " " + СтруктураДанных.НомерДокумента;
	НаборЗаписей.ID_DT.Значение = СтруктураДанных.ДатаВыдачиДокумента;
	НаборЗаписей.ID_DEPT.Значение = СтруктураДанных.КемВыданДокумент;
	Адрес = ?(ПустаяСтрока(СтруктураДанных.АдресПочтовый),СтруктураДанных.АдресРегистрации,СтруктураДанных.АдресПочтовый);
	СтруктураАдреса = УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(Адрес);	
	НаборЗаписей.POST_INDEX.Значение = СтруктураАдреса.Индекс;
	СтруктураАдреса.Индекс = "";
	НаборЗаписей.ADDR_HOUSE.Значение = СтруктураАдреса.Дом;
	СтруктураАдреса.Дом = "";
	НаборЗаписей.ADDR_BUILDING.Значение = СтруктураАдреса.Корпус;
	СтруктураАдреса.Корпус = "";
	НаборЗаписей.ADDR_FLAT.Значение = СтруктураАдреса.Квартира;
	СтруктураАдреса.Квартира = "";
	НаборЗаписей.ADDR.Значение = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтруктуре(СтруктураАдреса);
	НаборЗаписей.OWNER_FLAG.Значение = 1;
	НаборЗаписей.PAYMENT_TYPE.Значение = Формат(СтруктураДанных.ПеречислятьПособиеПочтовымПереводом,"БЛ=1; БИ=0");
	Если СтруктураДанных.ПеречислятьПособиеПочтовымПереводом Тогда
		НаборЗаписей.Удалить("ACCOUNT_BIC");
		НаборЗаписей.Удалить("ACCOUNT_NAME");
		НаборЗаписей.Удалить("ACCOUNT");
	Иначе
		НаборЗаписей.ACCOUNT_BIC.Значение = СтруктураДанных.БИКБанка;
		НаборЗаписей.ACCOUNT_NAME.Значение = СтруктураДанных.НаименованиеБанка;
		НаборЗаписей.ACCOUNT.Значение = СтруктураДанных.НомерЛицевогоСчета;
	КонецЕсли;
	Если Не ПустаяСтрока(СтруктураДанных.АдресПочтовый) И Не ПустаяСтрока(СтруктураДанных.АдресРегистрации) И СтруктураДанных.АдресПочтовый <> СтруктураДанных.АдресРегистрации Тогда
		СтруктураАдреса = УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(СтруктураДанных.АдресРегистрации);	
		НаборЗаписей.POST_INDEX2.Значение = СтруктураАдреса.Индекс;
		СтруктураАдреса.Индекс = "";
		НаборЗаписей.ADDR2_HOUSE.Значение = СтруктураАдреса.Дом;
		СтруктураАдреса.Дом = "";
		НаборЗаписей.ADDR2_BUILDING.Значение = СтруктураАдреса.Корпус;
		СтруктураАдреса.Корпус = "";
		НаборЗаписей.ADDR2_FLAT.Значение = СтруктураАдреса.Квартира;
		СтруктураАдреса.Квартира = "";
		НаборЗаписей.ADDR2.Значение = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтруктуре(СтруктураАдреса);
	Иначе
		НаборЗаписей.Удалить("ADDR2");
		НаборЗаписей.Удалить("ADDR2_HOUSE");
		НаборЗаписей.Удалить("ADDR2_BUILDING");
		НаборЗаписей.Удалить("ADDR2_FLAT");
		НаборЗаписей.Удалить("POST_INDEX2");
	КонецЕсли;
	НаборЗаписей.EMPLOYER.Значение = СтруктураДанных.ОрганизацияСокращенно;
	НаборЗаписей.EMPL_FLAG.Значение = Формат(СтруктураДанных.Совместительство,"БЛ=1; БИ=0");
	НаборЗаписей.EMPL_OGRN.Значение = СтруктураДанных.ОГРНОрганизации;
	НаборЗаписей.EMPL_REG_NO.Значение = СтруктураДанных.РегистрационныйНомерФСС;
	НаборЗаписей.EMPL_PARENT_NO.Значение = СтруктураДанных.КодПодчиненностиФСС;
	НаборЗаписей.EMPL_KPP.Значение = СтруктураДанных.КППОрганизации;
	НаборЗаписей.EMPL_INN.Значение = СтруктураДанных.ИННОрганизации;
	НаборЗаписей.APPROVE1.Значение = СтруктураДанных.ФИОРуководителя;
	НаборЗаписей.APPROVE1_ROLE.Значение = СтруктураДанных.ДолжностьРуководителя;
	Если ЗначениеЗаполнено(СтруктураДанных.ФИОГлБуха) Тогда
		НаборЗаписей.APPROVE2.Значение = СтруктураДанных.ФИОГлБуха;
	Иначе
		НаборЗаписей.Удалить("APPROVE2");
	КонецЕсли;
	Если СтруктураДанных.ПрименятьЛьготыПриНачисленииПособия Тогда
		НаборЗаписей.LIVE_COND_FLAG.Значение = Формат(СтруктураДанных.ПроживаниеРаботаВЛьготнойЗоне,"БЛ=2; БИ=1");
		НаборЗаписей.LIVE_COND.Значение = ?(СтруктураДанных.СтатусЛьготнойЗоны = Перечисления.ВидыЗонРадиационногоПоражения.ЗонаОтселения, 2, ?(СтруктураДанных.СтатусЛьготнойЗоны = Перечисления.ВидыЗонРадиационногоПоражения.ЗонаСЛьготнымСоциальноЭкономическимСтатусом,3,1));
	Иначе
		НаборЗаписей.Удалить("LIVE_COND_FLAG");
		НаборЗаписей.Удалить("LIVE_COND");
	КонецЕсли;
	
	Если СтруктураДанных.ВидВыплаты = "1" Или СтруктураДанных.ВидВыплаты = "2" Или СтруктураДанных.ВидВыплаты = "5" Тогда
		НаборЗаписей.BASE_AVG_DAILY_SAL.Значение = СтруктураДанных.СреднийДневнойЗаработок;
		Если СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = 0 Тогда
			НаборЗаписей.CALC_METHOD.Значение = 1;
			Если ЗначениеЗаполнено(СтруктураДанных.ЗамененныйПервыйГодРасчета) И СтруктураДанных.ПервыйГодРасчета <> СтруктураДанных.ЗамененныйПервыйГодРасчета
				Или ЗначениеЗаполнено(СтруктураДанных.ЗамененныйВторойГодРасчета) И СтруктураДанных.ВторойГодРасчета <> СтруктураДанных.ЗамененныйВторойГодРасчета Тогда
				НаборЗаписей.YEAR_CHANGE_FLAG.Значение = 1;
				НаборЗаписей.YEAR1_OLD.Значение = СтруктураДанных.ЗамененныйПервыйГодРасчета;
				НаборЗаписей.YEAR2_OLD.Значение = СтруктураДанных.ЗамененныйВторойГодРасчета;
			Иначе
				НаборЗаписей.YEAR_CHANGE_FLAG.Значение = СтруктураДанных.ЗамененныйПервыйГодРасчета ;
			КонецЕсли;	
			НаборЗаписей.YEAR1.Значение = СтруктураДанных.ПервыйГодРасчета;
			НаборЗаписей.YEAR2.Значение = СтруктураДанных.ВторойГодРасчета;
			НаборЗаписей.BASE_SUM1.Значение = СтруктураДанных.ЗаработокПервыйГодРасчета;
			НаборЗаписей.BASE_SUM2.Значение = СтруктураДанных.ЗаработокВторойГодРасчета;
			НаборЗаписей.BASE_AVG_SAL.Значение = СтруктураДанных.ЗаработокПервыйГодРасчета + СтруктураДанных.ЗаработокВторойГодРасчета;
			НаборЗаписей.Удалить("BASE_CALC_DAYS");
			НаборЗаписей.Удалить("CALC_MH_PERIOD_START");
			НаборЗаписей.Удалить("CALC_MH_PERIOD_FINISH");
			НаборЗаписей.Удалить("ROLE_WAGE");
		Иначе
			НаборЗаписей.Удалить("YEAR1_OLD");
			НаборЗаписей.Удалить("YEAR2_OLD");
			НаборЗаписей.Удалить("YEAR1");
			НаборЗаписей.Удалить("YEAR2");
			НаборЗаписей.Удалить("BASE_SUM1");
			НаборЗаписей.Удалить("BASE_SUM2");
			Если СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = 1 Тогда
				НаборЗаписей.BASE_AVG_SAL.Значение = СтруктураДанных.ЗаработокЗаПериодРасчета;
				НаборЗаписей.BASE_CALC_DAYS.Значение = СтруктураДанных.КалендарныхДнейРасчетногоПериода;
				НаборЗаписей.CALC_MH_PERIOD_START.Значение = СтруктураДанных.ПериодРасчетаСреднегоЗаработкаНачало;
				НаборЗаписей.CALC_MH_PERIOD_FINISH.Значение = СтруктураДанных.ПериодРасчетаСреднегоЗаработкаОкончание;
				НаборЗаписей.Удалить("ROLE_WAGE");
			Иначе
				Если СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = 2 Тогда
					НаборЗаписей.ROLE_WAGE.Значение = СтруктураДанных.ТарифнаяСтавкаОклад;
				ИначеЕсли СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = 3 Тогда
					НаборЗаписей.ROLE_WAGE.Значение = СтруктураДанных.МРОТ;
				Иначе
					НаборЗаписей.Удалить("ROLE_WAGE");
				КонецЕсли;
				НаборЗаписей.Удалить("BASE_AVG_SAL");
				НаборЗаписей.Удалить("BASE_CALC_DAYS");
				НаборЗаписей.Удалить("CALC_MH_PERIOD_START");
				НаборЗаписей.Удалить("CALC_MH_PERIOD_FINISH");
			КонецЕсли;
		КонецЕсли;
		Если СтруктураДанных.РайонныйКоэффициент >= 1.15 И СтруктураДанных.РайонныйКоэффициент <= 2 Тогда
			НаборЗаписей.KF_REG.Значение = СтруктураДанных.РайонныйКоэффициент * 100;
		Иначе
			НаборЗаписей.KF_REG.Значение = 100;
		КонецЕсли;
		Если СтруктураДанных.ДоляВремени > 0 И СтруктураДанных.ДоляВремени < 1 Тогда
			НаборЗаписей.KF_SHORT_DAY.Значение = СтруктураДанных.ДоляВремени;
		Иначе
			НаборЗаписей.KF_SHORT_DAY.Значение = 1;
		КонецЕсли;
	Иначе 	
		НаборЗаписей.Удалить("CALC_METHOD");
		НаборЗаписей.Удалить("ROLE_WAGE");
		НаборЗаписей.Удалить("BASE_AVG_DAILY_SAL");
		НаборЗаписей.Удалить("YEAR1_OLD");
		НаборЗаписей.Удалить("YEAR2_OLD");
		НаборЗаписей.Удалить("YEAR1");
		НаборЗаписей.Удалить("YEAR2");
		НаборЗаписей.Удалить("BASE_SUM1");
		НаборЗаписей.Удалить("BASE_SUM2");
		НаборЗаписей.Удалить("BASE_AVG_SAL");
		НаборЗаписей.Удалить("BASE_CALC_DAYS");
		НаборЗаписей.Удалить("CALC_MH_PERIOD_START");
		НаборЗаписей.Удалить("CALC_MH_PERIOD_FINISH");
		НаборЗаписей.Удалить("KF_REG");
		НаборЗаписей.Удалить("KF_SHORT_DAY");
	КонецЕсли;

	Если СтруктураДанных.ВидВыплаты = "1" Или СтруктураДанных.ВидВыплаты = "2" Тогда
		Если ЗначениеЗаполнено(СтруктураДанных.ПериодПростояС) и ЗначениеЗаполнено(СтруктураДанных.ПериодПростояПо) Тогда
			НаборЗаписей.DOWNTIME_START.Значение = СтруктураДанных.ПериодПростояС;
			НаборЗаписей.DOWNTIME_FINISH.Значение = СтруктураДанных.ПериодПростояПо;
		Иначе
			НаборЗаписей.Удалить("DOWNTIME_START");
			НаборЗаписей.Удалить("DOWNTIME_FINISH");
		КонецЕсли;
		НаборЗаписей.INSUR_YY.Значение = СтруктураДанных.СтажЛет;
		НаборЗаписей.INSUR_MM.Значение = СтруктураДанных.СтажМесяцев;
		Если СтруктураДанных.СтажЛет * 12 + СтруктураДанных.СтажМесяцев > СтруктураДанных.СтажБезНестраховыхПериодовЛет * 12 + СтруктураДанных.СтажБезНестраховыхПериодовСтажМесяцев Тогда
			ЛетСтажа = Макс(СтруктураДанных.СтажЛет - СтруктураДанных.СтажБезНестраховыхПериодовЛет, 0);
			МесяцевСтажа = СтруктураДанных.СтажМесяцев - СтруктураДанных.СтажБезНестраховыхПериодовСтажМесяцев;
			Если МесяцевСтажа < 0 Тогда
				Если ЛетСтажа < 1 Тогда
					МесяцевСтажа = 0
				Иначе
					ЛетСтажа = ЛетСтажа - 1;
					МесяцевСтажа = МесяцевСтажа + 12;
				КонецЕсли;
			КонецЕсли;
			НаборЗаписей.NOT_INSUR_YY.Значение = ЛетСтажа;
			НаборЗаписей.NOT_INSUR_MM.Значение = МесяцевСтажа;
		Иначе 
			НаборЗаписей.Удалить("NOT_INSUR_YY");
			НаборЗаписей.Удалить("NOT_INSUR_MM");
		КонецЕсли;
		НаборЗаписей.LN_CODE.Значение = СтруктураДанных.НомерВходящегоДокумента;
		Если ЗначениеЗаполнено(СтруктураДанных.НомерПервичногоБольничного) Тогда
			НаборЗаписей.PREV_LN_CODE.Значение = СтруктураДанных.НомерПервичногоБольничного;
		Иначе
			НаборЗаписей.PRIMARY_FLAG.Значение = 1;
			НаборЗаписей.Удалить("PREV_LN_CODE");
		КонецЕсли;
		НаборЗаписей.DUPLICATE_FLAG.Значение = Формат(СтруктураДанных.ЯвляетсяДубликатом, "БЛ=0; БИ=1");
		НаборЗаписей.LN_DATE.Значение = СтруктураДанных.ДатаВыдачиБольничного;
		НаборЗаписей.LPU_NAME.Значение = СтруктураДанных.НаименованиеЛПУ;
		НаборЗаписей.LPU_ADDRESS.Значение = СтруктураДанных.АдресЛПУ;
		НаборЗаписей.LPU_OGRN.Значение = СтруктураДанных.ОГРН_ЛПУ;
		НаборЗаписей.REASON1.Значение = СтруктураДанных.КодПричиныНетрудоспособности;
		НаборЗаписей.REASON2.Значение = СтруктураДанных.ДополнительныйКодПричиныНетрудоспособности;
		НаборЗаписей.REASON3.Значение = СтруктураДанных.ВторойКодПричиныНетрудоспособности;
		Если СтруктураДанных.Совместительство Тогда
			НаборЗаписей.PARENT_CODE.Значение = СтруктураДанных.НомерЛисткаПоОсновномуМестуРаботы;
		Иначе
			НаборЗаписей.Удалить("PARENT_CODE");
		КонецЕсли;
		НаборЗаписей.DATE1.Значение = СтруктураДанных.ДатаИзмененияКодаПричиныНетрудоспособности;    
		НаборЗаписей.DATE2.Значение = СтруктураДанных.ДатаОкончанияПутевки;
		НаборЗаписей.VOUCHER_NO.Значение = СтруктураДанных.НомерПутевки;
		НаборЗаписей.VOUCHER_OGRN.Значение = СтруктураДанных.ОГРН_Санатория;
		Если ЗначениеЗаполнено(СтруктураДанных.УходЗаРодственникомФИО1) Тогда
			НаборЗаписей.SERV1_AGE.Значение = СтруктураДанных.УходЗаРодственникомЛет1;
			НаборЗаписей.SERV1_MM.Значение = СтруктураДанных.УходЗаРодственникомМесяцев1;
			НаборЗаписей.SERV1_RELATION_CODE.Значение = СтруктураДанных.УходЗаРодственникомРодственнаяСвязь1;
			НаборЗаписей.SERV1_FIO.Значение = СтруктураДанных.УходЗаРодственникомФИО1;
			НаборЗаписей.SERV1_DAYS.Значение = СтруктураДанных.УходЗаРодственникомИспользованоДней1;
		Иначе
			НаборЗаписей.Удалить("SERV1_AGE");
			НаборЗаписей.Удалить("SERV1_MM");
			НаборЗаписей.Удалить("SERV1_RELATION_CODE");
			НаборЗаписей.Удалить("SERV1_FIO");
			НаборЗаписей.Удалить("SERV1_DAYS");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.УходЗаРодственникомФИО2) Тогда
			НаборЗаписей.SERV2_AGE.Значение = СтруктураДанных.УходЗаРодственникомЛет2;
			НаборЗаписей.SERV2_MM.Значение = СтруктураДанных.УходЗаРодственникомМесяцев2;
			НаборЗаписей.SERV2_RELATION_CODE.Значение = СтруктураДанных.УходЗаРодственникомРодственнаяСвязь2;
			НаборЗаписей.SERV2_FIO.Значение = СтруктураДанных.УходЗаРодственникомФИО2;
			НаборЗаписей.SERV2_DAYS.Значение = СтруктураДанных.УходЗаРодственникомИспользованоДней2;
		Иначе
			НаборЗаписей.Удалить("SERV2_AGE");
			НаборЗаписей.Удалить("SERV2_MM");
			НаборЗаписей.Удалить("SERV2_RELATION_CODE");
			НаборЗаписей.Удалить("SERV2_FIO");
			НаборЗаписей.Удалить("SERV2_DAYS");
		КонецЕсли;
		Если СтруктураДанных.ВидПособия = Перечисления.ВидыПособийСоциальногоСтрахования.БеременностьРоды Тогда
			НаборЗаписей.PREGN12W_FLAG.Значение = Формат(СтруктураДанных.ПоставленаНаУчетВРанниеСрокиБеременности,"БЛ=0; БИ=1");
		Иначе
			НаборЗаписей.Удалить("PREGN12W_FLAG");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ПериодНахожденияВСтационареСРебенкомС) И ЗначениеЗаполнено(СтруктураДанных.ПериодНахожденияВСтационареСРебенкомПо) Тогда
			НаборЗаписей.HOSPITAL_DT1.Значение = СтруктураДанных.ПериодНахожденияВСтационареСРебенкомС;
			НаборЗаписей.HOSPITAL_DT2.Значение = СтруктураДанных.ПериодНахожденияВСтационареСРебенкомПо;
		Иначе
			НаборЗаписей.Удалить("HOSPITAL_DT1");
			НаборЗаписей.Удалить("HOSPITAL_DT2");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.КодНарушенияРежима) И ЗначениеЗаполнено(СтруктураДанных.ДатаНарушенияРежима) Тогда
			НаборЗаписей.HOSPITAL_BREACH_CODE.Значение = СтруктураДанных.КодНарушенияРежима;
			НаборЗаписей.HOSPITAL_BREACH_DT.Значение = СтруктураДанных.ДатаНарушенияРежима;
		Иначе
			НаборЗаписей.Удалить("HOSPITAL_BREACH_CODE");
			НаборЗаписей.Удалить("HOSPITAL_BREACH_DT");
		КонецЕсли;
		НаборЗаписей.MSE_DT1.Значение = СтруктураДанных.ДатаНаправленияВБюроМСЭ;
		НаборЗаписей.MSE_DT2.Значение = СтруктураДанных.ДатаРегистрацииДокументовМСЭ;
		НаборЗаписей.MSE_DT3.Значение = СтруктураДанных.ДатаОсвидетельствованияМСЭ;
		Если СтруктураДанных.УстановленаИзмененаГруппаИнвалидности И ЗначениеЗаполнено(СтруктураДанных.ГруппаИнвалидности) Тогда
			НаборЗаписей.MSE_INVALID_GROUP.Значение = СтруктураДанных.ГруппаИнвалидности;
		Иначе
			НаборЗаписей.Удалить("MSE_INVALID_GROUP");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ДнейБолезниИнвалида) Тогда
			НаборЗаписей.MSE_INVALID_DAYS.Значение = СтруктураДанных.ДнейБолезниИнвалида;
		Иначе
			НаборЗаписей.Удалить("MSE_INVALID_DAYS");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.НовыйСтатусНетрудопособного) Тогда
			НаборЗаписей.MSE_RESULT.Значение = СтруктураДанных.НовыйСтатусНетрудопособного;
		Иначе
			НаборЗаписей.Удалить("MSE_RESULT");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеС1) И ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеПо1) Тогда
			НаборЗаписей.TREAT1_DT1.Значение = СтруктураДанных.ОсвобождениеС1;
			НаборЗаписей.TREAT1_DT2.Значение = СтруктураДанных.ОсвобождениеПо1;
			НаборЗаписей.TREAT1_DOCTOR_ROLE.Значение = СтруктураДанных.ДолжностьВрача1;
			НаборЗаписей.TREAT1_DOCTOR.Значение = СтруктураДанных.ФИОВрача1;
			НаборЗаписей.TREAT1_DOC_ID.Значение = СтруктураДанных.ИдентификационныйНомерВрача1;
			НаборЗаписей.TREAT1_CHAIRMAN_VK.Значение = СтруктураДанных.ФИОВрачаПредседателяВК1;
		Иначе
			НаборЗаписей.Удалить("TREAT1_DT1");
			НаборЗаписей.Удалить("TREAT1_DT2");
			НаборЗаписей.Удалить("TREAT1_DOCTOR_ROLE");
			НаборЗаписей.Удалить("TREAT1_DOCTOR");
			НаборЗаписей.Удалить("TREAT1_DOC_ID");
			НаборЗаписей.Удалить("TREAT1_CHAIRMAN_VK");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеС2) И ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеПо2) Тогда
			НаборЗаписей.TREAT2_DT1.Значение = СтруктураДанных.ОсвобождениеС2;
			НаборЗаписей.TREAT2_DT2.Значение = СтруктураДанных.ОсвобождениеПо2;
			НаборЗаписей.TREAT2_DOCTOR_ROLE.Значение = СтруктураДанных.ДолжностьВрача2;
			НаборЗаписей.TREAT2_DOCTOR.Значение = СтруктураДанных.ФИОВрача2;
			НаборЗаписей.TREAT2_DOC_ID.Значение = СтруктураДанных.ИдентификационныйНомерВрача2;
			НаборЗаписей.TREAT2_CHAIRMAN_VK.Значение = СтруктураДанных.ФИОВрачаПредседателяВК2;
		Иначе
			НаборЗаписей.Удалить("TREAT2_DT1");
			НаборЗаписей.Удалить("TREAT2_DT2");
			НаборЗаписей.Удалить("TREAT2_DOCTOR_ROLE");
			НаборЗаписей.Удалить("TREAT2_DOCTOR");
			НаборЗаписей.Удалить("TREAT2_DOC_ID");
			НаборЗаписей.Удалить("TREAT2_CHAIRMAN_VK");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеС3) И ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеПо3) Тогда
			НаборЗаписей.TREAT3_DT1.Значение = СтруктураДанных.ОсвобождениеС3;
			НаборЗаписей.TREAT3_DT2.Значение = СтруктураДанных.ОсвобождениеПо3;
			НаборЗаписей.TREAT3_DOCTOR_ROLE.Значение = СтруктураДанных.ДолжностьВрача3;
			НаборЗаписей.TREAT3_DOCTOR.Значение = СтруктураДанных.ФИОВрача3;
			НаборЗаписей.TREAT3_DOC_ID.Значение = СтруктураДанных.ИдентификационныйНомерВрача3;
			НаборЗаписей.TREAT3_CHAIRMAN_VK.Значение = СтруктураДанных.ФИОВрачаПредседателяВК3;
		Иначе
			НаборЗаписей.Удалить("TREAT3_DT1");
			НаборЗаписей.Удалить("TREAT3_DT2");
			НаборЗаписей.Удалить("TREAT3_DOCTOR_ROLE");
			НаборЗаписей.Удалить("TREAT3_DOCTOR");
			НаборЗаписей.Удалить("TREAT3_DOC_ID");
			НаборЗаписей.Удалить("TREAT3_CHAIRMAN_VK");
		КонецЕсли;
		НаборЗаписей.OTHER_STATE_DT.Значение = СтруктураДанных.ДатаНовыйСтатусНетрудопособного;
		НаборЗаписей.RETURN_DATE_LPU.Значение = СтруктураДанных.ДатаВыходаНаРаботу;
		НаборЗаписей.NEXT_LN_CODE.Значение = СтруктураДанных.НомерЛисткаПродолжения;
		НаборЗаписей.CALC_CONDITION1.Значение = СтруктураДанных.УсловияИсчисленияКод1;
		НаборЗаписей.CALC_CONDITION2.Значение = СтруктураДанных.УсловияИсчисленияКод2;
		НаборЗаписей.CALC_CONDITION3.Значение = СтруктураДанных.УсловияИсчисленияКод3;
		Если ЗначениеЗаполнено(СтруктураДанных.ДатаАктаФормыН1) Тогда
			НаборЗаписей.FORM1_DT.Значение = СтруктураДанных.ДатаАктаФормыН1;
		Иначе
			НаборЗаписей.Удалить("FORM1_DT");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ДатаНачалаРаботы) Тогда
			НаборЗаписей.RETURN_DATE_EMPL.Значение = СтруктураДанных.ДатаНачалаРаботы;
		Иначе
			НаборЗаписей.Удалить("RETURN_DATE_EMPL");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.СрочныйДоговорС) И ЗначениеЗаполнено(СтруктураДанных.СрочныйДоговорПо) Тогда
			НаборЗаписей.WORK_CONTRACT_START_DT.Значение = СтруктураДанных.СрочныйДоговорС;
			НаборЗаписей.WORK_CONTRACT_FINISH_DT.Значение = СтруктураДанных.СрочныйДоговорПо;
		Иначе
			НаборЗаписей.Удалить("WORK_CONTRACT_START_DT");
			НаборЗаписей.Удалить("WORK_CONTRACT_FINISH_DT");
		КонецЕсли;
		НаборЗаписей.DT1.Значение = СтруктураДанных.ДатаНачалаОплаты;
		НаборЗаписей.DT2.Значение = СтруктураДанных.ДатаОкончанияОплаты;
		ДатаС = СтруктураДанных.ОсвобождениеС1;
		ДатаПо = Макс(СтруктураДанных.ОсвобождениеПо1,СтруктураДанных.ОсвобождениеПо2,СтруктураДанных.ОсвобождениеПо3);
		Если ЗначениеЗаполнено(ДатаС) И ЗначениеЗаполнено(ДатаПо) Тогда
			НаборЗаписей.CALC_DAYS.Значение = (ДатаПо - ДатаС) / 86400 + 1;
		Иначе
			НаборЗаписей.Удалить("CALC_DAYS"); 
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.СуммаПособияРаботодателя) Тогда
			НаборЗаписей.EMPL_PAYMENT.Значение = СтруктураДанных.СуммаПособияРаботодателя;
		Иначе
			НаборЗаписей.Удалить("EMPL_PAYMENT");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.СуммаПособияФСС) Тогда
			НаборЗаписей.FSS_PAYMENT.Значение = СтруктураДанных.СуммаПособияФСС;
		Иначе
			НаборЗаписей.Удалить("FSS_PAYMENT");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.СуммаПособияВсего) Тогда
			НаборЗаписей.PAYMENT.Значение = СтруктураДанных.СуммаПособияВсего;
		Иначе
			НаборЗаписей.Удалить("PAYMENT");
		КонецЕсли;
	Иначе 	
		НаборЗаписей.Удалить("WORK_CONTRACT_START_DT");
		НаборЗаписей.Удалить("WORK_CONTRACT_FINISH_DT");
		НаборЗаписей.Удалить("DOWNTIME_START");
		НаборЗаписей.Удалить("DOWNTIME_FINISH");
		НаборЗаписей.Удалить("INSUR_YY");
		НаборЗаписей.Удалить("INSUR_MM");
		НаборЗаписей.Удалить("NOT_INSUR_YY");
		НаборЗаписей.Удалить("NOT_INSUR_MM");
		НаборЗаписей.Удалить("LN_CODE");
		НаборЗаписей.Удалить("PRIMARY_FLAG");
		НаборЗаписей.Удалить("PREV_LN_CODE");
		НаборЗаписей.Удалить("DUPLICATE_FLAG");
		НаборЗаписей.Удалить("LN_DATE");
		НаборЗаписей.Удалить("LPU_NAME");
		НаборЗаписей.Удалить("LPU_ADDRESS");
		НаборЗаписей.Удалить("LPU_OGRN");
		НаборЗаписей.Удалить("REASON1");
		НаборЗаписей.Удалить("REASON2");
		НаборЗаписей.Удалить("REASON3");
		НаборЗаписей.Удалить("PARENT_CODE");
		НаборЗаписей.Удалить("DATE1");
		НаборЗаписей.Удалить("DATE2");
		НаборЗаписей.Удалить("VOUCHER_NO");
		НаборЗаписей.Удалить("VOUCHER_OGRN");
		НаборЗаписей.Удалить("SERV1_AGE");
		НаборЗаписей.Удалить("SERV1_MM");
		НаборЗаписей.Удалить("SERV1_RELATION_CODE");
		НаборЗаписей.Удалить("SERV1_FIO");
		НаборЗаписей.Удалить("SERV1_DAYS");
		НаборЗаписей.Удалить("SERV2_AGE");
		НаборЗаписей.Удалить("SERV2_MM");
		НаборЗаписей.Удалить("SERV2_RELATION_CODE");
		НаборЗаписей.Удалить("SERV2_FIO");
		НаборЗаписей.Удалить("SERV2_DAYS");
		НаборЗаписей.Удалить("PREGN12W_FLAG");
		НаборЗаписей.Удалить("HOSPITAL_DT1");
		НаборЗаписей.Удалить("HOSPITAL_DT2");
		НаборЗаписей.Удалить("HOSPITAL_BREACH_CODE");
		НаборЗаписей.Удалить("HOSPITAL_BREACH_DT");
		НаборЗаписей.Удалить("MSE_DT1");
		НаборЗаписей.Удалить("MSE_DT2");
		НаборЗаписей.Удалить("MSE_DT3");
		НаборЗаписей.Удалить("MSE_INVALID_GROUP");
		НаборЗаписей.Удалить("MSE_INVALID_DAYS");
		НаборЗаписей.Удалить("MSE_RESULT");
		НаборЗаписей.Удалить("TREAT1_DT1");
		НаборЗаписей.Удалить("TREAT1_DT2");
		НаборЗаписей.Удалить("TREAT1_DOC_ID");
		НаборЗаписей.Удалить("TREAT1_CHAIRMAN_VK");
		НаборЗаписей.Удалить("TREAT1_DOCTOR_ROLE");
		НаборЗаписей.Удалить("TREAT1_DOCTOR");
		НаборЗаписей.Удалить("TREAT2_DT1");
		НаборЗаписей.Удалить("TREAT2_DT2");
		НаборЗаписей.Удалить("TREAT2_DOCTOR_ROLE");
		НаборЗаписей.Удалить("TREAT2_DOCTOR");
		НаборЗаписей.Удалить("TREAT2_DOC_ID");
		НаборЗаписей.Удалить("TREAT2_CHAIRMAN_VK");
		НаборЗаписей.Удалить("TREAT3_DT1");
		НаборЗаписей.Удалить("TREAT3_DT2");
		НаборЗаписей.Удалить("TREAT3_DOCTOR_ROLE");
		НаборЗаписей.Удалить("TREAT3_DOCTOR");
		НаборЗаписей.Удалить("TREAT3_DOC_ID");
		НаборЗаписей.Удалить("TREAT3_CHAIRMAN_VK");
		НаборЗаписей.Удалить("OTHER_STATE_DT");
		НаборЗаписей.Удалить("RETURN_DATE_LPU");
		НаборЗаписей.Удалить("NEXT_LN_CODE");
		НаборЗаписей.Удалить("CALC_CONDITION1");
		НаборЗаписей.Удалить("CALC_CONDITION2");
		НаборЗаписей.Удалить("CALC_CONDITION3");
		НаборЗаписей.Удалить("FORM1_DT");
		НаборЗаписей.Удалить("RETURN_DATE_EMPL");
		НаборЗаписей.Удалить("DT1");
		НаборЗаписей.Удалить("DT2"); 
		НаборЗаписей.Удалить("CALC_DAYS"); 
		НаборЗаписей.Удалить("EMPL_PAYMENT");
		НаборЗаписей.Удалить("FSS_PAYMENT");
		НаборЗаписей.Удалить("PAYMENT");
	КонецЕсли;

	Если СтруктураДанных.ВидВыплаты = "4" Или СтруктураДанных.ВидВыплаты = "5" Тогда
		НаборЗаписей.CERT_TYPE.Значение = СтруктураДанных.ДокументОРожденииВид;
		НаборЗаписей.CERT_NO.Значение = СтруктураДанных.ДокументОРожденииСерияНомер;
		НаборЗаписей.CERT_DT.Значение = СтруктураДанных.ДокументОРожденииДатаВыдачи;
		НаборЗаписей.CERT_BR.Значение = СтруктураДанных.ДатаРожденияРебенка;
		НаборЗаписей.CERT_SURNAME.Значение = СтруктураДанных.ФамилияРебенка;
		НаборЗаписей.CERT_NAME.Значение = СтруктураДанных.ИмяРебенка;
		НаборЗаписей.CERT_PATRONIMIC.Значение = СтруктураДанных.ОтчествоРебенка;
		Если ЗначениеЗаполнено(СтруктураДанных.ДатаСмертиРебенка) Тогда
			НаборЗаписей.CERT_DT_DATE.Значение = СтруктураДанных.ДатаСмертиРебенка;
		Иначе
			НаборЗаписей.Удалить("CERT_DT_DATE");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.УсыновлениеОпека) Тогда
			НаборЗаписей.WARD_FLAG.Значение = СтруктураДанных.УсыновлениеОпека;
			НаборЗаписей.WARD_REF_NO.Значение = СтруктураДанных.УсыновлениеОпекаСерияНомер;
			НаборЗаписей.WARD_REF_DT.Значение = СтруктураДанных.УсыновлениеОпекаДатаВыдачи;
		Иначе
			НаборЗаписей.Удалить("WARD_FLAG");
			НаборЗаписей.Удалить("WARD_REF_NO");
			НаборЗаписей.Удалить("WARD_REF_DT");
		КонецЕсли;
	Иначе 	
		НаборЗаписей.Удалить("CERT_TYPE");
		НаборЗаписей.Удалить("CERT_NO");
		НаборЗаписей.Удалить("CERT_DT");
		НаборЗаписей.Удалить("CERT_BR");
		НаборЗаписей.Удалить("CERT_DT_DATE");
		НаборЗаписей.Удалить("CERT_SURNAME");
		НаборЗаписей.Удалить("CERT_NAME");
		НаборЗаписей.Удалить("CERT_PATRONIMIC");
		НаборЗаписей.Удалить("WARD_FLAG");
		НаборЗаписей.Удалить("WARD_REF_NO");
		НаборЗаписей.Удалить("WARD_REF_DT");
	КонецЕсли;
	
	Если СтруктураДанных.ВидВыплаты = "4" Тогда
		Если ЗначениеЗаполнено(СтруктураДанных.НомерСправкиОРождении) И ЗначениеЗаполнено(СтруктураДанных.ДатаСправкиОРождении) Тогда
			НаборЗаписей.REF_24_NO.Значение = СтруктураДанных.НомерСправкиОРождении;
			НаборЗаписей.REF_24_DT.Значение = СтруктураДанных.ДатаСправкиОРождении;
		Иначе
			НаборЗаписей.Удалить("REF_24_NO");
			НаборЗаписей.Удалить("REF_24_DT");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.НомерДоговораОПередачеНаВоспитание) И ЗначениеЗаполнено(СтруктураДанных.ДатаДоговораОПередачеНаВоспитание) Тогда
			НаборЗаписей.REF_FAMILY_NO.Значение = СтруктураДанных.НомерДоговораОПередачеНаВоспитание;
			НаборЗаписей.REF_FAMILY_DT.Значение = СтруктураДанных.ДатаДоговораОПередачеНаВоспитание;
		Иначе
			НаборЗаписей.Удалить("REF_FAMILY_NO");
			НаборЗаписей.Удалить("REF_FAMILY_DT");
		КонецЕсли;
		НаборЗаписей.REF_NPAY_OTHER_NO.Значение = СтруктураДанных.НомерСправкиОтДругогоРодителя;
		НаборЗаписей.REF_NPAY_OTHER_DT.Значение = СтруктураДанных.ДатаСправкиОтДругогоРодителя; 
	Иначе 	
		НаборЗаписей.Удалить("REF_24_NO");
		НаборЗаписей.Удалить("REF_24_DT");
		НаборЗаписей.Удалить("REF_FAMILY_NO");
		НаборЗаписей.Удалить("REF_FAMILY_DT");
		НаборЗаписей.Удалить("REF_NPAY_OTHER_NO");
		НаборЗаписей.Удалить("REF_NPAY_OTHER_DT");
	КонецЕсли;
	
	Если СтруктураДанных.ВидВыплаты = "5" Тогда
		НаборЗаписей.CHILD_SER.Значение = СтруктураДанных.Очередность;
		НаборЗаписей.MH_OUT.Значение = Формат(СтруктураДанных.НаличиеРешенияСудаОЛишенииПрав,"БЛ=0; БИ=1");
		Если ЗначениеЗаполнено(СтруктураДанных.НомерПриказаНаОтпускПоУходуЗаРебенком) И ЗначениеЗаполнено(СтруктураДанных.ДатаПриказаНаОтпускПоУходуЗаРебенком) Тогда
			НаборЗаписей.HOLID_ORD_NO.Значение = СтруктураДанных.НомерПриказаНаОтпускПоУходуЗаРебенком;
			НаборЗаписей.HOLID_ORD_DT.Значение = СтруктураДанных.ДатаПриказаНаОтпускПоУходуЗаРебенком;
		Иначе
			НаборЗаписей.Удалить("HOLID_ORD_NO");
			НаборЗаписей.Удалить("HOLID_ORD_DT");
		КонецЕсли;
		НаборЗаписей.HOLID_DT_ST.Значение = СтруктураДанных.ДатаНачала;
		НаборЗаписей.HOLID_DT_FN.Значение = СтруктураДанных.ДатаОкончания;
		Если ЗначениеЗаполнено(СтруктураДанных.НомерПриказаОЗаменеПослеродовогоОтпуска) И ЗначениеЗаполнено(СтруктураДанных.ДатаПриказаОЗаменеПослеродовогоОтпуска) Тогда
			НаборЗаписей.HOLID_CH_ORD_NO.Значение = СтруктураДанных.НомерПриказаОЗаменеПослеродовогоОтпуска;
			НаборЗаписей.HOLID_CH_ORD_DT.Значение = СтруктураДанных.ДатаПриказаОЗаменеПослеродовогоОтпуска;
		Иначе
			НаборЗаписей.Удалить("HOLID_CH_ORD_NO");
			НаборЗаписей.Удалить("HOLID_CH_ORD_DT");
		КонецЕсли;
		НаборЗаписей.OTHER_CHILD_FLAG_DT.Значение = Формат(СтруктураДанных.НаличиеДокументаОСмерти,"БЛ=0; БИ=1");
		НаборЗаписей.OTHER_CHILD_FLAG_BR.Значение = Формат(СтруктураДанных.НаличиеДокументаОРождении,"БЛ=0; БИ=1");
		Если ЗначениеЗаполнено(СтруктураДанных.НомерСправкиОНеполученииПособияОтОтца) И ЗначениеЗаполнено(СтруктураДанных.ДатаСправкиОНеполученииПособияОтОтца) Тогда
			НаборЗаписей.REF_NPAY_FATHER_NO.Значение = СтруктураДанных.НомерСправкиОНеполученииПособияОтОтца;
			НаборЗаписей.REF_NPAY_FATHER_DT.Значение = СтруктураДанных.ДатаСправкиОНеполученииПособияОтОтца;
		Иначе
			НаборЗаписей.Удалить("REF_NPAY_FATHER_NO");
			НаборЗаписей.Удалить("REF_NPAY_FATHER_DT");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.НомерСправкиОНеполученииПособияОтМатери) И ЗначениеЗаполнено(СтруктураДанных.ДатаСправкиОНеполученииПособияОтМатери) Тогда
			НаборЗаписей.REF_NPAY_MOTHER_NO.Значение = СтруктураДанных.НомерСправкиОНеполученииПособияОтМатери;
			НаборЗаписей.REF_NPAY_MOTHER_DT.Значение = СтруктураДанных.ДатаСправкиОНеполученииПособияОтМатери;
		Иначе
			НаборЗаписей.Удалить("REF_NPAY_MOTHER_NO");
			НаборЗаписей.Удалить("REF_NPAY_MOTHER_DT");
		КонецЕсли;
	Иначе 	
		НаборЗаписей.Удалить("CHILD_SER");
		НаборЗаписей.Удалить("MH_OUT");
		НаборЗаписей.Удалить("HOLID_ORD_NO");
		НаборЗаписей.Удалить("HOLID_ORD_DT");
		НаборЗаписей.Удалить("HOLID_DT_ST");
		НаборЗаписей.Удалить("HOLID_DT_FN");
		НаборЗаписей.Удалить("HOLID_CH_ORD_NO");
		НаборЗаписей.Удалить("HOLID_CH_ORD_DT");
		НаборЗаписей.Удалить("OTHER_CHILD_FLAG_DT");
		НаборЗаписей.Удалить("OTHER_CHILD_FLAG_BR");
		НаборЗаписей.Удалить("REF_NPAY_FATHER_NO");
		НаборЗаписей.Удалить("REF_NPAY_FATHER_DT");
		НаборЗаписей.Удалить("REF_NPAY_MOTHER_NO");
		НаборЗаписей.Удалить("REF_NPAY_MOTHER_DT");
	КонецЕсли;
	
	ДобавитьИнформациюВДерево(ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(Узел, "ROW",""), НаборЗаписей);
	
КонецПроцедуры

Функция СтруктураДанныхДляФайлаРеестра()
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("НомерСтроки","");
	СтруктураДанных.Вставить("ВидВыплаты","");
	СтруктураДанных.Вставить("ДатаПредставленияПакетаДокументов","");
	СтруктураДанных.Вставить("СтраховойНомерПФР","");
	СтруктураДанных.Вставить("ИНН","");
	СтруктураДанных.Вставить("Фамилия","");
	СтруктураДанных.Вставить("Имя","");
	СтруктураДанных.Вставить("Отчество","");
	СтруктураДанных.Вставить("СтатусНалогоплательщика",0);
	СтруктураДанных.Вставить("ВидУдостоверенияЛичности","");
	СтруктураДанных.Вставить("СерияДокумента","");
	СтруктураДанных.Вставить("НомерДокумента","");
	СтруктураДанных.Вставить("ДатаВыдачиДокумента","");
	СтруктураДанных.Вставить("КемВыданДокумент","");
	СтруктураДанных.Вставить("АдресПочтовый","");
	СтруктураДанных.Вставить("АдресРегистрации","");
	СтруктураДанных.Вставить("ПеречислятьПособиеПочтовымПереводом", Ложь);
	СтруктураДанных.Вставить("БИКБанка","");
	СтруктураДанных.Вставить("НаименованиеБанка","");
	СтруктураДанных.Вставить("НомерЛицевогоСчета","");
	СтруктураДанных.Вставить("ОрганизацияСокращенно","");
	СтруктураДанных.Вставить("Совместительство", Ложь);
	СтруктураДанных.Вставить("ОГРНОрганизации","");
	СтруктураДанных.Вставить("РегистрационныйНомерФСС","");
	СтруктураДанных.Вставить("КодПодчиненностиФСС","");
	СтруктураДанных.Вставить("КППОрганизации","");
	СтруктураДанных.Вставить("ИННОрганизации","");
	СтруктураДанных.Вставить("ФИОРуководителя","");
	СтруктураДанных.Вставить("ДолжностьРуководителя","");
	СтруктураДанных.Вставить("ФИОГлБуха","");
	СтруктураДанных.Вставить("ДатаРождения","");
	СтруктураДанных.Вставить("Пол","");
	
	СтруктураДанных.Вставить("СреднийДневнойЗаработок",""); 
	СтруктураДанных.Вставить("ЗамененныйПервыйГодРасчета","");
	СтруктураДанных.Вставить("ЗамененныйВторойГодРасчета","");
	СтруктураДанных.Вставить("ПервыйГодРасчета","");
	СтруктураДанных.Вставить("ВторойГодРасчета","");
	СтруктураДанных.Вставить("ЗаработокПервыйГодРасчета",0);
	СтруктураДанных.Вставить("ЗаработокВторойГодРасчета",0);
	СтруктураДанных.Вставить("ЗаработокЗаПериодРасчета","");
	СтруктураДанных.Вставить("КалендарныхДнейРасчетногоПериода","");
	СтруктураДанных.Вставить("ПорядокРасчетаСреднегоЗаработка","");
	СтруктураДанных.Вставить("ПериодРасчетаСреднегоЗаработкаНачало","");
	СтруктураДанных.Вставить("ПериодРасчетаСреднегоЗаработкаОкончание","");
	СтруктураДанных.Вставить("ТарифнаяСтавкаОклад", 0);
	СтруктураДанных.Вставить("МРОТ", 0);
	СтруктураДанных.Вставить("РайонныйКоэффициент", 0);
	СтруктураДанных.Вставить("ДоляВремени", 0);
	
	СтруктураДанных.Вставить("ПрименятьЛьготыПриНачисленииПособия", Ложь);
	СтруктураДанных.Вставить("ПроживаниеРаботаВЛьготнойЗоне","");
	СтруктураДанных.Вставить("СтатусЛьготнойЗоны","");
	
	СтруктураДанных.Вставить("ПериодПростояС","");
	СтруктураДанных.Вставить("ПериодПростояПо","");
	СтруктураДанных.Вставить("СтажЛет", 0);
	СтруктураДанных.Вставить("СтажМесяцев", 0);
	СтруктураДанных.Вставить("СтажБезНестраховыхПериодовЛет", 0);
	СтруктураДанных.Вставить("СтажБезНестраховыхПериодовСтажМесяцев", 0);
	СтруктураДанных.Вставить("НомерВходящегоДокумента","");
	СтруктураДанных.Вставить("НомерПервичногоБольничного","");
	СтруктураДанных.Вставить("ЯвляетсяДубликатом","");
	СтруктураДанных.Вставить("ДатаВыдачиБольничного","");
	СтруктураДанных.Вставить("НаименованиеЛПУ","");
	СтруктураДанных.Вставить("АдресЛПУ","");
	СтруктураДанных.Вставить("ОГРН_ЛПУ","");
	СтруктураДанных.Вставить("КодПричиныНетрудоспособности","");
	СтруктураДанных.Вставить("ДополнительныйКодПричиныНетрудоспособности","");
	СтруктураДанных.Вставить("ВторойКодПричиныНетрудоспособности","");
	СтруктураДанных.Вставить("НомерЛисткаПоОсновномуМестуРаботы","");
	СтруктураДанных.Вставить("ДатаИзмененияКодаПричиныНетрудоспособности","");    
	СтруктураДанных.Вставить("ДатаОкончанияПутевки","");
	СтруктураДанных.Вставить("НомерПутевки","");
	СтруктураДанных.Вставить("ОГРН_Санатория","");
	СтруктураДанных.Вставить("УходЗаРодственникомЛет1","");
	СтруктураДанных.Вставить("УходЗаРодственникомМесяцев1","");
	СтруктураДанных.Вставить("УходЗаРодственникомРодственнаяСвязь1","");
	СтруктураДанных.Вставить("УходЗаРодственникомФИО1","");
	СтруктураДанных.Вставить("УходЗаРодственникомИспользованоДней1","");
	СтруктураДанных.Вставить("УходЗаРодственникомЛет2","");
	СтруктураДанных.Вставить("УходЗаРодственникомМесяцев2","");
	СтруктураДанных.Вставить("УходЗаРодственникомРодственнаяСвязь2","");
	СтруктураДанных.Вставить("УходЗаРодственникомФИО2","");
	СтруктураДанных.Вставить("УходЗаРодственникомИспользованоДней2","");
	СтруктураДанных.Вставить("ВидПособия","");
	СтруктураДанных.Вставить("ПоставленаНаУчетВРанниеСрокиБеременности","");
	СтруктураДанных.Вставить("ПериодНахожденияВСтационареСРебенкомС","");
	СтруктураДанных.Вставить("ПериодНахожденияВСтационареСРебенкомПо","");
	СтруктураДанных.Вставить("КодНарушенияРежима","");
	СтруктураДанных.Вставить("ДатаНарушенияРежима","");
	СтруктураДанных.Вставить("ДатаНаправленияВБюроМСЭ","");
	СтруктураДанных.Вставить("ДатаРегистрацииДокументовМСЭ","");
	СтруктураДанных.Вставить("ДатаОсвидетельствованияМСЭ","");
	СтруктураДанных.Вставить("УстановленаИзмененаГруппаИнвалидности", Ложь);
	СтруктураДанных.Вставить("ГруппаИнвалидности","");
	СтруктураДанных.Вставить("ДнейБолезниИнвалида",0);
	СтруктураДанных.Вставить("НовыйСтатусНетрудопособного","");
	СтруктураДанных.Вставить("ОсвобождениеС1","");
	СтруктураДанных.Вставить("ОсвобождениеПо1","");
	СтруктураДанных.Вставить("ДолжностьВрача1","");
	СтруктураДанных.Вставить("ФИОВрача1","");
	СтруктураДанных.Вставить("ИдентификационныйНомерВрача1","");
	СтруктураДанных.Вставить("ФИОВрачаПредседателяВК1","");
	СтруктураДанных.Вставить("ОсвобождениеС2","");
	СтруктураДанных.Вставить("ОсвобождениеПо2","");
	СтруктураДанных.Вставить("ДолжностьВрача2","");
	СтруктураДанных.Вставить("ФИОВрача2","");
	СтруктураДанных.Вставить("ИдентификационныйНомерВрача2","");
	СтруктураДанных.Вставить("ФИОВрачаПредседателяВК2","");
	СтруктураДанных.Вставить("ОсвобождениеС3","");
	СтруктураДанных.Вставить("ОсвобождениеПо3","");
	СтруктураДанных.Вставить("ДолжностьВрача3","");
	СтруктураДанных.Вставить("ФИОВрача3","");
	СтруктураДанных.Вставить("ИдентификационныйНомерВрача3","");
	СтруктураДанных.Вставить("ФИОВрачаПредседателяВК3","");
	СтруктураДанных.Вставить("ДатаНовыйСтатусНетрудопособного","");
	СтруктураДанных.Вставить("ДатаВыходаНаРаботу","");
	СтруктураДанных.Вставить("НомерЛисткаПродолжения","");
	СтруктураДанных.Вставить("УсловияИсчисленияКод1","");
	СтруктураДанных.Вставить("УсловияИсчисленияКод2","");
	СтруктураДанных.Вставить("УсловияИсчисленияКод3","");
	СтруктураДанных.Вставить("ДатаАктаФормыН1",""); 
	СтруктураДанных.Вставить("ДатаНачалаРаботы","");
	СтруктураДанных.Вставить("СрочныйДоговорС","");
	СтруктураДанных.Вставить("СрочныйДоговорПо","");
	СтруктураДанных.Вставить("ДатаНачалаОплаты","");
	СтруктураДанных.Вставить("ДатаОкончанияОплаты","");
	СтруктураДанных.Вставить("СуммаПособияРаботодателя",0);
	СтруктураДанных.Вставить("СуммаПособияФСС",0);
	СтруктураДанных.Вставить("СуммаПособияВсего",0);
	
	СтруктураДанных.Вставить("ДокументОРожденииВид","");
	СтруктураДанных.Вставить("ДокументОРожденииСерияНомер","");
	СтруктураДанных.Вставить("ДокументОРожденииДатаВыдачи","");
	СтруктураДанных.Вставить("ФамилияРебенка","");
	СтруктураДанных.Вставить("ИмяРебенка","");
	СтруктураДанных.Вставить("ОтчествоРебенка","");
	СтруктураДанных.Вставить("ДатаРожденияРебенка","");
	СтруктураДанных.Вставить("ДатаСмертиРебенка","");
	СтруктураДанных.Вставить("УсыновлениеОпека","");
	СтруктураДанных.Вставить("УсыновлениеОпекаСерияНомер","");
	СтруктураДанных.Вставить("УсыновлениеОпекаДатаВыдачи","");
	
	СтруктураДанных.Вставить("ДатаСправкиОРождении","");
	СтруктураДанных.Вставить("НомерСправкиОРождении","");
	СтруктураДанных.Вставить("ДатаДоговораОПередачеНаВоспитание","");
	СтруктураДанных.Вставить("НомерДоговораОПередачеНаВоспитание","");
	СтруктураДанных.Вставить("ДатаСправкиОтДругогоРодителя","");
	СтруктураДанных.Вставить("НомерСправкиОтДругогоРодителя","");
	
	СтруктураДанных.Вставить("ДатаПриказаНаОтпускПоУходуЗаРебенком","");
	СтруктураДанных.Вставить("НомерПриказаНаОтпускПоУходуЗаРебенком","");
	СтруктураДанных.Вставить("Очередность",0);
	СтруктураДанных.Вставить("НаличиеРешенияСудаОЛишенииПрав",Ложь);
	СтруктураДанных.Вставить("ДатаНачала","");
	СтруктураДанных.Вставить("ДатаОкончания","");
	СтруктураДанных.Вставить("ДатаСправкиОНеполученииПособияОтОтца","");
	СтруктураДанных.Вставить("НомерСправкиОНеполученииПособияОтОтца","");
	СтруктураДанных.Вставить("ДатаСправкиОНеполученииПособияОтМатери","");
	СтруктураДанных.Вставить("НомерСправкиОНеполученииПособияОтМатери","");
	СтруктураДанных.Вставить("НаличиеДокументаОРождении",Ложь);
	СтруктураДанных.Вставить("НаличиеДокументаОСмерти",Ложь);
	СтруктураДанных.Вставить("ДатаПриказаОЗаменеПослеродовогоОтпуска","");
	СтруктураДанных.Вставить("НомерПриказаОЗаменеПослеродовогоОтпуска","");

	Возврат СтруктураДанных
	
КонецФункции // СтруктураДанныхДляФайлаРеестра()

////////////////////////////////////////////////////////////////////////////////

Процедура ЗаписатьФИОРебенкаВПоляДокумента(СтрокаФИО, СтрокаДокумента, ПолеФамилия = "ФамилияРебенка", ПолеИмя = "ИмяРебенка",ПолеОтчество = "ОтчествоРебенка") Экспорт
	
	ФИО = ОбщегоНазначения.ПолучитьМассивФИО(СтрокаФИО);
	
	СтрокаДокумента[ПолеФамилия] = ФИО[0];
	СтрокаДокумента[ПолеИмя] = ФИО[1];
	СтрокаДокумента[ПолеОтчество] = ФИО[2];
	
КонецПроцедуры

Процедура ЗаполнитьДанныеОрганизации(ЭтотОбъект) Экспорт

	ДанныеСтрахователя = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЭтотОбъект.Организация,"РегистрационныйНомерФСС, ДополнительныйКодФСС, КодПодчиненностиФСС, НаименованиеТерриториальногоОрганаФСС, ИНН, КПП, ОГРН, ИндивидуальныйПредприниматель");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеСтрахователя);
	
	Если ОбщегоНазначенияПереопределяемый.ЭтоЮрЛицо(ЭтотОбъект.Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЛицаСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	ОтветственныеЛицаСрезПоследних.ОтветственноеЛицо,
		|	ОтветственныеЛицаСрезПоследних.ФизическоеЛицо,
		|	ФизическиеЛица.Комментарий
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|			&Дата,
		|			ОтветственноеЛицо в (ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель), ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер))
		|				И СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ОтветственныеЛицаСрезПоследних.ФизическоеЛицо = ФизическиеЛица.Ссылка";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		    Если Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда
				ЭтотОбъект.Руководитель = Выборка.ФизическоеЛицо;
				ЭтотОбъект.ДолжностьРуководителя = Выборка.ДолжностьРуководителя;
			ИначеЕсли Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер  Тогда
				ЭтотОбъект.ГлавныйБухгалтер = Выборка.ФизическоеЛицо;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ЭтотОбъект.Руководитель = ДанныеСтрахователя.ИндивидуальныйПредприниматель;
		ЭтотОбъект.ГлавныйБухгалтер = ЭтотОбъект.Руководитель;
		ЭтотОбъект.ДолжностьРуководителя = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДанныеЗастрахованного(ДанныеЗастрахованного, Отказ, Заголовок, НачалоСообщения = "") Экспорт

	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.ФИОСотрудника) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указано ФИО сотрудника!", Отказ, Заголовок);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.ДатаРождения) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указана дата рождения получателя пособия!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.Пол) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан пол получателя пособия!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрЗаменить(ДанныеЗастрахованного.СтраховойНомерПФР,"-","")) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан номер страхового свидетельства!", Отказ, Заголовок);
	ИначеЕсли Не РегламентированнаяОтчетность.СтраховойНомерПФРСоответствуетТребованиям(ДанныеЗастрахованного.СтраховойНомерПФР) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Задан неверный номер страхового свидетельства!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.СтатусНалогоплательщикаДляПроверки) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан статус налогоплательщика!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеЗастрахованного.ИНН) И Не РегламентированнаяОтчетность.ИННСоответствуетТребованиям(ДанныеЗастрахованного.ИНН, Перечисления.ЮрФизЛицо.ФизЛицо) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Указан неверный ИНН!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.ВидУдостоверенияЛичности) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан вид документа, удостоверяющего личность!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.СерияДокумента + ДанныеЗастрахованного.НомерДокумента) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указаны серия и номер документа, удостоверяющего личность!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.ДатаВыдачиДокумента) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указана дата выдачи документа, удостоверяющего личность!", Отказ, Заголовок);
	КонецЕсли;
	
	// Банковские реквизиты проверяем только если планируется банковский перевод
	Если НЕ ДанныеЗастрахованного.ПеречислятьПособиеПочтовымПереводом Тогда
		
		Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.НаименованиеБанка) Тогда
			ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан Банк!", Отказ, Заголовок);
		КонецЕсли;
	
		Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.БИКБанка) Тогда
			ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан БИК банка!", Отказ, Заголовок);
		КонецЕсли;
	
		Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.НомерЛицевогоСчета) Тогда
			ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан номер счета!", Отказ, Заголовок);
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.АдресРегистрации) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указан адрес регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗастрахованного.ДатаПредставленияПакетаДокументов) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(НачалоСообщения + "Не указана дата представления пакета документов!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьДанныеЗастрахованного()

Процедура ПроверитьДанныеСтрахователя(ДанныеСтрахователя, Отказ, Заголовок) Экспорт

	Если Не ЗначениеЗаполнено(ДанныеСтрахователя.Организация) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("Не указана организация!"), Отказ, Заголовок);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДанныеСтрахователя.ИННОрганизации) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан ИНН страхователя!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ОбщегоНазначенияПереопределяемый.ЭтоЮрЛицо(ДанныеСтрахователя.Организация) И Не ЗначениеЗаполнено(ДанныеСтрахователя.КППОрганизации) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан КПП страхователя!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеСтрахователя.НаименованиеТерриториальногоОрганаФСС) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указано наименование территориального органа ФСС!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеСтрахователя.РегистрационныйНомерФСС) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан регистрационный номер в ФСС!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеСтрахователя.РеестрСоставил) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан составитель реестра!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеСтрахователя.ТелефонСоставителя) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан телефон составителя реестра!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьДанныеСтрахователя()

Функция ДанныеОрганизацииДляЗаявленияНаВыплатуПособия(Организация, Дата) Экспорт

	ДанныеОрганизации = Новый Структура("Уполномоченный, ДолжностьУполномоченного");
	
	Если ОбщегоНазначенияПереопределяемый.ЭтоЮрЛицо(Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЛицаСрезПоследних.Должность КАК ДолжностьУполномоченного,
		|	ОтветственныеЛицаСрезПоследних.ФизическоеЛицо Уполномоченный,
		|	ФизическиеЛица.Комментарий
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|			&Дата,
		|			ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
		|				И СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ОтветственныеЛицаСрезПоследних.ФизическоеЛицо = ФизическиеЛица.Ссылка";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Дата", Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
		    ЗаполнитьЗначенияСвойств(ДанныеОрганизации, Выборка);
		КонецЕсли;
	Иначе
		ДанныеОрганизации.Уполномоченный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация,"ИндивидуальныйПредприниматель");
		ДанныеОрганизации.ДолжностьУполномоченного = "";
	КонецЕсли;
	
	Возврат ДанныеОрганизации
	
КонецФункции

Функция ДанныеСоставителяРеестра(Ответственный) Экспорт
	
	ДанныеСоставителя = Новый Структура("РеестрСоставил, ТелефонСоставителя, АдресЭлектроннойПочтыСоставителя");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.ФизЛицо КАК РеестрСоставил,
	|	АдресЭП.Представление КАК АдресЭлектроннойПочтыСоставителя,
	|	Телефон.Представление КАК ТелефонСоставителя
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресЭП
	|		ПО Пользователи.Ссылка = АдресЭП.Объект
	|			И (АдресЭП.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя))
	|			И (АдресЭП.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Телефон
	|		ПО Пользователи.ФизЛицо = Телефон.Объект
	|			И (Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
	|			И (Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|ГДЕ
	|	Пользователи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ответственный);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСоставителя,Выборка);
	КонецЕсли;
	
	Возврат ДанныеСоставителя
	
КонецФункции // ДанныеСоставителяРеестра()

Функция ДанныеСотрудникаДляЗаявленияНаВыплатуПособия(Организация, Сотрудник, Дата, Режим = "ДляДокумента") Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиОрганизаций.Физлицо,
	|	СотрудникиОрганизаций.Ссылка,
	|	СотрудникиОрганизаций.ВидЗанятости
	|ПОМЕСТИТЬ ВТФизлицо
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|ГДЕ
	|	СотрудникиОрганизаций.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеПоБольничномуЛисту.Ссылка,
	|	НачислениеПоБольничномуЛисту.Дата,
	|	НачислениеПоБольничномуЛисту.ПеречислятьПособиеПочтовымПереводом,
	|	НачислениеПоБольничномуЛисту.Банк,
	|	НачислениеПоБольничномуЛисту.НаименованиеБанка,
	|	НачислениеПоБольничномуЛисту.БИКБанка,
	|	НачислениеПоБольничномуЛисту.НомерЛицевогоСчета,
	|	НачислениеПоБольничномуЛисту.АдресПочтовый
	|ПОМЕСТИТЬ ВТДокументыПособий
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
	|ГДЕ
	|	НачислениеПоБольничномуЛисту.Физлицо В
	|			(ВЫБРАТЬ
	|				Физлица.Физлицо
	|			ИЗ
	|				ВТФизлицо КАК Физлица)
	|	И НачислениеПоБольничномуЛисту.Организация = &Организация
	|	И (НачислениеПоБольничномуЛисту.ПричинаНетрудоспособности <> ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ОбщееЗаболевание)
	|			ИЛИ ДОБАВИТЬКДАТЕ(НачислениеПоБольничномуЛисту.ДатаНачалаСобытия, ДЕНЬ, НачислениеПоБольничномуЛисту.ДнейОплатыРаботодателем) <= НачислениеПоБольничномуЛисту.ДатаОкончания)
	|	И НачислениеПоБольничномуЛисту.ПериодРегистрации >= &ДатаПередачиФССВыплатыПособий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеОтпускаРаботникамОрганизаций.Ссылка,
	|	НачислениеОтпускаРаботникамОрганизаций.Дата,
	|	НачислениеОтпускаРаботникамОрганизаций.ПеречислятьПособиеПочтовымПереводом,
	|	НачислениеОтпускаРаботникамОрганизаций.Банк,
	|	НачислениеОтпускаРаботникамОрганизаций.НаименованиеБанка,
	|	НачислениеОтпускаРаботникамОрганизаций.БИКБанка,
	|	НачислениеОтпускаРаботникамОрганизаций.НомерЛицевогоСчета,
	|	НачислениеОтпускаРаботникамОрганизаций.АдресПочтовый
	|ИЗ
	|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК НачислениеОтпускаРаботникамОрганизаций
	|ГДЕ
	|	НачислениеОтпускаРаботникамОрганизаций.ВидРасчетаДополнительногоОтпуска.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев)
	|	И НачислениеОтпускаРаботникамОрганизаций.Физлицо В
	|			(ВЫБРАТЬ
	|				Физлица.Физлицо
	|			ИЗ
	|				ВТФизлицо КАК Физлица)
	|	И НачислениеОтпускаРаботникамОрганизаций.Организация = &Организация
	|	И НачислениеОтпускаРаботникамОрганизаций.ПериодРегистрации >= &ДатаПередачиФССВыплатыПособий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтпускПоУходуЗаРебенком.Ссылка,
	|	ОтпускПоУходуЗаРебенком.Дата,
	|	ОтпускПоУходуЗаРебенком.ПеречислятьПособиеПочтовымПереводом,
	|	ОтпускПоУходуЗаРебенком.Банк,
	|	ОтпускПоУходуЗаРебенком.НаименованиеБанка,
	|	ОтпускПоУходуЗаРебенком.БИКБанка,
	|	ОтпускПоУходуЗаРебенком.НомерЛицевогоСчета,
	|	ОтпускПоУходуЗаРебенком.АдресПочтовый
	|ИЗ
	|	Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
	|ГДЕ
	|	ОтпускПоУходуЗаРебенком.Физлицо В
	|			(ВЫБРАТЬ
	|				Физлица.Физлицо
	|			ИЗ
	|				ВТФизлицо КАК Физлица)
	|	И ОтпускПоУходуЗаРебенком.Организация = &Организация
	|	И ОтпускПоУходуЗаРебенком.ВыплачиватьПособиеДоПолутораЛет
	|	И ОтпускПоУходуЗаРебенком.ДатаОкончанияПособияДоПолутораЛет >= &ДатаПередачиФССВыплатыПособий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.Ссылка,
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.Ссылка.Дата,
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.ПеречислятьПособиеПочтовымПереводом,
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.Банк,
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.НаименованиеБанка,
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.БИКБанка,
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.НомерЛицевогоСчета,
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.АдресПочтовый
	|ИЗ
	|	Документ.РеестрСведенийВФССОПособияхПоНетрудоспособности.РаботникиОрганизации КАК РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации
	|ГДЕ
	|	РеестрСведенийВФССОПособияхПоНетрудоспособностиРаботникиОрганизации.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Физлица.Физлицо
	|			ИЗ
	|				ВТФизлицо КАК Физлица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.Ссылка,
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.Ссылка.Дата,
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.ПеречислятьПособиеПочтовымПереводом,
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.Банк,
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.НаименованиеБанка,
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.БИКБанка,
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.НомерЛицевогоСчета,
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.АдресПочтовый
	|ИЗ
	|	Документ.РеестрСведенийВФССОПособияхПриРожденииРебенка.РаботникиОрганизации КАК РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации
	|ГДЕ
	|	РеестрСведенийВФССОПособияхПриРожденииРебенкаРаботникиОрганизации.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Физлица.Физлицо
	|			ИЗ
	|				ВТФизлицо КАК Физлица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.Ссылка,
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.Ссылка.Дата,
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.ПеречислятьПособиеПочтовымПереводом,
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.Банк,
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.НаименованиеБанка,
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.БИКБанка,
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.НомерЛицевогоСчета,
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.АдресПочтовый
	|ИЗ
	|	Документ.РеестрСведенийВФССОЕжемесячныхПособияхПоУходу.РаботникиОрганизации КАК РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации
	|ГДЕ
	|	РеестрСведенийВФССОЕжемесячныхПособияхПоУходуРаботникиОрганизации.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Физлица.Физлицо
	|			ИЗ
	|				ВТФизлицо КАК Физлица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыПособий.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	|	ДокументыПособий.БИКБанка КАК БИКБанка,
	|	ДокументыПособий.НаименованиеБанка КАК НаименованиеБанка,
	|	ДокументыПособий.АдресПочтовый КАК АдресПочтовый,
	|	ДокументыПособий.ПеречислятьПособиеПочтовымПереводом КАК ПеречислятьПособиеПочтовымПереводом,
	|	ДокументыПособий.Банк КАК Банк
	|ПОМЕСТИТЬ ВТДанныеПоследнегоДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ДокументыПособий.Ссылка) КАК Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(ДокументыПособий.Дата) КАК Дата
	|		ИЗ
	|			ВТДокументыПособий КАК ДокументыПособий
	|		ГДЕ
	|			ДокументыПособий.Дата < &Дата) КАК ДатаДокумента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыПособий КАК ДокументыПособий
	|			ПО ДатаДокумента.Дата = ДокументыПособий.Дата) КАК ДокументСДанными
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыПособий КАК ДокументыПособий
	|		ПО ДокументСДанными.Ссылка = ДокументыПособий.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета,
	|	ЛицевыеСчетаРаботниковОрганизации.Банк.ОсновнойБанковскийСчет.Банк КАК Банк,
	|	ЛицевыеСчетаРаботниковОрганизации.Банк.ОсновнойБанковскийСчет.Банк.Наименование КАК Наименование,
	|	ЛицевыеСчетаРаботниковОрганизации.Банк.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	ЛицевыеСчетаРаботниковОрганизации.Банк КАК БанкИзмерение
	|ПОМЕСТИТЬ ВТДанныеЗарплатногоСчета
	|ИЗ
	|	РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
	|ГДЕ
	|	ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
	|	И ЛицевыеСчетаРаботниковОрганизации.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Физлица.Физлицо
	|			ИЗ
	|				ВТФизлицо КАК Физлица)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевыеСчетаРаботниковОрганизации.Банк
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛица.Наименование,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	"","" + АдресаРегистрации.Поле1 + "","" + АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 + "","" + ВЫБОР
	|		КОГДА АдресаРегистрации.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
	|			ТОГДА ""дом""
	|		ИНАЧЕ ""владение""
	|	КОНЕЦ + "","" + ВЫБОР
	|		КОГДА АдресаРегистрации.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
	|			ТОГДА ""корпус""
	|		ИНАЧЕ ""строение""
	|	КОНЕЦ + "","" + ВЫБОР
	|		КОГДА АдресаРегистрации.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
	|			ТОГДА ""кв.""
	|		ИНАЧЕ ""оф.""
	|	КОНЕЦ КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА ДанныеПоследнегоДокумента.АдресПочтовый ЕСТЬ НЕ NULL 
	|			ТОГДА ДанныеПоследнегоДокумента.АдресПочтовый
	|		КОГДА АдресаФактические.Поле1 ЕСТЬ NULL 
	|			ТОГДА "","" + АдресаРегистрации.Поле1 + "","" + АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 + "","" + ВЫБОР
	|					КОГДА АдресаРегистрации.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
	|						ТОГДА ""дом""
	|					ИНАЧЕ ""владение""
	|				КОНЕЦ + "","" + ВЫБОР
	|					КОГДА АдресаРегистрации.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
	|						ТОГДА ""корпус""
	|					ИНАЧЕ ""строение""
	|				КОНЕЦ + "","" + ВЫБОР
	|					КОГДА АдресаРегистрации.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
	|						ТОГДА ""кв.""
	|					ИНАЧЕ ""оф.""
	|				КОНЕЦ
	|		ИНАЧЕ "","" + АдресаФактические.Поле1 + "","" + АдресаФактические.Поле2 + "","" + АдресаФактические.Поле3 + "","" + АдресаФактические.Поле4 + "","" + АдресаФактические.Поле5 + "","" + АдресаФактические.Поле6 + "","" + АдресаФактические.Поле7 + "","" + АдресаФактические.Поле8 + "","" + АдресаФактические.Поле9 + "","" + ВЫБОР
	|				КОГДА АдресаФактические.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
	|					ТОГДА ""дом""
	|				ИНАЧЕ ""владение""
	|			КОНЕЦ + "","" + ВЫБОР
	|				КОГДА АдресаФактические.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
	|					ТОГДА ""корпус""
	|				ИНАЧЕ ""строение""
	|			КОНЕЦ + "","" + ВЫБОР
	|				КОГДА АдресаФактические.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
	|					ТОГДА ""кв.""
	|				ИНАЧЕ ""оф.""
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресПочтовый,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК КемВыданДокумент,
	|	ЕСТЬNULL(ДанныеПоследнегоДокумента.НомерЛицевогоСчета, ДанныеЗарплатногоСчета.НомерЛицевогоСчета) КАК НомерЛицевогоСчета,
	|	ЕСТЬNULL(ДанныеПоследнегоДокумента.БИКБанка, ДанныеЗарплатногоСчета.БИК) КАК БИКБанка,
	|	ЕСТЬNULL(ДанныеПоследнегоДокумента.НаименованиеБанка, ДанныеЗарплатногоСчета.Наименование) КАК НаименованиеБанка,
	|	ЕСТЬNULL(ДанныеПоследнегоДокумента.ПеречислятьПособиеПочтовымПереводом, ЛОЖЬ) КАК ПеречислятьПособиеПочтовымПереводом,
	|	ЕСТЬNULL(ДанныеПоследнегоДокумента.Банк, ДанныеЗарплатногоСчета.Банк) КАК Банк,
	|	Физлица.Ссылка КАК СотрудникЗаполнения,
	|	ЕСТЬNULL(СтатусыНалогоплательщика.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) КАК СтатусНалогоплательщика,
	|	ФизическиеЛица.Ссылка КАК ФизЛицо,
	|	ФизическиеЛица.ИНН,
	|	ФизическиеЛица.СтраховойНомерПФР,
	|	ФизическиеЛица.Пол,
	|	ФизическиеЛица.ДатаРождения,
	|	Физлица.ВидЗанятости
	|ИЗ
	|	ВТФизлицо КАК Физлица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО Физлица.Физлицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
	|		ПО Физлица.Физлицо = АдресаФактические.Объект
	|			И (АдресаФактические.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица))
	|			И (АдресаФактические.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
	|		ПО Физлица.Физлицо = АдресаРегистрации.Объект
	|			И (АдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
	|			И (АдресаРегистрации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|				&Дата,
	|				Физлицо В
	|					(ВЫБРАТЬ
	|						Физлица.Физлицо
	|					ИЗ
	|						ВТФизлицо КАК Физлица)) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО Физлица.Физлицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						Физлица.Физлицо
	|					ИЗ
	|						ВТФизлицо КАК Физлица)) КАК СтатусыНалогоплательщика
	|		ПО Физлица.Физлицо = СтатусыНалогоплательщика.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				&Дата,
	|				Физлицо В
	|					(ВЫБРАТЬ
	|						Физлица.Физлицо
	|					ИЗ
	|						ВТФизлицо КАК Физлица)) КАК ФИОФизЛицСрезПоследних
	|		ПО Физлица.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПоследнегоДокумента КАК ДанныеПоследнегоДокумента
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеЗарплатногоСчета КАК ДанныеЗарплатногоСчета
	|		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаПередачиФССВыплатыПособий", ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ДатаПередачиФССВыплатыПособий"));
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Если Режим = "ДляДокумента" Тогда
		Выборка = Результат.Выбрать();
		ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, АдресПочтовый, АдресРегистрации, ВидДокумента, СерияДокумента, НомерДокумента, ДатаВыдачиДокумента, КемВыданДокумент, БИКБанка, НаименованиеБанка, НомерЛицевогоСчета, ПеречислятьПособиеПочтовымПереводом, Банк, ФизЛицо, ИНН, СтраховойНомерПФР, Пол, ДатаРождения, ВидЗанятости, СтатусНалогоплательщика");
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ДанныеСотрудника, Выборка);
		КонецЕсли;
		Возврат ДанныеСотрудника
	Иначе
		Возврат Результат.Выгрузить()
	КонецЕсли;
КонецФункции

Функция ИмяФайла(ДокументОбъект) Экспорт

	Возврат "E_" + ДокументОбъект.РегистрационныйНомерФСС + "_" + Формат(ДокументОбъект.Дата,"ДФ=yyyy_MM_dd") + "_" + ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументОбъект);

КонецФункции // ИмяФайла()

Функция СформироватьЗапросПоШапкеДокумента(ДокументОбъект) Экспорт 

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК ДатаПодачиЗаявления,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	ДанныеДокумента.НаименованиеТерриториальногоОрганаФСС,
	|	ДанныеДокумента.РегистрационныйНомерФСС,
	|	ДанныеДокумента.ДополнительныйКодФСС,
	|	ДанныеДокумента.КодПодчиненностиФСС,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, ДанныеДокумента.Руководитель.Наименование) КАК ФИОРуководителя,
	|	ЕСТЬNULL(ФИОГлавБуха.Фамилия + "" "" + ФИОГлавБуха.Имя + "" "" + ФИОГлавБуха.Отчество, ДанныеДокумента.ГлавныйБухгалтер.Наименование) КАК ФИОГлавБуха,
	|	ЕСТЬNULL(ФИОСоставителя.Фамилия + "" "" + ФИОСоставителя.Имя + "" "" + ФИОСоставителя.Отчество, ДанныеДокумента.РеестрСоставил.Наименование) КАК ФИОСоставителя,
	|	ДанныеДокумента.ТелефонСоставителя,
	|	ДанныеДокумента.АдресЭлектроннойПочтыСоставителя,
	|	ДанныеДокумента.ДолжностьРуководителя.Наименование КАК ДолжностьРуководителя,
	|	ДанныеДокумента.КраткийСоставДокумента,
	|	ДанныеДокумента.ОГРН КАК ОГРНОрганизации,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.ИНН КАК ИННОрганизации,
	|	ДанныеДокумента.КПП КАК КППОрганизации,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.НаименованиеСокращенное = """"
	|			ТОГДА ДанныеДокумента.Организация.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Организация.НаименованиеСокращенное
	|	КОНЕЦ КАК ОрганизацияСокращенно,
	|	ДанныеДокумента.РеестрСоставил,
	|	ДанныеДокумента.ГлавныйБухгалтер,
	|	ДанныеДокумента.ВыводитьПодписиВРеестрПособий
	|ИЗ
	|	Документ.РеестрСведенийВФССОПособияхПриРожденииРебенка КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо = &Руководитель) КАК ФИОФизЛицСрезПоследних
	|		ПО ДанныеДокумента.Руководитель = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо = &ГлавныйБухгалтер) КАК ФИОГлавБуха
	|		ПО ДанныеДокумента.ГлавныйБухгалтер = ФИОГлавБуха.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо = &Составитель) КАК ФИОСоставителя
	|		ПО ДанныеДокумента.РеестрСоставил = ФИОСоставителя.ФизЛицо
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ДокументСсылка";
    Запрос.Текст = СтрЗаменить(Запрос.Текст,"РеестрСведенийВФССОПособияхПриРожденииРебенка",ДокументОбъект.Метаданные().Имя);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Составитель", ДокументОбъект.РеестрСоставил);
	Запрос.УстановитьПараметр("Руководитель", ДокументОбъект.Руководитель);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер", ДокументОбъект.ГлавныйБухгалтер);
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);
	
	Возврат Запрос.Выполнить();	

КонецФункции // СформироватьЗапросПоШапкеДокумента()

Функция СформироватьФайлРеестра(ДокументОбъект, Отказ, ПроверятьДанные = Истина, ВыборкаПоШапкеДокумента = Неопределено, ВыборкаПоРаботникиОрганизации = Неопределено) Экспорт

	Если ВыборкаПоШапкеДокумента = Неопределено Тогда
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапкеДокумента(ДокументОбъект).Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
	КонецЕсли;
	Если ВыборкаПоРаботникиОрганизации = Неопределено Тогда
		ВыборкаПоРаботникиОрганизации = ДокументОбъект.СформироватьЗапросПоТЧРаботникиОрганизации().Выбрать();
	КонецЕсли;
	
	//Проверка корректности заполнения документа
	Если ПроверятьДанные Тогда
		ДокументОбъект.ПроверитьПравильностьЗаполненияДокумента(Отказ, Ложь, ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации);
		ВыборкаПоРаботникиОрганизации.Сбросить();
	КонецЕсли;
	
	Если Отказ тогда
		ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
		ОбработкаКомментариев.ПоказатьСообщения();
		Возврат "";
	КонецЕсли;	 
	
	// Загружаем формат файла сведений
	МакетФормата = ПолучитьОбщийМакет("ФорматФСС");
	
	// Создаем начальное дерево
	ДеревоВыгрузки = ПроцедурыПерсонифицированногоУчета.СоздатьДеревоXML();
	
	Атрибуты = Новый Соответствие;
	Атрибуты.Вставить("author", ВыборкаПоШапкеДокумента.ФИОСоставителя);
	Атрибуты.Вставить("version", "1.3");
	Атрибуты.Вставить("software", "1С:Предприятие");
	Атрибуты.Вставить("phone", ВыборкаПоШапкеДокумента.ТелефонСоставителя);
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.АдресЭлектроннойПочтыСоставителя) Тогда
		Атрибуты.Вставить("email", ВыборкаПоШапкеДокумента.АдресЭлектроннойПочтыСоставителя);
	КонецЕсли;
	Атрибуты.Вставить("xsi:noNamespaceSchemaLocation", "Страхователь.xsd");
	Узел = ПроцедурыПерсонифицированногоУчета.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, "ROWSET", "", Атрибуты);
	ФорматСтроки = ПроцедурыПерсонифицированногоУчета.ЗагрузитьФорматНабораЗаписейдляПФР(МакетФормата, "Строка");
	
	СтруктураДанных = СтруктураДанныхДляФайлаРеестра();
	ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаПоШапкеДокумента);
	
	НачалоНомераСтроки = ИмяФайла(ДокументОбъект) + ":";
	
	НомерДокументаВПачке = 0;
	Пока ВыборкаПоРаботникиОрганизации.Следующий()	Цикл
		
		НомерДокументаВПачке = 	НомерДокументаВПачке + 1;
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаПоРаботникиОрганизации);
		СтруктураДанных.НомерСтроки = НачалоНомераСтроки + Формат(НомерДокументаВПачке,"ЧЦ=10; ЧГ=0");
		ДобавитьСтрокуВРеестр(Узел, ФорматСтроки, СтруктураДанных)
		
	КонецЦикла;
	
	// Преобразуем дерево в строковое описание XML
	ПотокВыгрузкиXML = ПроцедурыПерсонифицированногоУчета.СоздатьПотокXML();
	СправкиПоНДФЛ.ЗаписатьУзелДереваXMLВXML(ДеревоВыгрузки, ПотокВыгрузкиXML, "xsi", "http://www.w3.org/2001/XMLSchema-instance");
	// получаем содержимое файла в виде строки
	СтрокаXML = ПроцедурыПерсонифицированногоУчета.ЗаписатьПотокXML(ПотокВыгрузкиXML);
	
	Возврат СтрокаXML;
	
КонецФункции // СформироватьВыходнойФайл()

////////////////////////////////////////////////////////////////////////////////

// Разбивает строку (не разрывая слов) на подстроки указанной длинны, 
//							строки дополняются пробелами, переводы строк удаляются
// Параметры
//  ТекстСтроки  - Строка, которую необходимо разбить на подстроки
//                 
//  МассивДлинСтрок  - Массив длин строк, если в результирующей строке оказалось подстрок больше
//                     Чем кодичество указанных длин, то все "лишние" строки выравниваются по последнему
//                     значению длинны строки.
// Возвращаемое значение:
//   Строка   - разбитая на подстроки указанной длинны
//
Функция РазбитьСтрокуНаПодСтроки(Знач ТекстСтроки, МассивДлинСтрок) Экспорт

	ВозвращаемаяСтрока = "";
	
	РазделителиСлов = " .,:;?!%\<>+-*/=_";
	
	ТекстСтроки = СокрЛП(ТекстСтроки);
	
	// обыграем случай, когда у нас многострочная строка
	Если СтрЧислоСтрок(ТекстСтроки) > 1 Тогда
	
		Для НомерПодстроки = 1 По СтрЧислоСтрок(ТекстСтроки) Цикл
			
			НовыйМассивДлинСтроки = Новый Массив;
			
			Если НомерПодстроки = 1 Тогда
			
				НачальнаяГраница = 0;
			
			Иначе
				
				Если СтрЧислоСтрок(ВозвращаемаяСтрока) > МассивДлинСтрок.ВГраница() Тогда
				
					НачальнаяГраница = МассивДлинСтрок.ВГраница();
					
				Иначе
					
					НачальнаяГраница = СтрЧислоСтрок(ВозвращаемаяСтрока);
				
				КонецЕсли; 
			
			КонецЕсли; 
			
			Для ИндексСтроки = НачальнаяГраница По МассивДлинСтрок.ВГраница() Цикл
			
				НовыйМассивДлинСтроки.Добавить(МассивДлинСтрок[ИндексСтроки]);
			
			КонецЦикла; 
		
			ВозвращаемаяСтрока = ВозвращаемаяСтрока + ?(ПустаяСтрока(ВозвращаемаяСтрока), "", Символы.ПС) + РазбитьСтрокуНаПодСтроки(СтрПолучитьСтроку(ТекстСтроки, НомерПодстроки), НовыйМассивДлинСтроки);
		
		КонецЦикла; 
		
	Иначе
		
		ДлинаСтроки = МассивДлинСтрок[0];
		
		// Если длина строки меньше или равна нужной длинне - просто вернем ее
		Если СтрДлина(ТекстСтроки) <= ДлинаСтроки Тогда
		
			ВозвращаемаяСтрока = ТекстСтроки; 
			
		Иначе
			
			// Заменим все разделители символом _, для удобства анализа
			ТестируемаяСтрока = ТекстСтроки;
			
			Для НомерРазделителя = 1 По СтрДлина(РазделителиСлов)  Цикл
				
				РазделительСлов = Сред(РазделителиСлов, НомерРазделителя, 1);
				
				ТестируемаяСтрока = СтрЗаменить(ТестируемаяСтрока, РазделительСлов, "_");
			
			КонецЦикла; 
			
			// Найдем первый разделитель
			Разрыв = Найти(ТестируемаяСтрока, "_");
			
			ИндексМассиваДлинСтрок = 0;
			
			// Обрабатывем строку пока она не закончится
			Пока СтрДлина(ТекстСтроки) > 0 Цикл
				
				Если ИндексМассиваДлинСтрок <= МассивДлинСтрок.ВГраница() Тогда
				
					ДлинаСтроки = МассивДлинСтрок[ИндексМассиваДлинСтрок];
				
				Иначе
				
					ДлинаСтроки = МассивДлинСтрок[МассивДлинСтрок.ВГраница()];
				
				КонецЕсли; 
				
				// если разрыв больше чем нужная длина
				// если разрывов больше нет
				// и частны случай, когда есть разрыв- пробел в самом конце строки нужной длины
				// или длина оставшейся строки меньше или равна нужной длинне
				Если Разрыв >= ДлинаСтроки ИЛИ Разрыв = 0 ИЛИ Сред(ТекстСтроки, ДлинаСтроки + 1, 1) = " " ИЛИ СтрДлина(ТекстСтроки) <= ДлинаСтроки Тогда
				
					ВозвращаемаяСтрока = ВозвращаемаяСтрока + ?(ПустаяСтрока(ВозвращаемаяСтрока), "", Символы.ПС) + СокрЛП(Лев(ТекстСтроки, ДлинаСтроки));
					
					ТекстСтроки = СокрЛП(Сред(ТекстСтроки, ДлинаСтроки + 1));
					
					ТестируемаяСтрока = Сред(ТестируемаяСтрока, ДлинаСтроки + 1);
					
					Если Лев(ТестируемаяСтрока,1) = "_" Тогда
					
						ТестируемаяСтрока = Сред(ТестируемаяСтрока, 2);
					
					КонецЕсли; 
					
					ИндексМассиваДлинСтрок = ИндексМассиваДлинСтрок + 1;
					
					Разрыв = Найти(ТестируемаяСтрока, "_");
				
				Иначе 
					
					НовыйРазрыв = Найти(Сред(ТестируемаяСтрока, Разрыв + 1), "_");
					
					// Есть еще один разрыв и он вместе с предыдущим меньше или равен длине строки
					Если НовыйРазрыв > 0 И Разрыв + НовыйРазрыв <= ДлинаСтроки Тогда
						
						Разрыв = Разрыв + НовыйРазрыв;
						
					Иначе
						
						// больше разрывов нет
						// или он вместе с предыдущим больше нужной длины
						ВозвращаемаяСтрока = ВозвращаемаяСтрока + ?(ПустаяСтрока(ВозвращаемаяСтрока), "", Символы.ПС) + СокрЛП(Лев(ТекстСтроки, Разрыв));
						
						ТекстСтроки = СокрЛП(Сред(ТекстСтроки, Разрыв + 1));
						
						ТестируемаяСтрока = Сред(ТестируемаяСтрока, Разрыв + 1);
						
						Если Лев(ТестируемаяСтрока,1) = "_" Тогда
					
							ТестируемаяСтрока = Сред(ТестируемаяСтрока, 2);
					
						КонецЕсли; 
					
						ИндексМассиваДлинСтрок = ИндексМассиваДлинСтрок + 1;
					
						Разрыв = Найти(ТестируемаяСтрока, "_");
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла; 
				
		КонецЕсли; 
	
	КонецЕсли;
	
	Если СтрЧислоСтрок(ВозвращаемаяСтрока) > 1 Тогда
		
		ВыравненнаяСтрока = "";
		
		Для НомерПодстроки = 1 По СтрЧислоСтрок(ВозвращаемаяСтрока) - 1 Цикл
			
			ВыравниваемаяСтрока = СтрПолучитьСтроку(ВозвращаемаяСтрока, НомерПодстроки);
			
			Если НомерПодстроки - 1 <= МассивДлинСтрок.ВГраница() Тогда
				
				ДлинаСтроки = МассивДлинСтрок[НомерПодстроки - 1];
				
			Иначе
				
				ДлинаСтроки = МассивДлинСтрок[МассивДлинСтрок.ВГраница()];
				
			КонецЕсли; 
				
			Для НомерПозицииВСтроке = СтрДлина(ВыравниваемаяСтрока) + 1 По ДлинаСтроки Цикл
			
				ВыравниваемаяСтрока = ВыравниваемаяСтрока + " ";
			
			КонецЦикла; 
			
			ВыравненнаяСтрока = ВыравненнаяСтрока + ?(ПустаяСтрока(ВыравненнаяСтрока), "", Символы.ПС) + ВыравниваемаяСтрока;
		
		КонецЦикла;
		
		ВозвращаемаяСтрока = ВыравненнаяСтрока + Символы.ПС + СтрПолучитьСтроку(ВозвращаемаяСтрока, СтрЧислоСтрок(ВозвращаемаяСтрока));
		
	КонецЕсли; 
	
	ВозвращаемаяСтрока = СтрЗаменить(ВозвращаемаяСтрока, Символы.ПС, "");
	
	Возврат ВозвращаемаяСтрока;

КонецФункции // РазбитьСтрокуПоСтрочно()

Функция ОписаниеПериодаВПечатнойФорме(ДатаС, ДатаПо) Экспорт

	Возврат "с " + Формат(ДатаС,"ДФ=dd.MM.yyyy") + " по " + Формат(ДатаПо,"ДФ=dd.MM.yyyy");

КонецФункции // ОписаниеСтажаВПечатнойФорме()

////////////////////////////////////////////////////////////////////////////////
//  Формирование общих печатных форм

#Если ТолстыйКлиентОбычноеПриложение Тогда

// Формирует табличный документ с печатной формой заявление
//
// Параметры
//  СтруктураДанных 		- Структура полученная с помощью функции СтруктураДанныхДляПечатиЗаявленийВФССОВыплатеПособия()
//								и в последствии заполненная в процедуре вывода на печать, если передать не заполненную структуру
//								вернется бланк заявления
//
// Возвращаемое значение:
//   ТабличныйДокумент   	- печатная форма заявление в ФСС о выплате пособия
//
//Функция ПечатьЗаявлениеВФССОВыплатеПособия(СтруктураДанных, ТабДокумент, ВыборкаПоТЧРаботникиОрганизации = Неопределено) Экспорт
Функция ПечатьЗаявлениеВФССОВыплатеПособия(СтруктураДанных, ИмяМакета = "ЗаявлениеВФССОВыплатеПособия") Экспорт

	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеВФССОВыплатеПособия";
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	
	Макет = ПолучитьОбщийМакет(ИмяМакета);
	                           
	СписокВидовПособий = Новый СписокЗначений();
	СписокВидовПособий.Добавить(СтруктураДанных.ВидПособия);
	СписокВидовПособий.Добавить(СтруктураДанных.ВидПособия2);
	
	// Шапка формы
	
	// Наименование  ФСС
	
	ДлиныСтрок = Новый Массив();
	ДлиныСтрок.Добавить(27);
	
	НаименованиеТерриториальногоОрганаФСС = РазбитьСтрокуНаПодСтроки(СтруктураДанных.НаименованиеТерриториальногоОрганаФСС, ДлиныСтрок);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(НаименованиеТерриториальногоОрганаФСС, Макет, "Наименование_ФСС_", 135);
	
	// ФИО заявителя в родительном падеже
	
	ФИО = СтруктураДанных.ФИОСотрудника;
	УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИО, 2, СтруктураДанных.ПолСотрудника, ФИО);
	
	Фамилия = Лев(ФИО, Найти(ФИО, " ") - 1);
	ФИО = СокрЛП(Сред(ФИО, Найти(ФИО, " ") + 1));
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Фамилия, 	Макет, "ФИО_Заявителя_", 27);
	
	Имя = Лев(ФИО, Найти(ФИО, " ") - 1);
	Отчество = СокрЛП(Сред(ФИО, Найти(ФИО, " ") + 1));
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Имя, 		Макет, "ФИО_Заявителя_", 27, 28);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Отчество, 	Макет, "ФИО_Заявителя_", 27, 55);
	
	// Отмечаем вид пособия
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.Нетрудоспособность) <> Неопределено Тогда
	
		Макет.Области["Нетрудоспособность"].Текст = "V";
	
	КонецЕсли;
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.БеременностьРоды) <> Неопределено Тогда
	
		Макет.Области["БеременностьРоды"].Текст = "V";
	
	КонецЕсли;
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.ПриПостановкеНаУчетВРанниеСрокиБеременности) <> Неопределено Тогда
	
		Макет.Области["ПриПостановкеНаУчетВРанниеСрокиБеременности"].Текст = "V";
	
	КонецЕсли;
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.ПриРожденииРебенка) <> Неопределено Тогда
	
		Макет.Области["ПриРожденииРебенка"].Текст = "V";
	
	КонецЕсли;
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет) <> Неопределено Тогда
	
		Макет.Области["ПоУходуЗаРебенкомДоПолутораЛет"].Текст = "V";
	
	КонецЕсли;
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай) <> Неопределено Тогда
	
		Макет.Области["НетрудоспособностьНесчастныйСлучай"].Текст = "V";
	
	КонецЕсли;
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев) <> Неопределено Тогда
	
		Макет.Области["ДополнительныйОтпускПослеНесчастныхСлучаев"].Текст = "V";
	
	КонецЕсли; 
	
	// Отмечаем желательный способ получения пособия
	
	Если СтруктураДанных.ПеречислятьПособиеПочтовымПереводом <> Неопределено И СтруктураДанных.ПеречислятьПособиеПочтовымПереводом Тогда
		
		Макет.Области["ВыплатаПочтой"].Текст = "V";
		
	ИначеЕсли СтруктураДанных.ПеречислятьПособиеПочтовымПереводом <> Неопределено Тогда
		
		Макет.Области["ВыплатаЧерезБанк"].Текст = "V";
		
	КонецЕсли; 
	
	// Выводим реквизиты банка

	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НаименованиеБанка, Макет, "НаименованиеБанка_", 34);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерЛицевогоСчета, Макет, "НомерСчета_", 20);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.БИКБанка, Макет, "БИК_", 9);
	
	// Выводим данные удостоверения личности заявителя
	
	// из серии нужно удалить лишние пробелы
	ДокументСерия = СтруктураДанных.УдостоверениеЛичностиСерия;
	ДокументСерия = СтрЗаменить(ДокументСерия, " ", "");
		
	Если СтруктураДанных.УдостоверениеЛичностиВид = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21 Тогда
			
		Макет.Области["Паспорт"].Текст = "V";
			
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "ПаспортСерия_", 4);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.УдостоверениеЛичностиНомер, Макет, "ПаспортНомер_", 6);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.УдостоверениеЛичностиДата, "ДФ=dd.MM.yyyy"),".",""), Макет, "ПаспортДата_", 8);
			
	ИначеЕсли СтруктураДанных.УдостоверениеЛичностиВид = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС14 Тогда
			
		Макет.Области["ВременноеУдостоверение"].Текст = "V";
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.УдостоверениеЛичностиНомер, Макет, "ВременноеУдостоверениеНомер_", 6);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.УдостоверениеЛичностиСрокДействия, "ДФ=dd.MM.yyyy"),".",""), Макет, "ВременноеУдостоверениеДата_", 8);
			
	ИначеЕсли СтруктураДанных.УдостоверениеЛичностиВид <> Неопределено Тогда
		
		Макет.Области["ИнойДокумент"].Текст = "V";
			
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "ИнойДокументСерия_", 2);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.УдостоверениеЛичностиНомер, Макет, "ИнойДокументНомер_", 7);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.УдостоверениеЛичностиСрокДействия, "ДФ=dd.MM.yyyy"),".",""), Макет, "ИнойДокументДата_", 8);
			
	КонецЕсли; 
	
	// Выводим почтовый адрес заявителя
	
	ДлиныСтрок = Новый Массив();
	ДлиныСтрок.Добавить(23);
	ДлиныСтрок.Добавить(63); // нужно 43, прсим больше, что бы хоть что то влезло

	Адрес = РазбитьСтрокуНаПодСтроки(УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(СтруктураДанных.АдресПроживания), ДлиныСтрок);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Адрес, Макет, "Адрес_", 66);
	
	// Выводим ФИО получателя
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.ФИОСотрудника, Макет, "ФИО_Получателя_", 42);
	
	// I. Единовременного пособия при рождении ребенка:
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСправкиОРождении, "ДФ=dd.MM.yyyy"),".",""),  Макет, "СправкаДата_", 8);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСправкиОРождении, Макет, "СправкаНомер_", 5);
		
	// Выводим дату и номер справки от другого родителя
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСправкиОтДругогоРодителя, "ДФ=dd.MM.yyyy"),".",""),  Макет, "СправкаОтДругогоРодителяДата_", 8);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСправкиОтДругогоРодителя, Макет, "СправкаОтДругогоРодителяНомер_", 5);
	
	// Выводим Дату и номер решения об усыновлении
		
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаРешенияОбУсыновлении, "ДФ=dd.MM.yyyy"),".",""),  Макет, "РешениеОбУсыновленииДата_", 8);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерРешенияОбУсыновлении, Макет, "РешениеОбУсыновленииНомер_", 5);
		
	// Выводим Дату и номер договора о передаче на воспитание
		
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаДоговораОПередачеНаВоспитание, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ДоговорОВоспитанииДата_", 8);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерДоговораОПередачеНаВоспитание, Макет, "ДоговорОВоспитанииНомер_", 5);
	
	// Выводим дату подачи заявления
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаПодачиЗаявления, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ДатаПодачи_", 8);
	
	// II. Ежемесячного пособия по уходу за ребенком:
	
	// Выводим данные о предыдущих детях
	
	Если СтруктураДанных.НаличиеДокументаОРожденииПредыдущегоРебенка <> Неопределено И СтруктураДанных.НаличиеДокументаОРожденииПредыдущегоРебенка Тогда
	
		Макет.Области["НаличиеДокументаОРожденииПредыдущегоРебенка"].Текст = "V";
	
	КонецЕсли;
	
	Если СтруктураДанных.НаличиеДокументаОСмертиПредыдущегоРебенка <> Неопределено И СтруктураДанных.НаличиеДокументаОСмертиПредыдущегоРебенка Тогда
	
		Макет.Области["НаличиеДокументаОСмертиПредыдущегоРебенка"].Текст = "V";
	
	КонецЕсли;
	
	// Выводим информацию о справках о не получении пособия
	
	Если СтруктураДанных.СправкаОтОтцаОНеполученииПособия <> Неопределено И СтруктураДанных.СправкаОтОтцаОНеполученииПособия Тогда
	
		Макет.Области["СправкаОтОтцаОНеполученииПособия"].Текст = "V";
	
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСправкиОтОтца, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ДатаСправкиОтОтца_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСправкиОтОтца,  Макет, "НомерСправкиОтОтца_", 5);
		
	КонецЕсли;
	
	Если СтруктураДанных.СправкаОтМатериОНеполученииПособия <> Неопределено И СтруктураДанных.СправкаОтМатериОНеполученииПособия Тогда
	
		Макет.Области["СправкаОтМатериОНеполученииПособия"].Текст = "V";
	
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСправкиОтМатери, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ДатаСправкиОтМатери_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСправкиОтМатери,  Макет, "НомерСправкиОтМатери_", 5);
		
	КонецЕсли;
	
	// если справка от обоих родителей то выводим данные справки отца
	Если СтруктураДанных.СправкаОтОбоихРодителейОНеполученииПособия <> Неопределено И СтруктураДанных.СправкаОтОбоихРодителейОНеполученииПособия Тогда
	
		Макет.Области["СправкаОтОбоихРодителейОНеполученииПособия"].Текст = "V";
	
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСправкиОтОтца, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ДатаСправкиОтОтца_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСправкиОтОтца,  Макет, "НомерСправкиОтОтца_", 5);
		
	КонецЕсли;
	
	// И по другим местам работы
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСправкиПоДругимМестамРаботы, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ДатаСправкиПоДругимМестамРаботы_", 8);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСправкиПоДругимМестамРаботы,  Макет, "НомерСправкиПоДругимМестамРаботы_", 5);
	
	// Выводим сведения о проживании работе в зоне
	
	// I или II в зависимости от типа пособия
	
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.ПриРожденииРебенка) <> Неопределено Тогда
		
		// Выводим дату и номер свидетельства о рождении
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСвидетельстваОРождении, "ДФ=dd.MM.yyyy"),".",""),  Макет, "СвидетельствоОРожденииДата_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСвидетельстваОРождении, Макет, "СвидетельствоОРожденииНомер_", 5);
		
		// Выводим Дату и номер решения об опеке
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаРешенияОбОпеке, "ДФ=dd.MM.yyyy"),".",""),  Макет, "РешениеОбОпекеДата_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерРешенияОбОпеке, Макет, "РешениеОбОпекеНомер_", 5);
		
		// Выводим дату и номер иного подтверждения о рождении
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаИногоПодтвержденияРождения, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ИноеПодтверждениеРожденияДата_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерИногоПодтвержденияРождения, Макет, "ИноеПодтверждениеРожденияНомер_", 5);
	
	КонецЕсли;
		
	Если СписокВидовПособий.НайтиПоЗначению(Перечисления.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет) <> Неопределено Тогда
		
		// Выводим дату и номер свидетельства о рождении
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаСвидетельстваОРождении, "ДФ=dd.MM.yyyy"),".",""),  Макет, "СвидетельствоОРожденииIIДата_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерСвидетельстваОРождении, Макет, "СвидетельствоОРожденииIIНомер_", 5);
		
		// Выводим Дату и номер решения об опеке
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаРешенияОбОпеке, "ДФ=dd.MM.yyyy"),".",""),  Макет, "РешениеОбОпекеIIДата_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерРешенияОбОпеке, Макет, "РешениеОбОпекеIIНомер_", 5);
		
		// Выводим дату и номер иного подтверждения о рождении
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ДатаИногоПодтвержденияРождения, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ИноеПодтверждениеРожденияIIДата_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НомерИногоПодтвержденияРождения, Макет, "ИноеПодтверждениеРожденияIIНомер_", 5);
		
	КонецЕсли; 
	
	Если СтруктураДанных.ПроживаниеВЗоне <> Неопределено И СтруктураДанных.ПроживаниеВЗоне Тогда
		
		Макет.Области["ПроживаниеВЗоне"].Текст = "V";
		
	КонецЕсли;
	
	Если СтруктураДанных.РаботаВЗоне <> Неопределено И СтруктураДанных.РаботаВЗоне Тогда
		
		Макет.Области["РаботаВЗоне"].Текст = "V";
		
	КонецЕсли;
	
	Если СтруктураДанных.ВЗонеСПравомНаОтселение <> Неопределено И СтруктураДанных.ВЗонеСПравомНаОтселение Тогда
		
		Макет.Области["ВЗонеСПравомНаОтселение"].Текст = "V";
		
	КонецЕсли;
	
	Если СтруктураДанных.ВЗонеОтселения <> Неопределено И СтруктураДанных.ВЗонеОтселения Тогда
		
		Макет.Области["ВЗонеОтселения"].Текст = "V";
		
	КонецЕсли;
	
	Если СтруктураДанных.ВЗонеСЛьготнымСтатусом <> Неопределено И СтруктураДанных.ВЗонеСЛьготнымСтатусом Тогда
		
		Макет.Области["ВЗонеСЛьготнымСтатусом"].Текст = "V";
		
	КонецЕсли;
	
	// Выводим ннаименование работодателя и тип занятости получателя пособия
	
	ДлиныСтрок = Новый Массив();
	ДлиныСтрок.Добавить(42);
	
	НаименованиеРаботодателяИВидЗанятости = "" + СтруктураДанных.НаименованиеОрганизации;
	НаименованиеРаботодателяИВидЗанятости = НаименованиеРаботодателяИВидЗанятости + ?(ПустаяСтрока(НаименованиеРаботодателяИВидЗанятости), "", ", ") + СтруктураДанных.ВидЗанятостиСотрудника;
	
	НаименованиеРаботодателяИВидЗанятости = РазбитьСтрокуНаПодСтроки(НаименованиеРаботодателяИВидЗанятости, ДлиныСтрок);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(НаименованиеРаботодателяИВидЗанятости, Макет, "РаботодательИВидЗанятости_", 84);
	
	// Выводим СНИЛС и ИНН получателя
	
	// из СНИЛСа удаляем - и пробелы
	СНИЛС = СтруктураДанных.СНИЛССотрудника;
	СНИЛС = СтрЗаменить(СНИЛС,"-","");
	СНИЛС = СтрЗаменить(СНИЛС," ","");
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СНИЛС, Макет, "СНИЛС_", 11);
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.ИННСотрудника, Макет, "ИНННетрудоспособного_", 12);
	
	// Выводим данные Заявление работника о замене календарных годов
	
	Если СтруктураДанных.ЗаявлениеРаботникаОЗаменеКалендарныхГодов <> Неопределено И СтруктураДанных.ЗаявлениеРаботникаОЗаменеКалендарныхГодов Тогда
	
		Макет.Области["ЗаявлениеРаботникаОЗаменеКалендарныхГодов"].Текст = "V";
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Формат(СтруктураДанных.ПервыйГод,"ЧЦ=2; ЧВН="), Макет, "ПервыйГод_", 2);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Формат(СтруктураДанных.ВторойГод,"ЧЦ=2; ЧВН="), Макет, "ВторойГод_", 2);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Формат(СтруктураДанных.ТретийГод,"ЧЦ=2; ЧВН="), Макет, "ТретийГод_", 2);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Формат(СтруктураДанных.ЧетвертыйГод,"ЧЦ=2; ЧВН="), Макет, "ЧетвертыйГод_", 2);
	
	КонецЕсли;
	
	
	// Выводим данные Заявление работника об исчислении пособий по материнству
	
	Если СтруктураДанных.ЗаявлениеПоМатеринству2010 <> Неопределено И СтруктураДанных.ЗаявлениеПоМатеринству2010 Тогда
	
		Макет.Области["ЗаявлениеПоМатеринству2010"].Текст = "V";
		
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ЗаявлениеПоМатеринству2010ДатаНачало, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ЗаявлениеПоМатеринству2010ДатаНачало_", 8);
		ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ЗаявлениеПоМатеринству2010ДатаОкончание, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ЗаявлениеПоМатеринству2010ДатаОкончание_", 8);
	
	КонецЕсли;
	
	// Выводим данные по расчету среднего заработка
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.ЧислоКалендарныхДней, Макет, "ЧислоКалендарныхДней_", 3);
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(Прав("         " + Формат(СтруктураДанных.СреднийЗаработок, "ЧЦ=10; ЧДЦ=0; ЧС=-2; ЧГ="), 9), Макет, "СреднийЗаработок_", 9);
	
	// Выводим период простоя
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ПериодПростояДатаНачало, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ПериодПростояДатаНачало_", 8);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ПериодПростояДатаОкончание, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ПериодПростояДатаОкончание_", 8);
	
	// Выводим Период, за который пособие по временной нетрудоспособности не назначается
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ПособияНеНазначаютсяДатаНачало, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ПособияНеНазначаютсяДатаНачало_", 8);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(СтруктураДанных.ПособияНеНазначаютсяДатаОкончание, "ДФ=dd.MM.yyyy"),".",""),  Макет, "ПособияНеНазначаютсяДатаОкончание_", 8);
	
	// Выводим должность и ФИО руководителя, а так же ставим галочку о том что он подтверждает сведения
	
	Если ЗначениеЗаполнено(СтруктураДанных.ФИОРуководителя) Тогда
	
		Макет.Области["Подтверждаю"].Текст = "V";
	
	КонецЕсли; 
	
	Макет.Области["ДолжностьФИОРуководителя"].Текст = "" + СтруктураДанных.ДолжностьРуководителя + ", " + СтруктураДанных.ФИОРуководителя;
	
	ТабДокумент.Вывести(Макет);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьЗаявлениеВФССОВыплатеПособия()

// Формирует опись заявлений и документов для передачи в ФСС
//
// Параметры
//  СтруктураДанных  		- Строка выборки по шапке документа, который выводится на печать
//  ВыборкаПоТЧРаботникиОрганизации - Выборка по табличной части РаботникиОрганизации
//                 
// Возвращаемое значение:
//   Табличный документ   - <описание возвращаемого значения>
//
Функция ПечатьОписьЗаявленийИДокументовВФСС(СтруктураДанных, ВыборкаПоТЧРаботникиОрганизации) Экспорт

	ТабДокумент = Новый ТабличныйДокумент;
		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОписьЗаявленийИДокументовВФСС";
		
	Макет = ПолучитьОбщийМакет("ОписьЗаявленийИДокументовВФСС");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.РегистрационныйНомерФСС, ОбластьШапка, "РегистрационныйНомер_", 10);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.ДополнительныйКодФСС, ОбластьШапка, "ДополнительныйКод_", 10);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.КодПодчиненностиФСС, ОбластьШапка, "КодПодчиненности_", 5);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.ИННОрганизации, ОбластьШапка, "ИНН_", 12);
	
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.ОрганизацияСокращенно, ОбластьШапка, "Страхователь_", 29);
	ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтруктураДанных.НаименованиеТерриториальногоОрганаФСС, ОбластьШапка, "Фонд_", 38);
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	Пока ВыборкаПоТЧРаботникиОрганизации.Следующий() Цикл
		
		Если ВыборкаПоТЧРаботникиОрганизации.НомерСтроки > 1 Тогда
		
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
			ТабДокумент.Вывести(ОбластьСтрока);
		
		
		КонецЕсли; 
		
		НомерСтроки = Формат(ВыборкаПоТЧРаботникиОрганизации.НомерСтроки, "ЧЦ=2; ЧГ=");
		
		НомерСтроки = Лев("  ", 2 - СтрДлина(НомерСтроки)) + НомерСтроки;
		
		ДлиныСтрок = Новый Массив();
		ДлиныСтрок.Добавить(17);
		
		ФИО = РазбитьСтрокуНаПодСтроки(ОбщегоНазначения.ФамилияИнициалыФизЛица(ВыборкаПоТЧРаботникиОрганизации.ФИОСотрудника), ДлиныСтрок);
		
		ДокументыОснования = РазбитьСтрокуНаПодСтроки(ВыборкаПоТЧРаботникиОрганизации.ДокументыОснования, ДлиныСтрок);
		
		КоличествоСтраниц = Формат(ВыборкаПоТЧРаботникиОрганизации.КоличествоСтраниц, "ЧЦ=4; ЧГ=");
		
		КоличествоСтраниц = Лев("    ", 4 - СтрДлина(КоличествоСтраниц)) + КоличествоСтраниц;
		
		ПерваяСтрокаВыводилась = Ложь;
		
		Пока СтрДлина(ФИО) > 0 ИЛИ СтрДлина(ДокументыОснования) > 0 ИЛИ НЕ ПерваяСтрокаВыводилась Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			
			Если НЕ ПерваяСтрокаВыводилась Тогда
				
				ПерваяСтрокаВыводилась = Истина;
				
				ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(НомерСтроки, ОбластьСтрока, "НПП_", 2);
				
				ОбластьСтрока.Области["ВидВыплаты"].Текст = ВыборкаПоТЧРаботникиОрганизации.ВидВыплаты;
				
				ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(КоличествоСтраниц, ОбластьСтрока, "КоличествоСраниц_", 4);
				
			КонецЕсли; 
			
			Если СтрДлина(ФИО) <= 17 Тогда
				
				СтрокаФИОНаПечать = ФИО;
				
				ФИО = "";
				
			Иначе
				
				СтрокаФИОНаПечать = Лев(ФИО, 17);
				
				ФИО = Сред(ФИО, 18);
				
			КонецЕсли;
			
			Если СтрДлина(ДокументыОснования) <= 17 Тогда
				
				СтрокаДокументыНаПечать = ДокументыОснования;
				
				ДокументыОснования = "";
				
			Иначе
				
				СтрокаДокументыНаПечать = Лев(ДокументыОснования, 17);
				
				ДокументыОснования = Сред(ДокументыОснования, 18);
				
			КонецЕсли; 
			
			ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрокаФИОНаПечать, ОбластьСтрока, "ФИО_", 17);
			
			ФормированиеПечатныхФормЗК.ВывестиДанныеПоБуквенно(СтрокаДокументыНаПечать, ОбластьСтрока, "Документы_", 17);
			
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Области["ДолжностьФИОРуководителя"].Текст = "" + СтруктураДанных.ДолжностьРуководителя + ", " + СтруктураДанных.ФИОРуководителя;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
	

КонецФункции // ПечатьОписьЗаявленийИДокументовВФСС()

// Формирует набор полей необходимый для печати Заявления в ФСС о выплате пособия
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   Пустую структуру полей, необходимых для печати Заявления в ФСС о выплате пособия
//
Функция СтруктураДанныхДляПечатиЗаявленийВФССОВыплатеПособия() Экспорт

	Возврат Новый Структура(
		  "ВидПособия, "									// ПеречислениеСсылка.ВидыПособийСоциальногоСтрахования - необходим для определения какую
		  													// галочку поставить в шапке и какой раздел заполнять сведениями о документах подтверждения рождения
		  "ВидПособия2, "									// ПеречислениеСсылка.ВидыПособийСоциальногоСтрахования - если заявление оформляется по двум пособиям
		  
		+ "ДатаПодачиЗаявления, "							// Дата
		+ "НаименованиеОрганизации, " 						// Строка
		+ "ФИОРуководителя, "								// Строка
		+ "ДолжностьРуководителя, "							// Строка
		+ "АдресОрганизации, "								// Строка
		+ "ИННОрганизации, "								// Строка
		+ "ОГРНОрганизации, "								// Строка
		+ "НаименованиеТерриториальногоОрганаФСС, "			// Строка
		+ "РегистрационныйНомерФСС, "						// Строка
		+ "ДополнительныйКодФСС, "							// Строка
		+ "КодПодчиненностиФСС, " 							// Строка
		+ "ФИОСотрудника, "									// Строка
		+ "ПолСотрудника, "                                 // ПеречислениеСсылка.ПолФизическихЛиц - необходим для склонения ФИО заявителя в родительный падеж
		+ "ИННСотрудника, "									// Строка
		+ "СНИЛССотрудника, "								// Строка
		+ "ВидЗанятостиСотрудника, "						// строка
		+ "УдостоверениеЛичностиВид, "						// СправочникСсылка.ДокументыУдостоверяющиеЛичность - необходим для определения в какой документ писать
		+ "УдостоверениеЛичностиСерия, "					// Строка
		+ "УдостоверениеЛичностиНомер, "					// Строка
		+ "УдостоверениеЛичностиДата, "						// Дата
		+ "УдостоверениеЛичностиСрокДействия, "						// Дата
		+ "ПеречислятьПособиеПочтовымПереводом, "			// Булево
		+ "НаименованиеБанка, "								// Строка
		+ "БИКБанка, "										// Строка
		+ "НомерЛицевогоСчета, "							// Строка
		+ "АдресПроживания, "								// Строка
		
		+ "ДатаСправкиОРождении, "							// Дата
		+ "НомерСправкиОРождении, "							// Строка
		
		+ "ДатаСвидетельстваОРождении, "					// Дата
		+ "НомерСвидетельстваОРождении, "					// Строка
		
		+ "ДатаИногоПодтвержденияРождения, "				// Дата
		+ "НомерИногоПодтвержденияРождения, "				// Строка
		
		+ "ДатаСправкиОтДругогоРодителя, "					// Дата
		+ "НомерСправкиОтДругогоРодителя, "					// Строка
		
		+ "ДатаРешенияОбОпеке, "							// Дата
		+ "НомерРешенияОбОпеке, "							// Строка
		
		+ "ДатаРешенияОбУсыновлении, "						// Дата
		+ "НомерРешенияОбУсыновлении, "						// Строка
		
		+ "ДатаДоговораОПередачеНаВоспитание, "				// Дата
		+ "НомерДоговораОПередачеНаВоспитание, "			// Строка
		
		+ "НаличиеДокументаОРожденииПредыдущегоРебенка, "	// Булево
		+ "НаличиеДокументаОСмертиПредыдущегоРебенка, "		// Булево
		+ "СправкаОтОтцаОНеполученииПособия, "				// Булево
		+ "СправкаОтМатериОНеполученииПособия, "			// Булево
		+ "СправкаОтОбоихРодителейОНеполученииПособия, "	// Булево
		+ "ДатаСправкиОтОтца, "								// Дата
		+ "НомерСправкиОтОтца, "							// Строка
		+ "ДатаСправкиОтМатери, "							// Дата
		+ "НомерСправкиОтМатери, "							// Строка
		+ "ДатаСправкиПоДругимМестамРаботы, "				// Дата
		+ "НомерСправкиПоДругимМестамРаботы, "				// Строка
		+ "ПроживаниеВЗоне, "								// Булево
		+ "РаботаВЗоне, "									// Булево
		+ "ВЗонеСПравомНаОтселение, "						// Булево
		+ "ВЗонеОтселения, "								// Булево
		+ "ВЗонеСЛьготнымСтатусом, "						// Булево
		+ "ЗаявлениеРаботникаОЗаменеКалендарныхГодов, "		// Булево
		+ "ПервыйГод, "										// Число(2)
		+ "ВторойГод, "										// Число(2)
		+ "ТретийГод, "										// Число(2)
		+ "ЧетвертыйГод, "									// Число(2)
		+ "ЗаявлениеПоМатеринству2010, "					// Булево
		+ "ЗаявлениеПоМатеринству2010ДатаНачало, "			// Дата
		+ "ЗаявлениеПоМатеринству2010ДатаОкончание, "		// Дата
		+ "ЧислоКалендарныхДней, "							// Число(3)
		+ "СреднийЗаработок, "								// Число(10.2)
		+ "ПериодПростояДатаНачало, "						// Дата
		+ "ПериодПростояДатаОкончание, "					// Дата
		+ "ПособияНеНазначаютсяДатаНачало, "				// Дата
		+ "ПособияНеНазначаютсяДатаОкончание"				// Дата
		);

КонецФункции // СтруктураДанныхДляПечатиЗаявленийВФССОВыплатеПособия()

#КонецЕсли

