
&НаСервере
Функция ЗаписатьФайлВРеквизит(СсылкаНаЭлемент, АдресХранилища)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ДвоичныеДанные.Записать(ВременныйФайл);
	
	ФайлXML = Новый ТекстовыйДокумент;
	ФайлXML.Прочитать(ВременныйФайл);
	
	Объект = СсылкаНаЭлемент.ПолучитьОбъект();
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Правила = ФайлXML.ПолучитьТекст();
	Объект.Записать();
	
	Возврат Объект.Правила;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Фильтр = "Файлы XML (*.xml)|*.xml";
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = "Обзор...";
	Если ВыборФайла.Выбрать() Тогда 
		СписокФайлов = ВыборФайла.ВыбранныеФайлы;
		Для Каждого Файл Из СписокФайлов Цикл
			АдресХранилища = "";
			ПоместитьФайл(АдресХранилища, Файл, , Ложь, Новый УникальныйИдентификатор());
			ТектИзФайла = ЗаписатьФайлВРеквизит(ПараметрКоманды, АдресХранилища);
		КонецЦикла;
		
		Если ПараметрыВыполненияКоманды.Источник.ИмяФормы <> "Справочник.ttk_ПравилаОбмена.Форма.ФормаСписка" Тогда 
			ПараметрыВыполненияКоманды.Источник.Объект.Правила = "";
			ПараметрыВыполненияКоманды.Источник.Объект.Правила = ТектИзФайла;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
