
Процедура ПеревестиСтатусДокументов(МассивДокументов, Статус, Отказ = Ложь) Экспорт
	
	Для Каждого Документ из МассивДокументов Цикл 
		
		Если НЕ ЗначениеЗаполнено(Документ) Тогда 
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.Статус = Статус;
		
		Если Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение Тогда 
			ДокументОбъект.СформироватьДвиженияПоОперации("-");	
		КонецЕсли;
		
		Если Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВФилиал ИЛИ 
			Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВКЦ Тогда
			ДокументОбъект.СформироватьДвиженияПоОперации("+");	
        КонецЕсли;
		
		Попытка 
			ДокументОбъект.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры