////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Автозаполнение() Экспорт

	ДатаОстатка = ?(НачалоМесяца(Дата) > МесяцРасчетногоПериода, Дата, КонецМесяца(МесяцРасчетногоПериода) + 1);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",						Ссылка);
	Запрос.УстановитьПараметр("ДатаОстатка",				ДатаОстатка);
	Запрос.УстановитьПараметр("ВидПлатежа",					ВидПлатежа);
	Запрос.УстановитьПараметр("МесяцРасчетногоПериода",		МесяцРасчетногоПериода);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Если Проведен И ЗначениеЗаполнено(ДатаПлатежа) И ДатаПлатежа < ДатаОстатка Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоСтраховымВзносам.ПФРСтраховая,
		|	РасчетыПоСтраховымВзносам.ПФРНакопительная,
		|	РасчетыПоСтраховымВзносам.ФСС,
		|	РасчетыПоСтраховымВзносам.ФФОМС,
		|	РасчетыПоСтраховымВзносам.ТФОМС,
		|	РасчетыПоСтраховымВзносам.ФССНесчастныеСлучаи,
		|	РасчетыПоСтраховымВзносам.ПФРПоДополнительномуТарифу
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.РасчетыПоСтраховымВзносам КАК РасчетыПоСтраховымВзносам
		|ГДЕ
		|	РасчетыПоСтраховымВзносам.Ссылка = &Ссылка";	
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК ПФРСтраховая,
		|	0 КАК ПФРНакопительная,
		|	0 КАК ФСС,
		|	0 КАК ФФОМС,
		|	0 КАК ТФОМС,
		|	0 КАК ФССНесчастныеСлучаи,
		|	0 КАК ПФРПоДополнительномуТарифу
		|ПОМЕСТИТЬ ВТДанныеДокумента";	
	КонецЕсли;
	Запрос.Выполнить();
	
	Если ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	-РасчетыПоСтраховымВзносам.ФССОстаток КАК ФСС,
		|	-РасчетыПоСтраховымВзносам.ФССНесчастныеСлучаиОстаток КАК ФССНесчастныеСлучаи
		|ПОМЕСТИТЬ ВТРасходыПоСоцСтрахованию
		|ИЗ
		|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
		|			&ДатаОстатка,
		|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию)
		|				И МесяцРасчетногоПериода = &МесяцРасчетногоПериода
		|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносам
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасчетыПоСтраховымВзносам.ФССОстаток,
		|	РасчетыПоСтраховымВзносам.ФССНесчастныеСлучаиОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
		|			&ДатаОстатка,
		|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.ПолученоИзФонда)
		|				И МесяцРасчетногоПериода = &МесяцРасчетногоПериода
		|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносам
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасчетыПоСтраховымВзносам.ФССОстаток,
		|	РасчетыПоСтраховымВзносам.ФССНесчастныеСлучаиОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
		|			&ДатаОстатка,
		|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НеПринято)
		|				И МесяцРасчетногоПериода = &МесяцРасчетногоПериода
		|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносам";	
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК ФСС,
		|	0 КАК ФССНесчастныеСлучаи
		|ПОМЕСТИТЬ ВТРасходыПоСоцСтрахованию";	
	КонецЕсли;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ПФРСтраховая) КАК ЧИСЛО(15, 0))) > 0
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ПФРСтраховая) КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПФРСтраховая,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ПФРНакопительная) КАК ЧИСЛО(15, 0))) > 0
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ПФРНакопительная) КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПФРНакопительная,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ФСС) КАК ЧИСЛО(15, 0))) > 0
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ФСС) КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФСС,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ФФОМС) КАК ЧИСЛО(15, 0))) > 0
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ФФОМС) КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФФОМС,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ТФОМС) КАК ЧИСЛО(15, 0))) > 0
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ТФОМС) КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТФОМС,
	|	ВЫБОР
	|		КОГДА СУММА(ДанныеДляСуммирования.ФССНесчастныеСлучаи) > 0
	|			ТОГДА СУММА(ДанныеДляСуммирования.ФССНесчастныеСлучаи)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФССНесчастныеСлучаи,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ПФРПоДополнительномуТарифу) КАК ЧИСЛО(15, 0))) > 0
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ДанныеДляСуммирования.ПФРПоДополнительномуТарифу) КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПФРПоДополнительномуТарифу
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоСтраховымВзносамОстатки.ПФРСтраховаяОстаток КАК ПФРСтраховая,
	|		РасчетыПоСтраховымВзносамОстатки.ПФРНакопительнаяОстаток КАК ПФРНакопительная,
	|		РасчетыПоСтраховымВзносамОстатки.ФССОстаток КАК ФСС,
	|		РасчетыПоСтраховымВзносамОстатки.ФФОМСОстаток КАК ФФОМС,
	|		РасчетыПоСтраховымВзносамОстатки.ТФОМСОстаток КАК ТФОМС,
	|		РасчетыПоСтраховымВзносамОстатки.ФССНесчастныеСлучаиОстаток КАК ФССНесчастныеСлучаи,
	|		РасчетыПоСтраховымВзносамОстатки.ПФРПоДополнительномуТарифуОстаток КАК ПФРПоДополнительномуТарифу
	|	ИЗ
	|		РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|				&ДатаОстатка,
	|				ВидПлатежа = &ВидПлатежа
	|					И МесяцРасчетногоПериода = &МесяцРасчетногоПериода
	|					И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеДокумента.ПФРСтраховая,
	|		ДанныеДокумента.ПФРНакопительная,
	|		ДанныеДокумента.ФСС,
	|		ДанныеДокумента.ФФОМС,
	|		ДанныеДокумента.ТФОМС,
	|		ДанныеДокумента.ФССНесчастныеСлучаи,
	|		ДанныеДокумента.ПФРПоДополнительномуТарифу
	|	ИЗ
	|		ВТДанныеДокумента КАК ДанныеДокумента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		-РасходыПоСоцСтрахованию.ФСС,
	|		0,
	|		0,
	|		-РасходыПоСоцСтрахованию.ФССНесчастныеСлучаи,
	|		0
	|	ИЗ
	|		ВТРасходыПоСоцСтрахованию КАК РасходыПоСоцСтрахованию) КАК ДанныеДляСуммирования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	Возврат Новый Структура();
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(Отказ, Заголовок = "")

	Если Не ЗначениеЗаполнено(Организация) Тогда
		СтрокаСообщения = ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("Не указана организация!");
		ОбщегоНазначения.ВывестиИнформациюОбОшибке(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МесяцРасчетногоПериода) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан месяц расчетного периода, за который производится уплата!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПлатежа) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указана дата операции!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПлатежа) Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан вид платежа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
	ОбработкаКомментариев.УдалитьСообщения();
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ttk_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверитьЗаполнениеШапки(Отказ, Заголовок);
	
	Если Отказ Тогда
		ОбработкаКомментариев.ПоказатьСообщения();
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРасчетыПоСтраховымВзносам.ПособияПоСтрахованию Тогда
		Если ФСС <> 0 Или ФССНесчастныеСлучаи <> 0 Тогда
			Движение = Движения.РасчетыПоСтраховымВзносам.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
			Движение.Период = ДатаПлатежа;
			Движение.ВидДвижения = ?(ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		КонецЕсли;
		Если ФССЕНВД <> 0 Тогда
			Движение = Движения.РасчетыПоСтраховымВзносам.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект, ,"ФСС, ФССНесчастныеСлучаи");
			Движение.ФСС = ФССЕНВД;
			Движение.ОблагаетсяЕНВД = Истина;
			Движение.Период = ДатаПлатежа;	
			Движение.ВидДвижения = ?(ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		КонецЕсли;
	Иначе
		
		Если ВидОперации = Перечисления.ВидыОперацийРасчетыПоСтраховымВзносам.Начисление Тогда
			Движение = Движения.РасчетыПоСтраховымВзносам.ДобавитьПриход()
		Иначе
			Движение = Движения.РасчетыПоСтраховымВзносам.ДобавитьРасход()
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
		Движение.Период = ДатаПлатежа;	
	КонецЕсли;
	
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ttk_ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

