// Процедура дополняет список ролей, при выборе которых необходимо установить пометку у роли Пользователь
//
Процедура ДополнитьСписокРолейДляПометкиРолиПользователь(МассивРолей) Экспорт
	
	МассивРолей.Добавить(Метаданные.Роли.УдалитьКадровикРегламентированныхДанныхБезОграниченияПрав);
	МассивРолей.Добавить(Метаданные.Роли.УдалитьКадровикУправленческихДанныхБезОграниченияПрав);
	МассивРолей.Добавить(Метаданные.Роли.УдалитьМенеджерПоНаборуПерсоналаБезОграниченияПрав);
	МассивРолей.Добавить(Метаданные.Роли.УдалитьРасчетчикРегламентированнойЗарплатыБезОграниченияПрав);
	МассивРолей.Добавить(Метаданные.Роли.УдалитьРасчетчикУправленческойЗарплатыБезОграниченияПрав);
	
КонецПроцедуры