&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Недоступна работа с файлами.");
	КонецЕсли;
    //АБС. Бреев. заявка 2901
	//Список.НастройкаПорядка.абс_ДатаПрикрепленияФайла.Доступность = истина;
	//ПолеДаты = Список.Порядок.ДоступныеПоляПорядка.Элементы.Найти("абс_ДатаПрикрепленияФайла").Поле;
	//КоллекцияПорядков = Список.Порядок.Элементы
	//ПолеПорядка = Новый ЭлементПорядкаКомпоновкиДанных;
	//ПолеПорядка.Использование = Истина;
	//ПолеПорядка.РежимОтображения = НаправлениеСортировкиКомпоновкиДанных.Возр;
	//ПолеПорядка.Поле = ПолеДаты;
	
	ПолеДаты = Список.Порядок.Элементы.Вставить(0,Тип("ЭлементПорядкаКомпоновкиДанных"));
	ПолеДаты.Поле = Новый ПолеКомпоновкиДанных("абс_ДатаПрикрепленияФайла");
	ПолеДаты.Использование = Истина;
	ПолеДаты.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
    //АБС. Бреев.              

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ФормаКнопкаИзменитьПризнакИтоговогоФайла.Видимость = Ложь;
	
	Если Параметры.Свойство("ВладелецФайла") Тогда

		ОтборСтатус = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ОтборСтатус.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборСтатус.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект");
		ОтборСтатус.ПравоеЗначение 	= Параметры.ВладелецФайла;
		ОтборСтатус.Использование	= Истина;
		
		Если ТипЗнч(Параметры.ВладелецФайла) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			Если 	Параметры.ВладелецФайла.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Исполнение ИЛИ
				Параметры.ВладелецФайла.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Корректировка ИЛИ
				Параметры.ВладелецФайла.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеОФКПослеКоррректировки ИЛИ
				Параметры.ВладелецФайла.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ОтказПослеКорректировки ИЛИ
				    Параметры.ВладелецФайла.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Закрыт Тогда
					
				ОбъектИтоговыйФайл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				
				ОбъектИтоговыйФайл.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
				ОбъектИтоговыйФайл.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("абс_ИтоговыйФайл");
				ОбъектИтоговыйФайл.ПравоеЗначение 	= Истина;
				ОбъектИтоговыйФайл.Использование 	= абс_РаботаСФайлами.ОтбиратьИтоговыеФайлыДоговора(Параметры.ВладелецФайла);	
			КонецЕсли;	
		КонецЕсли;
		
		Если (РольДоступна("абс_ОбщийОтдел") ИЛИ РольДоступна("ПолныеПрава")) 
				И ТипЗнч(Параметры.ВладелецФайла) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда		
				
				Элементы.ФормаКнопкаИзменитьПризнакИтоговогоФайла.Видимость = Истина;
		КонецЕсли;
		
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКнопкаОбновить(Команда)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьРасширение(Команда)
	
	УстановитьРасширениеРаботыСФайлами();

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьФайл(Команда)
				
	Состояние("Отправка файла на сервер...");
	
	АдресХранилища = "";	
	ПутьКФайлу = "";
	
	Если НЕ ПоместитьФайл(АдресХранилища, "", ПутьКФайлу, Истина, УникальныйИдентификатор) Тогда 
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер.");
		Возврат;
	КонецЕсли;
	
	ИмяФайла = "";
	ИмяКаталога = "";
	
	РаботаСФайлами.ПолучитьКаталогИИмяФайла(ПутьКФайлу, ИмяКаталога, ИмяФайла);
	
	ПередатьФайлНаСервер(АдресХранилища, ИмяФайла);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла)
	
	ДвоичныеДанные = абс_РаботаСФайлами.ПолучитьФайлИзВнешнегоХранилища(СсылкаНаФайл);
	
	Если ДвоичныеДанные = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка 
		АдресХранилища = "";	
		АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		НаименованиеФайла = СсылкаНаФайл.Наименование;

	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при получении файла из хранилища.");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат АдресХранилища;
			
КонецФункции

&НаКлиенте
Процедура КомандаОткрытьФайл(Команда)
	
	Состояние("Загрузка файла...");
	
	СсылкаНаФайл = Элементы.Список.ТекущиеДанные.Ссылка;
	
	НаименованиеФайла = "";
	
	АдресХран = ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла);
	
	Если АдресХран = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(АдресХран, НаименованиеФайла, Истина);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПередатьФайлНаСервер(ВремФайл, ИмяФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ВремФайл);
	
	СтруктураВозврата = абс_РаботаСФайлами.ЗаписатьФайлВоВнешнееХранилище(Список.Отбор.Элементы[0].ПравоеЗначение, ДвоичныеДанные, ИмяФайла);
	
	Возврат СтруктураВозврата.Успешно;
			
КонецФункции
 
&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСнятьИтоговыйФайл(Команда)
	
	ИзменитьПризнакИтоговогоФайла(Элементы.Список.ТекущиеДанные.Ссылка);		
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПризнакИтоговогоФайла(Ссылка)
	
	Если НЕ РольДоступна("абс_ОбщийОтдел") И НЕ РольДоступна("ПолныеПрава") Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав");
		Возврат;
	КонецЕсли;
	
	ОбъектФайла = Ссылка.ПолучитьОбъект();
	
	ОбъектФайла.абс_ИтоговыйФайл = НЕ ОбъектФайла.абс_ИтоговыйФайл;
	
	ОбъектФайла.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Состояние("Загрузка файла...");
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	СсылкаНаФайл = Элемент.ТекущиеДанные.Ссылка;
	
	НаименованиеФайла = "";
	
	АдресХран = ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла);
	
	Если АдресХран = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(АдресХран, НаименованиеФайла, Истина);
	
	Элементы.Список.Обновить();		
	
КонецПроцедуры


