
&НаКлиенте
Процедура ВыбратьПериод(Команда)
	РаботаСДиалогами.ОбработчикНастройкаПериодаНажатие(ДатаНач, ДатаКон);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать организацию.'"));
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Организация);
	Отбор.Вставить("ДатаНач", ДатаНач);
	Отбор.Вставить("ДатаКон", ?(ЗначениеЗаполнено(ДатаКон), КонецДня(ДатаКон), ДатаКон));
	Отбор.Вставить("ПериметрВыверки", ПериметрВыверки);
	
	Оповестить("ПолучитьПараметрыОтбора", Отбор, ВладелецФормы);
	
	Закрыть();                                          
	
КонецПроцедуры                                        


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПередЗакрытиемНаСервере()
		
	КлючОбъекта  = "ttk_НастройкаСоответствияСчетовБУКСтатьямВГО";
    КлючНастроек = "НастройкиОтбораПроверки";

	Настройки = Новый Структура("Организация, ДатаКон, ДатаНач, ПериметрВыверки", Организация, ДатаКон, ДатаНач, ПериметрВыверки);
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь();

    ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
		//Получим введенные ранее настройки
	КлючОбъекта  = "ttk_НастройкаСоответствияСчетовБУКСтатьямВГО";
    КлючНастроек = "НастройкиОтбораПроверки";
    ВладелецНастроек = ПользователиИнформационнойБазы.ТекущийПользователь();;
    // Для восстановления настроек необходимо воспользоваться функцией Загрузить
    СтруктураНастроек = Неопределено;
    Попытка
        СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,ВладелецНастроек);
        // если настроек нет, то будет возвращено значение "Неопределено"
    Исключение
        Сообщить("Нет прав на восстановление настроек.");
	КонецПопытки;
	
	Если НЕ СтруктураНастроек = Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек);
	КонецЕсли;
КонецПроцедуры

