
&НаСервере
Функция СоздатьДокумент(СтруктураПараметров)
	
	НовыйДокумент = Документы.абс_ВводБюджета.СоздатьДокумент();
	//Сторчевой А.Н. 05.12.2016 7759851 {
	ttk_ЕдиноеЦФУ = ПараметрыСеанса.ttk_ЕдиноеЦФУ;
	ПерехНаЕдиноеЦФУ = (СтруктураПараметров.Год >= 2017 и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
	Если ПерехНаЕдиноеЦФУ Тогда
		НачалоГодаВвода = Дата(СтрЗаменить(Строка(СтруктураПараметров.Год), Символы.НПП, "") + "0101");      
		Если ТекущаяДата() < НачалоГодаВвода Тогда 
			НовыйДокумент.Дата = НачалоГодаВвода;
		Иначе
			// } Сторчевой А.Н. 05.12.2016 7759851	Элементы.ЦФУ.Доступность = ЗначениеЗаполнено(Организация);
			
			НовыйДокумент.Дата = ТекущаяДата();
			
			//Сторчевой А.Н. 05.12.2016 7759851 {
		КонецЕсли;
	КонецЕсли;
	// } Сторчевой А.Н. 05.12.2016 7759851
	
	НовыйДокумент.Год 				= СтруктураПараметров.Год;
	НовыйДокумент.БюджетДоходов 	= СтруктураПараметров.БюджетДоходов;
	НовыйДокумент.Организация 		= СтруктураПараметров.Организация;
	НовыйДокумент.ЦФУ 				= СтруктураПараметров.ЦФУ;
	НовыйДокумент.ЦФО 				= СтруктураПараметров.ЦФО;
	НовыйДокумент.КапЗатраты 		= СтруктураПараметров.КапЗатраты;
	
	НовыйДокумент.ВводТолькоПлана 	= Истина;
	
	Если СтруктураПараметров.КапЗатраты Тогда
		
		НовыйДокумент.Сценарий			= СтруктураПараметров.Сценарий;
	Иначе
		
		НовыйДокумент.Сценарий			= Константы.абс_СценарийРазработкиБюджета.Получить();
		
	КонецЕсли;
	
	НовыйДокумент.ВалютаПланирования 	= НовыйДокумент.Сценарий.Валюта;
	
	КурсВалюты = Бюджетирование.КурсВалютыПоСценарию(НовыйДокумент.ВалютаПланирования, Дата(НовыйДокумент.Год, 1,1), НовыйДокумент.Сценарий);

	НовыйДокумент.КурсПланирования 		= КурсВалюты.Курс;
	НовыйДокумент.КратностьПланирования = КурсВалюты.Кратность;
	
	Если НовыйДокумент.КурсПланирования = 0 Тогда
		НовыйДокумент.КурсПланирования = 1;
	КонецЕсли;
	
	Если НовыйДокумент.КратностьПланирования = 0 Тогда
		НовыйДокумент.КратностьПланирования = 1;
	КонецЕсли;	
	
	НовыйДокумент.Статус			= Перечисления.абс_СтатусыБюджетов.Подготовка;
	
	НовыйДокумент.Ответственный		= глЗначениеПеременной("глТекущийПользователь");
	
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

                          
&НаКлиенте
Процедура КомандаДобавитьПлан(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	// Выбрать параметры
	
	РезультатВыбора = ОткрытьФормуМодально("Документ.абс_ВводБюджета.Форма.ФормаВыбораАналитикУправляемая", СтруктураПараметров, ЭтаФорма);
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Сформировать и открыть форму нового документа
	
	СсылкаНаДокумент = СоздатьДокумент(РезультатВыбора);
	
	П = Новый Структура("Ключ", СсылкаНаДокумент);	
	
	ОткрытьФорму("Документ.абс_ВводБюджета.Форма.ФормаДокументаУправляемая", П, ЭтаФорма, СсылкаНаДокумент);
	
	Элементы.Список.Обновить();	
	
КонецПроцедуры
