Функция ПревышенПорогСогласованияПоКонтрагенту(Сумма,Контрагент) Экспорт
	
	ПределПревышен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Сумма > абс_ЛимитыПоКонтрагентам.ЛимитДляСчетов
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПределПревышен
		|ИЗ
		|	РегистрСведений.абс_ЛимитыПоКонтрагентам КАК абс_ЛимитыПоКонтрагентам
		|ГДЕ
		|	абс_ЛимитыПоКонтрагентам.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Сумма", Сумма);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПределПревышен = ВыборкаДетальныеЗаписи.ПределПревышен;	
	КонецЕсли;

    Возврат ПределПревышен;
	
КонецФункции 
