
Процедура ЗаписатьНовыйСтатус(НовыйСтатус,ПричинаИзмененияСтатуса)

	НаборЗаписей = РегистрыСведений.абс_СвойРегистр.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();

	Запись.Документ  			= Ссылка;
	Запись.Пользователь	 		= глЗначениеПеременной("глТекущийПользователь");	
	Запись.СтатусДокумента  	= НовыйСтатус;
	
	Запись.Комментарий 			= ПричинаИзмененияСтатуса;
	
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусСвоегоДокумента(Ссылка);
	
	Если НЕ Статус = СтатусПоРегистру Тогда
		ЗаписатьНовыйСтатус(Статус, ПричинаИзмененияСтатуса);		
	КонецЕсли;
КонецПроцедуры
