
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	  
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = "";
	
	Если Диалог.Выбрать() Тогда
		НоваяСтрока = ТЗФайлы.Добавить();
		НоваяСтрока.ИмяФайла       = СтрЗаменить(Диалог.ПолноеИмяФайла,Диалог.Каталог,"");
		НоваяСтрока.ПолноеИмяФайла = Диалог.ПолноеИмяФайла ;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьФайл(Команда)
	
	ТекущаяСтрока = Элементы.ТЗФайлы.ТекущаяСтрока;
	ИндексТекущейСтроки = ТЗФайлы.Индекс(Элементы.ТЗФайлы.ТекущиеДанные);
	Если ТекущаяСтрока <> Неопределено Тогда
		ТЗФайлы.Удалить(ИндексТекущейСтроки);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Прикрепить(Команда)
	Оповестить("ВыбраныФайлыВложения",ТЗФайлы);
	Закрыть();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Стр Из Параметры.ТЗВложения Цикл
		НС = ТЗФайлы.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
	КонецЦикла;
	
КонецПроцедуры
