
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Объект) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнен объект.";
			Продолжить;
		КонецЕсли; 
		Если Запись.Объект.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать в качестве объекта контактной информации - группу.";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить(СтрокаОтказа);
	КонецЕсли; 
	
	//АБС Коломиец 15123+
	КИ = ЭтотОбъект.Выгрузить();
	абс_Синхронизировано       = абс_СерверныеФункции.ВыполнитьВыгрузкуКонтактнойИнформацииВSQL(КИ);   	
	Если Не абс_Синхронизировано Тогда
		Для каждого Запись Из ЭтотОбъект Цикл
			Запись.абс_Синхронизировано = Ложь;
		КонецЦикла;
	Иначе	
		ЭтотОбъект.ЗагрузитьКолонку(КИ.ВыгрузитьКолонку("абс_Синхронизировано"), "абс_Синхронизировано");		
	КонецЕсли;
	//АБС-
	
КонецПроцедуры
