
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДлинаТекста   = СтрДлина(Запись.Комментарий);
	врТекстПолный = Запись.Комментарий;
	врТекст       = "";
	Число         = 0;
	ДобавитьТекст = Ложь;
	                     	
	Для Н = 0 по ДлинаТекста Цикл
		
		Число = Число + 1;
		Если Число > 50 или Н = ДлинаТекста Тогда
			врТекст = Сред(врТекстПолный,0,Н-1);
			врТекстПолный = Сред(врТекстПолный,Н);
			ДобавитьТекст = Истина;
		КонецЕсли;	
		
		Если ДобавитьТекст Тогда
			
			врТекст = врТекст + Символы.ВК;
			ДобавитьТекст = Ложь;
			Если НЕ СокрЛП(врТекст) = "" Тогда
			Текст.ДобавитьСтроку(СокрЛП(врТекст)); 
			КонецЕсли;
			Число = 0;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры
