////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы

#Если Клиент Тогда

Процедура ФормаЭлементаПередОткрытиемДополнительно(Форма, ОбработчикПриИзмении) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ВыполнитьДополнительныеДействияПриИзменении(Элемент, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры
	
#КонецЕсли