
Процедура УстановитьИмяТекущегоПользователя(ЗаголовокНадписи) Экспорт
	// заполним команду Мои настройки представлением текущего пользователя
	Если Не ПустаяСтрока(ИмяПользователя()) Тогда
		ЗаголовокНадписи = ОбщегоНазначения.ПолучитьПредставленияОбъектов(глЗначениеПеременной("глТекущийПользователь"));
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьОсновнуюОрганизацию(ЗаголовокНадписиОсновнойОрганизации, ЗаголовокКомандыОсновнойОрганизации, ОбъектОбработка) Экспорт
	ОбъектОбработка.ОсновнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	ЗаголовокНадписиОсновнойОрганизации = ОбщегоНазначения.ПолучитьПредставленияОбъектов(ОбъектОбработка.ОсновнаяОрганизация);
	ЗаголовокКомандыОсновнойОрганизации = ?(ЗначениеЗаполнено(ОбъектОбработка.ОсновнаяОрганизация), "Изменить ", "Установить ") + ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("основную организацию");
КонецПроцедуры

Процедура ОбработатьОткрытиеФормы(Элемент, Менеджер = Неопределено, ФормаСписка = Истина, ИмяФормы = Неопределено) Экспорт

	ИмяОбъектаМетаданных = ОтсечьЦифры(Элемент.Имя);
	
	Попытка
		
		Если Менеджер = Неопределено Тогда
			Форма = ПолучитьОбщуюФорму(ИмяОбъектаМетаданных);
		ИначеЕсли ФормаСписка Тогда
			Если ИмяФормы = Неопределено Тогда
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФормуСписка();
			Иначе
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФормуСписка(ИмяФормы);
			КонецЕсли;
		Иначе
			Если ИмяФормы = Неопределено Тогда
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФорму();
			Иначе
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФорму(ИмяФормы);
			КонецЕсли;
		КонецЕсли;	
		Форма.Открыть();
		
	Исключение
		ОбработкаИсключения(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры // ОткрытьДокумент()

// Открыть форму настройки пользователя
// 
Процедура ОткрытьФормуНастройкиПользователя() Экспорт
	
	ПараметрыСеанса.ТекущийПользователь.ПолучитьФорму().Открыть();
	
КонецПроцедуры  // ОткрытьФормуНастройкиПользователя

Функция ОтсечьЦифры(ИсходнаяСтрока) Экспорт

	ФинальнаяСтрока = ИсходнаяСтрока;
	
	КодСимвола = КодСимвола(Прав(ИсходнаяСтрока, 1));
	
	Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		ФинальнаяСтрока = Лев(ИсходнаяСтрока, СтрДлина(ИсходнаяСтрока) - 1);
	КонецЕсли; 
	
	Возврат ФинальнаяСтрока;
		
КонецФункции // ОтсечьЦифры()

Процедура ОбработкаИсключения(ИнформацияОбОшибке) Экспорт
	
	ПричинаОшибки = ИнформацияОбОшибке.Причина;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(ПричинаОшибки = Неопределено,
					 "При выполнении действия произошла ошибка.",
					 ПричинаОшибки.Описание));
	
КонецПроцедуры // ОбработкаИсключения()

	

