&НаСервере
Процедура абс_ЗаявкаНаИзменениеНаСервере(МожноСоздавать,ДанныеФормы)
	
	Если Элементы.Список.ТекущаяСтрока.Пустая() Тогда
		Возврат ;
	КонецЕсли;
	Если   Элементы.Список.ТекущаяСтрока.ЭтоГруппа ТОгда
		Возврат;
	КонецЕсли;
	
	//НовЗаявка = Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.СоздатьДокумент();
	//НовЗаявка.Контрагент = Объект.Ссылка;
	МожноСоздавать = Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.ЗаполнитьПрежниеЗначенияКонтрагента(Элементы.Список.ТекущаяСтрока,ДанныеФормы);
	
КонецПРоцедуры

&НаКлиенте
Процедура абс_ЗаявкаНаИзменение(Команда)
	
	
	МожноСоздавать = Ложь;
	
	ФормаДок = ПолучитьФорму("Документ.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.Форма.ФормаДокументаУправляемая");
	ДанныеФормы = ФормаДок.Объект;
	абс_ЗаявкаНаИзменениеНаСервере(МожноСоздавать,ДанныеФормы);
	
	Если  МожноСоздавать = Истина ТОгда
	    КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
		ФормаДок.Объект.Контрагент = Элементы.Список.ТекущаяСтрока;
		ФормаДок.Открыть();
	Иначе
		
	КонецЕсли;
КонецПроцедуры
