
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Лимит = РегистрыСведений.ttk_ЛимитыПоДоговорам.СоздатьМенеджерЗаписи();
	Лимит.Организация = Организация;
	Лимит.Контрагент = Контрагент;
	Если МетодКонтроля = 2 И ЗначениеЗаполнено(ДополнительныеСвойства.ОсновнойДоговор) Тогда
		Лимит.ДоговорКонтрагента = ДополнительныеСвойства.ОсновнойДоговор;
	Иначе 
		Лимит.ДоговорКонтрагента = ДоговорКонтрагента;
	КонецЕсли;
	Лимит.Распоряжение = Ссылка;
	Лимит.Прочитать();		
	Лимит.Организация = Организация;
	Лимит.Контрагент = Контрагент;
	Лимит.ДоговорКонтрагента = ДоговорКонтрагента;
	Лимит.Распоряжение = Ссылка;
	Лимит.НачалоПериода = НачалоПериода;
	Лимит.ОкончаниеПериода = ОкончаниеПериода;
	Лимит.МетодКонтроля = МетодКонтроля;
	Лимит.Статус = Статус;
	Лимит.СуммаБезНДС = СуммаБезНДС;
	Лимит.СуммаНДС = СуммаНДС;
	Лимит.СуммаСНДС = Сумма;
	Лимит.СтавкаНДС = СтавкаНДС;
	Лимит.Валюта = Валюта;
	Лимит.Записать();
		
	//
	Если Статус = Перечисления.абс_СтатусыПервичныхДокументов.Согласован Тогда
		Движения.ttk_ОстаткиЛимитовПоДоговорам.Записывать = Истина;
		Движение = Движения.ttk_ОстаткиЛимитовПоДоговорам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = НачалоПериода;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Если МетодКонтроля = 2 И ЗначениеЗаполнено(ДополнительныеСвойства.ОсновнойДоговор) Тогда
			Движение.Договор = ДополнительныеСвойства.ОсновнойДоговор;
		Иначе 
			Движение.Договор = ДоговорКонтрагента;
		КонецЕсли;		
		Движение.СуммаБезНДС = СуммаБезНДС;
		Движение.СуммаНДС = СуммаНДС;
		Движение.СуммаСНДС = Сумма;
		Движение.Валюта = Валюта;
		Движение.Распоряжение = Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Записшем статусы согласования в регистр.
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовПервичныхДокументов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ПервичныйДокумент.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера(); //ТекущаяДата();  АБС Коломиец 17233
	Запись.ПервичныйДокумент = Ссылка;
	Запись.Пользователь = ТекПользователь;	
	Запись.СтатусДокумента = Статус;	
	Запись.Комментарий = Комментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Сообщение = Новый СообщениеПользователю;
	
	ОтказЗаписи = Документы.ttk_РаспоряжениеНаЗакупку.ПроверитьВозможностьЗаписиДокумента(Ссылка, МетодКонтроля, НачалоПериода, ОкончаниеПериода);
	Если ОтказЗаписи.Количество() > 0 Тогда
		Сообщение.Текст = ОтказЗаписи.ТекстСообщения;
		Сообщение.Поле = ОтказЗаписи.Поле;
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		ПроверяемыеРеквизиты.Удалить(МетодКонтроля);
		Отказ = ОтказЗаписи.Отказ;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
		Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
	НомерРаспоряжения = "";
	ДатаРаспоряжения = Дата(1,1,1);
	МетодКонтроля = 0;
	НачалоПериода = Дата(1,1,1);
	ОкончаниеПериода = Дата(1,1,1);
	СуммаБезНДС = 0;
	СуммаНДС = 0;
	Сумма = 0;
	Комментарий = "";
	
КонецПроцедуры
