
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборСтатей();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСтатей()
	
	ОтборОбъект = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборОбъект.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборОбъект.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("абс_Используется");
	ОтборОбъект.ПравоеЗначение 	= Истина;
	ОтборОбъект.Использование	= Истина;
	
		
	//Если ЗначениеЗаполнено(Параметры) Тогда
		
		Если Параметры.Свойство("СписокЭлементов") Тогда
			ОтборЭлементов = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ОтборЭлементов.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
			ОтборЭлементов.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
			ОтборЭлементов.ПравоеЗначение 	= Параметры.СписокЭлементов;
			ОтборЭлементов.Использование	= Истина;
			
			
		КонецЕсли;		
	//КонецЕсли;
		
КонецПроцедуры