
&НаКлиенте
Процедура УстановитьНастройкиОтчетаПоПараметрам()
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Отбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
		Организация = Неопределено;
		Если Параметры.Свойство("Организация", Организация) Тогда
			
			ОтборСтатус = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборСтатус.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ОтборСтатус.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Организация");
			ОтборСтатус.ПравоеЗначение 	= Организация;
			ОтборСтатус.Использование	= Истина;
	
		КонецЕсли;
		
		ЦФУ = Неопределено;
		Если Параметры.Свойство("ЦФУ", ЦФУ) Тогда
			
			ОтборСтатус = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборСтатус.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ОтборСтатус.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ЦФУ");
			ОтборСтатус.ПравоеЗначение 	= ЦФУ;
			ОтборСтатус.Использование	= Истина;
	
		КонецЕсли;

		ЦФО = Неопределено;
		Если Параметры.Свойство("ЦФО", ЦФО) Тогда
			
			ОтборСтатус = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборСтатус.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ОтборСтатус.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ЦФО");
			ОтборСтатус.ПравоеЗначение 	= ЦФО;
			ОтборСтатус.Использование	= Истина;
	
		КонецЕсли;

		СтатьяОборотов = Неопределено;
		Если Параметры.Свойство("СтатьяОборотов", СтатьяОборотов) Тогда
			
			ОтборСтатус = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборСтатус.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ОтборСтатус.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатьяОборотов");
			ОтборСтатус.ПравоеЗначение 	= СтатьяОборотов;
			ОтборСтатус.Использование	= Истина;
	
		КонецЕсли;

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНастройкиОтчетаПоПараметрам();
	
	//СкомпоноватьРезультат(Результат);
	
	пользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы
	
КонецПроцедуры

