
Процедура ЗаполнитьСписокДоступныхСтатусов(Список, Ссылка,мРолиПользователя,мТекущийПользователь) Экспорт	
	
	Список.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка.Статус) Тогда
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		Возврат;
	Иначе
		Список.Добавить(Ссылка.Статус);
	КонецЕсли;
	
	СотрудникДопСогласование = Справочники.Пользователи.ПустаяСсылка();
	МассивПользователей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(Ссылка.СотрудникДопСогласование);
	Если МассивПользователей.Количество() > 0 Тогда
		СотрудникДопСогласование = МассивПользователей[0];
	КонецЕсли;
	
	
	Если Ссылка.ВидТЭО = Перечисления.абс_ВидТЭО.ТЭО и Не Ссылка.Актуализация Тогда     //ВСТАВКА Проектный учет 171213 Родин
		Если Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Подготовка Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРТЭО);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
			//ВСТАВКА Проектный учет 191213 Родин	
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации и мТекущийПользователь = СотрудникДопСогласование Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан и мТекущийПользователь = Ссылка.Ответственный Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРТЭО и мРолиПользователя.Найти(Справочники.РолиИсполнителей.РазработкаИТРТЭО) <> Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ);
			//Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭИ) <> Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			//ВСТАВКА Проектный учет 191213 Родин
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеИК) <> Неопределено Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРДП);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРДП  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.РазработкаИТРДП) <> Неопределено Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Согласован);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Отказ  и мТекущийПользователь = Ссылка.Ответственный Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован  и мТекущийПользователь = Ссылка.Ответственный Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		КонецЕсли;
	ИначеЕсли Ссылка.ВидТЭО = Перечисления.абс_ВидТЭО.ЭкспрессТЭО или Ссылка.Актуализация Тогда 
		Если Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Подготовка Тогда
			
			//ВСТАВКА Проектный учет 191213 Родин
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ);
			//Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации  и мТекущийПользователь = СотрудникДопСогласование Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан   и мТекущийПользователь = Ссылка.Ответственный Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ   и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭИ) <> Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			//ВСТАВКА Проектный учет 191213 Родин
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеИК) <> Неопределено  Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Согласован);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Отказ  и мТекущийПользователь = Ссылка.Ответственный Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован   и мТекущийПользователь = Ссылка.Ответственный  Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		КонецЕсли;
		
	ИначеЕсли Ссылка.ВидТЭО = Перечисления.абс_ВидТЭО.БюджетнаяОценка Тогда
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Согласован);
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьСтатусТЭО(Ссылка) Экспорт 
	
	ЗапросСтатус = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                            |	абс_ИзменениеСтатусовЗаявокНаОбеспечениеТМЦСрезПоследних.Статус КАК СтатусДокумента,
	                            |	абс_ИзменениеСтатусовЗаявокНаОбеспечениеТМЦСрезПоследних.Период КАК Период
	                            |ИЗ
	                            |	РегистрСведений.абс_ИзменениеСтатусовТЭО.СрезПоследних(&Период, ТЭО = &ТЭО) КАК абс_ИзменениеСтатусовЗаявокНаОбеспечениеТМЦСрезПоследних
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	Период УБЫВ");
	ЗапросСтатус.УстановитьПараметр("Период"	, Новый Граница(абс_СерверныеФункции.ПолучитьДатуСервера(), ВидГраницы.Включая));
	ЗапросСтатус.УстановитьПараметр("ТЭО"	, Ссылка);
	
	ВыборкаСтатус = ЗапросСтатус.Выполнить().Выбрать();
	                                                              
	ТекСтатус = Неопределено;
	Если ВыборкаСтатус.Следующий() Тогда
		ТекСтатус = ВыборкаСтатус.СтатусДокумента;
	КонецЕсли;
	
	Возврат ТекСтатус;
	
КонецФункции

