//////////////////////////////////////////////////////////////////////////
//  КНИГА ПОКУПОК
 
// +++ввв 20.04.2016 г.
Процедура ПодменаСоставногоПоляДокументСсылкаЗапроса(Запрос,ЗапросЗамена,ЗапросТип,ТипыДоков)
	ЗапросВставка="(ВЫБОР";
	Для каждого йСтр Из ТипыДоков Цикл
		ЗапросВставка=ЗапросВставка+"
	|	КОГДА "+ЗапросТип+" = ТИП(Документ."+йСтр+") ТОГДА ВЫРАЗИТЬ("+ЗапросЗамена+" КАК Документ."+йСтр+")";
	КонецЦикла;
	ЗапросВставка=ЗапросВставка+"
	|	КОНЕЦ)";
	Запрос.Текст=СтрЗаменить(Запрос.Текст,ЗапросЗамена,ЗапросВставка);
КонецПроцедуры
// ---ввв 20.04.2016 г.

// +++ввв 31.05.2016 г.
Функция ДеталировкаПоляПоТипам(ЗапросТекст, КлассификаторСлучаев,ГрафаПоле,ПолеПл,ТаблПл,ФлагВпередиПоля=Ложь,ФлагДаты=Ложь) Экспорт
	ЗапросВставка="	(ВЫБОР";
	Если ФлагВпередиПоля Тогда
		ЗапросВставка=ЗапросВставка+"
	|		КОГДА "+ТаблПл+"."+ПолеПл+"<>"+?(ФлагДаты,"ДАТАВРЕМЯ(1,1,1)","""""")+" ТОГДА
	|			"+ТаблПл+"."+ПолеПл;
	КонецЕсли;
	ФлагКогда=Ложь;
	Для каждого йСтр Из КлассификаторСлучаев.Классификатор Цикл
		Если йСтр[ГрафаПоле]=NULL Тогда
			Продолжить;
		КонецЕсли;
		Если ПустаяСтрока(йСтр[ГрафаПоле]) Тогда
			Продолжить;
		КонецЕсли;
		ТипДО=Метаданные.НайтиПоТипу(йСтр.ТипДокументаОснования).Имя;
		ТипСФ=Метаданные.НайтиПоТипу(йСтр.ТипСчетаФактуры).Имя;
		ВидСФ="=НЕОПРЕДЕЛЕНО";
// +++ввв 22.06.2016 г.
		Если йСтр.ВидСчетаФактуры = NULL Тогда
			ВидСФ=" ЕСТЬ NULL";
// ---ввв 22.06.2016 г.
		ИначеЕсли ТипСФ="СчетФактураПолученный" Тогда
// +++ввв 22.06.2016 г.
			//ВидСФ="ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.";
			ВидСФ="=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.";
// ---ввв 22.06.2016 г.
			Если йСтр.ВидСчетаФактуры=Перечисления.ВидСчетаФактурыПолученного.ПустаяСсылка() Тогда
				ВидСФ=ВидСФ+"ПустаяСсылка";
			ИначеЕсли ТипЗнч(йСтр.ВидСчетаФактуры)=Тип("ПеречислениеСсылка.ВидСчетаФактурыПолученного") Тогда
				ВидСФ=ВидСФ+Метаданные.Перечисления.ВидСчетаФактурыПолученного.ЗначенияПеречисления[Перечисления.ВидСчетаФактурыПолученного.Индекс(йСтр.ВидСчетаФактуры)].Имя;
			КонецЕсли;
			ВидСФ=ВидСФ+")";
		ИначеЕсли ТипСФ="СчетФактураВыданный" Тогда
// +++ввв 22.06.2016 г.
			//ВидСФ="ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.";
			ВидСФ="=ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.";
// ---ввв 22.06.2016 г.
			Если йСтр.ВидСчетаФактуры=Перечисления.НДСВидСчетаФактуры.ПустаяСсылка() Тогда
				ВидСФ=ВидСФ+"ПустаяСсылка";
			ИначеЕсли ТипЗнч(йСтр.ВидСчетаФактуры)=Тип("ПеречислениеСсылка.НДСВидСчетаФактуры") Тогда
				ВидСФ=ВидСФ+Метаданные.Перечисления.НДСВидСчетаФактуры.ЗначенияПеречисления[Перечисления.НДСВидСчетаФактуры.Индекс(йСтр.ВидСчетаФактуры)].Имя;
			КонецЕсли;
			ВидСФ=ВидСФ+")";
		КонецЕсли;
		ФлагИспр=?(йСтр.Исправление,"ИСТИНА","ЛОЖЬ");
		ЗапросВставка=ЗапросВставка+"
	|		КОГДА ("+ТаблПл+".КодВидаОперацииКласс="""+йСтр.КодВидаОперации+""") И
	|			  ("+ТаблПл+".КодВидаОперацииСчетФактураДокумент="""+йСтр.КодВидаОперацииСчетФактураДокумент+""") И
	|			  (ТИПЗНАЧЕНИЯ("+ТаблПл+".СчетФактура)=ТИП(Документ."+ТипДО+")) И
	|			  (ТИПЗНАЧЕНИЯ("+ТаблПл+".СчетФактураДокумент)=ТИП(Документ."+ТипСФ+")) И
// +++ввв 22.06.2016 г.
	//|			  ("+ТаблПл+".ФлагВидСчетаФактуры="+ВидСФ+") И
	|			  ("+ТаблПл+".ФлагВидСчетаФактуры"+ВидСФ+") И
// ---ввв 22.06.2016 г.
	|			  ("+ТаблПл+".ФлагИсправление="+ФлагИспр+") ТОГДА";
// +++ввв 22.06.2016 г.
		ЗапросВставкаСтр="
	|			ВЫБОР";
		ФлагПоля=Ложь;
// ---ввв 22.06.2016 г.
		йС=йСтр[ГрафаПоле];
		Пока ЗначениеЗаполнено(йС) Цикл
			йй=Найти(йС,";");
			Если йй=0 Тогда
				йСР=йС;
				йС="";
			Иначе
				йСР=Лев(йС,йй-1);
				йС=Сред(йС,йй+1);
			КонецЕсли;
// +++ввв 01.06.2016 г.
			ПрефВыв=Врег(Лев(йСР,2));
			ПолеВыв=Сред(йСР,4);
			Если ПрефВыв="СФ" Тогда
// +++ввв 22.06.2016 г.
				Если Метаданные.Документы[ТипСФ].Реквизиты.Найти(ПолеВыв)<>Неопределено ИЛИ
					 Врег(ПолеВыв)="НОМЕР" ИЛИ Врег(ПолеВыв)="ДАТА" Тогда
// ---ввв 22.06.2016 г.
					ЗапросВставкаСтр=ЗапросВставкаСтр+"
	|				КОГДА ВЫРАЗИТЬ("+ТаблПл+".СчетФактураДокумент КАК Документ."+ТипСФ+")."+ПолеВыв+"<>"+?(ФлагДаты,"ДАТАВРЕМЯ(1,1,1)","""""")+" ТОГДА
	|					ВЫРАЗИТЬ("+ТаблПл+".СчетФактураДокумент КАК Документ."+ТипСФ+")."+ПолеВыв;
// +++ввв 22.06.2016 г.
					ФлагПоля=Истина;
// --ввв 22.06.2016 г.
// +++ввв 22.06.2016 г.
				КонецЕсли;
// ---ввв 22.06.2016 г.
			ИначеЕсли ПрефВыв="ДО" Тогда
// +++ввв 22.06.2016 г.
				Если Метаданные.Документы[ТипДО].Реквизиты.Найти(ПолеВыв)<>Неопределено ИЛИ
					 Врег(ПолеВыв)="НОМЕР" ИЛИ Врег(ПолеВыв)="ДАТА" Тогда
// ---ввв 22.06.2016 г.
					ЗапросВставкаСтр=ЗапросВставкаСтр+"
	|				КОГДА ВЫРАЗИТЬ("+ТаблПл+".СчетФактура КАК Документ."+ТипДО+")."+ПолеВыв+"<>"+?(ФлагДаты,"ДАТАВРЕМЯ(1,1,1)","""""")+" ТОГДА
	|					ВЫРАЗИТЬ("+ТаблПл+".СчетФактура КАК Документ."+ТипДО+")."+ПолеВыв;
// +++ввв 22.06.2016 г.
					ФлагПоля=Истина;
// ---ввв 22.06.2016 г.
// +++ввв 22.06.2016 г.
				КонецЕсли;
// ---ввв 22.06.2016 г.
			ИначеЕсли ПрефВыв="ЗК" Тогда
// +++ввв 24.06.2016 г.
				Если КлассификаторСлучаев.ПоляЗК.Найти(Врег(ПолеВыв))<>Неопределено Тогда
// ---ввв 24.06.2016 г.
					ЗапросВставкаСтр=ЗапросВставкаСтр+"
	|				КОГДА "+ТаблПл+"."+ПолеВыв+"<>"+?(ФлагДаты,"ДАТАВРЕМЯ(1,1,1)","""""")+" ТОГДА
	|					"+ТаблПл+"."+ПолеВыв;
// +++ввв 22.06.2016 г.
					ФлагПоля=Истина;
// +++ввв 24.06.2016 г.
				КонецЕсли;
// ---ввв 24.06.2016 г.
// ---ввв 22.06.2016 г.
// ---ввв 01.06.2016 г.
			КонецЕсли;
		КонецЦикла;
// +++ввв 22.06.2016 г.
		Если ФлагПоля Тогда
			ЗапросВставка=ЗапросВставка+ЗапросВставкаСтр+"
	|				ИНАЧЕ "+ТаблПл+"."+ПолеПл+"
	|			КОНЕЦ";
		Иначе
			ЗапросВставка=ЗапросВставка+"
	|					"+ТаблПл+"."+ПолеПл;
		КонецЕсли;
// ---ввв 22.06.2016 г.
		ФлагКогда=Истина;
	КонецЦикла;
	Если ФлагКогда Тогда
		ЗапросВставка=ЗапросВставка+"
	|		ИНАЧЕ "+ТаблПл+"."+ПолеПл+"
	|	КОНЕЦ)";
	Иначе
		ЗапросВставка=ТаблПл+"."+ПолеПл;
	КонецЕсли;
	Возврат СтрЗаменить(ЗапросТекст,ТаблПл+"."+ПолеПл+" КАК "+ПолеПл,ЗапросВставка+" КАК "+ПолеПл);
КонецФункции
// ---ввв 31.05.2016 г.

// +++ввв 23.06.2016 г.
Процедура ПрименитьКлассификаторСлучаев(КлассификаторСлучаев, Запрос, ТипУчета) Экспорт
	ТаблКнига="ЗаписиКниги"+?(ТипУчета=""+Перечисления.ttk_ТипыРазделовНДС.Покупки,"Покупок","Продаж");
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа3_Номер","НомерСчетаФактуры",ТаблКнига,Ложь,Ложь);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа3_Дата","ДатаСчетаФактуры",ТаблКнига,Ложь,Истина);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа4_Номер","НомерИсправления",ТаблКнига,Ложь,Ложь);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа4_Дата","ДатаИсправления",ТаблКнига,Ложь,Истина);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа5_Номер","НомерКорректировки",ТаблКнига,Ложь,Ложь);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа5_Дата","ДатаКорректировки",ТаблКнига,Ложь,Истина);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа6_Номер","НомерИсправленияКорректировки",ТаблКнига,Ложь,Ложь);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа6_Дата","ДатаИсправленияКорректировки",ТаблКнига,Ложь,Истина);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа7_Номер","НомерДокументаОплаты",ТаблКнига,Истина,Ложь);
	Запрос.Текст=ДеталировкаПоляПоТипам(Запрос.Текст, КлассификаторСлучаев,"Графа7_Дата","ДатаДокументаОплаты",ТаблКнига,Истина,Истина);
КонецПроцедуры
// ---ввв 23.06.2016 г.

// +++ввв 09.06.2016 г.
Функция ПолучитьКлассификаторСлучаев(Запрос,ТипУчета) Экспорт
// Классификатор начало
// +++ввв 24.06.2016 г.
	КлассификаторСлучаев=Новый Структура;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	*
	             |ИЗ
	             |	ВТ_ЗаписиКниги КАК ВТ_Книга
				 |ГДЕ
				 |	ЛОЖЬ";
	ПустаяТабл=Запрос.Выполнить().Выгрузить();
	ПоляЗК=Новый Массив;
	Для каждого йРекв Из ПустаяТабл.Колонки Цикл
		ПоляЗК.Добавить(Врег(йРекв.Имя));
	КонецЦикла;
	КлассификаторСлучаев.Вставить("ПоляЗК",ПоляЗК);
// ---ввв 24.06.2016 г.
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
// +++ввв 21.10.2016 г.
				 |	ВТ_Книга.КодВидаОперацииКласс КАК КодВидаОперации,
// ---ввв 21.10.2016 г.
	             |	ВТ_Книга.КодВидаОперацииСчетФактураДокумент КАК КодВидаОперацииСчетФактураДокумент,
	             |	ТИПЗНАЧЕНИЯ(ВТ_Книга.СчетФактура) КАК ТипДокументаОснования,
	             |	ТИПЗНАЧЕНИЯ(ВТ_Книга.СчетФактураДокумент) КАК ТипСчетаФактуры,
	             |	ВЫБОР
	             |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Книга.СчетФактура) = ТИПЗНАЧЕНИЯ(ВТ_Книга.СчетФактураДокумент)
	             |			ТОГДА ИСТИНА
	             |		ИНАЧЕ ЛОЖЬ
	             |	КОНЕЦ КАК ПараДокументовРавна,
	             |	ВТ_Книга.ФлагВидСчетаФактуры КАК ВидСчетаФактуры,
	             |	ВТ_Книга.ФлагИсправление КАК Исправление
// +++ввв 22.06.2016 г.
				 //,
	             //|	ВТ_Книга.ФлагИспользоватьДокументРасчетовКакСчетФактуру КАК ИспользоватьДокументРасчетовКакСчетФактуру
// ---ввв 22.06.2016 г.
	             |ПОМЕСТИТЬ ВТ_КлассыСлучаев
	             |ИЗ
	             |	ВТ_ЗаписиКниги КАК ВТ_Книга
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_Книга.КодВидаОперации КАК КодВидаОперации,
	             |	ВТ_Книга.КодВидаОперацииСчетФактураДокумент КАК КодВидаОперацииСчетФактураДокумент,
	             |	ВТ_Книга.ТипДокументаОснования КАК ТипДокументаОснования,
	             |	ВТ_Книга.ТипСчетаФактуры КАК ТипСчетаФактуры,
	             |	ВТ_Книга.ВидСчетаФактуры КАК ВидСчетаФактуры,
	             |	ВТ_Книга.Исправление КАК Исправление,
// +++ввв 22.06.2016 г.
	             //|	ВТ_Книга.ИспользоватьДокументРасчетовКакСчетФактуру КАК ИспользоватьДокументРасчетовКакСчетФактуру,
// ---ввв 22.06.2016 г.				 
	             |	ВЫБОР
	             |		КОГДА ВложенныйЗапрос.Графа3_Номер ЕСТЬ NULL 
	             |			ТОГДА ВЫБОР
	             |					КОГДА ВТ_Книга.ПараДокументовРавна
	             |						ТОГДА ВЫБОР
	             |								КОГДА ВТ_Книга.ТипДокументаОснования = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	             |									ТОГДА ""ДО.ttk_Номер""
	             |								ИНАЧЕ ""ДО.Номер""
	             |							КОНЕЦ
	             |					ИНАЧЕ ""СФ.Номер""
	             |				КОНЕЦ
	             |		ИНАЧЕ ВложенныйЗапрос.Графа3_Номер
	             |	КОНЕЦ КАК Графа3_Номер,
	             |	ВЫБОР
	             |		КОГДА ВложенныйЗапрос.Графа3_Дата ЕСТЬ NULL 
	             |			ТОГДА ВЫБОР
	             |					КОГДА ВТ_Книга.ПараДокументовРавна
	             |						ТОГДА ВЫБОР
	             |								КОГДА ВТ_Книга.ТипДокументаОснования = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	             |									ТОГДА ""ДО.ttk_Дата""
	             |								ИНАЧЕ ""ДО.Дата""
	             |							КОНЕЦ
	             |					ИНАЧЕ ""СФ.Дата""
	             |				КОНЕЦ
	             |		ИНАЧЕ ВложенныйЗапрос.Графа3_Дата
	             |	КОНЕЦ КАК Графа3_Дата,
	             |	ВложенныйЗапрос.Графа4_Номер КАК Графа4_Номер,
	             |	ВложенныйЗапрос.Графа4_Дата КАК Графа4_Дата,
	             |	ВложенныйЗапрос.Графа5_Номер КАК Графа5_Номер,
	             |	ВложенныйЗапрос.Графа5_Дата КАК Графа5_Дата,
	             |	ВложенныйЗапрос.Графа6_Номер КАК Графа6_Номер,
	             |	ВложенныйЗапрос.Графа6_Дата КАК Графа6_Дата,
	             |	ВложенныйЗапрос.Графа7_Номер КАК Графа7_Номер,
	             |	ВложенныйЗапрос.Графа7_Дата КАК Графа7_Дата,
	             |	ЕСТЬNULL(ВложенныйЗапрос.Согласован, ЛОЖЬ) КАК Согласован,
	             |	ВЫБОР
	             |		КОГДА ВложенныйЗапрос.Ошибка ЕСТЬ NULL 
	             |			ТОГДА ВЫБОР
	             |					КОГДА ВТ_Книга.ПараДокументовРавна
	             |							И ВТ_Книга.ТипДокументаОснования <> ТИП(Документ.ДокументРасчетовСКонтрагентом)
// +++ввв 22.06.2016 г.
				 //|						ТОГДА ВЫБОР
				 //|							КОГДА ВТ_Книга.ИспользоватьДокументРасчетовКакСчетФактуру
				 //|								ТОГДА ДАТАВРЕМЯ(2999, 12, 31)
				 //|							ИНАЧЕ ДАТАВРЕМЯ(2015, 1, 1)
				 //|						КОНЕЦ
	             |						ТОГДА ДАТАВРЕМЯ(2015, 1, 1)
// ---ввв 22.06.2016 г.
	             |					КОГДА НЕ ВТ_Книга.ПараДокументовРавна
	             |							И ВТ_Книга.ТипДокументаОснования = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	             |							И ВТ_Книга.ТипСчетаФактуры = ТИП(Документ.СчетФактураВыданный)
	             |							И ВТ_Книга.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.ПустаяСсылка)
	             |						ТОГДА ДАТАВРЕМЯ(2015, 1, 1)
	             |					КОГДА НЕ ВТ_Книга.ПараДокументовРавна
	             |							И ВТ_Книга.ТипДокументаОснования = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	             |							И ВТ_Книга.ТипСчетаФактуры = ТИП(Документ.СчетФактураПолученный)
	             |							И ВТ_Книга.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.ПустаяСсылка)
	             |						ТОГДА ДАТАВРЕМЯ(2015, 1, 1)
	             |					ИНАЧЕ ДАТАВРЕМЯ(2999, 12, 31)
	             |				КОНЕЦ
	             |		ИНАЧЕ ВложенныйЗапрос.Ошибка
	             |	КОНЕЦ КАК Ошибка,
	             |	ВЫБОР
	             |		КОГДА ВложенныйЗапрос.КодВидаОперации ЕСТЬ NULL 
	             |			ТОГДА ИСТИНА
	             |		ИНАЧЕ ЛОЖЬ
	             |	КОНЕЦ КАК Новый
	             |ПОМЕСТИТЬ ВТ_КлассификаторСлучаев
	             |ИЗ
	             |	ВТ_КлассыСлучаев КАК ВТ_Книга
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ttk_КлассификаторСлучаевНДС.КодВидаОперации КАК КодВидаОперации,
	             |			ttk_КлассификаторСлучаевНДС.КодВидаОперацииСчетФактураДокумент КАК КодВидаОперацииСчетФактураДокумент,
	             |			ТИПЗНАЧЕНИЯ(ttk_КлассификаторСлучаевНДС.ТипДокументаОснования) КАК ТипДокументаОснования,
	             |			ТИПЗНАЧЕНИЯ(ttk_КлассификаторСлучаевНДС.ТипСчетаФактуры) КАК ТипСчетаФактуры,
	             |			ttk_КлассификаторСлучаевНДС.ВидСчетаФактуры КАК ВидСчетаФактуры,
	             |			ttk_КлассификаторСлучаевНДС.Исправление КАК Исправление,
// +++ввв 22.06.2016 г.
	             //|			ttk_КлассификаторСлучаевНДС.ИспользоватьДокументРасчетовКакСчетФактуру КАК ИспользоватьДокументРасчетовКакСчетФактуру,
// ---ввв 22.06.2016 г.
	             |			ttk_КлассификаторСлучаевНДС.Графа3_Номер КАК Графа3_Номер,
	             |			ttk_КлассификаторСлучаевНДС.Графа3_Дата КАК Графа3_Дата,
	             |			ttk_КлассификаторСлучаевНДС.Графа4_Номер КАК Графа4_Номер,
	             |			ttk_КлассификаторСлучаевНДС.Графа4_Дата КАК Графа4_Дата,
	             |			ttk_КлассификаторСлучаевНДС.Графа5_Номер КАК Графа5_Номер,
	             |			ttk_КлассификаторСлучаевНДС.Графа5_Дата КАК Графа5_Дата,
	             |			ttk_КлассификаторСлучаевНДС.Графа6_Номер КАК Графа6_Номер,
	             |			ttk_КлассификаторСлучаевНДС.Графа6_Дата КАК Графа6_Дата,
	             |			ttk_КлассификаторСлучаевНДС.Графа7_Номер КАК Графа7_Номер,
	             |			ttk_КлассификаторСлучаевНДС.Графа7_Дата КАК Графа7_Дата,
	             |			ttk_КлассификаторСлучаевНДС.Согласован КАК Согласован,
	             |			ttk_КлассификаторСлучаевНДС.Ошибка КАК Ошибка
	             |		ИЗ
	             |			РегистрСведений.ttk_КлассификаторСлучаевНДС КАК ttk_КлассификаторСлучаевНДС
	             |		ГДЕ
	             |			ttk_КлассификаторСлучаевНДС.ТипРаздела = ЗНАЧЕНИЕ(Перечисление.ttk_ТипыРазделовНДС.Покупки)) КАК ВложенныйЗапрос
	             |		ПО ВТ_Книга.КодВидаОперации = ВложенныйЗапрос.КодВидаОперации
	             |			И ВТ_Книга.КодВидаОперацииСчетФактураДокумент = ВложенныйЗапрос.КодВидаОперацииСчетФактураДокумент
	             |			И ВТ_Книга.ТипДокументаОснования = ВложенныйЗапрос.ТипДокументаОснования
	             |			И ВТ_Книга.ТипСчетаФактуры = ВложенныйЗапрос.ТипСчетаФактуры
	             |			И ВТ_Книга.ВидСчетаФактуры = ВложенныйЗапрос.ВидСчетаФактуры
	             |			И ВТ_Книга.Исправление = ВложенныйЗапрос.Исправление
// +++ввв 22.06.2016 г.
	             //|			И ВТ_Книга.ИспользоватьДокументРасчетовКакСчетФактуру = ВложенныйЗапрос.ИспользоватьДокументРасчетовКакСчетФактуру
// ---ввв 22.06.2016 г.
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	КлассыСлучаев.КодВидаОперации,
	             |	КлассыСлучаев.КодВидаОперацииСчетФактураДокумент,
	             |	КлассыСлучаев.ТипДокументаОснования,
	             |	КлассыСлучаев.ТипСчетаФактуры,
	             |	КлассыСлучаев.ВидСчетаФактуры,
	             |	КлассыСлучаев.Исправление,
// +++ввв 22.06.2016 г.
	             //|	КлассыСлучаев.ИспользоватьДокументРасчетовКакСчетФактуру,
// ---ввв 22.06.2016 г.
	             |	КлассыСлучаев.Графа3_Номер,
	             |	КлассыСлучаев.Графа3_Дата,
	             |	КлассыСлучаев.Графа4_Номер,
	             |	КлассыСлучаев.Графа4_Дата,
	             |	КлассыСлучаев.Графа5_Номер,
	             |	КлассыСлучаев.Графа5_Дата,
	             |	КлассыСлучаев.Графа6_Номер,
	             |	КлассыСлучаев.Графа6_Дата,
	             |	КлассыСлучаев.Графа7_Номер,
	             |	КлассыСлучаев.Графа7_Дата,
	             |	КлассыСлучаев.Согласован,
	             |	КлассыСлучаев.Ошибка,
	             |	КлассыСлучаев.Новый
	             |ИЗ
	             |	ВТ_КлассификаторСлучаев КАК КлассыСлучаев
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	КлассыСлучаев.КодВидаОперации,
	             |	КлассыСлучаев.КодВидаОперацииСчетФактураДокумент,
	             |	КлассыСлучаев.ТипДокументаОснования,
	             |	КлассыСлучаев.ТипСчетаФактуры,
	             |	КлассыСлучаев.ВидСчетаФактуры,
	             |	КлассыСлучаев.Исправление
// +++ввв 22.06.2016 г.
				 //,
	             //|	КлассыСлучаев.ИспользоватьДокументРасчетовКакСчетФактуру
// ---ввв 22.06.2016 г.
				 |";
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"Перечисление.ttk_ТипыРазделовНДС.Покупки","Перечисление.ttk_ТипыРазделовНДС."+ТипУчета);
	КлассификаторСлучаев.Вставить("Классификатор",Запрос.Выполнить().Выгрузить().Скопировать());
	Для каждого йСтр Из КлассификаторСлучаев.Классификатор Цикл
		Если йСтр.Новый Тогда
			КодВО=йСтр.КодВидаОперации;
			КодВОСФД=йСтр.КодВидаОперацииСчетФактураДокумент;
			Попытка
				ТипДО=Документы[Метаданные.НайтиПоТипу(йСтр.ТипДокументаОснования).Имя].ПустаяСсылка();
				ТипСФ=Документы[Метаданные.НайтиПоТипу(йСтр.ТипСчетаФактуры).Имя].ПустаяСсылка();
				НаборЗаписей = РегистрыСведений.ttk_КлассификаторСлучаевНДС.СоздатьНаборЗаписей(); 
				// +++ввв 23.06.2016 г.
				НаборЗаписей.Отбор.ТипРаздела.Установить(?(""+Перечисления.ttk_ТипыРазделовНДС.Покупки=ТипУчета,Перечисления.ttk_ТипыРазделовНДС.Покупки,Перечисления.ttk_ТипыРазделовНДС.Продажи));
				// ---ввв 23.06.2016 г.
				НаборЗаписей.Отбор.КодВидаОперации.Установить(КодВО);
				НаборЗаписей.Отбор.КодВидаОперацииСчетФактураДокумент.Установить(КодВОСФД);
				НаборЗаписей.Отбор.ТипДокументаОснования.Установить(ТипДО);
				НаборЗаписей.Отбор.ТипСчетаФактуры.Установить(ТипСФ);
				НаборЗаписей.Отбор.ВидСчетаФактуры.Установить(йСтр.ВидСчетаФактуры);
				НаборЗаписей.Отбор.Исправление.Установить(йСтр.Исправление);
				// +++ввв 22.06.2016 г.
				//НаборЗаписей.Отбор.ИспользоватьДокументРасчетовКакСчетФактуру.Установить(йСтр.ИспользоватьДокументРасчетовКакСчетФактуру);
				// ---ввв 22.06.2016 г.
				НоваяЗапись = НаборЗаписей.Добавить(); 
				// +++ввв 23.06.2016 г.
				НоваяЗапись.ТипРаздела=?(""+Перечисления.ttk_ТипыРазделовНДС.Покупки=ТипУчета,Перечисления.ttk_ТипыРазделовНДС.Покупки,Перечисления.ttk_ТипыРазделовНДС.Продажи);
				// ---ввв 23.06.2016 г.
				НоваяЗапись.КодВидаОперации=КодВО;
				НоваяЗапись.КодВидаОперацииСчетФактураДокумент=КодВОСФД;
				НоваяЗапись.ТипДокументаОснования=ТипДО;
				НоваяЗапись.ТипСчетаФактуры=ТипСФ;
				НоваяЗапись.ВидСчетаФактуры=йСтр.ВидСчетаФактуры;
				НоваяЗапись.Исправление=йСтр.Исправление;
				// +++ввв 22.06.2016 г.
				//НоваяЗапись.ИспользоватьДокументРасчетовКакСчетФактуру=йСтр.ИспользоватьДокументРасчетовКакСчетФактуру;
				// ---ввв 22.06.2016 г.
				НоваяЗапись.Графа3_Номер=йСтр.Графа3_Номер;
				НоваяЗапись.Графа3_Дата=йСтр.Графа3_Дата;
				НоваяЗапись.Графа4_Номер=йСтр.Графа4_Номер;
				НоваяЗапись.Графа4_Дата=йСтр.Графа4_Дата;
				НоваяЗапись.Графа5_Номер=йСтр.Графа5_Номер;
				НоваяЗапись.Графа5_Дата=йСтр.Графа5_Дата;
				НоваяЗапись.Графа6_Номер=йСтр.Графа6_Номер;
				НоваяЗапись.Графа6_Дата=йСтр.Графа6_Дата;
				НоваяЗапись.Графа7_Номер=йСтр.Графа7_Номер;
				НоваяЗапись.Графа7_Дата=йСтр.Графа7_Дата;
				НоваяЗапись.Согласован=Ложь;
				НоваяЗапись.Ошибка=йСтр.Ошибка;
				НаборЗаписей.Записать();
			//Бобылев А.А. 15.02.2018 77271390	
			Исключение
				Сообщить("Ошибка при обработке элемента классификатора случаев: " + "Тип документа: " + йСтр.ТипДокументаОснования + " Тип СФ: " + йСтр.ТипСчетаФактуры + " Код ВО: " + КодВО + " КодВОСФД: " + КодВОСФД);
			КонецПопытки;
			//Бобылев А.А. 15.02.2018--------------------
		КонецЕсли;
	КонецЦикла;
	Возврат КлассификаторСлучаев;
// Классификатор случаев конец
КонецФункции
// ---ввв 09.06.2016 г.

Функция ПолучитьЗаписиКнигиПокупок(СписокСчетовФактур, СтруктураПараметров) Экспорт
		
	// Создаем запрос по счетам-фактурам
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Запрос.Текст = "выбрать 1 где ложь";
		Возврат Запрос.Выполнить();		
	КонецЕсли;
	
	УстановитьПараметрыЗапросаКнигиПокупок(Запрос, СтруктураПараметров);
			
	Если СтруктураПараметров.ЗаполнятьРаздел8ПоДаннымРегистраСведений Тогда
		НаборЗаписей = РегистрыСведений.ttk_ДанныеНДС.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Организация.Установить(СтруктураПараметров.Организация); 
// +++ввв 23.06.2016 г.
		НаборЗаписей.Отбор.ЖурналУчета.Установить(""+Перечисления.ttk_ТипыРазделовНДС.Покупки); 
// ---ввв 23.06.2016 г.
		НаборЗаписей.Прочитать(); 
		Для Каждого Запись Из НаборЗаписей Цикл 
			ТЗ_ДляРС=Запись.ТаблицаНДС.Получить();
			Прервать;
		КонецЦикла;
	Иначе	

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НДСЗаписиКнигиПокупок.Период КАК Период,
	|	НДСЗаписиКнигиПокупок.Организация КАК Организация,
	|	ВЫБОР
// +++ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация
// ---ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|							И &ВыводитьПокупателейПоАвансам
	|						ТОГДА НДСЗаписиКнигиПокупок.Поставщик
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.Организация
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|				И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|					ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.Поставщик
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.Поставщик
	|	КОНЕЦ КАК Контрагент,
	|	НДСЗаписиКнигиПокупок.Поставщик КАК КонтрагентПоСчетуФактуре,
	|	ВЫБОР
// +++ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.ИНН
// ---ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|							И &ВыводитьПокупателейПоАвансам
	|						ТОГДА НДСЗаписиКнигиПокупок.Поставщик.ИНН
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.Организация.ИНН
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|				И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|					ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.ИНН
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.Поставщик.ИНН
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.ИНН
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.Поставщик.ИНН
	|	КОНЕЦ КАК ПродавецИНН,
	|	ВЫБОР
// +++ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.КПП
// ---ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|							И &ВыводитьПокупателейПоАвансам
	|						ТОГДА НДСЗаписиКнигиПокупок.Поставщик.КПП
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.Организация.КПП
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|				И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|					ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.КПП
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.Поставщик.КПП
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.КПП
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.Поставщик.КПП
	|	КОНЕЦ КАК ПродавецКПП,
	|	ВЫБОР
	|		КОГДА НЕ НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|			ТОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура
	|	КОНЕЦ КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|				КОНЕЦ
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаОплаты
	|	КОНЕЦ КАК ДатаОплаты,
	|	НДСЗаписиКнигиПокупок.ДокументОплаты,
	|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПокупок.СуммаБезНДС, 0) + ЕСТЬNULL(НДСЗаписиКнигиПокупок.НДС, 0)) КАК ВсегоПокупок,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС В (&СтавкиНДС20)
	|					И НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|				ТОГДА НДСЗаписиКнигиПокупок.СуммаБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБезНДС20,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС В (&СтавкиНДС20)
	|				ТОГДА НДСЗаписиКнигиПокупок.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС20,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС В (&СтавкиНДС18)
	|					И НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|				ТОГДА НДСЗаписиКнигиПокупок.СуммаБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБезНДС18,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС В (&СтавкиНДС18)
	|				ТОГДА НДСЗаписиКнигиПокупок.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС18,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС В (&СтавкиНДС10)
	|					И НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|				ТОГДА НДСЗаписиКнигиПокупок.СуммаБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБезНДС10,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС В (&СтавкиНДС10)
	|				ТОГДА НДСЗаписиКнигиПокупок.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС10,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС = &СтавкаНДС0
	|				ТОГДА НДСЗаписиКнигиПокупок.СуммаБезНДС + НДСЗаписиКнигиПокупок.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДС0,
	|	СУММА(ВЫБОР
	|			КОГДА НДСЗаписиКнигиПокупок.СтавкаНДС = &СтавкаБезНДС
	|				ТОГДА НДСЗаписиКнигиПокупок.СуммаБезНДС + НДСЗаписиКнигиПокупок.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаСовсемБезНДС,
	|	ЕСТЬNULL(НДСЗаписиКнигиПокупок.СчетФактура.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК СчетФактураДата,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеСокращенное, 1, 250)
	|					ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеСокращенное, 1, 250)
	|					ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|					И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|						ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|				ИЛИ НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|					И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|							И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеСокращенное, 1, 250)
	|					ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Поставщик.НаименованиеПолное, 1, 250) = """"
	|					ТОГДА НДСЗаписиКнигиПокупок.Поставщик.Наименование
	|				ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Поставщик.НаименованиеПолное, 1, 250)
	|			КОНЕЦ
	|	КОНЕЦ КАК Продавец,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = &ВидыЦенностей_АвансыВыданные
	|			ТОГДА """"
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.ДатаОплаты
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|					ТОГДА ВЫБОР
	|							КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|								ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
	|							КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|								ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураПолученный).ДокументОснование.Дата
	|							ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|						ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаОприходования,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|				И НДСЗаписиКнигиПокупок.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НДСЗаписиКнигиПокупок.ДатаОплаты
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = &ВидыЦенностей_АвансыВыданные
	|					ТОГДА ВЫБОР
	|							КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|							ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|							ТОГДА ВЫБОР
	|									КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|										ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
	|									КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|										ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураПолученный).ДокументОснование.Дата
	|									ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|								ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаПринятияНаУчет,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НаАванс,
	|	ВЫБОР
	|		КОГДА (НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|				ИЛИ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СуммоваяРазница))
	|				И НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
	|				И НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
	|			ТОГДА НДСЗаписиКнигиПокупок.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДС_Аванс,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
	|						И НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
	|					ТОГДА НДСЗаписиКнигиПокупок.ДоговорКонтрагента
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ДоговорАванса,
	|	ВЫБОР
	|		КОГДА НЕ НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|			ТОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_НалоговыйАгент)
	|						И НЕ НДСЗаписиКнигиПокупок.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА НДСЗаписиКнигиПокупок.ДокументОплаты
	|				ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура
	|			КОНЕЦ
	|	КОНЕЦ КАК ДокументОснованиеСчетаФактуры,
	|	ВЫБОР
	|		КОГДА (НДСЗаписиКнигиПокупок.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|				ИЛИ НДСЗаписиКнигиПокупок.Регистратор ССЫЛКА Документ.КорректировкаРеализации)
	|				И ЕСТЬNULL(НДСЗаписиКнигиПокупок.СуммаБезНДС, 0) + ЕСТЬNULL(НДСЗаписиКнигиПокупок.НДС, 0) < 0
	|			ТОГДА ИСТИНА
	|		КОГДА НДСЗаписиКнигиПокупок.Регистратор ССЫЛКА Документ.СчетФактураПолученный
	|				И ЕСТЬNULL(НДСЗаписиКнигиПокупок.СуммаБезНДС, 0) + ЕСТЬNULL(НДСЗаписиКнигиПокупок.НДС, 0) < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Исправление,
	|	НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|	КОНЕЦ КАК ДатаСобытия,
	|	СУММА(НДСЗаписиКнигиПокупок.НДС) КАК НДС,
// +++ввв 12.04.2017 г.
	//|	НДСЗаписиКнигиПокупок.НомерДокументаОплаты,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Номер_ПП_ТаможенногоБрокера <> """"
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Номер_ПП_ТаможенногоБрокера
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее <> ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеИсходящее.ПустаяСсылка)
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее.Номер
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.НомерДокументаОплаты
	|				КОНЕЦ
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.НомерДокументаОплаты
	|	КОНЕЦ КАК НомерДокументаОплаты,
	//|	НДСЗаписиКнигиПокупок.ДатаДокументаОплаты,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Дата_ПП_ТаможенногоБрокера <> ДАТАВРЕМЯ(1,1,1)
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Дата_ПП_ТаможенногоБрокера
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее <> ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеИсходящее.ПустаяСсылка)
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее.Дата
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаДокументаОплаты
	|				КОНЕЦ
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаДокументаОплаты
	|	КОНЕЦ КАК ДатаДокументаОплаты,
// ---ввв 12.04.2017 г.
	|	НДСЗаписиКнигиПокупок.КодВидаОперации
	|ПОМЕСТИТЬ ЗаписиКнигиПокупок
	|ИЗ
//	|	ВТ_ВТ_НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|ГДЕ
	|	НДСЗаписиКнигиПокупок.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НДСЗаписиКнигиПокупок.Организация В(&Организация)
	|	И НЕ НДСЗаписиКнигиПокупок.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПокупок.Активность
	|	И (НДСЗаписиКнигиПокупок.СтавкаНДС <> &СтавкаБезНДС
	|   И (СуммаБезНДС<>0 ИЛИ НДС<>0))
//	|ГДЕ
//	|	НДСЗаписиКнигиПокупок.Период МЕЖДУ &НачалоПериода И &КонецПериода
//	|	И НДСЗаписиКнигиПокупок.Организация В(&Организация)
//	|	И НЕ НДСЗаписиКнигиПокупок.ЗаписьДополнительногоЛиста
//	|	И НДСЗаписиКнигиПокупок.Активность
//// +++ввв 15.02.2016 г. T#7719571 
//// чтобы действительно не попадали пустые строки, типа ндс=0
//	|	И (НДСЗаписиКнигиПокупок.СтавкаНДС <> &СтавкаБезНДС
//	|   И (НДСЗаписиКнигиПокупок.СуммаБезНДС<>0 И НДСЗаписиКнигиПокупок.НДС<>0))
//// ---ввв 15.02.2016 г.
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСЗаписиКнигиПокупок.Период,
	|	НДСЗаписиКнигиПокупок.Организация,
	|	НДСЗаписиКнигиПокупок.ДокументОплаты,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|				КОНЕЦ
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаОплаты
	|	КОНЕЦ,
	|	ЕСТЬNULL(НДСЗаписиКнигиПокупок.СчетФактура.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|				ИЛИ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СуммоваяРазница))
	|				И НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
	|				И НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
	|			ТОГДА НДСЗаписиКнигиПокупок.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
	|						И НЕ НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
	|					ТОГДА НДСЗаписиКнигиПокупок.ДоговорКонтрагента
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ,
	|	НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура,
	|	ВЫБОР
	|		КОГДА НЕ НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|			ТОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|			ТОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_НалоговыйАгент)
	|						И НЕ НДСЗаписиКнигиПокупок.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА НДСЗаписиКнигиПокупок.ДокументОплаты
	|				ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НДСЗаписиКнигиПокупок.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|				ИЛИ НДСЗаписиКнигиПокупок.Регистратор ССЫЛКА Документ.КорректировкаРеализации)
	|				И ЕСТЬNULL(НДСЗаписиКнигиПокупок.СуммаБезНДС, 0) + ЕСТЬNULL(НДСЗаписиКнигиПокупок.НДС, 0) < 0
	|			ТОГДА ИСТИНА
	|		КОГДА НДСЗаписиКнигиПокупок.Регистратор ССЫЛКА Документ.СчетФактураПолученный
	|				И ЕСТЬNULL(НДСЗаписиКнигиПокупок.СуммаБезНДС, 0) + ЕСТЬNULL(НДСЗаписиКнигиПокупок.НДС, 0) < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
// +++ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация
// ---ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|							И &ВыводитьПокупателейПоАвансам
	|						ТОГДА НДСЗаписиКнигиПокупок.Поставщик
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.Организация
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|				И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|					ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.Поставщик
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.Поставщик
	|	КОНЕЦ,
	|	ВЫБОР
// +++ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.ИНН
// ---ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|							И &ВыводитьПокупателейПоАвансам
	|						ТОГДА НДСЗаписиКнигиПокупок.Поставщик.ИНН
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.Организация.ИНН
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|				И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|					ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.ИНН
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.Поставщик.ИНН
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.ИНН
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.Поставщик.ИНН
	|	КОНЕЦ,
	|	ВЫБОР
// +++ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.КПП
// ---ввв 12.04.2017 г.
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|							И &ВыводитьПокупателейПоАвансам
	|						ТОГДА НДСЗаписиКнигиПокупок.Поставщик.КПП
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.Организация.КПП
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|				И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|					ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.КПП
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.Поставщик.КПП
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|				И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА НДСЗаписиКнигиПокупок.Организация.КПП
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.Поставщик.КПП
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеСокращенное, 1, 250)
	|					ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеСокращенное, 1, 250)
	|					ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
	|					И (НЕ НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|						ИЛИ НЕ &ВыводитьПокупателейПоАвансам)
	|				ИЛИ НДСЗаписиКнигиПокупок.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|					И НЕ(НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|							И ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).ПокупателемВыставляетсяСчетФактураНаВозврат)
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеСокращенное, 1, 250)
	|					ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Организация.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПОДСТРОКА(НДСЗаписиКнигиПокупок.Поставщик.НаименованиеПолное, 1, 250) = """"
	|					ТОГДА НДСЗаписиКнигиПокупок.Поставщик.Наименование
	|				ИНАЧЕ ПОДСТРОКА(НДСЗаписиКнигиПокупок.Поставщик.НаименованиеПолное, 1, 250)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(НДСЗаписиКнигиПокупок.СчетФактура.Дата, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|	КОНЕЦ,
	|	НДСЗаписиКнигиПокупок.Поставщик,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|				И НДСЗаписиКнигиПокупок.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НДСЗаписиКнигиПокупок.ДатаОплаты
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = &ВидыЦенностей_АвансыВыданные
	|					ТОГДА ВЫБОР
	|							КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|							ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|							ТОГДА ВЫБОР
	|									КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|										ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
	|									КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|										ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураПолученный).ДокументОснование.Дата
	|									ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|									ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|								ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности = &ВидыЦенностей_АвансыВыданные
	|			ТОГДА """"
	|		КОГДА НДСЗаписиКнигиПокупок.ВидЦенности В (&ВидыЦенностей_АвансыПолученные)
	|			ТОГДА НДСЗаписиКнигиПокупок.ДатаОплаты
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НДСЗаписиКнигиПокупок.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
	|					ТОГДА ВЫБОР
	|							КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|								ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
	|							КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|								ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураПолученный).ДокументОснование.Дата
	|							ИНАЧЕ НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НДСЗаписиКнигиПокупок.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА НДСЗаписиКнигиПокупок.СчетФактура.Дата
	|						ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаСобытия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
// +++ввв 12.04.2017 г.
	//|	НДСЗаписиКнигиПокупок.НомерДокументаОплаты,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Номер_ПП_ТаможенногоБрокера <> """"
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Номер_ПП_ТаможенногоБрокера
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее <> ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеИсходящее.ПустаяСсылка)
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее.Номер
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.НомерДокументаОплаты
	|				КОНЕЦ
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.НомерДокументаОплаты
	|	КОНЕЦ,
	//|	НДСЗаписиКнигиПокупок.ДатаДокументаОплаты,
	|	ВЫБОР
	|		КОГДА НДСЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Дата_ПП_ТаможенногоБрокера <> ДАТАВРЕМЯ(1,1,1)
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_Дата_ПП_ТаможенногоБрокера
	|					КОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее <> ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеИсходящее.ПустаяСсылка)
	|						ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПокупок.СчетФактура КАК Документ.ГТДИмпорт).ttk_ППИсходящее.Дата
	|					ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаДокументаОплаты
	|				КОНЕЦ
	|		ИНАЧЕ НДСЗаписиКнигиПокупок.ДатаДокументаОплаты
	|	КОНЕЦ,
// ---ввв 12.04.2017 г.
	|	НДСЗаписиКнигиПокупок.КодВидаОперации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура";
	
	Запрос.Выполнить();
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗаписиКнигиПокупок.СчетФактура КАК СчетФактура
	//|ИЗ
	//|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок";
	//СписокСчетовФактур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетФактура");
	
	ПолучитьСчетаФактурыДокументыКнигаПокупок(Запрос);
// +++ввв 25.05.2016 г.	
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
// +++ввв 09.06.2016 г.
	|	ВТ_ДО.НаАванс КАК На_Аванс,
// ---ввв 09.06.2016 г.
	|	ВТ_ДО.СчетФактура КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДОРавноСФ
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ВТ_ДО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетаФактурыДокументы КАК СчетаФактуры
	|	ПО ВТ_ДО.СчетФактура = СчетаФактуры.СчетФактура
// +++ввв 26.05.2016 г.
	|	 И ВТ_ДО.ДоговорАванса = СчетаФактуры.ДоговорАванса
	|	 И ВТ_ДО.СтавкаНДС_Аванс = СчетаФактуры.СтавкаНДСАванса
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ NULL И
	|	НЕ ВТ_ДО.СчетФактура ССЫЛКА Документ.СчетФактураВыданный И
	|	НЕ ВТ_ДО.СчетФактура ССЫЛКА Документ.СчетФактураПолученный И
//	|	НЕ ВТ_ДО.СчетФактура ССЫЛКА Документ.ДокументРасчетовСКонтрагентом И
	|	ВЫБОР
	|		КОГДА &ОтбиратьПоКонтрагенту = ИСТИНА ТОГДА
	|			ВЫБОР
	|				КОГДА НЕ СчетаФактуры.ПродавецДляПечати ЕСТЬ NULL И СчетаФактуры.ПродавецДляПечати.ОбособленноеПодразделение
	|					ТОГДА СчетаФактуры.ПродавецДляПечати.ГоловнойКонтрагент = &КонтрагентДляОтбора
	|				КОГДА НЕ СчетаФактуры.ПродавецДляПечати ЕСТЬ NULL 
	|					ТОГДА СчетаФактуры.ПродавецДляПечати = &КонтрагентДляОтбора
	|				КОГДА ВЫРАЗИТЬ(ВТ_ДО.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
	|					ТОГДА ВЫРАЗИТЬ(ВТ_ДО.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент = &КонтрагентДляОтбора
	|				ИНАЧЕ ВТ_ДО.Контрагент = &КонтрагентДляОтбора
	|			КОНЕЦ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
// ---ввв 26.05.2016 г.
	|;
	|///////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	СчетаФактуры.ДокументОснование КАК ДокументОснование,
	|	СчетаФактуры.Ссылка КАК СчетФактура
// +++ввв 28.06.2016 г.
	//|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ
	|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ_ВСФ
// ---ввв 28.06.2016 г.
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	(СчетаФактуры.ДокументОснование, (ВЫБОР
	|			КОГДА СчетаФактуры.Ссылка.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)) В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование,
	|				ДО.На_Аванс
	|			ИЗ
	|				ВТ_ДОРавноСФ КАК ДО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаФактуры.ДокументОснование,
	|	СчетаФактуры.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	(СчетаФактуры.ДокументОснование, (ВЫБОР
	|			КОГДА СчетаФактуры.Ссылка.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)) В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование,
	|				ДО.На_Аванс
	|			ИЗ
	|				ВТ_ДОРавноСФ КАК ДО)
// +++ввв 28.06.2016 г.
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДО.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДОРавноСФ_Доп
	|ИЗ
	|	ВТ_ДОРавноСФ КАК ВТ_ДО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ_ВСФ КАК СчетаФактуры
	|	ПО (ВТ_ДО.ДокументОснование = СчетаФактуры.ДокументОснование)
	|ГДЕ
	|	СчетаФактуры.ДокументОснование ЕСТЬ NULL
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	СчетаФактуры.ДокументОснование КАК ДокументОснование,
	|	СчетаФактуры.Ссылка КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ_Доп
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	СчетаФактуры.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование
	|			ИЗ
	|				ВТ_ДОРавноСФ_Доп КАК ДО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаФактуры.ДокументОснование,
	|	СчетаФактуры.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	СчетаФактуры.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование
	|			ИЗ
	|				ВТ_ДОРавноСФ_Доп КАК ДО)
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ВТ_ДО.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(СчетаФактуры.СчетФактура, СчетаФактуры0.СчетФактура) КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ
	|ИЗ
	|	ВТ_ДОРавноСФ КАК ВТ_ДО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ_ВСФ КАК СчетаФактуры
	|	ПО (ВТ_ДО.ДокументОснование = СчетаФактуры.ДокументОснование)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ_Доп КАК СчетаФактуры0
	|	ПО (ВТ_ДО.ДокументОснование = СчетаФактуры0.ДокументОснование)
	|ГДЕ
	|	НЕ ЕСТЬNULL(СчетаФактуры.СчетФактура, СчетаФактуры0.СчетФактура) ЕСТЬ NULL
// ---ввв 28.06.2016 г.
	|";
// ---ввв 09.06.2016 г.
	Если НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме 
		 И СтруктураПараметров.ОтбиратьПоКонтрагенту 
		 И СтруктураПараметров.КонтрагентДляОтбора.ЭтоГруппа Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " = &КонтрагентДляОтбора", " В ИЕРАРХИИ(&КонтрагентДляОтбора)");
	КонецЕсли;
	Запрос.Выполнить();
// ---ввв 25.05.2016 г.

//Бобылев А.А. 14.09.2018	SC3513
УстановитьПривилегированныйРежим(Истина);
//Бобылев А.А. --------------------------
	Запрос.Текст = 
	"ВЫБРАТЬ
// +++ввв 21.07.2016 г.
// {{KM WARE Семенов И.С. Заявка № 18.07.2015 начало
// оптимизация
//	|	ЗаписиКнигиПокупок.СчетФактура.абс_ДатаСФ КАК kmw_СчетФактура_абс_ДатаСФ,
//	|	ЗаписиКнигиПокупок.СчетФактура.Дата КАК kmw_СчетФактура_Дата,
	//|	ЗаписиКнигиПокупок.СчетФактура.Организация,
//	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.абс_ДатаСФ, ЗаписиКнигиПокупок.СчетФактура.абс_ДатаСФ) КАК kmw_СчетФактураДокумент_абс_ДатаСФ,
//	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.Дата, ЗаписиКнигиПокупок.СчетФактура.Дата) КАК kmw_СчетФактураДокумент_Дата,
//	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.Номер, ЗаписиКнигиПокупок.СчетФактура.Номер) КАК kmw_СчетФактураДокумент_Номер,
//	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.КодВидаОперации, ЗаписиКнигиПокупок.СчетФактура.КодВидаОперации) КАК kmw_СчетФактураДокумент_КодВидаОперации,
	//|	выбор 
	//|когда ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) ссылка документ.СчетФактураПолученный
	//|	тогда подстрока(выразить(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) как документ.СчетФактураПолученный).ДокументОснование.Номер,1,30)
	//|иначе null конец как kmw_СчетФактураДокумент_Полученный_ДокументОснование_Номер,
	//|	выбор 
	//|когда ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) ссылка документ.СчетФактураПолученный
	//|	тогда выразить(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) как документ.СчетФактураПолученный).ДокументОснование.Дата
	//|иначе null конец как kmw_СчетФактураДокумент_Полученный_ДокументОснование_Дата,
//	|	ЗаписиКнигиПокупок.СчетФактура.Дата КАК kmwСчетФактураДата,
//	|	ЗаписиКнигиПокупок.СчетФактура.Номер КАК kmwСчетФактураНомер,
	//|	ВЫБОР
	//|			КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) ССЫЛКА Документ.СчетФактураВыданный
	//|				ТОГДА выразить(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) как документ.СчетФактураВыданный).НомерПлатежноРасчетногоДокумента
	//|			ИНАЧЕ null
	//|		КОНЕЦ КАК kmw_СчетФактураДокумент_Выданный_НомерПлатежноРасчетногоДокумента,
	//|	ВЫБОР
	//|			КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) ССЫЛКА Документ.СчетФактураВыданный
	//|				ТОГДА выразить(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) как документ.СчетФактураВыданный).ДатаПлатежноРасчетногоДокумента
	//|			ИНАЧЕ null
	//|		КОНЕЦ КАК kmw_СчетФактураДокумент_Выданный_ДатаПлатежноРасчетногоДокумента,
	//|	ВЫБОР
	//|			КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	//|				ТОГДА ЗаписиКнигиПокупок.СчетФактура.ДатаВходящегоДокумента
	//|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	//|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДатаВходящегоДокумента
	//|			ИНАЧЕ null
	//|		КОНЕЦ КАК kmwСчетФактураДокументДатаВходящегоДокумента,
	//|	ВЫБОР
	//|			КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	//|				ТОГДА ЗаписиКнигиПокупок.СчетФактура.НомерВходящегоДокумента
	//|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	//|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.НомерВходящегоДокумента
	//|			ИНАЧЕ null
	//|		КОНЕЦ КАК kmwСчетФактураДокументНомерВходящегоДокумента,
	//|	ВЫБОР
	//|			КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	//|				ТОГДА ЗаписиКнигиПокупок.СчетФактура.ДатаПлатежноРасчетногоДокумента
	//|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	//|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДатаПлатежноРасчетногоДокумента
	//|			ИНАЧЕ null
	//|		КОНЕЦ КАК kmwСчетФактураДокументДатаПлатежноРасчетногоДокумента,
	//|	ВЫБОР
	//|			КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	//|				ТОГДА ЗаписиКнигиПокупок.СчетФактура.НомерПлатежноРасчетногоДокумента
	//|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	//|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.НомерПлатежноРасчетногоДокумента
	//|			ИНАЧЕ null
	//|		КОНЕЦ КАК kmwСчетФактураДокументНомерПлатежноРасчетногоДокумента,
// }}KM WARE Семенов И.С. Заявка № 18.07.2015 окончание	
// ---ввв 21.07.2016 г.
	|	НАЧАЛОПЕРИОДА(ЗаписиКнигиПокупок.Период, КВАРТАЛ) КАК НалоговыйПериод,
	|	ЗаписиКнигиПокупок.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.Контрагент ССЫЛКА Справочник.Организации
	|				И ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Организации).НаименованиеПолное, 1, 250) = """"
	|			ТОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Организации).НаименованиеСокращенное, 1, 250)
	|		КОГДА ЗаписиКнигиПокупок.Контрагент ССЫЛКА Справочник.Организации
	|			ТОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Организации).НаименованиеПолное, 1, 250)
	|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
	|				И ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ОбособленноеПодразделение
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент.Наименование
	|					ИНАЧЕ ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.Наименование
	|					ИНАЧЕ ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент.Наименование
	|					ИНАЧЕ ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент.НаименованиеПолное, 1, 250)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).НаименованиеПолное, 1, 250) = """"
	|					ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).Наименование
	|				ИНАЧЕ ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).НаименованиеПолное, 1, 250)
	|			КОНЕЦ
	|	КОНЕЦ КАК Продавец,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.Контрагент ССЫЛКА Справочник.Организации
	|			ТОГДА ЗаписиКнигиПокупок.Контрагент
	|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
	|				И ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ОбособленноеПодразделение
	|			ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент
	|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
	|			ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати
	|		КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
	|			ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент
	|		ИНАЧЕ ЗаписиКнигиПокупок.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.Контрагент ССЫЛКА Справочник.Организации
	|			ТОГДА ЗаписиКнигиПокупок.ПродавецИНН
	|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ИННПродавцаДляПечати ЕСТЬ NULL 
	|			ТОГДА ТаблицаСчетаФактурыДокументы.ИННПродавцаДляПечати
	|		ИНАЧЕ ЗаписиКнигиПокупок.ПродавецИНН
	|	КОНЕЦ КАК ПродавецИНН,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.Контрагент ССЫЛКА Справочник.Организации
	|			ТОГДА ЗаписиКнигиПокупок.ПродавецКПП
	|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.КПППродавцаДляПечати ЕСТЬ NULL 
	|			ТОГДА ТаблицаСчетаФактурыДокументы.КПППродавцаДляПечати
	|		ИНАЧЕ ЗаписиКнигиПокупок.ПродавецКПП
	|	КОНЕЦ КАК ПродавецКПП,
// +++ввв 17.05.2016 г.
	//|	ЗаписиКнигиПокупок.СчетФактура КАК СчетФактура,
	|	ВЫБОР
// +++ввв 23.05.2016 г.
	//|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации=""23"" И ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
	|		КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
// ---ввв 23.05.2016 г.
	|			ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование
// +++ввв 23.05.2016 г.
	//|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации=""23"" И ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|		КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный ТОГДА
// ---ввв 23.05.2016 г.
	|			ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураПолученный).ДокументОснование
	|		ИНАЧЕ ЗаписиКнигиПокупок.СчетФактура
	|	КОНЕЦ КАК СчетФактура,
// ---ввв 17.05.2016 г.
	|	ЗаписиКнигиПокупок.ДатаОплаты КАК ДатаОплаты,
	|	ЗаписиКнигиПокупок.СчетФактура.Дата КАК СчетФактураДата,
	|	ЗаписиКнигиПокупок.ДатаОприходования КАК ДатаОприходования,
	|	ЗаписиКнигиПокупок.ДатаПринятияНаУчет КАК ДатаПринятияНаУчет,
	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК СчетФактураДокумент,
// +++ввв 22.04.2016 г.
// +++ввв 17.05.2016 г.
	//|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ЗаписиКнигиПокупок.СчетФактура.Номер) КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации=""23"" И ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).НомерВходящегоДокумента
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
// +++ввв 23.05.2016 г.
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.ДокументРасчетовСКонтрагентом).ttk_Номер
// ---ввв 23.05.2016 г.
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.Номер,ЗаписиКнигиПокупок.СчетФактура.Номер))
	|	КОНЕЦ КАК НомерСчетаФактуры,
	//|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры, ЗаписиКнигиПокупок.СчетФактура.Дата) КАК ДатаСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации=""23"" И ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).ДатаВходящегоДокумента
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
// +++ввв 23.05.2016 г.
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.ДокументРасчетовСКонтрагентом).ttk_Дата
// ---ввв 23.05.2016 г.
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.Дата, ЗаписиКнигиПокупок.СчетФактура.Дата))
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	ЗаписиКнигиПокупок.НаАванс КАК НаАванс,
	|	ЗаписиКнигиПокупок.СтавкаНДС_Аванс КАК СтавкаНДС_Аванс,
	|	ЗаписиКнигиПокупок.ДоговорАванса КАК ДоговорАванса,
// +++ввв 11.07.2016 г.
	//|	ВЫБОР
	//|		КОГДА &ПравилаПостановления735
	//|			ТОГДА ВЫБОР
	//|					КОГДА ЗаписиКнигиПокупок.ВсегоПокупок < 0
	//|						ТОГДА -ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПокупокВВалюте, -ЗаписиКнигиПокупок.ВсегоПокупок)
	//|					ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПокупокВВалюте, ЗаписиКнигиПокупок.ВсегоПокупок)
	//|				КОНЕЦ
	//|		ИНАЧЕ ЗаписиКнигиПокупок.ВсегоПокупок
	//|	КОНЕЦ КАК ВсегоПокупок,
// +++ввв 10.08.2016 г.
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.ВсегоПокупок < 0
	|			ТОГДА -ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПокупокВВалюте, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.СуммаДокумента,-ЗаписиКнигиПокупок.ВсегоПокупок))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПокупокВВалюте, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.СуммаДокумента, ЗаписиКнигиПокупок.ВсегоПокупок))
	|	КОНЕЦ КАК ВсегоПокупокВСчетеФактуре,
// ---ввв 10.08.2016 г.
	|	ЗаписиКнигиПокупок.ВсегоПокупок КАК ВсегоПокупок,
// ---ввв 11.07.2016 г.
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.НаАванс
	|			ТОГДА 0
	|		ИНАЧЕ ЗаписиКнигиПокупок.СуммаБезНДС20
	|	КОНЕЦ КАК СуммаБезНДС20,
	|	ЗаписиКнигиПокупок.НДС20 КАК НДС20,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.НаАванс
	|			ТОГДА 0
	|		ИНАЧЕ ЗаписиКнигиПокупок.СуммаБезНДС18
	|	КОНЕЦ КАК СуммаБезНДС18,
	|	ЗаписиКнигиПокупок.НДС18 КАК НДС18,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.НаАванс
	|			ТОГДА 0
	|		ИНАЧЕ ЗаписиКнигиПокупок.СуммаБезНДС10
	|	КОНЕЦ КАК СуммаБезНДС10,
	|	ЗаписиКнигиПокупок.НДС10 КАК НДС10,
	|	ЗаписиКнигиПокупок.НДС0 КАК НДС0,
	|	ЗаписиКнигиПокупок.СуммаСовсемБезНДС КАК СуммаСовсемБезНДС,
	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокументРасшифровка, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК СчетФактураДокументРасшифровка,
	|	ЗаписиКнигиПокупок.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	ТаблицаСчетаФактурыДокументы.ДатаИсправления КАК ДатаИсправления,
	|	ТаблицаСчетаФактурыДокументы.НомерИсправления КАК НомерИсправления,
	|	ТаблицаСчетаФактурыДокументы.ДатаКорректировки КАК ДатаКорректировки,
	|	ТаблицаСчетаФактурыДокументы.НомерКорректировки КАК НомерКорректировки,
	|	ТаблицаСчетаФактурыДокументы.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ТаблицаСчетаФактурыДокументы.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ЗаписиКнигиПокупок.Исправление КАК Исправление,
	|	ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры КАК ДокументОснованиеСчетаФактуры,
	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ОбрабатыватьНомерДокумента, ЛОЖЬ) КАК ОбрабатыватьНомерДокумента,
	|	ЗаписиКнигиПокупок.ДатаСобытия КАК ДатаСобытия,
	|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СводныйКорректировочный, ЛОЖЬ) КАК СводныйКорректировочный,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации <> """"
	|			ТОГДА ЗаписиКнигиПокупок.КодВидаОперации
// +++ввв 14.06.2016 г.
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураВыданный).КодВидаОперации
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).КодВидаОперации
// ---ввв 14.06.2016 г.
	|		ИНАЧЕ ВЫБОР КОГДА ЗаписиКнигиПокупок.НаАванс ТОГДА ""02"" ИНАЧЕ ""01"" КОНЕЦ 
	|	КОНЕЦ КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.Валюта, &ВалютаРегУчета) <> &ВалютаРегУчета
	|			ТОГДА ТаблицаСчетаФактурыДокументы.ВалютаНаименованиеПолное
// +++ввв 05.10.2016 г.
	|		КОГДА ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.ВалютаДокумента, &ВалютаРегУчета) <> &ВалютаРегУчета
	|			ТОГДА СчетаФактурыДоп.СчетФактура.ВалютаДокумента.Наименование
// ---ввв 05.10.2016 г.
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.Валюта, &ВалютаРегУчета) <> &ВалютаРегУчета
	|			ТОГДА ТаблицаСчетаФактурыДокументы.ВалютаКод
// +++ввв 05.10.2016 г.
	|		КОГДА ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.ВалютаДокумента, &ВалютаРегУчета) <> &ВалютаРегУчета
	|			ТОГДА СчетаФактурыДоп.СчетФактура.ВалютаДокумента.Код
// ---ввв 05.10.2016 г.
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаКод,
	|	ЗаписиКнигиПокупок.НДС КАК НДС,
// {{KM WARE Семенов И.С. 16.07.2015 Заявка №  начало
// код 23 берем дату и номер оплаты из "формирования книги покупок"
	|	выбор
	|		когда (ЗаписиКнигиПокупок.КодВидаОперации=""23"") и ЗаписиКнигиПокупок.НомерДокументаОплаты=""""
	|			тогда ЗаписиКнигиПокупок.ДокументОплаты.Номер
	|		иначе ЗаписиКнигиПокупок.НомерДокументаОплаты 
	|	конец КАК НомерДокументаОплаты,
	|	выбор
	|		когда (ЗаписиКнигиПокупок.КодВидаОперации=""23"") и ЗаписиКнигиПокупок.НомерДокументаОплаты=""""
	|			тогда ЗаписиКнигиПокупок.ДокументОплаты.Дата
	|		иначе ЗаписиКнигиПокупок.ДатаДокументаОплаты 
	|	конец КАК ДатаДокументаОплаты,
	|	ТаблицаСчетаФактурыДокументы.Посредник,
	|	ТаблицаСчетаФактурыДокументы.ПосредникИНН,
	|	ТаблицаСчетаФактурыДокументы.ПосредникКПП,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураВыданный).ВидСчетаФактуры
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).ВидСчетаФактуры
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ФлагВидСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураВыданный).Исправление
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).Исправление
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФлагИсправление,
// +++ввв 06.06.2016 г.
// +++ввв 22.06.2016 г.
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
	//|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.ОтражениеПоступленияТоваровИУслугНДС).ИспользоватьДокументРасчетовКакСчетФактуру
	//|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
	//|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.ОтражениеРеализацииТоваровИУслугНДС).ИспользоватьДокументРасчетовКакСчетФактуру
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ФлагИспользоватьДокументРасчетовКакСчетФактуру,
// ---ввв 22.06.2016 г.
// ---ввв 06.05.2016 г.
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураВыданный).КодВидаОперации
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).КодВидаОперации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперацииСчетФактураДокумент,
//// +++ввв 18.10.2016 г.
//	|	ВЫБОР
//	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации <> """"
//	|			ТОГДА ЗаписиКнигиПокупок.КодВидаОперации
//// +++ввв 14.06.2016 г.
//	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
//	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураВыданный).КодВидаОперации
//	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
//	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).КодВидаОперации
//// ---ввв 14.06.2016 г.
//	|		ИНАЧЕ ВЫБОР КОГДА ЗаписиКнигиПокупок.НаАванс ТОГДА ""02"" ИНАЧЕ ""01"" КОНЕЦ 
//	|	КОНЕЦ КАК КодВидаОперацииКласс,
// +++ввв 21.10.2016 г.
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный И
	|			  (ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации <> """"
	|			ТОГДА ЗаписиКнигиПокупок.КодВидаОперации
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураВыданный).КодВидаОперации
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).КодВидаОперации
	|		ИНАЧЕ ВЫБОР КОГДА ЗаписиКнигиПокупок.НаАванс ТОГДА ""02"" ИНАЧЕ ""01"" КОНЕЦ 
	|	КОНЕЦ)=""01"" И
	|			  ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ""04""
	|		ИНАЧЕ (ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперации <> """"
	|			ТОГДА ЗаписиКнигиПокупок.КодВидаОперации
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураВыданный).КодВидаОперации
	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПокупок.СчетФактура)) КАК Документ.СчетФактураПолученный).КодВидаОперации
	|		ИНАЧЕ ВЫБОР КОГДА ЗаписиКнигиПокупок.НаАванс ТОГДА ""02"" ИНАЧЕ ""01"" КОНЕЦ 
	|	КОНЕЦ)
	|	КОНЕЦ КАК КодВидаОперацииКласс
// ---ввв 21.10.2016 г.
	|ПОМЕСТИТЬ ВТ_ЗаписиКниги
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетаФактурыДокументы КАК ТаблицаСчетаФактурыДокументы
	|		ПО ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры = ТаблицаСчетаФактурыДокументы.СчетФактура
	|			И ЗаписиКнигиПокупок.ДоговорАванса = ТаблицаСчетаФактурыДокументы.ДоговорАванса
	|			И ЗаписиКнигиПокупок.СтавкаНДС_Аванс = ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса
// +++ввв 25.05.2016 г.
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ КАК СчетаФактурыДоп
	|		ПО ЗаписиКнигиПокупок.СчетФактура = СчетаФактурыДоп.ДокументОснование
// ---ввв 25.05.2016 г.
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтбиратьПоКонтрагенту = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
	|								И ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ОбособленноеПодразделение
	|							ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент = &КонтрагентДляОтбора
	|						КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
	|							ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати = &КонтрагентДляОтбора
	|						КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
	|							ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент = &КонтрагентДляОтбора
	|						ИНАЧЕ ЗаписиКнигиПокупок.Контрагент = &КонтрагентДляОтбора
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаПринятияНаУчет,
	|	ДатаОплаты";

	
	Если НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме 
		 И СтруктураПараметров.ОтбиратьПоКонтрагенту 
		 И СтруктураПараметров.КонтрагентДляОтбора.ЭтоГруппа Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " = &КонтрагентДляОтбора", " В ИЕРАРХИИ(&КонтрагентДляОтбора)");
	КонецЕсли;
				
	Запрос.Выполнить();

// +++ввв 27.05.2016 г.
// +++ввв 23.06.2016 г.
	КлассификаторСлучаев=ПолучитьКлассификаторСлучаев(Запрос,""+Перечисления.ttk_ТипыРазделовНДС.Покупки);
// ---ввв 23.06.2016 г.
	Для йЭтап=СтруктураПараметров.ЗаполнятьРаздел89СУровнемПроверки По 3 Цикл
		Запрос.Текст = 
	"ВЫБРАТЬ
// +++ввв 21.07.2016 г.
// +++Подлежат удалению
	//|	ЗаписиКнигиПокупок.kmw_СчетФактура_абс_ДатаСФ,
	//|	ЗаписиКнигиПокупок.kmw_СчетФактура_Дата,
	//|	ЗаписиКнигиПокупок.СчетФактураОрганизация,
//	|	ЗаписиКнигиПокупок.kmw_СчетФактураДокумент_абс_ДатаСФ,
//	|	ЗаписиКнигиПокупок.kmw_СчетФактураДокумент_Полученный_ДокументОснование_Номер,
//	|	ЗаписиКнигиПокупок.kmw_СчетФактураДокумент_Полученный_ДокументОснование_Дата,
//	|	ЗаписиКнигиПокупок.kmwСчетФактураДата,
//	|	ЗаписиКнигиПокупок.kmwСчетФактураНомер,
//	|	ЗаписиКнигиПокупок.kmw_СчетФактураДокумент_Выданный_НомерПлатежноРасчетногоДокумента,
//	|	ЗаписиКнигиПокупок.kmw_СчетФактураДокумент_Выданный_ДатаПлатежноРасчетногоДокумента,
//	|	ЗаписиКнигиПокупок.kmwСчетФактураДокументДатаВходящегоДокумента,
//	|	ЗаписиКнигиПокупок.kmwСчетФактураДокументНомерВходящегоДокумента,
//	|	ЗаписиКнигиПокупок.kmwСчетФактураДокументДатаПлатежноРасчетногоДокумента,
//	|	ЗаписиКнигиПокупок.kmwСчетФактураДокументНомерПлатежноРасчетногоДокумента,
// ---Подлежат удалению
// ---ввв 21.07.2016 г.
	|	ЗаписиКнигиПокупок.НалоговыйПериод,
	|	ЗаписиКнигиПокупок.Организация КАК Организация,
	|	ЗаписиКнигиПокупок.ДатаОплаты КАК ДатаОплаты,
	|	ЗаписиКнигиПокупок.СчетФактураДата КАК СчетФактураДата,
	|	ЗаписиКнигиПокупок.ДатаОприходования КАК ДатаОприходования,
	|	ЗаписиКнигиПокупок.ДатаПринятияНаУчет КАК ДатаПринятияНаУчет,
	|	ЗаписиКнигиПокупок.НаАванс КАК НаАванс,
	|	ЗаписиКнигиПокупок.СтавкаНДС_Аванс КАК СтавкаНДС_Аванс,
	|	ЗаписиКнигиПокупок.ДоговорАванса КАК ДоговорАванса,
// +++ввв 10.08.2016 г.
	|	ЗаписиКнигиПокупок.ВсегоПокупокВСчетеФактуре,
// ---ввв 10.08.2016 г.
	|	ЗаписиКнигиПокупок.ВсегоПокупок,
	|	ЗаписиКнигиПокупок.СуммаБезНДС20,
	|	ЗаписиКнигиПокупок.НДС20 КАК НДС20,
	|	ЗаписиКнигиПокупок.СуммаБезНДС18,
	|	ЗаписиКнигиПокупок.НДС18 КАК НДС18,
	|	ЗаписиКнигиПокупок.СуммаБезНДС10,
	|	ЗаписиКнигиПокупок.НДС10 КАК НДС10,
	|	ЗаписиКнигиПокупок.НДС0 КАК НДС0,
	|	ЗаписиКнигиПокупок.СуммаСовсемБезНДС КАК СуммаСовсемБезНДС,
	|	ЗаписиКнигиПокупок.СчетФактураДокументРасшифровка,
	|	ЗаписиКнигиПокупок.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	ЗаписиКнигиПокупок.КодВидаОперации,
// +++ввв над этим работает классификатор начало
	|	ЗаписиКнигиПокупок.КодВидаОперацииКласс,
	|	ЗаписиКнигиПокупок.КодВидаОперацииСчетФактураДокумент,
	|	ЗаписиКнигиПокупок.СчетФактура,
	|	ЗаписиКнигиПокупок.СчетФактураДокумент,
	|	ЗаписиКнигиПокупок.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ЗаписиКнигиПокупок.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЗаписиКнигиПокупок.НомерИсправления КАК НомерИсправления,
	|	ЗаписиКнигиПокупок.ДатаИсправления КАК ДатаИсправления,
	|	ЗаписиКнигиПокупок.НомерКорректировки КАК НомерКорректировки,
	|	ЗаписиКнигиПокупок.ДатаКорректировки КАК ДатаКорректировки,
	|	ЗаписиКнигиПокупок.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ЗаписиКнигиПокупок.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ЗаписиКнигиПокупок.НомерДокументаОплаты КАК НомерДокументаОплаты,
	|	ЗаписиКнигиПокупок.ДатаДокументаОплаты КАК ДатаДокументаОплаты,
// ---ввв над этим работает классификатор конец
	|	ЗаписиКнигиПокупок.Исправление КАК Исправление,
	|	ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры КАК ДокументОснованиеСчетаФактуры,
	|	ЗаписиКнигиПокупок.ОбрабатыватьНомерДокумента,
	|	ЗаписиКнигиПокупок.ДатаСобытия КАК ДатаСобытия,
	|	ЗаписиКнигиПокупок.СводныйКорректировочный,
	|	ЗаписиКнигиПокупок.Валюта,
	|	ЗаписиКнигиПокупок.ВалютаКод,
	|	ЗаписиКнигиПокупок.НДС КАК НДС,
// +++ввв 14.06.2016 г.
	//|	ЗаписиКнигиПокупок.Посредник,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперацииКласс=""04"" И
	|			  ЗаписиКнигиПокупок.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактураДокумент КАК Документ.СчетФактураПолученный).Контрагент.НаименованиеПолное,1,250)
	|		ИНАЧЕ ЗаписиКнигиПокупок.Посредник
	|	КОНЕЦ КАК Посредник,
	//|	ЗаписиКнигиПокупок.ПосредникИНН,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперацииКласс=""04"" И
	|			  ЗаписиКнигиПокупок.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактураДокумент КАК Документ.СчетФактураПолученный).Контрагент.ИНН
	|		ИНАЧЕ ЗаписиКнигиПокупок.ПосредникИНН
	|	КОНЕЦ КАК ПосредникИНН,
	//|	ЗаписиКнигиПокупок.ПосредникКПП,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперацииКласс=""04"" И
	|			  ЗаписиКнигиПокупок.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактураДокумент КАК Документ.СчетФактураПолученный).Контрагент.КПП
	|		ИНАЧЕ ЗаписиКнигиПокупок.ПосредникКПП
	|	КОНЕЦ КАК ПосредникКПП,
	//|	ЗаписиКнигиПокупок.Продавец,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперацииКласс=""04"" И
	|			  ЗаписиКнигиПокупок.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактураДокумент КАК Документ.СчетФактураПолученный).абс_Продавец.НаименованиеПолное,1,250)
	|		ИНАЧЕ ЗаписиКнигиПокупок.Продавец
	|	КОНЕЦ КАК Продавец,
	//|	ЗаписиКнигиПокупок.ПродавецИНН,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперацииКласс=""04"" И
	|			  ЗаписиКнигиПокупок.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактураДокумент КАК Документ.СчетФактураПолученный).абс_Продавец.ИНН
	|		ИНАЧЕ ЗаписиКнигиПокупок.ПродавецИНН
	|	КОНЕЦ КАК ПродавецИНН,
	//|	ЗаписиКнигиПокупок.ПродавецКПП,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.КодВидаОперацииКласс=""04"" И
	|			  ЗаписиКнигиПокупок.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактураДокумент КАК Документ.СчетФактураПолученный).абс_Продавец.КПП
	|		ИНАЧЕ ЗаписиКнигиПокупок.ПродавецКПП
	|	КОНЕЦ КАК ПродавецКПП,
// ---ввв 14.06.2016 г.
	|	ЗаписиКнигиПокупок.Контрагент,
	|	&ФлагОшибка КАК ОшибкаУчета
	|ИЗ
	|	ВТ_ЗаписиКниги КАК ЗаписиКнигиПокупок
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлассификаторСлучаев КАК ВТ_КС
	|	ПО ВТ_КС.КодВидаОперации = ЗаписиКнигиПокупок.КодВидаОперации И
	|	   ВТ_КС.КодВидаОперацииСчетФактураДокумент = ЗаписиКнигиПокупок.КодВидаОперацииСчетФактураДокумент И
	|	   ВТ_КС.ТипДокументаОснования = ТИПЗНАЧЕНИЯ(ЗаписиКнигиПокупок.СчетФактура) И
	|	   ВТ_КС.ТипСчетаФактуры = ТИПЗНАЧЕНИЯ(ЗаписиКнигиПокупок.СчетФактураДокумент) И
	|	   ВТ_КС.ВидСчетаФактуры = ЗаписиКнигиПокупок.ФлагВидСчетаФактуры И
	|	   ВТ_КС.Исправление = ЗаписиКнигиПокупок.ФлагИсправление";
// +++ввв 31.05.2016 г.
// +++ввв 23.06.2016 г.
		ПрименитьКлассификаторСлучаев(КлассификаторСлучаев, Запрос,""+Перечисления.ttk_ТипыРазделовНДС.Покупки);
// ---ввв 23.06.2016 г.
// +++ввв 01.06.2016 г.
		Если йЭтап=1 Тогда
		// поиск ошибок Классификации
			Запрос.УстановитьПараметр("ФлагОшибка","Ошибка учёта");
	    	Запрос.Текст=Запрос.Текст+"
	|ГДЕ
	|	ВТ_КС.Ошибка <= ЗаписиКнигиПокупок.ДатаСчетаФактуры";
		ИначеЕсли йЭтап=2 Тогда
	    // поиск несогласованных случаев
			Запрос.УстановитьПараметр("ФлагОшибка","Не согласовано");
	    	Запрос.Текст=Запрос.Текст+"
	|ГДЕ
	|	НЕ ВТ_КС.Согласован";
		Иначе
			Запрос.УстановитьПараметр("ФлагОшибка","");
		КонецЕсли;
// ---ввв 31.05.2016 г.                                                                        
		ТЗ_ДляРС=Запрос.Выполнить().Выгрузить();
		Если ТЗ_ДляРС.Количество()>0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
// ---ввв 01.06.2016 г.
// Классификатор конец
// ---ввв 27.05.2016 г.

		// Запись в регистр сведений *** ++++++++++++++
		//Сначала формируем запрос без итогов для выгрузки в регистр сведений
		
		НаборЗаписей = РегистрыСведений.ttk_ДанныеНДС.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Организация.Установить(СтруктураПараметров.Организация);
// +++ввв 23.06.2016 г.
		НаборЗаписей.Отбор.ЖурналУчета.Установить(""+Перечисления.ttk_ТипыРазделовНДС.Покупки);
// ---ввв 23.06.2016 г.
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Организация 	= СтруктураПараметров.Организация; 
// +++ввв 23.06.2016 г.
		НоваяЗапись.ЖурналУчета 	= ""+Перечисления.ttk_ТипыРазделовНДС.Покупки; 
// ---ввв 23.06.2016 г.
		НоваяЗапись.ТаблицаНДС 		= Новый ХранилищеЗначения(ТЗ_ДляРС); 
		НаборЗаписей.Записать(); 
	КонецЕсли;
				
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ";
	Запрос.УстановитьПараметр("ТЗ", ТЗ_ДляРС);
	Запрос.Выполнить();
			
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПокупок.СчетФактура КАК СчетФактура
	|ИЗ
	|	ТЗ КАК ЗаписиКнигиПокупок";
	СписокСчетовФактур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетФактура");
	
	// Теперь добавляем итоги , необходимые для декларации НДС

	Запрос.Текст = "
			|ВЫБРАТЬ
			|	*,
			|	ТЗ.Продавец КАК Продавец,
			|	ТЗ.Контрагент КАК Контрагент,
			|	ТЗ.ДатаОплаты КАК ДатаОплаты,
			|	ТЗ.ДатаОприходования КАК ДатаОприходования,
			|	ТЗ.ДатаПринятияНаУчет КАК ДатаПринятияНаУчет,
			|	ТЗ.НаАванс КАК НаАванс,
// +++ввв 10.08.2016 г.
			|	ТЗ.ВсегоПокупокВСчетеФактуре КАК ВсегоПокупокВСчетеФактуре,
// ---ввв 10.08.2016 г.
			|	ТЗ.ВсегоПокупок КАК ВсегоПокупок,
			|	ТЗ.СуммаБезНДС20 КАК СуммаБезНДС20,
			|	ТЗ.НДС20 КАК НДС20,
			|	ТЗ.СуммаБезНДС18 КАК СуммаБезНДС18,
			|	ТЗ.НДС18 КАК НДС18,
			|	ТЗ.СуммаБезНДС10 КАК СуммаБезНДС10,
			|	ТЗ.НДС10 КАК НДС10,
			|	ТЗ.НДС0 КАК НДС0,
			|	ТЗ.СуммаСовсемБезНДС КАК СуммаСовсемБезНДС,
			|	ТЗ.СводныйКорректировочный КАК СводныйКорректировочный,
			|	ТЗ.НДС КАК НДС,
			|	ТЗ.НомерДокументаОплаты КАК НомерДокументаОплаты,
			|	ТЗ.ДатаДокументаОплаты КАК ДатаДокументаОплаты,
			|	ТЗ.СчетФактураДокумент КАК СчетФактураДокумент,
			|	ТЗ.КодВидаОперации КАК КодВидаОперации,
			|	ТЗ.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
			|	ТЗ.Исправление КАК Исправление
			|ИЗ
			|	ТЗ КАК ТЗ
//++Готовцев КТТК 13.07.2018			
			|ГДЕ
	        |	ТЗ.СуммаБезНДС20 = 0 + ТЗ.НДС20 + ТЗ.СуммаБезНДС18 + ТЗ.НДС18 + ТЗ.СуммаБезНДС10 + ТЗ.НДС10 + ТЗ.НДС0 + ТЗ.СуммаСовсемБезНДС <> 0
//--Готовцев КТТК 13.07.2018				
			|ИТОГИ
			|	МАКСИМУМ(Продавец),
			|	МАКСИМУМ(Контрагент),
			|	МИНИМУМ(ДатаОплаты),
			|	МАКСИМУМ(ДатаОприходования),
			|	МАКСИМУМ(ДатаПринятияНаУчет),
			|	МАКСИМУМ(НаАванс),
// +++ввв 17.06.2016 г.
			//|	ВЫБОР
			//|		КОГДА &ПравилаПостановления735
			//|			ТОГДА МАКСИМУМ(ВсегоПокупок)
			//|		ИНАЧЕ СУММА(ВсегоПокупок)
			//|	КОНЕЦ КАК ВсегоПокупок,
// ---ввв 10.08.2016 г.
			|	МАКСИМУМ(ВсегоПокупокВСчетеФактуре),
// ---ввв 10.08.2016 г.
			|	СУММА(ВсегоПокупок),
// ---ввв 17.06.2016 г.
			|	СУММА(СуммаБезНДС20),
			|	СУММА(НДС20),
			|	СУММА(СуммаБезНДС18),
			|	СУММА(НДС18),
			|	СУММА(СуммаБезНДС10),
			|	СУММА(НДС10),
			|	СУММА(НДС0),
			|	СУММА(СуммаСовсемБезНДС),
			|	МАКСИМУМ(СводныйКорректировочный),
			|	СУММА(НДС),
			|	МАКСИМУМ(НомерДокументаОплаты),
			|	МАКСИМУМ(ДатаДокументаОплаты)
			|ПО
			|	ОБЩИЕ,
			|	СчетФактураДокумент,
			|	КодВидаОперации,
			|	ИсправленныйСчетФактура,
			|	Исправление";
			
			// Запись в регистр сведений *** ---------------
			
			

			Если СтруктураПараметров.ГруппироватьПоКонтрагентам И НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО
			               |	ОБЩИЕ,", "ПО
			               |	ОБЩИЕ, Контрагент, ");
			КонецЕсли;
			
						
			РезультатЗапроса=Запрос.Выполнить();
			Запрос.МенеджерВременныхТаблиц.Закрыть();
			
			Возврат РезультатЗапроса;
			
КонецФункции // ПолучитьЗаписиКнигиПокупок()

Процедура ПолучитьСчетаФактурыДокументыКнигаПокупок(Запрос) Экспорт
	Запрос.Текст="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТЧПокупатели.СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ТЧПокупатели
	|ГДЕ
	|	ТЧПокупатели.Ссылка.Проведен
	|	И НЕ ТЧПокупатели.Ссылка.ПометкаУдаления
	|	И ТЧПокупатели.Ссылка.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПокупатели.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.Исправление
	|				И СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА СчетФактураПолученный.Ссылка
	|		ИНАЧЕ СчетФактураПолученный.ДокументОснование
	|	КОНЕЦ КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.Ссылка.НомерВходящегоДокумента
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	СчетФактураПолученный.Ссылка КАК СчетФактураДокумент,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НаАванс,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА ЕСТЬNULL(Авансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА СчетФактураПолученный.Ссылка.ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДоговорАванса,
	|	СчетФактураПолученный.Ссылка КАК Ссылка,
	|	СчетФактураПолученный.Ссылка.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактураПолученный.Ссылка.Исправление КАК Исправление,
	|	СчетФактураПолученный.Ссылка.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК ЭтоСчетФактураВыданныйПокупателюПоОтчетуКомиссионера,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.СводныйКомиссионный
	|			ТОГДА 1
	|		ИНАЧЕ СчетФактураПолученный.НомерСтроки
	|	КОНЕЦ КАК НомерСтроки,
	|	СчетФактураПолученный.Ссылка.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетФактураПолученный.Ссылка.СводныйКомиссионный КАК СводныйКомиссионный
	|ПОМЕСТИТЬ ВТ_СчетаФактурыДокументыПромежуточная
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.Авансы КАК Авансы
	|		ПО СчетФактураПолученный.Ссылка = Авансы.Ссылка
	|ГДЕ
	|	СчетФактураПолученный.Ссылка.Проведен
	|	И НЕ СчетФактураПолученный.Ссылка.ПометкаУдаления
	|	И СчетФактураПолученный.Ссылка.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.Исправление
	|				И (СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|					ИЛИ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент))
	|			ТОГДА СчетФактураВыданный.Ссылка
	|		ИНАЧЕ СчетФактураВыданный.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.Ссылка.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.Ссылка.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Дата
	|	КОНЕЦ,
	|	СчетФактураВыданный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|			ТОГДА ЕСТЬNULL(Авансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаСуммовуюРазницу)
	|			ТОГДА СчетФактураВыданный.Ссылка.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|				ИЛИ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)
	|			ТОГДА СчетФактураВыданный.Ссылка.ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.Ссылка.ВидСчетаФактуры,
	|	СчетФактураВыданный.Ссылка.Исправление,
	|	СчетФактураВыданный.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера.СчетФактура ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СчетФактураВыданный.НомерСтроки,
	|	СчетФактураВыданный.Ссылка.СводныйКорректировочный,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ПО СчетФактураВыданный.Ссылка = Авансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера КАК ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера
	|		ПО СчетФактураВыданный.Ссылка = ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера.СчетФактура
	|ГДЕ
	|	СчетФактураВыданный.Ссылка.Проведен
	|	И НЕ СчетФактураВыданный.Ссылка.ПометкаУдаления
	|	И СчетФактураВыданный.Ссылка.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГТДИмпорт.Ссылка,
	|	ГТДИмпорт.НомерГТД,
	|	ГТДИмпорт.Дата,
	|	ГТДИмпорт.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ГТДИмпорт.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	ГТДИмпорт.Контрагент,
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ГТДИмпорт КАК ГТДИмпорт
	|ГДЕ
	|	ГТДИмпорт.Проведен
	|	И НЕ ГТДИмпорт.ПометкаУдаления
	|	И ГТДИмпорт.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ВозвратТоваровОтПокупателя.НомерРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.ДатаРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.Проведен
	|	И НЕ ВозвратТоваровОтПокупателя.ПометкаУдаления
	|	И ВозвратТоваровОтПокупателя.Организация В(&Организация)
	|	И ВозвратТоваровОтПокупателя.НомерРасходногоКассовогоОрдера <> """"
	|	И ВозвратТоваровОтПокупателя.ДатаРасходногоКассовогоОрдера <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	Контрагент,
	|	ДоговорАванса,
	|	НаАванс,
	|	СтавкаНДСАванса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СчетаФактурыДокументы.СчетФактура, ЗаписиКнигиПокупок.СчетФактура) КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА НЕ СчетаФактурыДокументы.ДатаСчетаФактуры ЕСТЬ NULL 
	|			ТОГДА СчетаФактурыДокументы.ДатаСчетаФактуры
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|					ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураПолученный).ДатаВходящегоДокумента
	|				ИНАЧЕ ЗаписиКнигиПокупок.СчетФактура.Дата
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	ВЫБОР
	|		КОГДА НЕ СчетаФактурыДокументы.НомерСчетаФактуры ЕСТЬ NULL 
	|			ТОГДА СчетаФактурыДокументы.НомерСчетаФактуры
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|					ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПокупок.СчетФактура КАК Документ.СчетФактураПолученный).НомерВходящегоДокумента
	|				ИНАЧЕ ЗаписиКнигиПокупок.СчетФактура.Номер
	|			КОНЕЦ
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) КАК СчетФактураДокумент,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПокупок.Организация=ЗаписиКнигиПокупок.СчетФактура.Организация
	|			ТОГДА ЕСТЬNULL(СчетаФактурыДокументы.ДоговорАванса, ЗаписиКнигиПокупок.ДоговорАванса)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДоговорАванса,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СтавкаНДСАванса, НЕОПРЕДЕЛЕНО) КАК СтавкаНДСАванса,
	|	СчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокументРасшифровка,
	|	СчетаФактурыДокументы.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)) КАК ВидСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Исправление, ЛОЖЬ) КАК Исправление,
	|	СчетаФактурыДокументы.НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный,
	|	СчетаФактурыДокументы.СводныйКомиссионный,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Контрагент, ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактура ЕСТЬ NULL 
	|			ТОГДА ""26""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументыПредварительная
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыДокументыПромежуточная КАК СчетаФактурыДокументы
	|		ПО (ЗаписиКнигиПокупок.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|				ИЛИ ЗаписиКнигиПокупок.ДокументОплаты = СчетаФактурыДокументы.СчетФактура)
	|			И ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре = СчетаФактурыДокументы.Контрагент
	|			И ЗаписиКнигиПокупок.ДоговорАванса = СчетаФактурыДокументы.ДоговорАванса
	|			И (НЕ ЗаписиКнигиПокупок.НаАванс ИЛИ СчетаФактурыДокументы.НаАванс
	|					И ЗаписиКнигиПокупок.СтавкаНДС_Аванс = СчетаФактурыДокументы.СтавкаНДСАванса)
	|ГДЕ
	|	НЕ(ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|				И СчетаФактурыДокументы.ЭтоСчетФактураВыданныйПокупателюПоОтчетуКомиссионера)
	|	И СчетаФактурыДокументы.СчетФактура ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ДоговорАванса,
	|	ВидСчетаФактуры,
	|	Исправление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСчетаФактурыДокументы.Контрагент КАК СчетФактураДокументКонтрагент,
	|	ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ТаблицаСчетаФактурыДокументы.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументы.Исправление КАК Исправление,
	|	ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
	|	МАКСИМУМ(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|ПОМЕСТИТЬ ВТ_ОбъединениеСФ
	|ИЗ
	|	ТаблицаСчетаФактурыДокументыПредварительная КАК ТаблицаСчетаФактурыДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСчетаФактурыДокументы.СчетФактура,
	|	ТаблицаСчетаФактурыДокументы.Контрагент,
	|	ТаблицаСчетаФактурыДокументы.ДоговорАванса,
	|	ТаблицаСчетаФактурыДокументы.ВидСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументы.Исправление,
	|	ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокументКонтрагент,
	|	ДоговорАванса,
	|	ВидСчетаФактуры,
	|	Исправление,
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСчетаФактуры,
	|	ВТ_ОбъединениеСФ.СчетФактураДокумент,
	|	ВТ_ОбъединениеСФ.СчетФактураДокументКонтрагент,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДоговорАванса,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СтавкаНДСАванса,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СчетФактураДокументРасшифровка,
	|	ТаблицаСчетаФактурыДокументыПредварительная.Ссылка КАК Ссылка,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСтроки,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.КодВидаОперации,
// +++ввв 10.10.2016 г.
	|	ВЫБОР
	|		КОГДА ТаблицаСчетаФактурыДокументыПредварительная.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура КАК Документ.СчетФактураПолученный).СуммаУвеличение
	|					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура КАК Документ.СчетФактураПолученный).СуммаДокумента
	|				КОНЕЦ
	|		КОГДА ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура КАК Документ.СчетФактураВыданный).СуммаУменьшение
	|					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура КАК Документ.СчетФактураВыданный).СуммаДокумента
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВсегоПокупокВВалюте,
// ---ввв 10.10.2016 г.
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура.абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаполненПродавец
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ТаблицаСчетаФактурыДокументыПредварительная КАК ТаблицаСчетаФактурыДокументыПредварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъединениеСФ КАК ВТ_ОбъединениеСФ
	|		ПО ТаблицаСчетаФактурыДокументыПредварительная.ДоговорАванса = ВТ_ОбъединениеСФ.ДоговорАванса
	|			И ТаблицаСчетаФактурыДокументыПредварительная.ВидСчетаФактуры = ВТ_ОбъединениеСФ.ВидСчетаФактуры
	|			И ТаблицаСчетаФактурыДокументыПредварительная.Исправление = ВТ_ОбъединениеСФ.Исправление
	|			И ТаблицаСчетаФактурыДокументыПредварительная.СчетФактураДокумент.Контрагент = ВТ_ОбъединениеСФ.СчетФактураДокументКонтрагент
	|			И ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура = ВТ_ОбъединениеСФ.СчетФактура
// {{KM WARE Семенов И.С. Заявка № 18.07.2015 начало
// оптимизация
	|индексировать по ТаблицаСчетаФактурыДокументыПредварительная.Ссылка;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналУчетаСчетовФактур.Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура,
// +++ввв 14.04.2016 г.
	//|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры,
	//|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры,
// +++ввв 21.04.2016 г.
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|					ТОГДА ЖурналУчетаСчетовФактур.НомерСчетаФактуры
	|				ИНАЧЕ ЕСТЬNULL(ЖурналУчетаСчетовФактур.СчетФактура.Номер,ЖурналУчетаСчетовФактур.НомерСчетаФактуры)
	|			КОНЕЦ
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|					ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.НомерИсходногоДокумента
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|					ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.НомерВходящегоДокумента
	|				ИНАЧЕ ЕСТЬNULL(ЖурналУчетаСчетовФактур.СчетФактура.Номер,ЖурналУчетаСчетовФактур.НомерСчетаФактуры)
	|			КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ЖурналУчетаСчетовФактур.СчетФактура.Номер,ЖурналУчетаСчетовФактур.НомерСчетаФактуры)
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|					ТОГДА ЖурналУчетаСчетовФактур.ДатаСчетаФактуры
	|				ИНАЧЕ ЕСТЬNULL(ЖурналУчетаСчетовФактур.СчетФактура.Дата,ЖурналУчетаСчетовФактур.ДатаСчетаФактуры)
	|			КОНЕЦ
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|					ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.ДатаИсходногоДокумента
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|					ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.ДатаВходящегоДокумента
	|				ИНАЧЕ ЕСТЬNULL(ЖурналУчетаСчетовФактур.СчетФактура.Дата,ЖурналУчетаСчетовФактур.ДатаСчетаФактуры)
	|			КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ЖурналУчетаСчетовФактур.СчетФактура.Дата,ЖурналУчетаСчетовФактур.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактуры,
// ---ввв 14.04.2016 г.
//	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|					ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.НомерВходящегоДокумента
	|				ИНАЧЕ ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры
	|			КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры
	|	КОНЕЦ КАК НомерКорректировочногоСчетаФактуры,
//	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|					ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.ДатаВходящегоДокумента
	|				ИНАЧЕ ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|			КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|	КОНЕЦ КАК ДатаКорректировочногоСчетаФактуры,
// ---ввв 21.04.2016 г.
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Продавец
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПродавецДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Продавец.ИНН
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент.ИНН
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ИННПродавцаДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Продавец.КПП
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК КПППродавцаДляПечати,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Посредник,
	|	ЖурналУчетаСчетовФактур.НомерСтроки,
	|	ЖурналУчетаСчетовФактур.Валюта,
	|	ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПокупокВВалюте,
	|	ЖурналУчетаСчетовФактур.Валюта.Код,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.СчетФактура.абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаполненПродавец
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.СчетФактура В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
// {{KM WARE Семенов И.С. Заявка № 18.07.2015 начало
// оптимизация
	|индексировать по СчетФактура;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГТДИмпорт.Ссылка КАК СчетФактура,
	|	СУММА(ГТДИмпорт.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаГТДИмпорт
	|ИЗ
	|	Документ.ГТДИмпорт.Разделы КАК ГТДИмпорт
	|ГДЕ
	|	ГТДИмпорт.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДИмпорт.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументРасшифровка КАК СчетФактураДокументРасшифровка,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = ""26""
	|			ТОГДА ИСТИНА
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.Ссылка ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL 
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ЗаполненПродавец, ВТ_ТаблицаСчетаФактурыДокументы.ЗаполненПродавец) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.абс_Продавец, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.абс_Продавец)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ПродавецДляПечати, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументКонтрагент)
	|	КОНЕЦ КАК ПродавецДляПечати,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ЗаполненПродавец, ВТ_ТаблицаСчетаФактурыДокументы.ЗаполненПродавец) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.абс_Продавец.ИНН, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.абс_Продавец.ИНН)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура.Контрагент.ИНН, ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ИННПродавцаДляПечати, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументКонтрагент.ИНН))
	|	КОНЕЦ КАК ИННПродавцаДляПечати,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ЗаполненПродавец, ВТ_ТаблицаСчетаФактурыДокументы.ЗаполненПродавец) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.абс_Продавец.КПП, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.абс_Продавец.КПП)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура.Контрагент.КПП, ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.КПППродавцаДляПечати, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументКонтрагент.КПП))
	|	КОНЕЦ КАК КПППродавцаДляПечати,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.КодВидаОперации, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.КодВидаОперации) КАК КодВидаОперации,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументКонтрагент КАК КонтрагентПоСчетуФактуре,
// +++ввв 18.10.2016 г.
	|	ВЫБОР
	|		КОГДА ВТ_РегистрацияСчетовФактур.Валюта=&ВалютаРегУчета ТОГДА
	|			ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ВсегоПокупокВВалюте, ЕСТЬNULL(ВременнаяТаблицаГТДИмпорт.СуммаНДС, ВТ_ТаблицаСчетаФактурыДокументы.ВсегоПокупокВВалюте))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВсегоПокупокВВалюте,
// ---ввв 18.10.2016 г.
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураПолученный).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчета
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураВыданный).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчета
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК Документ.ПоступлениеТоваровУслуг).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчета
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураПолученный).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаКод
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураВыданный).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаКод
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК Документ.ПоступлениеТоваровУслуг).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаКод
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.Валюта.Код
	|	КОНЕЦ КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураПолученный).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаНаименованиеПолное
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураВыданный).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаНаименованиеПолное
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				И ВЫРАЗИТЬ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК Документ.ПоступлениеТоваровУслуг).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаНаименованиеПолное
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.Валюта.НаименованиеПолное
	|	КОНЕЦ КАК ВалютаНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ВТ_РегистрацияСчетовФактур.Посредник.НаименованиеПолное, 1, 250) = """"
	|			ТОГДА ВТ_РегистрацияСчетовФактур.Посредник.Наименование
	|		ИНАЧЕ ПОДСТРОКА(ВТ_РегистрацияСчетовФактур.Посредник.НаименованиеПолное, 1, 250)
	|	КОНЕЦ КАК Посредник,
	|	ВТ_РегистрацияСчетовФактур.Посредник.ИНН КАК ПосредникИНН,
	|	ВТ_РегистрацияСчетовФактур.Посредник.КПП КАК ПосредникКПП
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.Ссылка = ВТ_РегистрацияСчетовФактур.СчетФактура
	|			И (ВЫБОР
	|				КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|						ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|					ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаГТДИмпорт КАК ВременнаяТаблицаГТДИмпорт
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.Ссылка = ВременнаяТаблицаГТДИмпорт.СчетФактура";
	
	Запрос.Выполнить();
// ---ввв 20.04.2016 г.	
КонецПроцедуры

Процедура УстановитьПараметрыЗапросаКнигиПокупок(Запрос, СтруктураПараметров) Экспорт
	
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(СтруктураПараметров.КонецПериода));
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.СписокОрганизаций);
	Запрос.УстановитьПараметр("ОтбиратьПоКонтрагенту", НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме И СтруктураПараметров.ОтбиратьПоКонтрагенту);
	Запрос.УстановитьПараметр("КонтрагентДляОтбора", СтруктураПараметров.КонтрагентДляОтбора);
	Запрос.УстановитьПараметр("ВыводитьПокупателейПоАвансам", СтруктураПараметров.ВыводитьПокупателейПоАвансам);
	Запрос.УстановитьПараметр("ВалютаРегУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	//АБС
	Запрос.УстановитьПараметр("ВалютаРегУчетаКод","643");		
	Запрос.УстановитьПараметр("ВалютаРегУчетаНаименованиеПолное", "Российский рубль");
	//\\АБС
	
	ДатаПроверкиПараметровУчета = '00010101';
	ЗаполнениеДокументовОтчетности = СтруктураПараметров.ЗаполнениеДокумента ИЛИ СтруктураПараметров.ЗаполнениеДекларации;
	
	Если ЗаполнениеДокументовОтчетности И СтруктураПараметров.ЗаписьДополнительногоЛиста Тогда
		Запрос.УстановитьПараметр("НачалоНалоговогоПериода", СтруктураПараметров.НачалоНалоговогоПериода); 
		Запрос.УстановитьПараметр("КонецНалоговогоПериода", КонецДня(СтруктураПараметров.КонецНалоговогоПериода));
		ДатаПроверкиПараметровУчета = СтруктураПараметров.КонецНалоговогоПериода;
	Иначе
		ДатаПроверкиПараметровУчета = СтруктураПараметров.КонецПериода;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПравилаПостановления735", УчетНДС.ВерсияПостановленияНДС1137(ДатаПроверкиПараметровУчета) = 3);

	СтавкиНДС20 = Новый Массив();
	СтавкиНДС20.Добавить(Перечисления.СтавкиНДС.НДС20);
	СтавкиНДС20.Добавить(Перечисления.СтавкиНДС.НДС20_120);

	СтавкиНДС18 = Новый Массив();
	СтавкиНДС18.Добавить(Перечисления.СтавкиНДС.НДС18);
	СтавкиНДС18.Добавить(Перечисления.СтавкиНДС.НДС18_118);

	СтавкиНДС10 = Новый Массив();
	СтавкиНДС10.Добавить(Перечисления.СтавкиНДС.НДС10);
	СтавкиНДС10.Добавить(Перечисления.СтавкиНДС.НДС10_110);

	СтавкаНДС0 = Перечисления.СтавкиНДС.НДС0;
	СтавкаБезНДС = Перечисления.СтавкиНДС.БезНДС;

	Запрос.УстановитьПараметр("СтавкиНДС20", СтавкиНДС20);
	Запрос.УстановитьПараметр("СтавкиНДС18", СтавкиНДС18);
	Запрос.УстановитьПараметр("СтавкиНДС10", СтавкиНДС10);
	Запрос.УстановитьПараметр("СтавкаНДС0", СтавкаНДС0);
	Запрос.УстановитьПараметр("СтавкаБезНДС", СтавкаБезНДС);
	
	ВидыЦенностей_СобственныеСФ = Новый Массив;
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.ВнутреннееПотребление);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);

	Запрос.УстановитьПараметр("ВидыЦенностей_СобственныеСФ", ВидыЦенностей_СобственныеСФ);

	ВидыЦенностей_АвансыПолученные = Новый Массив;
	ВидыЦенностей_АвансыПолученные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностей_АвансыПолученные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ВидыЦенностей_АвансыПолученные.Добавить(Перечисления.ВидыЦенностей.АвансыВыданные);
	ВидыЦенностей_АвансыПолученные.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);
	
	Запрос.УстановитьПараметр("ВидыЦенностей_АвансыПолученные", ВидыЦенностей_АвансыПолученные);
	
	Запрос.УстановитьПараметр("ВидыЦенностей_АвансыВыданные", Перечисления.ВидыЦенностей.АвансыВыданные);
	
	ВидыЦенностей_СуммовыеРазницы = Новый Массив;
	ВидыЦенностей_СуммовыеРазницы.Добавить(Перечисления.ВидыЦенностей.СуммыСвязанныеСРасчетамиПоОплате);
	
	Запрос.УстановитьПараметр("ВидыЦенностей_СуммоваяРазница", ВидыЦенностей_СуммовыеРазницы);
	
	ВидыЦенностей_АвансСобственные = Новый Массив;
	ВидыЦенностей_АвансСобственные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностей_АвансСобственные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ВидыЦенностей_АвансСобственные.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);	
	
	Запрос.УстановитьПараметр("ВидыЦенностей_АвансСобственные", ВидыЦенностей_АвансСобственные);
	
	Запрос.УстановитьПараметр("ВидыЦенностей_НалоговыйАгент", УчетНДС.ВидыЦенностиНалоговыйАгентПоступление());
	
	МассивДокументовИсправлений = Новый Массив;
	МассивДокументовИсправлений.Добавить(Неопределено);
	
	ТипыДокументовИсправлений	= Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок.Измерения.ИсправленныйСчетФактура.Тип;
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		
		Если ТипыДокументовИсправлений.СодержитТип(Тип("ДокументСсылка." + МетаданныеДокумента.Имя)) Тогда
			МассивДокументовИсправлений.Добавить(Документы[МетаданныеДокумента.Имя].ПустаяСсылка());
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ПустыеДокументыИсправления", МассивДокументовИсправлений);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
//  КНИГА ПРОДАЖ
// {{KM WARE Агапов Н.А. Заявка №34425 09.10.2015 начало

Функция ПолучитьЗаписиКнигиПродаж(СписокСчетовФактур, СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Запрос.Текст = "выбрать 1 где ложь";
		Возврат Запрос.Выполнить();		
	КонецЕсли;
	
	УстановитьПараметрыЗапросаКнигиПродаж(Запрос, СтруктураПараметров);
		
	Если СтруктураПараметров.ЗаполнятьРаздел9ПоДаннымРегистраСведений Тогда
		
		НаборЗаписей = РегистрыСведений.ttk_ДанныеНДС.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Организация.Установить(СтруктураПараметров.Организация); 
// +++ввв 23.06.2016 г.
		НаборЗаписей.Отбор.ЖурналУчета.Установить(""+Перечисления.ttk_ТипыРазделовНДС.Продажи); 
// ---ввв 23.06.2016 г.
		НаборЗаписей.Прочитать(); 
		Для Каждого Запись Из НаборЗаписей Цикл 
			ТЗ_ДляРС=Запись.ТаблицаНДС.Получить();
// +++ввв 17.06.2016 г.
			Прервать;
// ---ввв 17.06.2016 г.
		КонецЦикла;
		
	Иначе	
		Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
				|				ИЛИ НДСЗаписиКнигиПродаж.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)
				|					И НЕ &ВыводитьПродавцовПоАвансам
				|			ТОГДА НДСЗаписиКнигиПродаж.Организация
				|		КОГДА НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.КорректировкаПоступления
				|			ТОГДА НДСЗаписиКнигиПродаж.Организация
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.Покупатель
				|	КОНЕЦ КАК Контрагент,
				|	НДСЗаписиКнигиПродаж.Покупатель КАК КонтрагентПоСчетуФактуре,
				|	НДСЗаписиКнигиПродаж.Период КАК Период,
				|	ВЫБОР
				|		КОГДА НЕ НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
				|			ТОГДА НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.СчетФактура
				|	КОНЕЦ КАК СчетФактура,
				|	НДСЗаписиКнигиПродаж.ДатаОплаты КАК ДатаОплаты,
				|	НДСЗаписиКнигиПродаж.ДокументОплаты КАК ДокументОплаты,
				|	НДСЗаписиКнигиПродаж.Событие КАК Событие,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА НДСЗаписиКнигиПродаж.СчетФактура.Дата
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.ДатаСобытия
				|	КОНЕЦ КАК ДатаСобытия,
				|	СУММА(НДСЗаписиКнигиПродаж.СуммаБезНДС + НДСЗаписиКнигиПродаж.НДС) КАК ВсегоПродаж,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС В (&СтавкиНДС20)
				|				ТОГДА НДСЗаписиКнигиПродаж.СуммаБезНДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК СуммаБезНДС20,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС В (&СтавкиНДС20)
				|				ТОГДА НДСЗаписиКнигиПродаж.НДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК НДС20,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС В (&СтавкиНДС18)
				|				ТОГДА НДСЗаписиКнигиПродаж.СуммаБезНДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК СуммаБезНДС18,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС В (&СтавкиНДС18)
				|				ТОГДА НДСЗаписиКнигиПродаж.НДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК НДС18,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС В (&СтавкиНДС10)
				|				ТОГДА НДСЗаписиКнигиПродаж.СуммаБезНДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК СуммаБезНДС10,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС В (&СтавкиНДС10)
				|				ТОГДА НДСЗаписиКнигиПродаж.НДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК НДС10,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = &СтавкаНДС0
				|				ТОГДА НДСЗаписиКнигиПродаж.СуммаБезНДС + НДСЗаписиКнигиПродаж.НДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК НДС0,
				|	СУММА(ВЫБОР
				|			КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = &СтавкаБезНДС
				|				ТОГДА НДСЗаписиКнигиПродаж.СуммаБезНДС + НДСЗаписиКнигиПродаж.НДС
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК СуммаСовсемБезНДС,
				|	НДСЗаписиКнигиПродаж.Организация КАК Организация,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				|			ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.СчетФактура.Дата
				|	КОНЕЦ КАК ДатаОприходования,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_Аванс)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК НаАванс,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_СуммоваяРазница)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК НаСуммовуюРазницу,
				|	ВЫБОР
				|		КОГДА (НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_Аванс)
				|				ИЛИ НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_СуммоваяРазница))
				|				И НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
				|				И НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
				|			ТОГДА НДСЗаписиКнигиПродаж.СтавкаНДС
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК СтавкаНДС_Аванс,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				|			ТОГДА НЕОПРЕДЕЛЕНО
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
				|						И НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
				|					ТОГДА НДСЗаписиКнигиПродаж.ДоговорКонтрагента
				|				ИНАЧЕ НЕОПРЕДЕЛЕНО
				|			КОНЕЦ
				|	КОНЕЦ КАК ДоговорАванса,
				|	НДСЗаписиКнигиПродаж.СчетФактура.Дата,
				|	НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
				|	ВЫБОР
				|		КОГДА (НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.КорректировкаРеализации
				|				ИЛИ НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
				|				И НДСЗаписиКнигиПродаж.СуммаБезНДС + НДСЗаписиКнигиПродаж.НДС < 0
				|			ТОГДА ИСТИНА
				|		КОГДА НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.СчетФактураВыданный
				|				И НДСЗаписиКнигиПродаж.СуммаБезНДС + НДСЗаписиКнигиПродаж.НДС < 0
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК Исправление,
				|	НДСЗаписиКнигиПродаж.НомерДокументаОплаты,
				|	НДСЗаписиКнигиПродаж.ДатаДокументаОплаты,
				// {{KM WARE Семенов И.С. Заявка № 33278 14.07.2015 начало
			// что бы для корректировок поступления кодвида операции=18
				|	выбор когда НДСЗаписиКнигиПродаж.КодВидаОперации="""" и НДСЗаписиКнигиПродаж.СчетФактура ссылка документ.КорректировкаПоступления тогда ""18"" иначе НДСЗаписиКнигиПродаж.КодВидаОперации конец как КодВидаОперации
			// было
			//|	НДСЗаписиКнигиПродаж.КодВидаОперации
			// }}KM WARE Семенов И.С. Заявка № 33278 14.07.2015 окончание
				|ПОМЕСТИТЬ ЗаписиКнигиПродаж
				|ИЗ
				|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
				|ГДЕ
				|	НДСЗаписиКнигиПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
				|	И НДСЗаписиКнигиПродаж.Организация В(&Организация)
				|	И НЕ НДСЗаписиКнигиПродаж.ЗаписьДополнительногоЛиста
				|	И НДСЗаписиКнигиПродаж.Активность
				|	И (НДСЗаписиКнигиПродаж.СтавкаНДС <> &СтавкаБезНДС
				|			ИЛИ &ОтражатьРеализацииБезНДС)
			// {{KM WARE Семенов И.С. Заявка № 33278 14.07.2015 начало
			// что бы не попадали в книгу продаж пустые строки изза корретировок (сторно)
				|   и (СуммаБезНДС<>0 или НДС<>0)
// +++ввв 23.06.2016 г.
				|	И (НЕ НДСЗаписиКнигиПродаж.СчетФактура ЕСТЬ NULL)
				|	И (НЕ НДСЗаписиКнигиПродаж.СчетФактура = НЕОПРЕДЕЛЕНО)
// ---ввв 23.06.2016 г.
			// }}KM WARE Семенов И.С. Заявка № 33278 14.07.2015 окончание
				|
				|СГРУППИРОВАТЬ ПО
			// {{KM WARE Семенов И.С. Заявка № 33278 14.07.2015 начало
			// что бы для корректировок поступления кодвида операции=18
				|	выбор когда НДСЗаписиКнигиПродаж.КодВидаОперации="""" и НДСЗаписиКнигиПродаж.СчетФактура ссылка документ.КорректировкаПоступления тогда ""18"" иначе НДСЗаписиКнигиПродаж.КодВидаОперации конец ,
			// }}KM WARE Семенов И.С. Заявка № 33278 14.07.2015 окончание
				|	НДСЗаписиКнигиПродаж.Организация,
				|	НДСЗаписиКнигиПродаж.Период,
				|	НДСЗаписиКнигиПродаж.ДатаОплаты,
				|	НДСЗаписиКнигиПродаж.ДокументОплаты,
				|	НДСЗаписиКнигиПродаж.Событие,
				|	НДСЗаписиКнигиПродаж.СчетФактура.Дата,
				|	НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА НДСЗаписиКнигиПродаж.СчетФактура.Дата
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.ДатаСобытия
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				|			ТОГДА ВЫРАЗИТЬ(НДСЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование.Дата
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.СчетФактура.Дата
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_Аванс)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_СуммоваяРазница)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА (НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_Аванс)
				|				ИЛИ НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_СуммоваяРазница))
				|				И НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
				|				И НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
				|			ТОГДА НДСЗаписиКнигиПродаж.СтавкаНДС
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				|			ТОГДА НЕОПРЕДЕЛЕНО
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
				|						И НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
				|					ТОГДА НДСЗаписиКнигиПродаж.ДоговорКонтрагента
				|				ИНАЧЕ НЕОПРЕДЕЛЕНО
				|			КОНЕЦ
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА НЕ НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
				|			ТОГДА НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.СчетФактура
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА (НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.КорректировкаРеализации
				|				ИЛИ НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
				|				И НДСЗаписиКнигиПродаж.СуммаБезНДС + НДСЗаписиКнигиПродаж.НДС < 0
				|			ТОГДА ИСТИНА
				|		КОГДА НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.СчетФактураВыданный
				|				И НДСЗаписиКнигиПродаж.СуммаБезНДС + НДСЗаписиКнигиПродаж.НДС < 0
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ВидЦенности В (&ВидыЦенностей_СобственныеСФ)
				|				ИЛИ НДСЗаписиКнигиПродаж.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)
				|					И НЕ &ВыводитьПродавцовПоАвансам
				|			ТОГДА НДСЗаписиКнигиПродаж.Организация
				|		КОГДА НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.КорректировкаПоступления
				|			ТОГДА НДСЗаписиКнигиПродаж.Организация
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.Покупатель
				|	КОНЕЦ,
				|	НДСЗаписиКнигиПродаж.Покупатель,
				|	НДСЗаписиКнигиПродаж.НомерДокументаОплаты,
				|	НДСЗаписиКнигиПродаж.ДатаДокументаОплаты,
				|	НДСЗаписиКнигиПродаж.КодВидаОперации 
			// {{KM WARE Семенов И.С. Заявка № 18.07.2015 начало
			// оптимизация
				|индексировать по ВЫБОР
				|		КОГДА НЕ НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура В (&ПустыеДокументыИсправления)
				|			ТОГДА НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура
				|		ИНАЧЕ НДСЗаписиКнигиПродаж.СчетФактура
				|	КОНЕЦ,ВЫБОР
				|		КОГДА НДСЗаписиКнигиПродаж.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				|			ТОГДА НЕОПРЕДЕЛЕНО
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
				|						И НЕ НДСЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтражениеПоступленияТоваровИУслугНДС
				|					ТОГДА НДСЗаписиКнигиПродаж.ДоговорКонтрагента
				|				ИНАЧЕ НЕОПРЕДЕЛЕНО
				|			КОНЕЦ
				|	КОНЕЦ";
						
		Запрос.Выполнить();  // ПолучитьЗаписиКнигиПродаж
				
		ПолучитьСчетаФактурыДокументыКнигаПродаж(Запрос);

// +++ввв 17.06.2016 г.
		Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ВТ_ДО.НаАванс КАК На_Аванс,
	|	ТИПЗНАЧЕНИЯ(ВТ_ДО.СчетФактура) КАК ТипДокументОснование,
	|	ВТ_ДО.СчетФактура КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДОРавноСФ
	|ИЗ
	|	ЗаписиКнигиПродаж КАК ВТ_ДО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетаФактурыДокументы КАК СчетаФактуры
	|	ПО (ВТ_ДО.СчетФактура = СчетаФактуры.СчетФактура)
	|		И (ВТ_ДО.ДоговорАванса = СчетаФактуры.ДоговорАванса)
	|		И (ВТ_ДО.СтавкаНДС_Аванс = СчетаФактуры.СтавкаНДСАванса)
	|ГДЕ
	|	СчетаФактуры.СчетФактураДокумент ЕСТЬ NULL И
	|	НЕ ВТ_ДО.СчетФактура ЕСТЬ NULL И
	|	НЕ ВТ_ДО.СчетФактура = НЕОПРЕДЕЛЕНО И
	|	НЕ ВТ_ДО.СчетФактура ССЫЛКА Документ.СчетФактураВыданный И
	|	НЕ ВТ_ДО.СчетФактура ССЫЛКА Документ.СчетФактураПолученный И
	|	ВЫБОР
	|		КОГДА &ОтбиратьПоКонтрагенту = ИСТИНА
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ СчетаФактуры.ПродавецДляПечати ЕСТЬ NULL 
	|						И СчетаФактуры.ПродавецДляПечати.ОбособленноеПодразделение
	|					ТОГДА СчетаФактуры.ПродавецДляПечати.ГоловнойКонтрагент = &КонтрагентДляОтбора
	|				КОГДА НЕ СчетаФактуры.ПродавецДляПечати ЕСТЬ NULL 
	|					ТОГДА СчетаФактуры.ПродавецДляПечати = &КонтрагентДляОтбора
	|				КОГДА ВЫРАЗИТЬ(ВТ_ДО.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
	|					ТОГДА ВЫРАЗИТЬ(ВТ_ДО.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент = &КонтрагентДляОтбора
	|				ИНАЧЕ ВТ_ДО.Контрагент = &КонтрагентДляОтбора
	|			КОНЕЦ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	СчетаФактуры.ДокументОснование КАК ДокументОснование,
	|	СчетаФактуры.Ссылка КАК СчетФактура
// +++ввв 23.06.2016 г.
	//|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ
	|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ_ВСФ
// ---ввв 23.06.2016 г.
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	(СчетаФактуры.ДокументОснование, (ВЫБОР
	|			КОГДА СчетаФактуры.Ссылка.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)) В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование,
	|				ДО.На_Аванс
	|			ИЗ
	|				ВТ_ДОРавноСФ КАК ДО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаФактуры.ДокументОснование,
	|	СчетаФактуры.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	(СчетаФактуры.ДокументОснование, (ВЫБОР
	|			КОГДА СчетаФактуры.Ссылка.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)) В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование,
	|				ДО.На_Аванс
	|			ИЗ
	|				ВТ_ДОРавноСФ КАК ДО)
// +++ввв 23.06.2016 г.
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДО.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДОРавноСФ_Доп
	|ИЗ
	|	ВТ_ДОРавноСФ КАК ВТ_ДО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ_ВСФ КАК СчетаФактуры
	|	ПО (ВТ_ДО.ДокументОснование = СчетаФактуры.ДокументОснование)
	|ГДЕ
	|	СчетаФактуры.ДокументОснование ЕСТЬ NULL
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	СчетаФактуры.ДокументОснование КАК ДокументОснование,
	|	СчетаФактуры.Ссылка КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ_Доп
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	СчетаФактуры.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование
	|			ИЗ
	|				ВТ_ДОРавноСФ_Доп КАК ДО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаФактуры.ДокументОснование,
	|	СчетаФактуры.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка.Проведен И
	|	НЕ СчетаФактуры.Ссылка.ПометкаУдаления И
	|	СчетаФактуры.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ДО.ДокументОснование
	|			ИЗ
	|				ВТ_ДОРавноСФ_Доп КАК ДО)
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ВТ_ДО.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(СчетаФактуры.СчетФактура, СчетаФактуры0.СчетФактура) КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактуры_ДОРавноСФ
	|ИЗ
	|	ВТ_ДОРавноСФ КАК ВТ_ДО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ_ВСФ КАК СчетаФактуры
	|	ПО (ВТ_ДО.ДокументОснование = СчетаФактуры.ДокументОснование)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ_Доп КАК СчетаФактуры0
	|	ПО (ВТ_ДО.ДокументОснование = СчетаФактуры0.ДокументОснование)
	|ГДЕ
	|	НЕ ЕСТЬNULL(СчетаФактуры.СчетФактура, СчетаФактуры0.СчетФактура) ЕСТЬ NULL
// ---ввв 23.06.2016 г.
	|";
	
		Если НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме И СтруктураПараметров.ОтбиратьПоКонтрагенту И
			СтруктураПараметров.КонтрагентДляОтбора.ЭтоГруппа Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, " = &КонтрагентДляОтбора", " В ИЕРАРХИИ(&КонтрагентДляОтбора)");
		КонецЕсли;
	
		Запрос.Выполнить();
// Создаем общий запрос                                    
		Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаписиКнигиПродаж.Организация КАК Организация,
				|	НАЧАЛОПЕРИОДА(ЗаписиКнигиПродаж.Период, КВАРТАЛ) КАК НалоговыйПериод,
				|	ЗаписиКнигиПродаж.НаАванс КАК НаАванс,
				|	ЗаписиКнигиПродаж.НаСуммовуюРазницу КАК НаСуммовуюРазницу,
// +++ввв 23.06.2016 г.
				//|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
				|			ЕСТЬNULL(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ДокументОснование, ЗаписиКнигиПродаж.СчетФактура)
				|		КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный ТОГДА
				|			ЕСТЬNULL(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураПолученный).ДокументОснование, ЗаписиКнигиПродаж.СчетФактура)
				|		ИНАЧЕ ЗаписиКнигиПродаж.СчетФактура
				|	КОНЕЦ КАК СчетФактура,
// ---ввв 23.06.2016 г.
				|	НАЧАЛОПЕРИОДА(ЗаписиКнигиПродаж.СчетФактураДата, ДЕНЬ) КАК СчетФактураДата,
// +++ввв 21.07.2016 г.
				// {{KM WARE Семенов И.С. Заявка № ... 14.01.2016 начало
			// оптимизация
				//|	ЗаписиКнигиПродаж.СчетФактура.абс_ДатаСФ КАК kmw_СчетФактура_абс_ДатаСФ,
				//|	ЗаписиКнигиПродаж.СчетФактура.Дата КАК kmw_СчетФактура_Дата,
				//|	ЕСТЬNULL(ВЫБОР
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.абс_ДатаСФ
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.абс_ДатаСФ
				//|			ИНАЧЕ ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.абс_ДатаСФ
				//|		КОНЕЦ, ЗаписиКнигиПродаж.СчетФактура.абс_ДатаСФ) КАК kmw_СчетФактураДокумент_абс_ДатаСФ,
				//|	ЕСТЬNULL(ВЫБОР
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.Дата
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.Дата
				//|			ИНАЧЕ ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.Дата
				//|		КОНЕЦ, ЗаписиКнигиПродаж.СчетФактура.Дата) КАК kmw_СчетФактураДокумент_Дата,
//				|	ЗаписиКнигиПродаж.СчетФактура.Дата КАК kmwСчетФактураДата,
//				|	ЗаписиКнигиПродаж.СчетФактура.Номер КАК kmwСчетФактураНомер,
				//|	ВЫБОР
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.ДатаВходящегоДокумента
				////|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
				////|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДатаВходящегоДокумента
				//|			ИНАЧЕ null
				//|		КОНЕЦ КАК kmwСчетФактураДокументДатаВходящегоДокумента,
				//|	ВЫБОР
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.НомерВходящегоДокумента
				////|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
				////|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.НомерВходящегоДокумента
				//|			ИНАЧЕ null
				//|		КОНЕЦ КАК kmwСчетФактураДокументНомерВходящегоДокумента,
				//|	ВЫБОР
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.ДатаПлатежноРасчетногоДокумента
				//|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
				//|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДатаПлатежноРасчетногоДокумента
				//|			ИНАЧЕ null
				//|		КОНЕЦ КАК kmwСчетФактураДокументДатаПлатежноРасчетногоДокумента,
				//|	ВЫБОР
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура.НомерПлатежноРасчетногоДокумента
				//|			КОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
				//|				ТОГДА ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.НомерПлатежноРасчетногоДокумента
				//|			ИНАЧЕ null
				//|		КОНЕЦ КАК kmwСчетФактураДокументНомерПлатежноРасчетногоДокумента,
			// }}KM WARE Семенов И.С. Заявка № 18.07.2015 окончание	
// ---ввв 21.07.2016 г.
// +++ввв 17.06.2016 г.
				//|	ЕСТЬNULL(ВЫБОР
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура
				//|			КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
				//|				ТОГДА ЗаписиКнигиПродаж.СчетФактура
//// +++ввв 15.06.2016 г.
				//|			ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент,ЗаписиКнигиПродаж.СчетФактура)
//// ---ввв 15.06.2016 г.
				//|		КОНЕЦ, ЗаписиКнигиПродаж.СчетФактура) КАК СчетФактураДокумент,
				|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК СчетФактураДокумент,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
				|			ТОГДА ВЫБОР
				|				КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).Исправление
				|					  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
				|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).НомерИсходногоДокумента
				|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).НомерВходящегоДокумента
				|				КОНЕЦ
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
				|			ТОГДА ВЫБОР
				|				КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Исправление
				|					  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
				|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).НомерИсходногоДокумента
				|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Номер
				|				КОНЕЦ
			//	|		КОГДА ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			//	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.ДокументРасчетовСКонтрагентом).ttk_Номер
				|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.Номер, ЗаписиКнигиПродаж.СчетФактура.Номер))
				|	КОНЕЦ КАК НомерСчетаФактуры,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
				|			ТОГДА ВЫБОР
				|				КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).Исправление
				|					  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
				|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ДатаИсходногоДокумента
				|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ДатаВходящегоДокумента
				|				КОНЕЦ
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
				|			ТОГДА ВЫБОР
				|					КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Исправление
				|						  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
				|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).ДатаИсходногоДокумента
				|					ИНАЧЕ ВЫБОР
				|							КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).абс_ДатаСФ,ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
				|								ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Дата
				|							ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).абс_ДатаСФ
				|						КОНЕЦ
				|				КОНЕЦ
			//	|		КОГДА ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			//	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.ДокументРасчетовСКонтрагентом).ttk_Дата
				|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.Дата, ЗаписиКнигиПродаж.СчетФактура.Дата))
				|	КОНЕЦ КАК ДатаСчетаФактуры,
				
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
				|			ТОГДА ВЫБОР
				|				КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).Исправление
				|					  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
				|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).НомерИсходногоДокумента
				|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).НомерВходящегоДокумента
				|				КОНЕЦ
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
				|			ТОГДА ВЫБОР
				|				КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Исправление
				|					  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
				|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).НомерИсходногоДокумента
				|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Номер
				|				КОНЕЦ
			//	|		КОГДА ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			//	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.ДокументРасчетовСКонтрагентом).ttk_Номер
				|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.НомерСчетаФактурыСортировка, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.Номер, ЗаписиКнигиПродаж.СчетФактура.Номер)))
				|	КОНЕЦ КАК НомерСчетаФактурыСортировка,
				
			//	|	ВЫБОР
			//	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
			//	|			ТОГДА ВЫБОР
			//	|				КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).Исправление
			//	|					  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
			//	|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ДатаИсходногоДокумента
			//	|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ДатаВходящегоДокумента
			//	|				КОНЕЦ
			//	|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
			//	|			ТОГДА ВЫБОР
			//	|					КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Исправление
			//	|						  ИЛИ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
			//	|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).ДатаИсходногоДокумента
			//	|					ИНАЧЕ ВЫБОР
			//	|							КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).абс_ДатаСФ,ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
			//	|								ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Дата
			//	|							ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).абс_ДатаСФ
			//	|						КОНЕЦ
			//	|				КОНЕЦ
			////	|		КОГДА ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			////	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СчетаФактурыДоп.СчетФактура, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.ДокументРасчетовСКонтрагентом).ttk_Дата
			//	|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ДатаСчетаФактурыСортировка, ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.Дата, ЗаписиКнигиПродаж.СчетФактура.Дата)))
			//	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
				//|	ЕСТЬNULL(ВЫБОР
				//|			КОГДА НЕ ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры ЕСТЬ NULL 
				//|				ТОГДА ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры
				//|			ИНАЧЕ ВЫБОР
				//|					КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|						ТОГДА ВЫБОР
				//|								КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Исправление
				//|										ИЛИ ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
				//|									ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).НомерИсходногоДокумента
				//|								ИНАЧЕ ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Номер
				//|							КОНЕЦ
				//|					КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
				//|						ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураПолученный).НомерВходящегоДокумента
				//|					ИНАЧЕ ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры
				//|				КОНЕЦ
				//|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК НомерСчетаФактуры,
				//|	ЕСТЬNULL(ВЫБОР
				//|			КОГДА НЕ ТаблицаСчетаФактурыДокументы.НомерСчетаФактурыСортировка ЕСТЬ NULL 
				//|				ТОГДА ТаблицаСчетаФактурыДокументы.НомерСчетаФактурыСортировка
				//|			ИНАЧЕ ВЫБОР
				//|					КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|						ТОГДА ВЫБОР
				//|								КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Исправление
				//|										ИЛИ ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
				//|									ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).НомерИсходногоДокумента
				//|								ИНАЧЕ ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Номер
				//|							КОНЕЦ
				//|					КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
				//|						ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураПолученный).НомерВходящегоДокумента
				//|					ИНАЧЕ ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры
				//|				КОНЕЦ
				//|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК НомерСчетаФактурыСортировка,
				|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ВЫБОР
				|				КОГДА НЕ ТаблицаСчетаФактурыДокументы.ДатаСчетаФактурыСортировка ЕСТЬ NULL 
				|					ТОГДА ТаблицаСчетаФактурыДокументы.ДатаСчетаФактурыСортировка
				|				ИНАЧЕ ВЫБОР
				|						КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				|							ТОГДА ВЫБОР
				|									КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Исправление
				|											ИЛИ ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
				|										ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ДатаИсходногоДокумента
				|									ИНАЧЕ ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Дата
				|								КОНЕЦ
				|						КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
				|							ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураПолученный).ДатаВходящегоДокумента
				|						ИНАЧЕ ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры
				|					КОНЕЦ
				|			КОНЕЦ, ДЕНЬ), НЕОПРЕДЕЛЕНО) КАК ДатаСчетаФактурыСортировка,
				//|	ЕСТЬNULL(ВЫБОР
				//|			КОГДА НЕ ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры ЕСТЬ NULL 
				//|				ТОГДА ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры
				//|			ИНАЧЕ ВЫБОР
				//|					КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
				//|						ТОГДА ВЫБОР
				//|								КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Исправление
				//|										ИЛИ ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
				//|									ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).ДатаИсходногоДокумента
				//|								ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).абс_ДатаСФ,ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураВыданный).Дата)
				//|							КОНЕЦ
				//|					КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
				//|						ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.СчетФактураПолученный).ДатаВходящегоДокумента
				//|					ИНАЧЕ ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры
				//|				КОНЕЦ
				//|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК ДатаСчетаФактуры,
// ---ввв 17.06.2016 г.
				|	ЗаписиКнигиПродаж.СтавкаНДС_Аванс КАК СтавкаНДС_Аванс,
				|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.Контрагент ССЫЛКА Справочник.Организации
				|			ТОГДА ЗаписиКнигиПродаж.Контрагент
				|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
				|				И ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ОбособленноеПодразделение
				|			ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент
				|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
				|			ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати
				|		КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
				|			ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент
				|		ИНАЧЕ ЗаписиКнигиПродаж.Контрагент
				|	КОНЕЦ КАК Контрагент,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.Контрагент ССЫЛКА Справочник.Организации
				|			ТОГДА ЗаписиКнигиПродаж.Контрагент.ИНН
				|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ИННПродавцаДляПечати ЕСТЬ NULL 
				|			ТОГДА ТаблицаСчетаФактурыДокументы.ИННПродавцаДляПечати
				|		ИНАЧЕ ЗаписиКнигиПродаж.Контрагент.ИНН
				|	КОНЕЦ КАК ПокупательИНН,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.Контрагент ССЫЛКА Справочник.Организации
				|			ТОГДА ЗаписиКнигиПродаж.Контрагент.КПП
				|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.КПППродавцаДляПечати ЕСТЬ NULL 
				|			ТОГДА ТаблицаСчетаФактурыДокументы.КПППродавцаДляПечати
				|		ИНАЧЕ ЗаписиКнигиПродаж.Контрагент.КПП
				|	КОНЕЦ КАК ПокупательКПП,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
				|					И ЗаписиКнигиПродаж.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				|				ИЛИ ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ПриходныйКассовыйОрдер
				|					И ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.ПриходныйКассовыйОрдер).ВидОперации = &ПКО_РозничнаяВыручка
				|			ТОГДА ""Розничная продажа""
				|		КОГДА ЗаписиКнигиПродаж.Контрагент ССЫЛКА Справочник.Организации
				|				И ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Организации).НаименованиеПолное, 1, 250) = """"
				|			ТОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Организации).НаименованиеСокращенное, 1, 250)
				|		КОГДА ЗаписиКнигиПродаж.Контрагент ССЫЛКА Справочник.Организации
				|			ТОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Организации).НаименованиеПолное, 1, 250)
				|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
				|				И ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ОбособленноеПодразделение
				|			ТОГДА ВЫБОР
				|					КОГДА ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент.НаименованиеПолное, 1, 250) = """"
				|						ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент.Наименование
				|					ИНАЧЕ ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент.НаименованиеПолное, 1, 250)
				|				КОНЕЦ
				|		КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
				|			ТОГДА ВЫБОР
				|					КОГДА ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.НаименованиеПолное, 1, 250) = """"
				|						ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.Наименование
				|					ИНАЧЕ ПОДСТРОКА(ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.НаименованиеПолное, 1, 250)
				|				КОНЕЦ
				|		КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
				|			ТОГДА ВЫБОР
				|					КОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент.НаименованиеПолное, 1, 250) = """"
				|						ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент.Наименование
				|					ИНАЧЕ ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент.НаименованиеПолное, 1, 250)
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).НаименованиеПолное, 1, 250) = """"
				|					ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).Наименование
				|				ИНАЧЕ ПОДСТРОКА(ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).НаименованиеПолное, 1, 250)
				|			КОНЕЦ
				|	КОНЕЦ КАК Покупатель,
				|	ЗаписиКнигиПродаж.ДатаОплаты КАК ДатаОплаты,
				|	ЗаписиКнигиПродаж.ДокументОплаты КАК ДокументОплаты,
				|	ЗаписиКнигиПродаж.Событие КАК Событие,
// +++ввв 14.07.2016 г.
				//|	ВЫБОР
				//|		КОГДА &ПравилаПостановления735
				//|				И ЗаписиКнигиПродаж.ИсправленныйСчетФактура <> НЕОПРЕДЕЛЕНО
				//|				И ЗаписиКнигиПродаж.ИсправленныйСчетФактура ССЫЛКА Документ.КорректировкаРеализации
				//|			ТОГДА ЗаписиКнигиПродаж.ВсегоПродаж
				//|		КОГДА &ПравилаПостановления735
				//|				И ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.Валюта, &ВалютаРегУчета) = &ВалютаРегУчета
				//|			ТОГДА ВЫБОР
				//|					КОГДА ЗаписиКнигиПродаж.ВсегоПродаж < 0
				//|						ТОГДА -ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПродажВВалюте, -ЗаписиКнигиПродаж.ВсегоПродаж)
				//|					ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПродажВВалюте, ЗаписиКнигиПродаж.ВсегоПродаж)
				//|				КОНЕЦ
				//|		ИНАЧЕ ЗаписиКнигиПродаж.ВсегоПродаж
				//|	КОНЕЦ КАК ВсегоПродаж,
				|	ЗаписиКнигиПродаж.ВсегоПродаж КАК ВсегоПродаж,
// ---ввв 14.07.2016 г,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.НаАванс
				|				ИЛИ ЗаписиКнигиПродаж.НаСуммовуюРазницу
				|			ТОГДА 0
				|		ИНАЧЕ ЗаписиКнигиПродаж.СуммаБезНДС20
				|	КОНЕЦ КАК СуммаБезНДС20,
				|	ЗаписиКнигиПродаж.НДС20 КАК НДС20,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.НаАванс
				|				ИЛИ ЗаписиКнигиПродаж.НаСуммовуюРазницу
				|			ТОГДА 0
				|		ИНАЧЕ ЗаписиКнигиПродаж.СуммаБезНДС18
				|	КОНЕЦ КАК СуммаБезНДС18,
				|	ЗаписиКнигиПродаж.НДС18 КАК НДС18,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.НаАванс
				|				ИЛИ ЗаписиКнигиПродаж.НаСуммовуюРазницу
				|			ТОГДА 0
				|		ИНАЧЕ ЗаписиКнигиПродаж.СуммаБезНДС10
				|	КОНЕЦ КАК СуммаБезНДС10,
				|	ЗаписиКнигиПродаж.НДС10 КАК НДС10,
				|	ЗаписиКнигиПродаж.НДС0 КАК НДС0,
				|	ЗаписиКнигиПродаж.СуммаСовсемБезНДС КАК СуммаСовсемБезНДС,
				|	ЗаписиКнигиПродаж.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
				|	ЗаписиКнигиПродаж.Исправление КАК Исправление,
				|	ТаблицаСчетаФактурыДокументы.ДатаИсправления КАК ДатаИсправления,
				|	ТаблицаСчетаФактурыДокументы.НомерИсправления КАК НомерИсправления,
				|	ТаблицаСчетаФактурыДокументы.ДатаКорректировки КАК ДатаКорректировки,
				|	ТаблицаСчетаФактурыДокументы.НомерКорректировки КАК НомерКорректировки,
				|	ТаблицаСчетаФактурыДокументы.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
				|	ТаблицаСчетаФактурыДокументы.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
				|	ВЫБОР
				|		КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
				|					И ЗаписиКнигиПродаж.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				|				ИЛИ ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ПриходныйКассовыйОрдер
				|					И ВЫРАЗИТЬ(ЗаписиКнигиПродаж.СчетФактура КАК Документ.ПриходныйКассовыйОрдер).ВидОперации = &ПКО_РозничнаяВыручка
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ОбрабатыватьНомерДокумента, ЛОЖЬ)
				|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
				|	ЗаписиКнигиПродаж.ДатаСобытия КАК ДатаСобытия,
				|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СводныйКорректировочный, ЛОЖЬ) КАК СводныйКорректировочный,
// +++ввв 17.06.2016 г.
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ЗаписиКнигиПродаж.КодВидаОперации, """") <> """"
				|			ТОГДА ЗаписиКнигиПродаж.КодВидаОперации
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.КодВидаОперации, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.КодВидаОперации, ЕСТЬNULL(ЗаписиКнигиПродаж.КодВидаОперации, """"))) = """"
				|					ТОГДА ""01""
				|				ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.КодВидаОперации, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.КодВидаОперации, ЗаписиКнигиПродаж.КодВидаОперации))
				|			КОНЕЦ
				|	КОНЕЦ КАК КодВидаОперации,
// ---ввв 17.06.2016 г.
// +++ввв 19.10.2016 г.
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ЗаписиКнигиПродаж.КодВидаОперации, """") <> """"
				|			ТОГДА ЗаписиКнигиПродаж.КодВидаОперации
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.КодВидаОперации, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.КодВидаОперации, ЕСТЬNULL(ЗаписиКнигиПродаж.КодВидаОперации, """"))) = """"
				|					ТОГДА ""01""
				|				ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.КодВидаОперации, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура.КодВидаОперации, ЗаписиКнигиПродаж.КодВидаОперации))
				|			КОНЕЦ
				|	КОНЕЦ КАК КодВидаОперацииКласс,
// ---ввв 19.10.2016 г.
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.Валюта, &ВалютаРегУчета) <> &ВалютаРегУчета
				|			ТОГДА ТаблицаСчетаФактурыДокументы.ВалютаНаименование
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК Валюта,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.Валюта, &ВалютаРегУчета) <> &ВалютаРегУчета
				|			ТОГДА ТаблицаСчетаФактурыДокументы.ВалютаКод
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК ВалютаКод,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.Валюта, &ВалютаРегУчета) <> &ВалютаРегУчета
				|			ТОГДА ВЫБОР
				|					КОГДА ЗаписиКнигиПродаж.ВсегоПродаж < 0
				|						ТОГДА -ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПродажВВалюте, -ЗаписиКнигиПродаж.ВсегоПродаж)
				|					ИНАЧЕ ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.ВсегоПродажВВалюте, ЗаписиКнигиПродаж.ВсегоПродаж)
				|				КОНЕЦ
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ВсегоПродажВВалюте,
				|	ЗаписиКнигиПродаж.НомерДокументаОплаты КАК НомерДокументаОплаты,
				|	ЗаписиКнигиПродаж.ДатаДокументаОплаты КАК ДатаДокументаОплаты,
				|	ТаблицаСчетаФактурыДокументы.Посредник,
				|	ТаблицаСчетаФактурыДокументы.ПосредникИНН,
				|	ТаблицаСчетаФактурыДокументы.ПосредникКПП,
				|	ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СводныйКомиссионный, ЛОЖЬ) КАК СводныйКомиссионный,
// +++ввв 22.06.2016 г.
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
				|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).ВидСчетаФактуры
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
				|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).ВидСчетаФактуры
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК ФлагВидСчетаФактуры,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
// +++ввв 09.12.2016 г.
				|			ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).Исправление ИЛИ
				|				  ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).УчитыватьИсправлениеИсходногоДокумента)
// ---ввв 09.12.2016 г.
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
				|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).Исправление
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ФлагИсправление,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураВыданный
				|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураВыданный).КодВидаОперации
				|		КОГДА ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) ССЫЛКА Документ.СчетФактураПолученный
				|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент, ЕСТЬNULL(СчетаФактурыДоп.СчетФактура,ЗаписиКнигиПродаж.СчетФактура)) КАК Документ.СчетФактураПолученный).КодВидаОперации
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК КодВидаОперацииСчетФактураДокумент
				|ПОМЕСТИТЬ ВТ_ЗаписиКниги
// ---ввв 22.06.2016 г.
				|ИЗ
				|	ЗаписиКнигиПродаж КАК ЗаписиКнигиПродаж
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
				|			ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
				|			ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
				|			МИНИМУМ(ТаблицаСчетаФактурыДокументы.Приоритет) КАК МинимумПриоритет,
				|			ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре
				|		ИЗ
				|			ТаблицаСчетаФактурыДокументы КАК ТаблицаСчетаФактурыДокументы
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ТаблицаСчетаФактурыДокументы.СчетФактура,
				|			ТаблицаСчетаФактурыДокументы.ДоговорАванса,
				|			ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса,
				|			ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры,
				|			ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре) КАК Приоритеты
				|		ПО ЗаписиКнигиПродаж.СчетФактура = Приоритеты.СчетФактура
				|			И ЗаписиКнигиПродаж.ДоговорАванса = Приоритеты.ДоговорАванса
				|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = Приоритеты.СтавкаНДСАванса
				|			И ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = Приоритеты.КонтрагентПоСчетуФактуре
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетаФактурыДокументы КАК ТаблицаСчетаФактурыДокументы
				|		ПО (Приоритеты.СчетФактура = ТаблицаСчетаФактурыДокументы.СчетФактура)
				|			И (Приоритеты.МинимумПриоритет = ТаблицаСчетаФактурыДокументы.Приоритет)
				|			И (Приоритеты.ДоговорАванса = ТаблицаСчетаФактурыДокументы.ДоговорАванса)
				|			И (Приоритеты.СтавкаНДСАванса = ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса)
				|			И (Приоритеты.КонтрагентПоСчетуФактуре = ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре)
// +++ввв 08.06.2016 г.
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактуры_ДОРавноСФ КАК СчетаФактурыДоп
				|		ПО ЗаписиКнигиПродаж.СчетФактура = СчетаФактурыДоп.ДокументОснование
// ---ввв 08.06.2016 г.
				|ГДЕ
				|	ВЫБОР
				|			КОГДА &ОтбиратьПоКонтрагенту = ИСТИНА
				|				ТОГДА ВЫБОР
				|						КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
				|								И ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ОбособленноеПодразделение
				|							ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати.ГоловнойКонтрагент = &КонтрагентДляОтбора
				|						КОГДА НЕ ТаблицаСчетаФактурыДокументы.ПродавецДляПечати ЕСТЬ NULL 
				|							ТОГДА ТаблицаСчетаФактурыДокументы.ПродавецДляПечати = &КонтрагентДляОтбора
				|						КОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение
				|							ТОГДА ВЫРАЗИТЬ(ЗаписиКнигиПродаж.Контрагент КАК Справочник.Контрагенты).ГоловнойКонтрагент = &КонтрагентДляОтбора
				|						ИНАЧЕ ЗаписиКнигиПродаж.Контрагент = &КонтрагентДляОтбора
				|					КОНЕЦ
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ";
				
		Если НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме И СтруктураПараметров.ОтбиратьПоКонтрагенту И
			СтруктураПараметров.КонтрагентДляОтбора.ЭтоГруппа Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, " = &КонтрагентДляОтбора", " В ИЕРАРХИИ(&КонтрагентДляОтбора)");
		КонецЕсли;
		
// ---ввв 22.06.2016 г.
		Запрос.Выполнить();
// +++ввв 23.06.2016 г.
		КлассификаторСлучаев=ПолучитьКлассификаторСлучаев(Запрос,""+Перечисления.ttk_ТипыРазделовНДС.Продажи);
// ---ввв 23.06.2016 г.
		Для йЭтап=СтруктураПараметров.ЗаполнятьРаздел89СУровнемПроверки По 3 Цикл
			Запрос.Текст = 
				"ВЫБРАТЬ
// +++ввв 21.07.2016 г.
			// +++ в итоге требуется удалить
				//|	ЗаписиКнигиПродаж.СчетФактура.абс_ДатаСФ КАК kmw_СчетФактура_абс_ДатаСФ,
				//|	ЗаписиКнигиПродаж.СчетФактура.Дата КАК kmw_СчетФактура_Дата,
//				|	ЗаписиКнигиПродаж.kmw_СчетФактураДокумент_абс_ДатаСФ КАК kmw_СчетФактураДокумент_абс_ДатаСФ,
//				|	ЗаписиКнигиПродаж.kmw_СчетФактураДокумент_Дата КАК kmw_СчетФактураДокумент_Дата,
//				|	ЗаписиКнигиПродаж.kmwСчетФактураДата КАК kmwСчетФактураДата,
//				|	ЗаписиКнигиПродаж.kmwСчетФактураНомер КАК kmwСчетФактураНомер,
//				|	ЗаписиКнигиПродаж.kmwСчетФактураДокументДатаВходящегоДокумента КАК kmwСчетФактураДокументДатаВходящегоДокумента,
//				|	ЗаписиКнигиПродаж.kmwСчетФактураДокументНомерВходящегоДокумента КАК kmwСчетФактураДокументНомерВходящегоДокумента,
//				|	ЗаписиКнигиПродаж.kmwСчетФактураДокументДатаПлатежноРасчетногоДокумента КАК kmwСчетФактураДокументДатаПлатежноРасчетногоДокумента,
//				|	ЗаписиКнигиПродаж.kmwСчетФактураДокументНомерПлатежноРасчетногоДокумента КАК kmwСчетФактураДокументНомерПлатежноРасчетногоДокумента,
			// --- в итоге требуется удалить	
// ---ввв 21.07.2016 г.
				|	ЗаписиКнигиПродаж.Организация КАК Организация,
				|	ЗаписиКнигиПродаж.НалоговыйПериод КАК НалоговыйПериод,
				|	ЗаписиКнигиПродаж.НаАванс КАК НаАванс,
				|	ЗаписиКнигиПродаж.НаСуммовуюРазницу КАК НаСуммовуюРазницу,
				|	ЗаписиКнигиПродаж.СчетФактураДата КАК СчетФактураДата,
				|	ЗаписиКнигиПродаж.НомерСчетаФактурыСортировка,
				|	ЗаписиКнигиПродаж.ДатаСчетаФактурыСортировка,
				|	ЗаписиКнигиПродаж.КодВидаОперации,
// +++ввв над этим работает классификатор начало
				|	ЗаписиКнигиПродаж.СчетФактура,
				|	ЗаписиКнигиПродаж.СчетФактураДокумент,
				|	ЗаписиКнигиПродаж.КодВидаОперацииКласс,
				|	ЗаписиКнигиПродаж.КодВидаОперацииСчетФактураДокумент,
				|	ЗаписиКнигиПродаж.НомерСчетаФактуры КАК НомерСчетаФактуры,
				|	ЗаписиКнигиПродаж.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
				|	ЗаписиКнигиПродаж.ДатаИсправления КАК ДатаИсправления,
				|	ЗаписиКнигиПродаж.НомерИсправления КАК НомерИсправления,
				|	ЗаписиКнигиПродаж.ДатаКорректировки КАК ДатаКорректировки,
				|	ЗаписиКнигиПродаж.НомерКорректировки КАК НомерКорректировки,
				|	ЗаписиКнигиПродаж.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
				|	ЗаписиКнигиПродаж.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
				|	ЗаписиКнигиПродаж.НомерДокументаОплаты КАК НомерДокументаОплаты,
				|	ЗаписиКнигиПродаж.ДатаДокументаОплаты КАК ДатаДокументаОплаты,
// ---+ввв над этим работает классификатор конец
				|	ЗаписиКнигиПродаж.СтавкаНДС_Аванс,
				|	ЗаписиКнигиПродаж.ДоговорАванса,
				|	ЗаписиКнигиПродаж.Контрагент,
				|	ЗаписиКнигиПродаж.ПокупательИНН,
				|	ЗаписиКнигиПродаж.ПокупательКПП,
				|	ЗаписиКнигиПродаж.Покупатель,
				|	ЗаписиКнигиПродаж.ДатаОплаты,
				|	ЗаписиКнигиПродаж.ДокументОплаты,
				|	ЗаписиКнигиПродаж.Событие,
				|	ЗаписиКнигиПродаж.ВсегоПродаж,
				|	ЗаписиКнигиПродаж.СуммаБезНДС20,
				|	ЗаписиКнигиПродаж.НДС20,
				|	ЗаписиКнигиПродаж.СуммаБезНДС18,
				|	ЗаписиКнигиПродаж.НДС18,
				|	ЗаписиКнигиПродаж.СуммаБезНДС10,
				|	ЗаписиКнигиПродаж.НДС10,
				|	ЗаписиКнигиПродаж.НДС0,
				|	ЗаписиКнигиПродаж.СуммаСовсемБезНДС,
				|	ЗаписиКнигиПродаж.ИсправленныйСчетФактура,
				|	ЗаписиКнигиПродаж.Исправление,
				|	ЗаписиКнигиПродаж.ОбрабатыватьНомерДокумента,
				|	ЗаписиКнигиПродаж.ДатаСобытия,
				|	ЗаписиКнигиПродаж.СводныйКорректировочный,
				|	ЗаписиКнигиПродаж.Валюта,
				|	ЗаписиКнигиПродаж.ВалютаКод,
				|	ЗаписиКнигиПродаж.ВсегоПродажВВалюте,
				|	ЗаписиКнигиПродаж.Посредник,
				|	ЗаписиКнигиПродаж.ПосредникИНН,
				|	ЗаписиКнигиПродаж.ПосредникКПП,
				|	ЗаписиКнигиПродаж.СводныйКомиссионный,
				|	&ФлагОшибка КАК ОшибкаУчета
				|ИЗ
				|	ВТ_ЗаписиКниги КАК ЗаписиКнигиПродаж
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлассификаторСлучаев КАК ВТ_КС
				|	ПО ВТ_КС.КодВидаОперации = ЗаписиКнигиПродаж.КодВидаОперации И
				|	   ВТ_КС.КодВидаОперацииСчетФактураДокумент = ЗаписиКнигиПродаж.КодВидаОперацииСчетФактураДокумент И
				|	   ВТ_КС.ТипДокументаОснования = ТИПЗНАЧЕНИЯ(ЗаписиКнигиПродаж.СчетФактура) И
				|	   ВТ_КС.ТипСчетаФактуры = ТИПЗНАЧЕНИЯ(ЗаписиКнигиПродаж.СчетФактураДокумент) И
				|	   ВТ_КС.ВидСчетаФактуры = ЗаписиКнигиПродаж.ФлагВидСчетаФактуры И
				|	   ВТ_КС.Исправление = ЗаписиКнигиПродаж.ФлагИсправление
				|ГДЕ
				|	ИСТИНА
				|УПОРЯДОЧИТЬ ПО
				|	НалоговыйПериод,
				|	ДатаСчетаФактурыСортировка,
				|	НомерСчетаФактурыСортировка,
				|	ЗаписиКнигиПродаж.Исправление";
// +++ввв 23.06.2016 г.
			ПрименитьКлассификаторСлучаев(КлассификаторСлучаев, Запрос,""+Перечисления.ttk_ТипыРазделовНДС.Продажи);
// ---ввв 23.06.2016 г.
// +++ввв 01.06.2016 г.
			Если йЭтап=1 Тогда
		// поиск ошибок Классификации
				Запрос.УстановитьПараметр("ФлагОшибка","Ошибка учёта");
// +++ввв 23.06.2016 г.
	    		Запрос.Текст=СтрЗаменить(Запрос.Текст, "
				|ГДЕ
				|	ИСТИНА", "
				|ГДЕ
				|	ВТ_КС.Ошибка <= ЗаписиКнигиПродаж.ДатаСчетаФактуры");
// ---ввв 23.06.2016 г.
			ИначеЕсли йЭтап=2 Тогда
	    // поиск несогласованных случаев
				Запрос.УстановитьПараметр("ФлагОшибка","Не согласовано");
// +++ввв 23.06.2016 г.
	    		Запрос.Текст=СтрЗаменить(Запрос.Текст, "
				|ГДЕ
				|	ИСТИНА", "
				|ГДЕ
				|	НЕ ВТ_КС.Согласован");
// ---ввв 23.06.2016 г.
			Иначе
				Запрос.УстановитьПараметр("ФлагОшибка","");
			КонецЕсли;
// ---ввв 31.05.2016 г.                                                                        
			Если НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме И СтруктураПараметров.ОтбиратьПоКонтрагенту И
				СтруктураПараметров.КонтрагентДляОтбора.ЭтоГруппа Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "УПОРЯДОЧИТЬ ПО", "УПОРЯДОЧИТЬ ПО Покупатель, ");
			КонецЕсли;
			ТЗ_ДляРС=Запрос.Выполнить().Выгрузить();
			Если ТЗ_ДляРС.Количество()>0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
// ---ввв 22.06.2016 г.

		НаборЗаписей = РегистрыСведений.ttk_ДанныеНДС.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Организация.Установить(СтруктураПараметров.Организация);
// +++ввв 23.06.2016 г.
		НаборЗаписей.Отбор.ЖурналУчета.Установить(""+Перечисления.ttk_ТипыРазделовНДС.Продажи);
// ---ввв 23.06.2016 г.
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Организация 	= СтруктураПараметров.Организация; 
// +++ввв 23.06.2016 г.
		НоваяЗапись.ЖурналУчета 	= ""+Перечисления.ttk_ТипыРазделовНДС.Продажи; 
// ---ввв 23.06.2016 г.
		НоваяЗапись.ТаблицаНДС 		= Новый ХранилищеЗначения(ТЗ_ДляРС); 
		НаборЗаписей.Записать(); 
		
	КонецЕсли;
				
			// Теперь добавляем итоги , необходимые для декларации НДС
			
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ";
	Запрос.УстановитьПараметр("ТЗ", ТЗ_ДляРС);
	Запрос.Выполнить();
	
// +++ввв 17.06.2016 г.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура
		|ИЗ
		|	ТЗ КАК ЗаписиКнигиПродаж";
	СписокСчетовФактур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетФактура");
// ---ввв 17.06.2016 г.
				
	Запрос.Текст = "
			|ВЫБРАТЬ
			|	*,
			|	ТЗ.НомерСчетаФактурыСортировка КАК НомерСчетаФактурыСортировка,
			|	ТЗ.ДатаСчетаФактурыСортировка КАК ДатаСчетаФактурыСортировка,
			|	ТЗ.Контрагент КАК Контрагент,
			|	ТЗ.Покупатель КАК Покупатель,
			|	ТЗ.ДатаОплаты КАК ДатаОплаты,
			|	ТЗ.ВсегоПродаж КАК ВсегоПродаж,
			|	ТЗ.СуммаБезНДС20 КАК СуммаБезНДС20,
			|	ТЗ.НДС20 КАК НДС20,
			|	ТЗ.СуммаБезНДС18 КАК СуммаБезНДС18,
			|	ТЗ.НДС18 КАК НДС18,
			|	ТЗ.СуммаБезНДС10 КАК СуммаБезНДС10,
			|	ТЗ.НДС10 КАК НДС10,
			|	ТЗ.НДС0 КАК НДС0,
			|	ТЗ.СуммаСовсемБезНДС КАК СуммаСовсемБезНДС,
			|	ТЗ.СводныйКорректировочный КАК СводныйКорректировочный,
			|	ТЗ.НомерДокументаОплаты КАК НомерДокументаОплаты,
			|	ТЗ.ДатаДокументаОплаты КАК ДатаДокументаОплаты,
			|	ТЗ.СводныйКомиссионный КАК СводныйКомиссионный,
			|	ТЗ.НалоговыйПериод КАК НалоговыйПериод,
			|	ТЗ.СчетФактураДокумент КАК СчетФактураДокумент,
			|	ТЗ.ДоговорАванса КАК ДоговорАванса,
			|	ТЗ.Исправление КАК Исправление
			|ИЗ
			|	ТЗ КАК ТЗ
			|ИТОГИ
			|	МИНИМУМ(НомерСчетаФактурыСортировка),
			|	МИНИМУМ(ДатаСчетаФактурыСортировка),
			|	МАКСИМУМ(Контрагент),
			|	МАКСИМУМ(Покупатель),
			|	МАКСИМУМ(ДатаОплаты),
// +++ввв 17.06.2016 г.
			//|	ВЫБОР
			//|		КОГДА &ПравилаПостановления735
			//|			ТОГДА МАКСИМУМ(ВсегоПродаж)
			//|		ИНАЧЕ СУММА(ВсегоПродаж)
			//|	КОНЕЦ КАК ВсегоПродаж,
			|	СУММА(ВсегоПродаж),
// ---ввв 17.06.2016 г.
			|	СУММА(СуммаБезНДС20),
			|	СУММА(НДС20),
			|	СУММА(СуммаБезНДС18),
			|	СУММА(НДС18),
			|	СУММА(СуммаБезНДС10),
			|	СУММА(НДС10),
			|	СУММА(НДС0),
			|	СУММА(СуммаСовсемБезНДС),
			|	МАКСИМУМ(СводныйКорректировочный),
			|	МАКСИМУМ(НомерДокументаОплаты),
			|	МАКСИМУМ(ДатаДокументаОплаты),
			|	МАКСИМУМ(СводныйКомиссионный)
			|ПО
			|	ОБЩИЕ,
			|	НалоговыйПериод,
			|	СчетФактураДокумент,
			|	ДоговорАванса,
			|	Исправление";
			// Запись в регистр сведений *** ---------------

			
	// {{KM WARE Агапов Н.А. Заявка №34425 08.10.2015 начало
	//Если СтруктураПараметров.ГруппироватьПоКонтрагентам И Не СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО
				   |	ОБЩИЕ,", "ПО
				   |	ОБЩИЕ, Контрагент, ");
	//КонецЕсли;
	// }}KM WARE Агапов Н.А. Заявка №34425 08.10.2015 окончание
							
// +++ввв 20.03.2016 г.
// +++ввв 31.03.2016 г.
	РезультатЗапроса=Запрос.Выполнить();
// +++ввв 01.04.2016 г.
	Запрос.МенеджерВременныхТаблиц.Закрыть();
// ---ввв 01.04.2016 г.
	Возврат РезультатЗапроса;
// ---ввв 31.03.2016 г.
// ---ввв 20.03.2016 г.
КонецФункции
// }}KM WARE Агапов Н.А. Заявка №34425 09.10.2015 окончание

Процедура ПолучитьСчетаФактурыДокументыКнигаПродаж(Запрос) Экспорт
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ОтчетОРозничныхПродажах.Ссылка КАК СчетФактура,
	|	ОтчетОРозничныхПродажах.Номер КАК НомерСчетаФактуры,
	|	ОтчетОРозничныхПродажах.Дата КАК ДатаСчетаФактуры,
	|	ОтчетОРозничныхПродажах.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	1 КАК Приоритет,
	|	NULL КАК Ссылка,
	|	NULL КАК Контрагент,
	|	0 КАК НомерСтроки,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный
	|ПОМЕСТИТЬ ВТ_СчетаФактурыДокументыПромежуточная
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Проведен
	|	И ОтчетОРозничныхПродажах.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Номер,
	|	ПриходныйКассовыйОрдер.Дата,
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	2,
	|	NULL,
	|	NULL,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен
	|	И ПриходныйКассовыйОрдер.ВидОперации = &ПКО_РозничнаяВыручка
	|	И ПриходныйКассовыйОрдер.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА (СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|				ИЛИ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент))
	|				И (СчетФактураВыданный.Ссылка.Исправление
	|					ИЛИ СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|			ТОГДА СчетФактураВыданный.Ссылка
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию)
	|				И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|			ТОГДА ВЫБОР
	|					КОГДА СчетФактураВыданный.Ссылка.Контрагент = СчетФактураВыданный.ДокументОснование.Контрагент
	|						ТОГДА СчетФактураВыданный.ДокументОснование
	|					ИНАЧЕ СчетФактураВыданный.Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ СчетФактураВыданный.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Дата
	|	КОНЕЦ,
	|	СчетФактураВыданный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаСуммовуюРазницу)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|			ТОГДА ЕСТЬNULL(Авансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаСуммовуюРазницу)
	|			ТОГДА СчетФактураВыданный.Ссылка.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|				И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА НЕ(СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию)
	|					ИЛИ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаСуммовуюРазницу)
	|					ИЛИ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный))
	|			ТОГДА СчетФактураВыданный.Ссылка.ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	3,
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.Ссылка.Контрагент,
	|	СчетФактураВыданный.НомерСтроки,
	|	СчетФактураВыданный.Ссылка.СводныйКорректировочный,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ПО СчетФактураВыданный.Ссылка = Авансы.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Ссылка.Проведен
	|	И СчетФактураВыданный.Ссылка.Организация В(&Организация)
	|	И НЕ СчетФактураВыданный.Ссылка.СводныйКомиссионный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураВыданный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Дата
	|	КОНЕЦ,
	|	СчетФактураВыданный.Ссылка,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|				И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА НЕ(СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию)
	|					ИЛИ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаСуммовуюРазницу)
	|					ИЛИ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный))
	|			ТОГДА СчетФактураВыданный.Ссылка.ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	3,
	|	СчетФактураВыданный.Ссылка,
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахПокупатели.Покупатель, СчетФактураВыданный.Ссылка.Контрагент),
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахПокупатели.НомерСтроки, СчетФактураВыданный.НомерСтроки),
	|	СчетФактураВыданный.Ссылка.СводныйКорректировочный,
	|	ИСТИНА
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО СчетФактураВыданный.ДокументОснование = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|			И СчетФактураВыданный.Ссылка = ОтчетКомиссионераОПродажахПокупатели.СчетФактура
	|ГДЕ
	|	СчетФактураВыданный.Ссылка.Проведен
	|	И СчетФактураВыданный.Ссылка.Организация В(&Организация)
	|	И СчетФактураВыданный.Ссылка.СводныйКомиссионный
	|	И НЕ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Авансы.Ссылка,
	|	Авансы.Ссылка.Номер,
	|	Авансы.Ссылка.Дата,
	|	Авансы.Ссылка,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	Авансы.СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	3,
	|	Авансы.Ссылка,
	|	Авансы.Контрагент,
	|	Авансы.НомерСтроки,
	|	Авансы.Ссылка.СводныйКорректировочный,
	|	ИСТИНА
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК Авансы
	|ГДЕ
	|	Авансы.Ссылка.Проведен
	|	И Авансы.Ссылка.Организация В(&Организация)
	|	И Авансы.Ссылка.СводныйКомиссионный
	|	И Авансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				И СчетФактураПолученный.Ссылка.Исправление
	|			ТОГДА СчетФактураПолученный.Ссылка
	|		ИНАЧЕ СчетФактураПолученный.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.Ссылка.НомерВходящегоДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СчетФактураПолученный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента
	|	КОНЕЦ,
	|	СчетФактураПолученный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА ЕСТЬNULL(Авансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА СчетФактураПолученный.Ссылка.ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	5,
	|	СчетФактураПолученный.Ссылка,
	|	СчетФактураПолученный.Ссылка.Контрагент,
	|	СчетФактураПолученный.НомерСтроки,
	|	СчетФактураПолученный.Ссылка.СводныйКорректировочный,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.Авансы КАК Авансы
	|		ПО СчетФактураПолученный.Ссылка = Авансы.Ссылка
	|ГДЕ
	|	СчетФактураПолученный.Ссылка.Проведен
	|	И СчетФактураПолученный.Ссылка.Организация В(&Организация)
	|	И НЕ СчетФактураПолученный.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|	И НЕ СчетФактураПолученный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГТДИмпорт.Ссылка,
	|	ГТДИмпорт.НомерГТД,
	|	ГТДИмпорт.Дата,
	|	ГТДИмпорт.Ссылка,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	6,
	|	NULL,
	|	ГТДИмпорт.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ГТДИмпорт КАК ГТДИмпорт
	|ГДЕ
	|	ГТДИмпорт.Проведен
	|	И ГТДИмпорт.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ВозвратТоваровОтПокупателя.НомерРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.ДатаРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	6,
	|	NULL,
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.Проведен
//	|	И НЕ ВозвратТоваровОтПокупателя.ПометкаУдаления
	|	И ВозвратТоваровОтПокупателя.Организация В(&Организация)
	|	И ВозвратТоваровОтПокупателя.НомерРасходногоКассовогоОрдера <> """"
	|	И ВозвратТоваровОтПокупателя.ДатаРасходногоКассовогоОрдера <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
//	|	СтавкаНДСАванса,
	|	ДоговорАванса
//	,
//	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПродаж.СчетФактура,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДатаСчетаФактуры, ЗаписиКнигиПродаж.СчетФактура.Дата) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.НомерСчетаФактуры, ЗаписиКнигиПродаж.СчетФактура.Номер) КАК НомерСчетаФактуры,
	|	СчетаФактурыДокументы.СчетФактураДокумент,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДоговорАванса, НЕОПРЕДЕЛЕНО) КАК ДоговорАванса,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СтавкаНДСАванса, НЕОПРЕДЕЛЕНО) КАК СтавкаНДСАванса,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Приоритет, 8) КАК Приоритет,
	|	СчетаФактурыДокументы.Ссылка КАК Ссылка,
	|	СчетаФактурыДокументы.НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре,
	|	СчетаФактурыДокументы.СводныйКомиссионный,
// +++ввв 14.06.2016 г.
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный ТОГДА 
	|			ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(СчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураВыданный).КодВидаОперации="""" ТОГДА
	|					ВЫБОР
	|						КОГДА ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре В (&АгрегатныеКонтры) ТОГДА ""26""
	|						ИНАЧЕ ЗаписиКнигиПродаж.КодВидаОперации
	|					КОНЕЦ
	|				ИНАЧЕ ВЫРАЗИТЬ(СчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураВыданный).КодВидаОперации
	|			КОНЕЦ
	|		КОГДА СчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный ТОГДА
	|			ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(СчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураПолученный).КодВидаОперации="""" ТОГДА
	|					ВЫБОР
	|						КОГДА ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре В (&АгрегатныеКонтры) ТОГДА ""26""
	|						ИНАЧЕ ЗаписиКнигиПродаж.КодВидаОперации
	|					КОНЕЦ
	|				ИНАЧЕ ВЫРАЗИТЬ(СчетаФактурыДокументы.СчетФактураДокумент КАК Документ.СчетФактураПолученный).КодВидаОперации
	|			КОНЕЦ
	|		КОГДА ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре ССЫЛКА Справочник.Контрагенты ТОГДА 
	|			ВЫБОР
	|				КОГДА ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре В (&АгрегатныеКонтры) ТОГДА ""26""
	|				ИНАЧЕ ""01""
	|			КОНЕЦ
	|		ИНАЧЕ ЗаписиКнигиПродаж.КодВидаОперации
	|	КОНЕЦ КАК КодВидаОперации,
// ---ввв 14.06.2016 г.
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И СчетаФактурыДокументы.СчетФактура.абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаполненПродавец
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ЗаписиКнигиПродаж КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыДокументыПромежуточная КАК СчетаФактурыДокументы
	|		ПО ЗаписиКнигиПродаж.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = СчетаФактурыДокументы.СтавкаНДСАванса
	|			И ЗаписиКнигиПродаж.ДоговорАванса = СчетаФактурыДокументы.ДоговорАванса
	|			И (ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = ЕСТЬNULL(СчетаФактурыДокументы.Контрагент, ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре))
// {{KM WARE Семенов И.С. Заявка № 18.07.2015 начало
// оптимизация
	|индексировать по СчетаФактурыДокументы.Ссылка,СчетаФактурыДокументы.НомерСтроки;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналУчетаСчетовФактур.Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура,
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры,
// +++ввв 14.06.2016 г.
//	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|					ТОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).Номер
	|				ИНАЧЕ ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры
	|			КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры
	|	КОНЕЦ КАК НомерКорректировочногоСчетаФактуры,
//	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
	|			ВЫБОР
	|				КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры=ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|					ТОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).Дата
	|				ИНАЧЕ ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|			КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|	КОНЕЦ КАК ДатаКорректировочногоСчетаФактуры,
// ---ввв 14.06.2016 г.
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура.абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.Контрагент
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.Контрагент
	|	КОНЕЦ КАК ПродавецДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура.абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.Контрагент.ИНН
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.Контрагент.ИНН
	|	КОНЕЦ КАК ИННПродавцаДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура.абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.СчетФактура.Контрагент.КПП
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.Контрагент.КПП
	|	КОНЕЦ КАК КПППродавцаДляПечати,
	|	ЖурналУчетаСчетовФактур.ИндексСтроки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).СводныйКомиссионный
	|				И НЕ ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|			ТОГДА ЖурналУчетаСчетовФактур.ИндексСтроки
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.НомерСтроки
	|	КОНЕЦ КАК НомерСтроки,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаНаименование,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналУчетаСчетовФактур.СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.Корректировочный)
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПродажВВалюте,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЖурналУчетаСчетовФактур.Посредник.НаименованиеПолное, 1, 250) = """"
	|			ТОГДА ЖурналУчетаСчетовФактур.Посредник.Наименование
	|		ИНАЧЕ ПОДСТРОКА(ЖурналУчетаСчетовФактур.Посредник.НаименованиеПолное, 1, 250)
	|	КОНЕЦ КАК Посредник,
	|	ЖурналУчетаСчетовФактур.Посредник.ИНН КАК ПосредникИНН,
	|	ЖурналУчетаСчетовФактур.Посредник.КПП КАК ПосредникКПП,
	|	ЖурналУчетаСчетовФактур.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.СчетФактура.абс_Продавец <> ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаполненПродавец
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.СчетФактура В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.Ссылка
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|индексировать по ЖурналУчетаСчетовФактур.СчетФактура,ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).СводныйКомиссионный
	|				И НЕ ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаАванс)
	|			ТОГДА ЖурналУчетаСчетовФактур.ИндексСтроки
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.НомерСтроки
	|	КОНЕЦ;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
// +++ввв 09.03.2016 г.
	|	ВЫБОР
	|		КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный ТОГДА
	|			ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.абс_ДатаСФ,ВТ_РегистрацияСчетовФактур.СчетФактура.Дата)
	|		ИНАЧЕ
	|			ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры,ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактуры,
// ---ввв 09.03.2016 г.
	//|	ЕСТЬNULL(ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры) КАК НомерСчетаФактуры, - Малыгин 19.01.2016
	// {{KM WARE Малыгин П.К. Заявка № 7714660 - пункт 4 19.01.2016 начало
	|	ВЫБОР
	|		КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВТ_РегистрацияСчетовФактур.СчетФактура.ДокументОснование ССЫЛКА Документ.ОтражениеРеализацииТоваровИУслугНДС
	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры)
	|	КОНЕЦ КАК НомерСчетаФактуры,
	// }}KM WARE Малыгин П.К. Заявка № 7714660 - пункт 4 19.01.2016 окончание 
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.Приоритет КАК Приоритет,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = ""26""
	|			ТОГДА ИСТИНА
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.Ссылка ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL 
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ВТ_РегистрацияСчетовФактур.ПродавецДляПечати,
	|	ВТ_РегистрацияСчетовФактур.ИННПродавцаДляПечати КАК ИННПродавцаДляПечати,
	|	ВТ_РегистрацияСчетовФактур.КПППродавцаДляПечати КАК КПППродавцаДляПечати,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = """"
	|			ТОГДА ВТ_РегистрацияСчетовФактур.КодВидаОперации
	|		ИНАЧЕ ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|	КОНЕЦ КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах) = ИСТИНА
	|				И ВТ_РегистрацияСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ВсегоПродажВВалюте
	|	КОНЕЦ КАК ВсегоПродажВВалюте,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах) = ИСТИНА
	|			ТОГДА &ВалютаРегУчета
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах) = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаНаименованиеПолное
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ВалютаНаименование
	|	КОНЕЦ КАК ВалютаНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах) = ИСТИНА
	|			ТОГДА &ВалютаРегУчетаКод
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ВалютаКод
	|	КОНЕЦ КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ЗаполненПродавец, ВТ_ТаблицаСчетаФактурыДокументы.ЗаполненПродавец) = ИСТИНА
	|			ТОГДА ВТ_РегистрацияСчетовФактур.СчетФактура.абс_Продавец
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.абс_Продавец.ПустаяСсылка)
	|	КОНЕЦ КАК Посредник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ЗаполненПродавец, ВТ_ТаблицаСчетаФактурыДокументы.ЗаполненПродавец) = ИСТИНА
	|			ТОГДА ВТ_РегистрацияСчетовФактур.СчетФактура.абс_Продавец.ИНН
	|	КОНЕЦ КАК ПосредникИНН,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ЗаполненПродавец, ВТ_ТаблицаСчетаФактурыДокументы.ЗаполненПродавец) = ИСТИНА
	|			ТОГДА ВТ_РегистрацияСчетовФактур.СчетФактура.абс_Продавец.КПП
	|	КОНЕЦ КАК ПосредникКПП,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.Ссылка = ВТ_РегистрацияСчетовФактур.СчетФактура
	|			И ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки
	|индексировать по ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура,ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса";

	Запрос.Выполнить();
	
КонецПроцедуры // ПолучитьСчетаФактурыДокументыКнигаПродаж

Процедура УстановитьПараметрыЗапросаКнигиПродаж(Запрос, СтруктураПараметров) Экспорт
	
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(СтруктураПараметров.КонецПериода));
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.СписокОрганизаций);
	Запрос.УстановитьПараметр("ОтбиратьПоКонтрагенту", 
		НЕ СтруктураПараметров.СформироватьОтчетПоСтандартнойФорме И СтруктураПараметров.ОтбиратьПоКонтрагенту);
	Запрос.УстановитьПараметр("КонтрагентДляОтбора", СтруктураПараметров.КонтрагентДляОтбора);
	Запрос.УстановитьПараметр("ВыводитьПродавцовПоАвансам", СтруктураПараметров.ВыводитьПродавцовПоАвансам);
	Запрос.УстановитьПараметр("ВалютаРегУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	//АБС
	Запрос.УстановитьПараметр("ВалютаРегУчетаКод","643");		
	Запрос.УстановитьПараметр("ВалютаРегУчетаНаименованиеПолное", "Российский рубль");
	//\\АБС

	
	ДатаПроверкиПараметровУчета ='00010101';
	ЗаполнениеДокументовОтчетности = СтруктураПараметров.ЗаполнениеДокумента ИЛИ СтруктураПараметров.ЗаполнениеДекларации;

	Если ЗаполнениеДокументовОтчетности И СтруктураПараметров.ЗаписьДополнительногоЛиста Тогда
		Запрос.УстановитьПараметр("НачалоНалоговогоПериода", СтруктураПараметров.НачалоНалоговогоПериода); 
		Запрос.УстановитьПараметр("КонецНалоговогоПериода", КонецДня(СтруктураПараметров.КонецНалоговогоПериода));
		ДатаПроверкиПараметровУчета = СтруктураПараметров.КонецНалоговогоПериода;
	Иначе
		ДатаПроверкиПараметровУчета = СтруктураПараметров.КонецПериода;
	КонецЕсли;
	
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(
		ДатаПроверкиПараметровУчета, Ложь, СтруктураПараметров.Организация, "регл");
	ПрименяетсяОсвобождениеОтУплатыНДС = УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС;
	Запрос.УстановитьПараметр("ПравилаПостановления735", 
		УчетНДС.ВерсияПостановленияНДС1137(ДатаПроверкиПараметровУчета) = 3);
	ОтражатьРеализацииБезНДС = ДатаПроверкиПараметровУчета < '20141001' ИЛИ ПрименяетсяОсвобождениеОтУплатыНДС;
	Запрос.УстановитьПараметр("ОтражатьРеализацииБезНДС", ОтражатьРеализацииБезНДС);
	
	СтавкиНДС20 = Новый Массив();
	СтавкиНДС20.Добавить(Перечисления.СтавкиНДС.НДС20);
	СтавкиНДС20.Добавить(Перечисления.СтавкиНДС.НДС20_120);
	
	СтавкиНДС18 = Новый Массив();
	СтавкиНДС18.Добавить(Перечисления.СтавкиНДС.НДС18);
	СтавкиНДС18.Добавить(Перечисления.СтавкиНДС.НДС18_118);
	
	СтавкиНДС10 = Новый Массив();
	СтавкиНДС10.Добавить(Перечисления.СтавкиНДС.НДС10);
	СтавкиНДС10.Добавить(Перечисления.СтавкиНДС.НДС10_110);
	
	СтавкаНДС0 = Перечисления.СтавкиНДС.НДС0;
	СтавкаБезНДС = Перечисления.СтавкиНДС.БезНДС;
	
	Запрос.УстановитьПараметр("СтавкиНДС20", СтавкиНДС20);
	Запрос.УстановитьПараметр("СтавкиНДС18", СтавкиНДС18);
	Запрос.УстановитьПараметр("СтавкиНДС10", СтавкиНДС10);
	Запрос.УстановитьПараметр("СтавкаНДС0", СтавкаНДС0);
	Запрос.УстановитьПараметр("СтавкаБезНДС", СтавкаБезНДС);
	
	ВидыЦенностей_СобственныеСФ = Новый Массив;
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.ВнутреннееПотребление);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества);
	ВидыЦенностей_СобственныеСФ.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);

	Запрос.УстановитьПараметр("ВидыЦенностей_СобственныеСФ", ВидыЦенностей_СобственныеСФ);
	
	ВидыЦенностей_Аванс = Новый Массив;
	ВидыЦенностей_Аванс.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностей_Аванс.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ВидыЦенностей_Аванс.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);
	ВидыЦенностей_Аванс.Добавить(Перечисления.ВидыЦенностей.АвансыВыданные);
	
	Запрос.УстановитьПараметр("ВидыЦенностей_Аванс", ВидыЦенностей_Аванс);
	
	ВидыЦенностей_АвансСобственные = Новый Массив;
	ВидыЦенностей_АвансСобственные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностей_АвансСобственные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ВидыЦенностей_АвансСобственные.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);
	
	Запрос.УстановитьПараметр("ВидыЦенностей_АвансСобственные", ВидыЦенностей_АвансСобственные);
	
	ВидыЦенностей_СуммоваяРазница = Новый Массив;
	ВидыЦенностей_СуммоваяРазница.Добавить(Перечисления.ВидыЦенностей.СуммыСвязанныеСРасчетамиПоОплате);
	Запрос.УстановитьПараметр("ВидыЦенностей_СуммоваяРазница", ВидыЦенностей_СуммоваяРазница);
	
	МассивДокументовИсправлений = Новый Массив;
	МассивДокументовИсправлений.Добавить(Неопределено);
	
	ТипыДокументовИсправлений	= Метаданные.РегистрыНакопления.НДСЗаписиКнигиПродаж.Измерения.ИсправленныйСчетФактура.Тип;
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		
		Если ТипыДокументовИсправлений.СодержитТип(Тип("ДокументСсылка." + МетаданныеДокумента.Имя)) Тогда
			МассивДокументовИсправлений.Добавить(Документы[МетаданныеДокумента.Имя].ПустаяСсылка());
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ПустыеДокументыИсправления", МассивДокументовИсправлений);
	
	Запрос.УстановитьПараметр("ПКО_РозничнаяВыручка", Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка);

// +++ввв 19.03.2016 г.
	АгрегатныеКонтры = Новый Массив();
	АгрегатныеКонтры.Добавить(Справочники.Контрагенты.НайтиПоКоду("K020971"));
	АгрегатныеКонтры.Добавить(Справочники.Контрагенты.НайтиПоКоду("K007280"));
	
	Запрос.УстановитьПараметр("АгрегатныеКонтры", АгрегатныеКонтры);
// ---ввв 19.03.2016 г.
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////
//  КОД ВИДА ОПЕРАЦИИ


Процедура ЗаполнитьКод_ВычетПоПриобретеннымЦенностям(ВычетПоПриобретеннымЦенностям) Экспорт
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Возврат;		
	КонецЕсли;
	
	Счет_1905 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("19.05");
	
	Для Каждого строка из ВычетПоПриобретеннымЦенностям Цикл 
		// {{KM WARE Малыгин П.К. Заявка № 34911 15.10.2015 начало
		// Исправление ошибок
		// {{Старый код:
		//// {{KM WARE Агапов Н.А. Заявка №34510 13.10.2015 начало
		//ПроверкаКодаВидаОперации = ВозвратКодаВидаОперации(строка.СчетФактура.Услуги);
		//// }}KM WARE Агапов Н.А. Заявка №34940 13.10.2015 окончание	
		// }}Новый код:
		Попытка
			ПроверкаКодаВидаОперации = ВозвратКодаВидаОперации(строка.СчетФактура.Услуги);
		Исключение
			ПроверкаКодаВидаОперации = "Нет табличной части услуги";
		КонецПопытки;
		// }}KM WARE Малыгин П.К. Заявка № 34911 15.10.2015 окончание 
		
		
		Если строка.ВидЦенности = Перечисления.ВидыЦенностей.КомандировочныеРасходы И строка.КодВидаОперации <> "23" Тогда 
			строка.КодВидаОперации = "23";
		ИначеЕсли строка.ВидЦенности = Перечисления.ВидыЦенностей.ОбъектыНезавершенногоСтроительства И строка.КодВидаОперации <> "13" Тогда 
			строка.КодВидаОперации = "13";
		ИначеЕсли строка.ВидЦенности = Перечисления.ВидыЦенностей.СМРПодрядные И строка.КодВидаОперации <> "13" Тогда 
			строка.КодВидаОперации = "13";
		ИначеЕсли строка.СчетУчетаНДС = Счет_1905 И строка.КодВидаОперации <> "20" Тогда 
			строка.КодВидаОперации = "20";	
		КонецЕсли;
		
		// {{KM WARE Агапов Н.А. Заявка №34510 13.10.2015 начало
		Если ПроверкаКодаВидаОперации = "найден" Тогда
			строка.КодВидаОперации = "01";
		КонецЕсли;
		// }}KM WARE Агапов Н.А. Заявка №34510 13.10.2015 окончание	
			
		// {{KM WARE Агапов Н.А. Заявка №34043 13.10.2015 начало
		Продавец = ПроверитьПродавца(строка.СчетФактура);
		Если значениеЗаполнено(Продавец) тогда
			строка.Поставщик = Продавец;
			строка.КодВидаОперации = "04"; 
		КонецЕсли;
		// }}KM WARE Агапов Н.А. Заявка №34043 13.10.2015 окончание
	КонецЦикла;
		
КонецПроцедуры

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Агапов Н.А. Заявка № 30.09.2015 начало
Функция ВозвратКодаВидаОперации(ДокументыОснования)
	Для каждого строка из ДокументыОснования цикл 
		Если СокрЛП(строка.СтатьяЗатрат) = СокрЛП(справочники.СтатьиЗатрат.НайтиПоНаименованию("Услуги агентов, связанные с организацией командировок")) тогда
    		ПроверкаКодаВидаОперации = "найден";
		КонецЕсли;
	КонецЦикла;

	возврат ПроверкаКодаВидаОперации;
КонецФункции // ВозвратКодаВидаОперации() }}KM WARE Агапов Н.А. Заявка №34510 13.10.2015 окончание


// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Агапов Н.А. Заявка №34043 13.10.2015 начало
Функция ПроверитьПродавца(ДокументОснование)
	Запрос = новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураПолученный.абс_Продавец
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	
    выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() цикл
		Продавец = выборка.абс_Продавец;	
	КонецЦикла;
	
	возврат Продавец;
КонецФункции // ПроверитьПродавца() }}KM WARE Агапов Н.А. Заявка №34043 13.10.2015 окончание

Процедура ЗаполнитьКод_ВычетСПолученныхАвансов(НДСсАвансов) Экспорт
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Возврат;		
	КонецЕсли;
	
	// {{ТТК Сладков А. Заявка №7748183  07.10.2016 начало
	
	//НДСсАвансов.ЗаполнитьЗначения("22", "КодВидаОперации");	
	Для каждого Строка Из НДСсАвансов Цикл
		
		Если Строка.Покупатель.абс_ТипыКонтрагентов=Справочники.абс_ТипыКонтрагентов.ФизическиеЛица Тогда
			
			
			Строка.КодВидаОперации="26";
			
		Иначе
			
			Строка.КодВидаОперации="22";

		КонецЕсли;
		
	КонецЦикла;
	// }}ТТК Сладков А. Заявка №7748183  07.10.2016 окончание	
		
КонецПроцедуры

Процедура ЗапонлитьКод_Реализация(Реализация, Организация, Дата) Экспорт
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Возврат;		
	КонецЕсли;
		
	ГруппаСтроительсвто = Справочники.НоменклатурныеГруппы.НайтиПоКоду("Строительство13");
	ЗаполнятьПоСМР = ЗначениеЗаполнено(ГруппаСтроительсвто); 
	
	ЮрЛицо = Справочники.Контрагенты.НайтиПоКоду("K020971");
	ЗаполнятьПоЮрлицу = ЗначениеЗаполнено(ЮрЛицо); 
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТЗ.СчетФактура
	               |ПОМЕСТИТЬ ТаблицаРеализаций
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаРеализаций.СчетФактура
	               |ПОМЕСТИТЬ ВТ_Строительсвто
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРеализаций КАК ТаблицаРеализаций
	               |		ПО РеализацияТоваровУслугТовары.Ссылка = ТаблицаРеализаций.СчетФактура
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ЗаполнятьПоСМР
	               |				ТОГДА РеализацияТоваровУслугТовары.СубконтоБУ В ИЕРАРХИИ (&Строительство)
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаРеализаций.СчетФактура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаРеализаций.СчетФактура
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРеализаций КАК ТаблицаРеализаций
	               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ТаблицаРеализаций.СчетФактура
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ЗаполнятьПоСМР
	               |				ТОГДА РеализацияТоваровУслугУслуги.СубконтоБУ В ИЕРАРХИИ (&Строительство)
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаРеализаций.СчетФактура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаРеализаций.СчетФактура,
	               |	ВЫБОР
	               |		КОГДА ВТ_Строительсвто.СчетФактура ЕСТЬ НЕ NULL 
	               |			ТОГДА ""13""
	               |		ИНАЧЕ ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка.КодВидаОперации, """")
	               |	КОНЕЦ КАК КодВидаОперации
	               |ИЗ
	               |	ТаблицаРеализаций КАК ТаблицаРеализаций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	               |		ПО ТаблицаРеализаций.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Строительсвто КАК ВТ_Строительсвто
	               |		ПО ТаблицаРеализаций.СчетФактура = ВТ_Строительсвто.СчетФактура";
				   
	Запрос.УстановитьПараметр("Строительство", 	ГруппаСтроительсвто);			   	
    Запрос.УстановитьПараметр("ТЗ", 			Реализация.Скопировать(, "СчетФактура"));			   	
	Запрос.УстановитьПараметр("ЗаполнятьПоСМР", ЗаполнятьПоСМР);			   	
	
	ТаблицаКодов = Запрос.Выполнить().Выгрузить();
		
	Для Каждого строка из Реализация Цикл 		
		
		Если ТипЗнч(строка.СчетФактура) = Тип("ДокументСсылка.РеализацияТоваровУслуг")Тогда
			
			Если ТипЗнч(строка.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда 
				Если строка.Покупатель.абс_ТипыКонтрагентов = Справочники.абс_ТипыКонтрагентов.ФизическиеЛица И строка.КодВидаОперации <> "26" Тогда  
					строка.КодВидаОперации = "26";
				КонецЕсли;
			КонецЕсли;
						
		КонецЕсли;
		
		Если ЗаполнятьПоЮрлицу И строка.Покупатель = ЮрЛицо И строка.КодВидаОперации <> "26" Тогда  
			строка.КодВидаОперации = "26";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(строка.КодВидаОперации) Тогда 
			строкаТаблицыКодов = ТаблицаКодов.Найти(строка.СчетФактура);
			Если строкаТаблицыКодов <> Неопределено Тогда 
				строка.КодВидаОперации = строкаТаблицыКодов.КодВидаОперации;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
 
Процедура ЗаполнитьКод_Авансы(Авансы) Экспорт
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Возврат;		
	КонецЕсли;
	
	// {{ТТК Сладков А. Заявка №7748183  07.10.2016 начало

	//Авансы.ЗаполнитьЗначения("02", "КодВидаОперации");
	Для каждого Строка Из Авансы Цикл
		
		Если Строка.Покупатель.абс_ТипыКонтрагентов=Справочники.абс_ТипыКонтрагентов.ФизическиеЛица Тогда
			
			
			Строка.КодВидаОперации="26";
			
		Иначе
			
			Строка.КодВидаОперации="02";

		КонецЕсли;
		
	КонецЦикла;
	// }}ТТК Сладков А. Заявка №7748183  07.10.2016 окончание	
	
КонецПроцедуры

Процедура ЗаполнитьКод_ВычетНДСПоНалоговомуАгенту(ВычетНДСПоНалоговомуАгенту) Экспорт
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Возврат;		
	КонецЕсли;
	
	ВычетНДСПоНалоговомуАгенту.ЗаполнитьЗначения("06", "КодВидаОперации");

КонецПроцедуры

Процедура ЗаполнитьКод_ВосстановленПоАвансам(ВосстановленПоАвансам) Экспорт
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Возврат;		
	КонецЕсли;
	
	ВосстановленПоАвансам.ЗаполнитьЗначения("21", "КодВидаОперации");

КонецПроцедуры


//////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС 


Функция ПолучитьМассивФилиалов(Организация) Экспорт
	
	МассивФилиалов = Новый Массив;
	Запрос = новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                        |	Организации.Ссылка
	                        |ИЗ
	                        |	Справочник.Организации КАК Организации
	                        |ГДЕ
	                        |	НЕ Организации.ПометкаУдаления
	                        |	И Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация
	                        |	И Организации.абс_СтатусОрганизации = &абс_СтатусОрганизации");
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",		Организация);	
	Запрос.УстановитьПараметр("абс_СтатусОрганизации",	Перечисления.абс_СтатусОрганизации.Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		МассивФилиалов.Добавить(Выборка.Ссылка);		
	КонецЦикла;
	
	Возврат МассивФилиалов; 

КонецФункции

Функция Удалить_ОпределитьДатуИНомерСФ(ЗаписьКниги, СтруктураПараметров) Экспорт
	
	ПрефиксыРИБиОрганизации = ОбщегоНазначения.СформироватьМассивПрефиксовДляРИБИОрганизации(СтруктураПараметров.Организация);
	
	ВариантыПредставленияСчетаФактуры = Новый Структура("ДатаНомер,НомерДата,Дата,Номер", "", "", "", "");
	
	Если НЕ ЗначениеЗаполнено(ЗаписьКниги.СчетФактура) Тогда
		Возврат ВариантыПредставленияСчетаФактуры;
	КонецЕсли;
	
// +++ввв 21.07.2016 г.
	Если ЗначениеЗаполнено(ЗаписьКниги.ДатаСчетаФактуры) И ЗначениеЗаполнено(ЗаписьКниги.НомерСчетаФактуры) Тогда
		ДатаСФ	= Формат(ЗаписьКниги.ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");
		НомерСФ = СокрЛП(ЗаписьКниги.НомерСчетаФактуры);
	КонецЕсли;
	
	// {{KM WARE Малыгин П.К. Заявка № 7714660 18.01.2016 начало
	// 
//	Если ТипЗнч(ЗаписьКниги.СчетФактураДокумент)=тип("ДокументСсылка.СчетФактураВыданный") И ЗаписьКниги.СчетФактураДокумент.Исправление  Тогда
//		
//			ДатаСФ	= Формат(ЗаписьКниги.СчетФактураДокумент.ДатаИсходногоДокумента, "ДФ=dd.MM.yyyy");
//			НомерСФ = СокрЛП(ЗаписьКниги.СчетФактураДокумент.НомерИсходногоДокумента);			
//		
//	Иначе	
//	// }}KM WARE Малыгин П.К. Заявка № 7714660 18.01.2016 окончание

//	
//	Иначе
//		
//		ДатаНомер = "";
//// {{KM WARE Семенов И.С. Заявка № 24.07.2015 начало    
//// отвратительно! но хоть как то вытащить номер счета фактура до договорам переноски
//		Нашли=ложь;
//		
//		если (ЗаписьКниги.КодВидаОперации="02") и типзнч(ЗаписьКниги.СчетФактура)=тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") тогда
//			если ЗначениеЗаполнено(ЗаписьКниги.СчетФактура.абс_ДокументОснование) тогда
//				зп=новый запрос("выбрать разрешенные первые 1 Ссылка,Номер,Дата из документ.СчетФактураВыданный где ДокументОснование=&ДокОснование и Проведен");
//				зп.УстановитьПараметр("ДокОснование",ЗаписьКниги.СчетФактура.абс_ДокументОснование);
//				рз=зп.Выполнить().Выбрать();
//				если рз.Следующий() тогда
//					ДатаСФ  = Формат(рз.Дата, "ДФ=dd.MM.yyyy");
//					НомерСФ = СокрЛП(рз.Номер);
//					Нашли=истина;
//				конецесли;
//			конецесли;
//		конецесли;
//// }}KM WARE Семенов И.С. Заявка № 24.07.2015 окончание
//		если НЕ Нашли тогда
//// {{KM WARE Лазаревский К.В. Заявка №  18.08.2015 начало
////Вылет при формировании
////Старый код
//			//ДатаСФ  = Формат(ЗаписьКниги.kmwСчетФактураДата, "ДФ=dd.MM.yyyy");
//			//НомерСФ = СокрЛП(ЗаписьКниги.kmwСчетФактураНомер);
////Новый код
//			ДатаСФ  = Формат(ЗаписьКниги.СчетФактураДата, "ДФ=dd.MM.yyyy");
//			
//			НомерСФ = СокрЛП(ЗаписьКниги.СчетФактураДокумент.Номер);
//			
//// }}KM WARE Лазаревский К.В. Заявка № 24.07.2015 окончание
//		//Если ТипЗнч(ЗаписьКниги.СчетФактура) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
//		//	ДатаСФ  = Формат(ЗаписьКниги.СчетФактура.Дата, "ДФ=dd.MM.yyyy");
//		//	НомерСФ = СокрЛП(ЗаписьКниги.СчетФактура.Номер);
//		//ИначеЕсли ТипЗнч(ЗаписьКниги.СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
//		//	ДатаСФ  = Формат(ЗаписьКниги.СчетФактураДокумент.Дата, "ДФ=dd.MM.yyyy");
//		//	НомерСФ = СокрЛП(ЗаписьКниги.СчетФактура.Номер);
//		//ИначеЕсли ТипЗнч(ЗаписьКниги.СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
//		//	ДатаСФ  = Формат(ЗаписьКниги.СчетФактураДокумент.Дата, "ДФ=dd.MM.yyyy");
//		//	НомерСФ = СокрЛП(ЗаписьКниги.СчетФактура.Номер);
//		//	
//		//Иначе
//		//	ДатаСФ =  Формат(ЗаписьКниги.СчетФактура.Дата, "ДФ=dd.MM.yyyy");
//		//	НомерСФ = СокрЛП(ЗаписьКниги.СчетФактура.Номер);
//		//КонецЕсли;
//		конецесли;
//	КонецЕсли;
//	
//// {{KM WARE Малыгин П.К. Заявка № 34379 25.12.2015 начало
//// 
//// {{KM WARE Семенов И.С. Заявка № ... 14.01.2016 начало
//// оптимизация скорости
////Если ТипЗнч(ЗаписьКниги.СчетФактура) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
//	// {{KM WARE Малыгин П.К. Заявка № 7714660 18.01.2016 начало
//	// 
//	// {{Старый код:
////	//Если kwr_ОбщиеСерверКлиентПовтИсп.Регистрысведений_kwr_УстановкаДатыСФ_ПроверкаДаты(ЗаписьКниги.kmw_СчетФактура_абс_ДатаСФ,ЗаписьКниги.Организация) = истина тогда
////	// }}Новый код:
////	Если ЗначениеЗаполнено(ЗаписьКниги.kmw_СчетФактура_абс_ДатаСФ) И kwr_ОбщиеСерверКлиентПовтИсп.Регистрысведений_kwr_УстановкаДатыСФ_ПроверкаДаты(ЗаписьКниги.kmw_СчетФактура_абс_ДатаСФ,ЗаписьКниги.Организация) = истина тогда
////		// }}KM WARE Малыгин П.К. Заявка № 7714660 18.01.2016 окончание 
////		ДатаСФ = "" + Формат(ЗаписьКниги.kmw_СчетФактура_абс_ДатаСФ, "ДФ=dd.MM.yyyy");
////	иначе
////		ДатаСФ = "" + Формат(ЗаписьКниги.kmw_СчетФактура_Дата, "ДФ=dd.MM.yyyy");
////	КонецЕсли;
//	
////ИначеЕсли ТипЗнч(ЗаписьКниги.СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
////	// {{KM WARE Малыгин П.К. Заявка № 7714660 18.01.2016 начало
////	// 
////	// {{Старый код:
////	//Если kwr_ОбщиеСерверКлиентПовтИсп.Регистрысведений_kwr_УстановкаДатыСФ_ПроверкаДаты(ЗаписьКниги.kmw_СчетФактураДокумент_абс_ДатаСФ,ЗаписьКниги.Организация)=истина тогда
////	// }}Новый код:
////	Если ЗначениеЗаполнено(ЗаписьКниги.kmw_СчетФактураДокумент_абс_ДатаСФ) И kwr_ОбщиеСерверКлиентПовтИсп.Регистрысведений_kwr_УстановкаДатыСФ_ПроверкаДаты(ЗаписьКниги.kmw_СчетФактураДокумент_абс_ДатаСФ,ЗаписьКниги.Организация)=истина тогда
////		// }}KM WARE Малыгин П.К. Заявка № 7714660 18.01.2016 окончание	
////		ДатаСФ = "" + Формат(ЗаписьКниги.kmw_СчетФактураДокумент_абс_ДатаСФ, "ДФ=dd.MM.yyyy");
////	иначе
////		ДатаСФ = "" + Формат(ЗаписьКниги.kmw_СчетФактураДокумент_Дата, "ДФ=dd.MM.yyyy");
////	КонецЕсли;
//	
//КонецЕсли;
////	// }}KM WARE Семенов И.С. Заявка № ... 14.01.2016 окончание
//// }}KM WARE Малыгин П.К. Заявка № 34379 25.12.2015 окончание		

//// {{KM WARE Малыгин П.К. Заявка № 18.01.2016 начало
//КонецЕсли;
//// }}KM WARE Малыгин П.К. Заявка № 18.01.2016 окончание
//	
//	
// ---ввв 21.07.2016 г.
	
	ВариантыПредставленияСчетаФактуры.ДатаНомер = "" + ДатаСФ + ?(ЗначениеЗаполнено(ДатаСФ), ";", "") + НомерСФ;
	ВариантыПредставленияСчетаФактуры.НомерДата = "" + НомерСФ + ?(ЗначениеЗаполнено(НомерСФ), ";", "") + ДатаСФ;
	
	ВариантыПредставленияСчетаФактуры.Номер = НомерСФ;
	ВариантыПредставленияСчетаФактуры.Дата = ДатаСФ;
	
	Возврат ВариантыПредставленияСчетаФактуры;
	
КонецФункции

Процедура ЗаполнитьОтчетНДСФормаОтчета2015Кв1_Раздел7(Контейнер, Запрос) Экспорт 
	
	Если Контейнер.Свойство("Раздел7") Тогда		
		Раздел7 = Контейнер.Раздел7;	
	Иначе
		Контейнер.Вставить("Раздел7", Новый Структура());
		Раздел7 = Контейнер.Раздел7; 
	КонецЕсли;
	
	Если НЕ абс_НастройкиСистемы.ФункционалДоступен("НДС2015") Тогда
		Возврат;		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ЛьготаПоНДСОбороты.ЛьготаПоНДС.Код КАК П000700000101,
	|	абс_ЛьготаПоНДСОбороты.СуммаБезНДСОборот КАК П000700000102
	|ИЗ
	|	РегистрНакопления.абс_ЛьготаПоНДС.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация В (&Организация)
	|				И ЛьготаПоНДС.Код <> ""-"") КАК абс_ЛьготаПоНДСОбороты";
	
	ТаблицаРаздел7 = Запрос.Выполнить().Выгрузить();
	Раздел7.Вставить("ТаблицаРаздел7", ТаблицаРаздел7);
		
КонецПроцедуры


