
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	итогоПроцент = 0;
	Для Каждого ТекСтрокаМенеджеры Из Менеджеры Цикл
		// регистр zsttk_МенеджерыПоЗаказам 
		итогоПроцент = итогоПроцент +  ТекСтрокаМенеджеры.Процент;
	КонецЦикла;
	
	Если итогоПроцент > 100 Тогда
		сообщить("Сумма % всех менеджеров, не может превышать 100%");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	Движение = Движения.zsttk_МенеджерыПоЗаказам.Добавить();
	Движение.Период = Дата;
	Движение.ЗаказПокупателя = ЗаказПокупателя;
	Движение.ПроцентМенеджерам = ПроцентМенеджерам;
		
		
	//Для Каждого ТекСтрокаМенеджеры Из Менеджеры Цикл
	//	// регистр zsttk_МенеджерыПоЗаказам 
	//	Движение = Движения.zsttk_МенеджерыПоЗаказам.Добавить();
	//	Движение.Период = Дата;
	//	Движение.ЗаказПокупателя = ЗаказПокупателя;
	//	Движение.ПроцентМенеджерам = ПроцентМенеджерам;
	//	//Движение.РаспределениеПоМенеджерам = ЭтотОбъект;
	//	
	//	
	//	//Движение.Менеджер = ТекСтрокаМенеджеры.Менеджер;
	//	//Движение.Процент = ТекСтрокаМенеджеры.Процент;
	//КонецЦикла;
	// записываем движения регистров
	Движения.zsttk_МенеджерыПоЗаказам.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
