Процедура НайтиОбъектыПоИсполнителю() Экспорт
	
	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("МенятьОтветственного"		, МенятьОтветственного);
	Запрос.УстановитьПараметр("МенятьКуратора"				, МенятьКуратора);
	
	Запрос.УстановитьПараметр("абс_Куратор"					, СтарыйИсполнитель);
	Запрос.УстановитьПараметр("абс_Ответственный"			, абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(СтарыйИсполнитель));
	
	Запрос.Текст = "ВЫБРАТЬ
	                |	Контрагенты.Ссылка КАК Объект,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеКонтрагентов) КАК ТипБизнесПроцесса,
	                |	1 КАК Колво
	                |ИЗ
	                |	Справочник.Контрагенты КАК Контрагенты
	                |ГДЕ
	                |	(&МенятьОтветственного
	                |				И Контрагенты.абс_Ответственный В (&абс_Ответственный)
	                |			ИЛИ &МенятьКуратора
	                |				И Контрагенты.абс_Куратор В (&абс_Куратор))
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ДоговорыПоКураторам.Ссылка,
	                |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеДоговоров)),
	                |	1
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		ДоговорыКонтрагентовабс_Кураторы.Ссылка КАК Ссылка,
	                |		ДоговорыКонтрагентовабс_Кураторы.Куратор КАК Куратор,
	                |		ДоговорыКонтрагентовабс_Кураторы.Ссылка.абс_Ответственный КАК абс_Ответственный
	                |	ИЗ
	                |		Справочник.ДоговорыКонтрагентов.абс_Кураторы КАК ДоговорыКонтрагентовабс_Кураторы
	                |	ГДЕ
	                |		(&МенятьОтветственного
	                |					И ДоговорыКонтрагентовабс_Кураторы.Ссылка.абс_Ответственный В (&абс_Ответственный)
	                |				ИЛИ &МенятьКуратора
	                |					И ДоговорыКонтрагентовабс_Кураторы.Куратор В (&абс_Куратор))) КАК ДоговорыПоКураторам
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ДоговорыПоКураторам.Ссылка
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсСогласованиеКонтрагентов.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеКонтрагентов),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсСогласованиеКонтрагентов КАК абсСогласованиеКонтрагентов
	                |ГДЕ
	                |	абсСогласованиеКонтрагентов.Завершен = ЛОЖЬ
	                |	И абсСогласованиеКонтрагентов.ПользовательИнициаторБП В(&абс_Ответственный)
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсЗавершениеОтношенийСКонтрагентами.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеКонтрагентов),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсЗавершениеОтношенийСКонтрагентами КАК абсЗавершениеОтношенийСКонтрагентами
	                |ГДЕ
	                |	абсЗавершениеОтношенийСКонтрагентами.ПользовательИнициаторБП В(&абс_Ответственный)
	                |	И абсЗавершениеОтношенийСКонтрагентами.Завершен = ЛОЖЬ
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсПереутверждениеКонтрагентов.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеКонтрагентов),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсПереутверждениеКонтрагентов КАК абсПереутверждениеКонтрагентов
	                |ГДЕ
	                |	абсПереутверждениеКонтрагентов.ПользовательИнициаторБП В(&абс_Ответственный)
	                |	И абсПереутверждениеКонтрагентов.Завершен = ЛОЖЬ
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсСогласованиеДоговоров.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеДоговоров),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсСогласованиеДоговоров КАК абсСогласованиеДоговоров
	                |ГДЕ
	                |	абсСогласованиеДоговоров.ПользовательИнициаторБП В(&абс_Ответственный)
	                |	И абсСогласованиеДоговоров.Завершен = ЛОЖЬ
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсЗакрытиеДоговоров.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеДоговоров),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсЗакрытиеДоговоров КАК абсЗакрытиеДоговоров
	                |ГДЕ
	                |	абсЗакрытиеДоговоров.ПользовательИнициаторБП В(&абс_Ответственный)
	                |	И абсЗакрытиеДоговоров.Завершен = ЛОЖЬ
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсСогласованиеЗакупочногоЗаказа.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеЗакупочныхЗаказов),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсСогласованиеЗакупочногоЗаказа КАК абсСогласованиеЗакупочногоЗаказа
	                |ГДЕ
	                |	абсСогласованиеЗакупочногоЗаказа.ПользовательИнициаторБП В(&абс_Ответственный)
	                |	И абсСогласованиеЗакупочногоЗаказа.Завершен = ЛОЖЬ
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсСогласованиеСчетаНаОплату.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеСчетовНаОплату),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсСогласованиеСчетаНаОплату КАК абсСогласованиеСчетаНаОплату
	                |ГДЕ
	                |	абсСогласованиеСчетаНаОплату.ПользовательИнициаторБП В(&абс_Ответственный)
	                |	И абсСогласованиеСчетаНаОплату.Завершен = ЛОЖЬ
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсУточнениеСчетаНаОплату.Ссылка,
	                |	ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеСчетовНаОплату),
	                |	1
	                |ИЗ
	                |	БизнесПроцесс.абсУточнениеСчетаНаОплату КАК абсУточнениеСчетаНаОплату
	                |ГДЕ
	                |	абсУточнениеСчетаНаОплату.ПользовательИнициаторБП В(&абс_Ответственный)
	                |	И абсУточнениеСчетаНаОплату.Завершен = ЛОЖЬ
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	абсЗадачаДоговора.Ссылка,
	                |	ВЫБОР
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсСогласованиеДоговоров
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеДоговоров)
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсСогласованиеКонтрагентов
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеКонтрагентов)
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсЗакрытиеДоговоров
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.Согласованиедоговоров)
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсЗавершениеОтношенийСКонтрагентами
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеКонтрагентов)
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсПереутверждениеКонтрагентов
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеКонтрагентов)
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсСогласованиеЗакупочногоЗаказа
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеЗакупочныхЗаказов)
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсСогласованиеСчетаНаОплату
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиеСчетовНаОплату)
	                |		КОГДА абсЗадачаДоговора.БизнесПроцесс ССЫЛКА БизнесПроцесс.абсУточнениеСчетаНаОплату
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.СогласованиесчетовнаОплату)
	                |	КОНЕЦ,
	                |	1
	                |ИЗ
	                |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	                |ГДЕ
	                |	абсЗадачаДоговора.Выполнена = ЛОЖЬ";	
				   
				   
				   
	ВыгрузкаЗапроса = Запрос.Выполнить().Выгрузить();
				   
	ТаблицаОбъектовИсполнителя.Загрузить(ВыгрузкаЗапроса);
	
	ВыгрузкаЗапроса.Свернуть("ТипБизнесПроцесса", "Колво");
	
	ТаблицаБизнесПроцессов.Загрузить(ВыгрузкаЗапроса);
	
КонецПроцедуры

Процедура СменитьИсполнителя() Экспорт
	
	СписокБП = ТаблицаБизнесПроцессов.НайтиСтроки(Новый Структура("Использование", Истина));
	
	СтарыйПользователь 	= абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(СтарыйИсполнитель);
	СтарыйСотрудник		= СтарыйИсполнитель;
	
	НовыйПользователь 	= абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(НовыйИсполнитель);
	НовыйСотрудник 		= НовыйИсполнитель;
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаБП Из СписокБП Цикл
		ОбъектыПоБП = ТаблицаОбъектовИсполнителя.НайтиСтроки(
			Новый Структура("ТипБизнесПроцесса", СтрокаБП.ТипБизнесПроцесса));
			
		Для Каждого СтрокаОбъекта Из ОбъектыПоБП Цикл
			ОбъектСсылка = СтрокаОбъекта.Объект;
			
			Объект = ОбъектСсылка.ПолучитьОбъект();
			
			ОбъектИзменен = Ложь;
			
			ТипОбъекта = ТипЗнч(Объект);
			
			Сообщить(">" + Объект);
			
			Если ТипОбъекта = Тип("СправочникОбъект.Контрагенты") Тогда
				
				Если МенятьОтветственного И Объект.абс_Ответственный = СтарыйПользователь Тогда
					Объект.абс_Ответственный = НовыйПользователь;
					ОбъектИзменен = Истина;
				КонецЕсли;
				
				Если МенятьКуратора И Объект.абс_Куратор = СтарыйСотрудник Тогда
					Объект.абс_Куратор = НовыйСотрудник;
					ОбъектИзменен = Истина;
				КонецЕсли;
				
			ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
				
				Если МенятьОтветственного И Объект.абс_Ответственный = СтарыйПользователь Тогда
					Объект.абс_Ответственный = НовыйПользователь;
					ОбъектИзменен = Истина;
				КонецЕсли;
				
				Если МенятьКуратора Тогда
					Для Каждого СтрокаКуратор Из Объект.абс_Кураторы Цикл
						Если СтрокаКуратор.Куратор = СтарыйСотрудник Тогда
							СтрокаКуратор.Куратор = НовыйСотрудник;
							ОбъектИзменен = Истина;
						КонецЕсли;					
					КонецЦикла;
				КонецЕсли;	
				
			ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.абс_ЗакупочныйЗаказ") Тогда
				
				Если МенятьОтветственного И Объект.Ответственный = СтарыйПользователь Тогда
					Объект.Ответственный = НовыйПользователь;
					ОбъектИзменен = Истина;
				КонецЕсли;
				
			ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.абс_СчетНаОплату") Тогда
				
				Если МенятьОтветственного И Объект.Ответственный = СтарыйПользователь Тогда
					Объект.Ответственный = НовыйПользователь;
					ОбъектИзменен = Истина;
				КонецЕсли;
			
			ИначеЕсли МенятьОтветственного И ТипОбъекта = Тип("ЗадачаОбъект.абсЗадачаДоговора") Тогда
				
				Если Объект.Исполнитель = СтарыйПользователь Тогда
					Объект.Исполнитель = НовыйПользователь;
					ОбъектИзменен = Истина;
				КонецЕсли;
				
			ИначеЕсли МенятьОтветственного И Найти(Строка(ТипОбъекта), "Бизнес-процесс объект") > 0 Тогда
				
				Если ТипОбъекта = Тип("БизнесПроцессОбъект.абсСогласованиеДоговоров") Тогда
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;
					
					Если Объект.СотрудникДопСогласование = СтарыйСотрудник Тогда
						Объект.СотрудникДопСогласование = НовыйСотрудник;
						ОбъектИмзенен = Истина;
					КонецЕсли;
					
				ИначеЕсли ТипОбъекта = Тип("БизнесПроцессОбъект.абсЗакрытиеДоговоров") Тогда
					
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;					
					
				ИначеЕсли ТипОбъекта = Тип("БизнесПроцессОбъект.абсСогласованиеКонтрагентов") Тогда
					
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;					
					
				ИначеЕсли ТипОбъекта = Тип("БизнесПроцессОбъект.абсЗавершениеОтношенийСКонтрагентами") Тогда
					
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;					
					
				ИначеЕсли ТипОбъекта = Тип("БизнесПроцессОбъект.абсПереутверждениеКонтрагентов") Тогда
					
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;				
					
				ИначеЕсли ТипОбъекта = Тип("БизнесПроцессОбъект.абсСогласованиеЗакупочногоЗаказа") Тогда
					
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;					
					
				ИначеЕсли ТипОбъекта = Тип("БизнесПроцессОбъект.абсСогласованиеСчетаНаОплату") Тогда
					
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;					
					
				ИначеЕсли ТипОбъекта = Тип("БизнесПроцессОбъект.абсУточнениеСчетаНаОплату") Тогда
					
					Если Объект.ПользовательИнициаторБП = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторБП = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;				
					
					Если Объект.ПользовательИнициаторСогласования = СтарыйПользователь Тогда
						Объект.ПользовательИнициаторСогласования = НовыйПользователь;
						ОбъектИзменен = Истина;
					КонецЕсли;
					
			
				КонецЕсли;
			КонецЕсли;
			
			Если ОбъектИзменен = Истина Тогда
				Попытка 
					Объект.Записать();
					
					Сообщить("Обновлен объект: " + Объект + ".");
				Исключение
					Сообщить("Ошибка при записи объекта: " + Объект + ".");
					ОтменитьТранзакцию();
				КонецПопытки;				
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
