
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Оплаты.Итог("СуммаОплаты");

КонецПроцедуры

 
Функция ВыполнитьПодключение() Экспорт
	
	РезультатПодключения = Неопределено;
	
	Попытка
		
		#Если Клиент Тогда
		Состояние("Идет процесс соединения ...");
		#КонецЕсли
	
		СтрокаПодключения = "Provider="+СокрЛП(Provider)+"; Password="+СокрЛП(Password)+"; User ID="+СокрЛП(UserID)+"; Initial Catalog="+СокрЛП(InitialCatalog)+"; Data Source="+СокрЛП(DataSource)+"";
		
		Connection = Новый COMОбъект("ADODB.Connection");
		Connection.Open(СтрокаПодключения);
		
		#Если Клиент Тогда
		Состояние("Соединение установлено");
		#КонецЕсли		
			
	Исключение
		
		СтрокаСообщенияОбОшибке = "При попытке соединения с COM-сервером произошла следующая ошибка:" + Символы.ПС 
						+ ОписаниеОшибки();
		#Если Клиент Тогда
			Сообщить(СтрокаСообщенияОбОшибке, СтатусСообщения.Важное);
		    Состояние("Соединение установить не удалось");
			Состояние();
		#КонецЕсли
							
		Возврат Неопределено; 
		
	КонецПопытки;
	
	Возврат Connection;
	
КонецФункции



Функция ExecSQL(sSql)
	
	Connect= Новый COMОбъект("ADODB.Connection");
	//rs = Новый COMОбъект("ADODB.Recordset");		
	Connect.Provider = "sqloledb";
	
	Попытка 
		Connect.Open("Data Source=10.7.0.22;Initial Catalog=INSIDE;", "sa", "sql_user");
//		Connect.Open("Password=sql_user; User ID=sa; Initial Catalog=INSIDE; Data Source=BETA");
		Connect.execute(sSQL);
		Connect=Null;	
		возврат Истина;
	Исключение
		Инфо = ИнформацияОбОшибке ();
		Сообщить("Описание='" + Инфо.Описание + "'");
		Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
		Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
		Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");

		Сообщить("Не удалось подключиться к SQL серверу");
		Возврат Ложь;
	КонецПопытки;	
		
	
КонецФункции



