&НаСервере
Процедура ПрочитатьТЧБюджетСервер()
	
	ТЧ_Бюджет.Очистить();
	
	Для Каждого СтрокаБюджета Из Объект.Бюджет Цикл
		
		ИндексКолонки = Прав("0" + Месяц(СтрокаБюджета.Период), 2);
		
		СтруктураАналитик = ПолучитьСтруктуруАналитик(СтрокаБюджета);
		
		СтрокиТЧБюджет = ТЧ_Бюджет.НайтиСтроки(СтруктураАналитик);
		
		Если СтрокиТЧБюджет.Количество() = 0 Тогда
			СтрокаТЧБюджет = ТЧ_Бюджет.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧБюджет, СтруктураАналитик);
		Иначе
			СтрокаТЧБюджет = СтрокиТЧБюджет[0];
		КонецЕсли;
		
		СтрокаТЧБюджет["СуммаРуб" + ИндексКолонки] = СтрокаБюджета.СуммаРуб;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТЧБюджетСервер()
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруАналитик(СтрокаБюджета)
	
	СтруктураАналитик = Новый Структура;
	
	СтруктураАналитик.Вставить("Организация"			, СтрокаБюджета.Организация);
	СтруктураАналитик.Вставить("ЦФУ"					, СтрокаБюджета.ЦФУ);
	СтруктураАналитик.Вставить("ЦФО"					, СтрокаБюджета.ЦФО);
	СтруктураАналитик.Вставить("ТипРасхода"				, СтрокаБюджета.ТипРасходаНаПроизводствоИРеализацию);
	СтруктураАналитик.Вставить("ТипКонтрагента"			, СтрокаБюджета.ТипКонтрагента);
	СтруктураАналитик.Вставить("ТипСети"				, СтрокаБюджета.ТипСети);
	СтруктураАналитик.Вставить("КВ"						, СтрокаБюджета.КВ);
	СтруктураАналитик.Вставить("ТЭО"					, СтрокаБюджета.ТЭО);
	СтруктураАналитик.Вставить("БюджетнаяСтатья"		, СтрокаБюджета.БюджетнаяСтатья);
	
	СтруктураАналитик.Вставить("Валюта"					, СтрокаБюджета.Валюта);
	
	Возврат СтруктураАналитик;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрочитатьТЧБюджетСервер();
	
КонецПроцедуры

