
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	//	Список.Отбор,
	//	"Ссылка",
	//	Параметры.Отбор,
	//	ВидСравненияКомпоновкиДанных.НеВСписке
	//);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РезультатВыбора = Неопределено;
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		РезультатВыбора = ТД.Ссылка;
	КонецЕсли;
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры
