&НаСервере
Процедура ПолучитьСписокДокументов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_РаспределяемыеДоходыРасходыДоходы.Ссылка КАК Документ
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	Документ.абс_РаспределяемыеДоходыРасходы.Доходы КАК абс_РаспределяемыеДоходыРасходыДоходы
	|ГДЕ
	|	абс_РаспределяемыеДоходыРасходыДоходы.Филиал = &Филиал
	|	И абс_РаспределяемыеДоходыРасходыДоходы.Ссылка.НомерДляПечати = &НомерДляПечати
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_РаспределяемыеДоходыРасходыРасходы.Ссылка
	|ИЗ
	|	Документ.абс_РаспределяемыеДоходыРасходы.Расходы КАК абс_РаспределяемыеДоходыРасходыРасходы
	|ГДЕ
	|	абс_РаспределяемыеДоходыРасходыРасходы.Филиал = &Филиал
	|	И абс_РаспределяемыеДоходыРасходыРасходы.Ссылка.НомерДляПечати = &НомерДляПечати
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументы.Документ
	|ИЗ
	|	втДокументы КАК втДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	втДокументы.Документ";
	
	Запрос.УстановитьПараметр("НомерДляПечати", НомерДляПечати);
	Запрос.УстановитьПараметр("Филиал", Филиал);
    ТзДокументы.Загрузить(Запрос.Выполнить().Выгрузить());
	   
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументСводнаяВедомостьПоРаспределяемымДоходамСервер()
	
	МассивДокументов = Новый Массив;
	Для каждого Стр Из ТзДокументы Цикл
		МассивДокументов.Добавить(Стр.Документ);
	КонецЦикла;
	
	Возврат Документы.абс_РаспределяемыеДоходыРасходы.ВыполнитьПечатьСводнаяВедомостьПоРаспределяемымДоходам(МассивДокументов,Филиал);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)

	ТабДок = ПолучитьТабличныйДокументСводнаяВедомостьПоРаспределяемымДоходамСервер();
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь,"Сводная  ведомость по распределяемым доходам");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТз(Команда)
	
	ПолучитьСписокДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПодборФилиалаРаспределяемыеДоходыРасходы" Тогда	
		Филиал =  Параметр;
	КонецЕсли;	
КонецПроцедуры
